{"Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Date of the Event":"02/22/1993 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.251044,+-116.794984(8016)&iwloc=A&hl=en\"> mufon case (8016) map </A>","Latitude":"34.251044","Summary":"On group ski trip on Big Bear Lake, 3 of us watched a huge UFO land so close to our rental on the lake and cloak itself.","Date Submitted":"02/22/1993 12:00 UTC","Tags":"City","Disposition":"Unknown","Case Number":"8016","Object Features":"Window(s), Patterned Surface, Insignia, Other","Region":"California","Object Shape":"Circle, Disc, Saturn-like","Longitude":"-116.794984","divs":["sighting detailsmy last known encounter was 14 years ago, witnessed by 2 other friends (aqaintences who became friends after this experience we all shared). i was 25 on a group ski trip staying in a condo rental with a bunch of friends, most i didn't know well, our condo was right on the lake. everyone was partying and did not notice the very bright pink\\daylight illuminating from outside of our sliding glass doors. i was directly drawn to this over-powering light and went out on our deck. 2 guys (aquaintences), noticed it as well: terry gatens and christopher kelsey... we went outside and closed the sliding glass door. i remember us asking each other what the hell was this, in my mind i was sort of thinking it was an accident that we were witnessing. before we could say anymore words to eachother, the sky was filled w\\ white and light pink light, it was very windy, our hair and skin was fighting the strong pressure of that of a landing approaching and the lake's water was swirling, showing a round object was landing on it, like a whirlpool. then the wind stopped and a huge flying saucer\\spaceship appeared on the lake right in front of us, and the middle part pushed up and circulated w\\ sharp red, green, blue and strong white lights permeating from it as it spun. it stopped and shut down, it started to become dark outside again, and then it \"cloned itself,\" closing slowly from right to left. the presence of it was there for a few seconds, then it was gone and the sky became light blue w\\ clouds, like a cartton, then back to black, dark, normal w\\ a zillion stars. we all hugged eachother and went back inside and did not discuss it except between eachother. 14 years later i ran into chris and he confirmed our vision exactly as i had remembered it!"],"City":"Big Bear City","Weather Factors":"Windy, Unknown","Log Number":"US-09282007-0001","trends":["There have been 5 other sightings in Big Bear City","There were no other sightings in Big Bear City on or around February 22nd 1993"],"Country":"United States","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/8016.html.txt","/var/www/straped/mufon/org/8016.html"],"Source":"MUFON"}