{"Log Number":"US-09282007-0004","Source":"MUFON","Region":"Florida","Summary":"Apparent Aerial Vehicle Disappears in a \"blink\"","Object Shape":"Undisclosed","trends":["There have been 24 other sightings in Boca Raton","There were no other sightings in Boca Raton on or around September 28th 2007"],"Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=26.362308,+-80.074478(8019)&iwloc=A&hl=en\"> mufon case (8019) map </A>","files":["/var/www/straped/mufon/html2text/8019.html.txt","/var/www/straped/mufon/org/8019.html"],"Latitude":"26.362308","Tags":"City","Date of the Event":"09/28/2007 02:52 UTC","Longitude":"-80.074478","City":"Boca Raton","Country":"United States","Disposition":"Hoax","divs":["Sighting DetailsI was driving south on Military Trail on my way to work when I noticed the object in the sky directly in front of me. It was moving slowly to the west at an altitude of several thousand feet. When I first saw the object I felt a sensation like \"wow, there's an unidentified flying object\". I kept my eyes trained on it until it suddenly vanished, or seemed to implode, disappearing in a \"blink\". The object, which was cylindrical in shape with no apparent wings and white in color, was too close for me to have lost it in the background sky. I've seen similar phenomena on two different occasions in this city within the last seven or eight years. In the two other sighting, the objects were motionless and viewed for only a few moments before blinking out. I thought that the object that I was looking at today was an airplane, having the same color and speed that an airplane would have at that altitude, but I kept staring at this thing because it apparently lacked wings and was traveling curiously slow at such a low altitude. After it was gone, I was still looking for it, even heading southwest (on my way to my job), but it never reappeared even though it should have been right in the area I was. There is a private airport a few miles away, to the northwest. If it was just an airplane and was presumably landing then why did it never appear to descend? The airport is centralized within the town, and adjacent to the highway. Aircraft taking off and landing is hardly unnoticeable, and I've worked and lived in various locations surrounding the airport, as well as having lived in Boca Raton for 15 years. I am very familiar with the geography of where I was and the proximity to the airport. If there was a plane that was landing, I would have seen it. It if started flying in a direction away from my position I still can't see how it \"shrinked\" in size so rapidly, not even appearing as a dot in the sky."],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date Submitted":"09/28/2007 02:52 UTC","Case Number":"8019"}