{"Weather Factors":"Unknown","Disposition":"Unknown","Latitude":"35.445326","Log Number":"US-09292007-0001","Case Number":"8021","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Longitude":"-100.270955","Object Shape":"Other","Date of the Event":"07/22/2007 10:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.445326,+-100.270955(8021)&iwloc=A&hl=en\"> mufon case (8021) map </A>","files":["/var/www/straped/mufon/html2text/8021.html.txt","/var/www/straped/mufon/more/8021_submitter_file1__IMG_0833.JPG","/var/www/straped/mufon/more/8021_submitter_file2__IMG_0834.JPG","/var/www/straped/mufon/more/8021_submitter_file3__IMG_0843.JPG","/var/www/straped/mufon/org/8021.html"],"Object Flight Path":"Stationary","divs":["Sighting DetailsWorking out on a rig location about 10 miles NE of Wheeler TX. Went outside to make a phone call around 10:30 pm, when i saw a bright light towards the west. Grabbed my camera to take some pictures, and took a few pictures of this object. There was no movement of this light, but had a different light to it than a star. I did have a feeling of discomfort while i was out side and felt the need to go back inside, after watching this light for 30 min, and finishing my phone call. But when i went back to see the pictures there was a strange red glow in one of the pictures that i did not notice there when originally taking the picture. There was also a strange blue object that i could not see with the naked eye that was in all the pictures. I did go around the area where the red glow was the following day but noticed nothing out of the ordinary. I also took a picture of the area during day light for a reference as to the objects that can't be seen at night. If you would be able to email me back in regards to your opinions that would be great. (adrianmccredie@hotmail.com) Thanks, Adrian"],"Region":"Texas","Object Features":"Unknown","Viewing Distance":"Over One Mile","Summary":"Saw a bright light that caught my eye.","Country":"United States","trends":["There have been no other sightings in Wheeler","This sighting has never been favorited."],"Date Submitted":"07/22/2007 10:30 UTC","City":"Wheeler"}