{"Object Shape":"Sphere","Sighting Duration":"Undisclosed","Log Number":"US-09292007-0002","divs":["sighting detailsit was in october of 1966. my girlfriend and i were parked up on what was called south mountain around santa paula ca. we were facing directly south. you could see the light glow projecting from los angles.neither of us were drinking or using any kind of drugs. we were simply talking.as you look south from this position, there is sort of a valley which lies between a mountain on the left and another on the right side. without hearing a thing, suddenly, we were looking at this glowing white-hot sphere. it was not making any noise at all, and it was simply sitting there in place. there were no windows. it appeared to be white-hot, although it was not emitting any form of heat wave. we watched it for approximately 15 minutes,and then it 'flew' off without making a sound to the southwest over the pacific ocean as fast as you could blink an eye.the ufo was close but out there quite a way, if you can understand what i mean by that. i would estimate it to have been approximately 300 to 400 feet in diameter. i was eighteen years of age at the time, and i have never forgotten the incident. i have told this same story to many people over the years(only those that i trusted not to make fun).after all, if you don't see it yourself, all you really have is someone elses word. thanks for the opportunity to report this.sincerely, john r> schaffter\\6810 n.w. 59th terrace\\bethany, oklahoma\\73008."],"Source":"MUFON","Weather Factors":"Unknown","Case Number":"8022","Disposition":"Unresolved","Country":"United States","files":["/var/www/straped/mufon/html2text/8022.html.txt","/var/www/straped/mufon/org/8022.html"],"Date Submitted":"09/30/1966 12:00 UTC","trends":["There has been one other sighting in Santa Paula","There were no other sightings in Santa Paula on or around September 30th 1966"],"Object Features":"Undisclosed","City":"Santa Paula","Summary":"it appeared out of no where. it remained stationary for about 15 minutes it was glowing white-hot and making no sound at all.","Region":"California","Tags":"City","Longitude":"-119.05927","Latitude":"34.354166","Date of the Event":"09/30/1966 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.354166,+-119.05927(8022)&iwloc=A&hl=en\"> mufon case (8022) map </A>","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}