{"Object Features":"Unknown","Tags":"City","Summary":"Unknown object appeared to float from NW to SE over NW washington DC","Date Submitted":"09/29/2007 06:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.898412,+-77.028176(8023)&iwloc=A&hl=en\"> mufon case (8023) map </A>","Region":"District of Columbia","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","divs":["Sighting DetailsAt approx. 6PM eastern my fiance' and I were laying around our apartment when we noticed a strange object in the sky through our sliding glass balcony door. Given that Washington DC is restricted air space my initial thought was that something wasn't right. It appeared to be a thin blimp floating too high. After I realized that what I was seeing wasn't normal I grabbed our digital camera, and she grab a pair of binoculars. Once outside, the object appeared to be an elongated tube, but through the binoculars a triangle could be seen around the white spots. At that time, the object was between 50 to 60 degrees off the horizon from our fifth floor balcony, and was moving NW to SE. At one point the object appeared to turn upward and head to a higher alt. After that it continued on it's previous course. We watched the object for approx 5 to 10 minutes, and lost sight of the object when it pasted our apartment building roof. After this sighting, the both of us were left with an uneasy feeling of not knowing what had just flown over the nations capitol."],"files":["/var/www/straped/mufon/html2text/8023.html.txt","/var/www/straped/mufon/more/8023_submitter_file1__UFO.JPG","/var/www/straped/mufon/more/8023_submitter_file2__UFO2.JPG","/var/www/straped/mufon/org/8023.html"],"Longitude":"-77.028176","City":"Washington","Case Number":"8023","Log Number":"US-09292007-0003","Latitude":"38.898412","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around September 29th 2007","This sighting has never been favorited.",""],"Disposition":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Object Shape":"Cigar, Triangle","Date of the Event":"09/29/2007 06:00 UTC","Weather Factors":"None","Source":"MUFON"}