{"Source":"MUFON","Tags":"City","Longitude":"-74.821845","Sighting Duration":"Undisclosed","Region":"Pennsylvania","Disposition":"Insufficient Data","Viewing Distance":"Unknown","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/8027.html.txt","/var/www/straped/mufon/org/8027.html"],"Country":"United States","City":"Levittown","Log Number":"US-09302007-0001","Date Submitted":"09/28/2007 09:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.16184,+-74.821845(8027)&iwloc=A&hl=en\"> mufon case (8027) map </A>","Latitude":"40.16184","Object Flight Path":"Undisclosed","trends":["There have been 29 other sightings in Levittown","There were no other sightings in Levittown on or around September 28th 2007"],"Weather Factors":"Unknown","divs":["Sighting DetailsMy husband and I went outside around 9:00pm because we heard a car accident down the street from our house. We went out to see what was going on. I'd say we were outside together for about 10 minutes before he decided to go back inside. I stayed outside and saw all of the police and paramedics show up. Thankfully, I don't believe anyone was seriously hurt. Anyhow, when I was turning to go back inside, I noticed in the opposite direction from where the accident was, that there was a strange row of red and white blinking lights hovering over the tree tops. I didn't remember if there were any towers over there or not. It definitely caught my attention so I stayed there to check it out for a while. This object just hovered there for about 10 or 15 minutes before it started raising straight up into the sky until it looked like it was right in front of the moon and then started flying to the west. It didn't make any sound and seemed to be round or disc shaped from the pattern of the lights flashing around it. In total disbelief of what I had just seen, I ran in the house to tell my husband and we both went back outside. I had told him this object was gone already, but we went back outside and then both of us noticed in the area of where the object was hovering there were about five planes flying around. It was definitely a strange experience, and not one I'll forget any time soon."],"Object Shape":"Disc","Date of the Event":"09/28/2007 09:15 UTC","Case Number":"8027","Summary":"Disc shaped object with flashing lights"}