{"Summary":"both identical just above tree level no higher than 500 ft. no rivets /markings/silent /cesna speed/orange light in front/no fins /not airodynamic","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Log Number":"US-09302007-0004","files":["/var/www/straped/mufon/html2text/8030.html.txt","/var/www/straped/mufon/org/8030.html"],"divs":["sighting detailswas with a date and was aproaching stop sign when i noticed 2 orange lights.they were to close to be helicopters. ishut off my car but could not here anything.i used to fly cesna with my father who was a docter\\ww2 navigater bomber.i new that these two craft as they approached were not designed primarily for airodynamics but rather for space flight.as they flew over head i looked for markings,rivets etc. but there was none.they each had a dome about 2\\3 to the front of craft that had a wrap around window. a white light could be seen rotating and reflecting off the glass.both craft were about 100 yards long and 30 feet wide.they wre dead silent with no fins\\wings\\rivets port holes nothing !!!i have always hoped to see something similar but have never seen anything since.i sped of in pursuit but could not keep up.i called the airforce base in vieanna and made a report a the time.these craft were made for space travel.it was like they were on a tractor beem of sorts and with there size and slow speed it was as if they were ant-gravity"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.10444,+-80.647049(8030)&iwloc=A&hl=en\"> mufon case (8030) map </A>","Disposition":"Insufficient Data","Longitude":"-80.647049","Country":"United States","Date of the Event":"09/15/1985 09:10 UTC","Latitude":"41.10444","Tags":"City","City":"Youngstown","Object Shape":"Cigar, Circle, Other","Object Flight Path":"Straight-line path","Case Number":"8030","Date Submitted":"09/15/1985 09:10 UTC","Region":"Ohio","Object Features":"Dome, Window(s), Other","trends":["There have been 16 other sightings in Youngstown","There were no other sightings in Youngstown on or around September 15th 1985"]}