{"map":"<A HREF = \"http://maps.google.com/maps?q=40.400661,+-105.07334(8031)&iwloc=A&hl=en\"> mufon case (8031) map </A>","Date Submitted":"09/30/2007 09:45 UTC","Date of the Event":"09/30/2007 09:45 UTC","Sighting Duration":"Undisclosed","Longitude":"-105.07334","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around September 30th 2007","This sighting has never been favorited.",""],"divs":["Sighting DetailsScanning the night sky as I often do, I was setting out my trash bin on Sunday Sept 30, 9:45 p.m. I noticed a satellite and 2 or 3 commercial aircraft on approach to Denver International Airport while I watched the sky. As I was about to go in I spent another minute or 2 to look up, and noticed 3 dimly lit circular objects speeding from south to north almost directly overhead. They were either a tight formation or a single object with 3 lights. There was no noise. They may have been illuminated from city glow as they looked a faded brownish color. The closest approximation to their appearance would be 3 peas almost touching each other. Each object or light had a hazy glow around the edge. With my stuck out thumb as a guide the object(s) together were about as big as a quarter at arm's length. I had both a camera and camcorder 2 feet away from me in my car but the whole sighting lasted less than 10 seconds and by the time I could have gotten them out and turned on the objects would have been gone. I opted to watch. My basic feelings were of exasperation more than awe, as I've occasionally seen unexplainable objects in the skies over the years and have never been able to get any recorded on media. After watching them cross the sky and disappear past the roof of my house I watched a few more minutes to see if anything else would show up, then I went inside and started typing a sighting report."],"Object Shape":"Sphere, Triangle","Weather Factors":"None","Region":"Colorado","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Log Number":"US-10012007-0001","Latitude":"40.400661","Summary":"3 light triangle formation over Loveland, CO","Source":"MUFON","Case Number":"8031","City":"Loveland","Tags":"City","Country":"United States","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/8031.html.txt","/var/www/straped/mufon/more/8031_submitter_file1__ufo9_30_07.jpg","/var/www/straped/mufon/org/8031.html"],"Object Features":"None"}