{"divs":["Sighting DetailsHi; This was a afternoon sighting under blue clear sky and bright sunlight. I was in our yard observing a high flying turkey vulture when a massive high altitude object crossed my field of view above the bird traveling S.E. It was in view for 3sec. then disappeared behind some trees. The object was blue-gray against the blue sky and almost invisible because of the distance. Commercial aircraft were flying at the time at 35,000ft. I had the impression that this object was not in orbit around our planet but came into view from outer spaces,then returned beyond view. I feel it was going about 80,000 miles per hour and was thousands of ft. long. There was no sound and no sun reflection. We have no space craft like this ibject and the ISS is not visible during daylight hours with the naked eye. My state of mind is changed forever from the shock and awe of this event. There have been no local reports about this sighting. I feel that this object was a mother ship sent to survey our planet from high altidude, maybe 100 miles high as I saw it. It had to be going about 80,000 mph because it was in view for 3 sec. covering 20 degrees of arc. I am 73 years old and have a scientic career and hve Air Force experience."],"Weather Factors":"None","Tags":"City","Source":"MUFON","Latitude":"35.89137","Object Shape":"Cigar, Other","City":"Los Alamos","Country":"United States","Region":"New Mexico","Date Submitted":"09/24/2007 03:15 UTC","files":["/var/www/straped/mufon/html2text/8033.html.txt","/var/www/straped/mufon/org/8033.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=35.89137,+-106.299062(8033)&iwloc=A&hl=en\"> mufon case (8033) map </A>","trends":["There have been 6 other sightings in Los Alamos","There were no other sightings in Los Alamos on or around September 24th 2007"],"Disposition":"Unknown","Summary":"Massive object 100 miles high , Thousands of feet long ,daek blue-grayHi;","Object Features":"Unknown","Longitude":"-106.299062","Sighting Duration":"00:00:03","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Case Number":"8033","Date of the Event":"09/24/2007 03:15 UTC","Log Number":"US-10012007-0003"}