{"City":"Delaware","Object Shape":"Star-like","Log Number":"US-10022007-0002","Latitude":"40.307772","Weather Factors":"None, Does Not Apply","map":"<A HREF = \"http://maps.google.com/maps?q=40.307772,+-83.066115(8037)&iwloc=A&hl=en\"> mufon case (8037) map </A>","Tags":"City","Date of the Event":"09/15/2007 08:30 UTC","Disposition":"Insufficient Data","trends":["There have been 13 other sightings in Delaware","There were no other sightings in Delaware on or around September 15th 2007"],"divs":["sighting detailsmy wife and 2 others witnessed a ufo sighting on september 15th around the time of 8:30-9pm est in delaware, oh. i've been stargazing my entire life on and off, so when i looked up at cassiopeia, down and to the left (approx 230 deg) i easily noticed two much brighter \"stars\", about the brightness of polaris\\venus when quite brilliant. i had just walked up to a bonfire, and was looking up at what was turning into a wonderful night sky with hardly any light pollution. as i noticed them near cassiopeia, i took a few seconds to determine if these were jets or satellites, and after they remained motionless, i knew they were something else, especially with their size, placement and brightness. i drew my wife and friend's attention a couple other bystanders to them and they were all able to see the objects. they stayed immobile for about 15-20 seconds, then slowly started moving. they moved in parallel what looked like out of orbit (in the direction of the t below). it took approximately 30-45 seconds, perhaps longer, for the ufo lights to go completely invisible to our naked eye. unfortunately it wasn't completely dark at the time or we could have tracked them further, i believe. someone mentioned maybe they were satellites. i immediately discounted this because they were not moving on any axis (pointed out a satellite on the orbital plane later that evening to my wife and others), and initially they were not moving at all. * * * * * (*)t (*) \\ \\"],"Source":"MUFON","Region":"Ohio","Sighting Duration":"00:02:00","Date Submitted":"09/15/2007 08:30 UTC","Country":"United States","Object Features":"None","Case Number":"8037","Summary":"Two bright star-like objects below Cassiopeia sit motionless for a brief time then move slowly equidistant away to finally fade out of vision","Longitude":"-83.066115","Object Flight Path":"Stationary,Straight-line path","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/8037.html.txt","/var/www/straped/mufon/org/8037.html"]}