{"Viewing Distance":"101-500 Feet","Tags":"City","Case Number":"8038","Date Submitted":"06/30/2006 05:00 UTC","Object Shape":"Other, Unknown","Latitude":"51.62264","Country":"United Kingdom","Sighting Duration":"00:00:05","map":"<A HREF = \"http://maps.google.com/maps?q=51.62264,+-3.938546(8038)&iwloc=A&hl=en\"> mufon case (8038) map </A>","Source":"MUFON","Object Features":"Appendage(s), Wings, Other, Unknown","City":"Swansea","Summary":"Strange flying object found in image, not seen at the time.","Date of the Event":"06/30/2006 05:00 UTC","Log Number":"GB-10022007-0003","files":["/var/www/straped/mufon/html2text/8038.html.txt","/var/www/straped/mufon/more/8038_submitter_file1__June30th2006020.jpg","/var/www/straped/mufon/more/8038_submitter_file2__June30th2006020crop.jpg","/var/www/straped/mufon/org/8038.html"],"Region":"Wales","Longitude":"-3.938546","Object Flight Path":"Unknown","divs":["Sighting DetailsI live in the coastal city of Swansea, in south-west Wales, UK. At the far western edge of the city, on the coast, is an area known as the Mumbles. I visited this area on June 30th 2006, catching a bus which dropped me off on the road above a small cove called Limeslade, at approximately 16.45. I went there to take some photographs for my weblog. It was a beautiful, hot summer's day, and my plan had been to take some photos, grab an ice-cream from the nearby cafe, walk out to the coastal path, and then return, before following the coastal walk back to the nearest village, Oystermouth, to get a bus home. Strange as this sounds, I suddenly got the sense that I shouldn't venture out onto the isolated coastal path alone. That could have been just the natural caution of a woman out walking alone, admittedly. But as I stood overlooking Limeslade, taking my shots, I grew more and more uneasy, to the point where I felt quite desperate to leave the area. I blamed my discomfort on the heat of the day, and when the next bus arrived, around 17.15, I hopped aboard and returned to the city centre. I thought no more of it, until I uploaded my pics onto my PC that evening. One of the shots showed a bizarre, airborne object, which seemed to be flying over the sea. I considered this may have just been an insect or airborne seed, close to the camera. However, it looks like a larger object some distance from the camera. The object looks like some kind of prehistoric creature - a pterydactyl or other such creature. I've attached my original shot, plus an enlarged, cropped section of the shot, showing the object. I don't know the precise time the pic was taken, but it was sometime between 16.45 and 17.10 on that day. I'm hoping you can give me a rational explanation for this strange apparition - there probably is one, despite how I felt at the time the shot was taken. Many thanks for your time."],"trends":["There have been 5 other sightings in Swansea","There were no other sightings in Swansea on or around June 30th 2006","This sighting has never been favorited.",""],"Disposition":"Unresolved","Weather Factors":"Light"}