{"Country":"United States","Tags":"City","Date of the Event":"09/26/2007 04:38 UTC","Longitude":"-72.527607","map":"<A HREF = \"http://maps.google.com/maps?q=41.278723,+-72.527607(8039)&iwloc=A&hl=en\"> mufon case (8039) map </A>","Date Submitted":"09/26/2007 04:38 UTC","Latitude":"41.278723","trends":["There have been 4 other sightings in Clinton","There were no other sightings in Clinton on or around September 26th 2007"],"Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Disposition":"IFO","Object Flight Path":"Undisclosed","Object Shape":"Sphere","files":["/var/www/straped/mufon/html2text/8039.html.txt","/var/www/straped/mufon/org/8039.html"],"Weather Factors":"Unknown","Log Number":"US-10032007-0001","City":"Clinton","Case Number":"8039","divs":["Sighting DetailsWent out to check weather and have a cigar between 4:30 & 5:00 am EST. Looked up at the stars as always and spotted a gold, yellowish light traveling east up with the stars trucking faster than any aircraft. No strobe, no Green, no red nav lights. What could it have been? A satellite? the space station? Space junk? Did not enter earths atmosphere. Thought I would report this. It was something just passing us by fast up with the stars in space. I'll bet they know all about us and some of us know about them. Just a route that took them by us like two ships passing in the night! It was wild. Wished I could have seen it with a telescope. I will be ready next time for sure! I wished they would stop or maybe e are just not ready yet. I hope that I will be able to see \"THEM\" in my life time. I am sure it is just a matter of time before they come. I hope they come in peace. I believe that someone probably (our government) knows about them and probably has contact. They may even be among us now! Who knows. but I know one thing they are out there! I feel insulted that my government hides this from us and thinks I wouldn't be able to handle it. This is 2007 not the 40's for God's sake! Thanks"],"Region":"Connecticut","Summary":"A fast gold, yellowish light going across the sky in space up wih the stars!","Object Features":"Undisclosed"}