{"Source":"MUFON","Case Number":"8045","Object Features":"None, Other, Unknown","Weather Factors":"None, Windy, Light, Unknown, Does Not Apply","Log Number":"US-10032007-0007","Date Submitted":"04/24/1997 05:24 UTC","Latitude":"30.339034","divs":["sighting detailswhen i was four-or-five months pregnant, i had the strangest \"dream\" ever, about *the grey* aliens coming to visit me! my baby's father (now my ex-boyfriend) fell asleep in the living room of my apartment; and my bedroom (where i fell asleep) was right behind the wall, adjacent to where he was. the next morning, i got up and told \"brent\" (not his real name, just using an alias) about the dream i had and that *the greys* were trying to \"abduct my unborn fetus\". he turned to me and said, \"oreally? i had the same dream...\" (as if it was nothing to it). i said, \"what?!? what do you mean by that!?!\": brent said, \"yes, i was there, i know what happened\": i said, \"nooo way!!!\": he said, \"yuup, it's true\": then, brent and i got in this long-conversation (about *the greys*). brent told me once, that he was nearly abducted by them (when he was around four years old), on his grandfather's farm in oklahoma. he reminded me of that incident and said all this stuff about them. mainly, the one thing he told me, stuck in my mind like glue. he told me that *the greys* tend to \"go after\" people that are related, that they are probably trying to collect some \"d\\n\\a samples\" and running experiments of some kind. (i was totally flabber-gasted, hearing all of this). i didn't know much beforehand, about *the greys*, let alone have a dream about them! i was still left wandering... then it donned on me, i remembered years before, i used to watch this show on television, called \"strange universe\" (it was either on the scifi-channel, or t\\l\\c, or the discovery-channel: i don't remember which), but i do recall seeing this same egg-shaped craft on that show! so after 04\\24\\1997, i became a true believer of ufo-phenomena, since that's the date i witnessed my first-sighting! (reminder: i was about 8-months pregnant by then). i don't guarantee that these two-events are in any way related, but there's a strong possibility that they are (is all i can say)! --i believe in u\\f\\o's now, without a shadow-of-doubt in my mind, and i also am aware.....\"there's a huge government cover-up about all of this (no doubt)!!!\" please feel-free to contact me, for any additional information you might want to know! sincerely, *brenda.alias*"],"Longitude":"-81.649261","Object Flight Path":"Straight-line path","Date of the Event":"04/24/1997 05:24 UTC","City":"Jacksonville","Disposition":"Unknown","Viewing Distance":"101-500 Feet, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=30.339034,+-81.649261(8045)&iwloc=A&hl=en\"> mufon case (8045) map </A>","Sighting Duration":"00:05:00","Region":"Florida","files":["/var/www/straped/mufon/html2text/8045.html.txt","/var/www/straped/mufon/org/8045.html"],"Object Shape":"Egg","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around April 24th 1997"],"Country":"United States","Summary":"I looked-up, from the doorway, and noticed 3-egg shaped (metal) craft,","Tags":"City"}