{"Summary":"Colorful Glowing Sphere","divs":["Sighting DetailsIn 1976 i was 8 years old and my best friend was 9 years old, we were with my dad driving down on an old country road, heading to a McDonalds in the country side, when all of a sudden my dad is excited and saying and pointing...\"look over there!, at the big house on the hill!, wait ill pull over!\" so he then pulled over, we all got out of the car and he directed my friend and i to look at the farm house!, there was this two story \"5 br?\" house \"with three windows on the top story\", there was a clolorful glowing sphere on the left side of the house about 30 feet from the top story left bedroom window. With a blusih-white beam, beaming across all three windows, \"back and fourth\", there was a slight hum noise, then the beam of light went out, then the sphere swayed in reverse a bit then took off out of sight, \"dissapeared!\" the sphere was possably the size of two-three huge 1976 cars put together!, there wasnt one place on the sphere that wasnt glowing! the colorful lights lit up the air around the craft! it was actually really beautiful! people dont believe me, by my friend, dad and i were not on drugs! we were only 8 and 9 years old we saw what my dad saw! from that day and on, ive have believed that other life existes else where! we cant be alone! it would be stupid to think were the only life that exists! ive also came to the conclusion that if we have so many ethnics and species of life on our planet...there has to be the same else where! i wish i had pics! i can draw this event for anyone who is interested in seeing what we saw that night!! just email me :) christine"],"Date Submitted":"06/30/1976 10:15 UTC","Tags":"City","Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Endicott","There were no other sightings in Endicott on or around June 30th 1976"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.100758,+-76.041788(8049)&iwloc=A&hl=en\"> mufon case (8049) map </A>","Source":"MUFON","Longitude":"-76.041788","Object Shape":"Circle, Sphere","Log Number":"US-10042007-0002","Country":"United States","Sighting Duration":"00:10:00","City":"Endicott","Object Features":"Patterned Surface","Case Number":"8049","Object Flight Path":"Stationary,Hovering then path","Date of the Event":"06/30/1976 10:15 UTC","Latitude":"42.100758","files":["/var/www/straped/mufon/html2text/8049.html.txt","/var/www/straped/mufon/org/8049.html"],"Region":"New York","Disposition":"Unresolved","Weather Factors":"None"}