{"map":"<A HREF = \"http://maps.google.com/maps?q=42.335645,+-122.867095(8052)&iwloc=A&hl=en\"> mufon case (8052) map </A>","divs":["Sighting DetailsDuring an outdoor concert where I was a stagehand working with Creedence Clearwater Revival and Curtis Salgado, we witnessed 3 bright objects I first thought were planets although the positions weren't right for that. Two objects began circling the third and suddenly either an F-15 or F-14 did a fly-by near the objects and one of them shot off to the north at incredible speed. Being an ex-Airforce weatherman I knew these were not rawindsone devices but indeed controlled aircraft. After a few minutes of observing from the concert stage I pointed out the objects to other musicians and the sheriff's deputies acting as security. We then saw 4 more spheres moving slowly and randomly to the southwest of our location when a very large object I can only describe as comb-shaped came in and out of view for only about 10 seconds. At this point most of hte objects faded from view except for two which actually came close enough to make out as silver spheres and they stayed in one place for the next 20-30 minutes until it was dark and we could no longer make out if they were present. One odd thing or rather another odd thing about this incident is that several days before on Sept 6th 1998 we actually saw a glowing object crash near Roseburg Oregon and though I tried to report it to police they ignored me and to this day I truly don't think anyone ever investigated the crash site. It was probably a meteor but I don't know. I am currently as far as I know the only witness who knows where the site is that the object came down and exploded in a series of three large, bright green flashes of light."],"Summary":"6-spherical objects 1-chevron shaped object","City":"Medford","Log Number":"US-10042007-0005","files":["/var/www/straped/mufon/html2text/8052.html.txt","/var/www/straped/mufon/org/8052.html"],"Case Number":"8052","Source":"MUFON","Object Flight Path":"Other","Object Shape":"Chevron, Sphere","Date Submitted":"09/12/1998 12:00 UTC","Weather Factors":"Unknown","trends":["There have been 34 other sightings in Medford","There were no other sightings in Medford on or around September 12th 1998"],"Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"09/12/1998 12:00 UTC","Longitude":"-122.867095","Region":"Oregon","Tags":"City","Object Features":"Appendage(s), Unknown","Latitude":"42.335645","Disposition":"Unknown","Viewing Distance":"Over One Mile"}