{"Latitude":"41.880144","Country":"United States","Object Flight Path":"Stationary","Longitude":"-87.628428","Region":"Illinois","Object Features":"Patterned Surface","map":"<A HREF = \"http://maps.google.com/maps?q=41.880144,+-87.628428(8054)&iwloc=A&hl=en\"> mufon case (8054) map </A>","Date Submitted":"09/04/2007 09:30 UTC","Source":"MUFON","Summary":"sphere shaped object that had a prism like effect--very colorful like a rainbow","trends":["There have been 221 other sightings in Chicago","There was one other sighting in Chicago on or around September 4th 2007","This sighting has never been favorited.",""],"Disposition":"Unknown","Case Number":"8054","Object Shape":"Sphere","Log Number":"US-10042007-0007","Date of the Event":"09/04/2007 09:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Weather Factors":"None","Tags":"City","City":"Chicago","divs":["Sighting DetailsI was locking up my garage at night. It was dark out and I was fumbling with the key in the lock. I heard a strange sound, rather like a hum? that instinctively made me look up to find the source of the noise. It sounded like it was coming towards the front of the house at the top of the tree line. Suddenly, a bright flash went off to the right hand side like a camera flash. Within this flash was a sphere shape that was completely filled with clearly defined stripes of color (vertical). It made me think of a prism, or like the T.V when there is a test for the emergency broadcasting system. I think there was a low level hum. The colors were reflected onto the clouds that partially surrounded it. This \"image\" lasted only about 3 or four seconds at most. The colors seemed to sizzle? Then it just dissappeared with great intensity. Like Thhhhhhwp! also, it momentarily lit up my back yard with light like bright moon light. There were commercial aircraft in the sky. Then I finally locked the door to the garage, but it seemed even darker after all that lighting. If I held out my hand at arms length,a quarter would have covered it (the object) up and a tennis ball would have covered up the glow it emmitted. It was far enough away and up in the sky that I wasn't afraid, but I can't explain this. I appreciate objectivity, and can honestly say I hadn't thought too much on the topic of ufo's. What can this be? Thank you."],"files":["/var/www/straped/mufon/html2text/8054.html.txt","/var/www/straped/mufon/more/8054_submitter_file1__Ferris_map.jpg","/var/www/straped/mufon/org/8054.html"]}