{"Log Number":"US-10052007-0002","Tags":"City","Object Features":"Other, Unknown","Object Shape":"Boomerang, Diamond, Flash, Oval, Sphere, Star-like, Triangle","Summary":"100+ UFOs Eastern Sky Imitating stars and constellations for past several nights","Latitude":"40.746451","Country":"United States","City":"Lima","Date Submitted":"10/01/2007 05:33 UTC","Disposition":"Hoax","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","map":"<A HREF = \"http://maps.google.com/maps?q=40.746451,+-84.096056(8063)&iwloc=A&hl=en\"> mufon case (8063) map </A>","Source":"MUFON","Weather Factors":"None","Sighting Duration":"Undisclosed","Region":"Ohio","Case Number":"8063","Date of the Event":"10/01/2007 05:33 UTC","divs":["Sighting DetailsStarted off seeing a bright orb that looked similar to Venus except it moved closer, then overhead, and finally past me. Then I started noticing other blue and red lights that appear as glowing orbs on a 12x optical digital camera. I started filming and snapping pictures then comparing them to the other ones and noticed that there were hundreds of UFOs that are imitating stars and the constellations behind them. I've seen several low flying silent objects that pulse bright lights. On still shots I can make out several color changing bulbs along a boomerang shaped object. I've read that people have seen them sucking up large amounts of water over bodies of water which would make this next part make sense. I've seen what appears to be the front fly downward while the outer edges stay still so in essence it appears to spin on it's own axis making it blur and my guess is it's rotating at high speeds to separate substances of different densities by centrifugal force. Thus seperating the two atoms of hydrogen from oxygen and creating hydrogen fuel cells for their power, so in essence we're the BP of our solar system. These sightings have occurred from October 1st 2007-present. I have several videos but the most convincing ones couldn't be caught on tape due to their habit of traveling fast as light, kind of makes it hard to prove a skeptic wrong when all you have is a blurred image. Best proof is to watch the night sky for abnormalities such as constellations n stars flashing blue and red with some of them breaking formation then flying back to where it should be. They all appear brighter to me than surrounding stars and move counter-clockwise repeating the night sky. The thing that makes them stand out the most is the ones on the horizens appear lower than the rest and I've seen the most activity when most people are asleep from 3:30-6:00am. All of the brighter \"stars\" seem to move in unison so that's one hell of a tactic to invade a planet. It appears they send a few low flying scout ships to record how our night sky might appear to us and then the rest cover the stars up glowing bright to cover up the star behind them. Then they just hover and observe. My friends thought I was going crazy until they saw some of the things I saw and now they're convincing their friends. I took footage to my local news station and they blew me off of course saying it was Venus but Venus doesn't move like the things I saw. The red and blue lights that have a bright flashing strobe lights are our planes flying around the UFOs I've seen disappear and made no sound. I was out filming Friday Oct. 5th and saw several low flying UFO's while at my friends house. We went back inside after our cigarette break to finish watching our movie when the Pandora air siren went off. That sound freaked me out because I though we were under attack or something but it was a fire alarm down the road according to her dad's police scanner. I drove out to the country down the street to check it out and saw the barn fire. I deleted some footage of the other encounters to snap a short video of the fire but the crazy part is I saw a flying triangle on the backside of the fire but not a bright glowing orb surrounding it. I'm not sure if the three objects around the tree on the left are debris flying from the fire or the under side of the craft I saw in the area afterwards. I didn't see it do anything to the barn itself and there's also 2 brighter objects that could either be debris or another craft above the fire. I just kick myself for not getting the 2gb memory stick while I saw at the store earlier. I only had the 32mb internal one so I kept having to edit the size down to cut out the getting focused in on it. When you only have 41 sec of footage total you try to make it last. I was a nonbeliever before last week, I always just hoped there would be intelligent life out there that would come to make contact someday. Willis S., A.k.a Chicken Little....The sky is falling!"],"Longitude":"-84.096056","trends":["There have been 7 other sightings in Lima","There were no other sightings in Lima on or around October 1st 2007","This sighting has never been favorited.",""],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","files":["/var/www/straped/mufon/html2text/8063.html.txt","/var/www/straped/mufon/org/8063.html"]}