{"map":"<A HREF = \"http://maps.google.com/maps?q=42.054311,+-124.282552(8066)&iwloc=A&hl=en\"> mufon case (8066) map </A>","Weather Factors":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Straight-line path,Path with directional change","Object Features":"Appendage(s), Wings","Sighting Duration":"Undisclosed","Latitude":"42.054311","Log Number":"US-10052007-0005","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Country":"United States","trends":["There have been 5 other sightings in Brookings","There were no other sightings in Brookings on or around October 4th 2007"],"Date Submitted":"10/04/2007 02:30 UTC","Summary":"a cross from a white star/bird tumbled across sky almost rolled","divs":["Sighting Detailsi was in harbor at a friends house. it wasd around 2am the sky was clear and the stars looked distant. i looked directly above twards the sky and noticed what i first thought was a bird. i noticed that what i thought were its wings were still in place. i had my friend look and we both agreed that it was too high to be a bird unless it was a big big bird. as dark as it was and as high as it was we could see it some what clearly. i then came to the conclusion that it must be a plane beacuse what we thought were wings were stuck in place. what we thought was flapping wings turned out to be 3 to 4 airplane like wings extending outwards about 2 thirds the size of the object. we b oth decided it could not have been a plane beacuse it didnt have the little red light and it seemed to be tumbling in a 360 degree circular motion. like ball hoovering in place that spun randomly in all angles. it was not bright but it was sort of florecent white but very dim. mabey so that it could not be seen. my friend and i both were curious and stumped. it was not a satelite, gravity gave that one up. it was not a bird or a plane. we have a small airport and i see planes verry often and this was noticably larger and traveled much faster for how high it was. we watched as it crossed the sky. at the altitude it was it traveled in both our opinions at a steady fast rate. i first saw it south of us heading north. after flying over the top of us continuing north it seemed to increase in altitude, slowing down but not much as it fadded. we would have maintined a good visual if it maintained altitude as it headded north but beacuse it increased in altitude it faded much sooner than it would have. my friend mentioned this website emediatly after loosing site. we both agreed on what we saw but couldnt come to any reasonable conclusion. My friend as well as i will tell u that what we saw was NOT a plane, bird, baloon, or satelite. i can say that i have not seen anything resembling it from ufo pics on tv or any popular pics. what we saw was truely unexplainable and i cant compare it to anything ive ever seen."],"files":["/var/www/straped/mufon/html2text/8066.html.txt","/var/www/straped/mufon/org/8066.html"],"Source":"MUFON","Date of the Event":"10/04/2007 02:30 UTC","Case Number":"8066","City":"Brookings","Object Shape":"Boomerang, Bullet, Missile, Star-like, Other","Region":"Oregon","Longitude":"-124.282552"}