{"Source":"MUFON","Latitude":"40.488373","City":"Bloomington","Region":"Illinois","Weather Factors":"Light","trends":["There have been 10 other sightings in Bloomington","There were no other sightings in Bloomington on or around September 1st 2004"],"Tags":"City","Summary":"Bright orange double crescent spinning about a central axis many many times larger than a commercial jet","divs":["Sighting DetailsLaying outside in our back yard in central Illinois, a slight breeze out of the west as usual, with clear blue skies about 9 am Early Sept, nice cool morning. I was looking up at the sky with my newborn son, pointing stuff out to him, (ex. that is a lady bug, that is a leaf, that is a stick, that is a plane, that is a bird, that ... is a UFO.) Thats when I saw something bright orange, and about half as high as the Jets that fly over are. It was Huge, cut a city block in half and that is close to the size of it. It was double cresent shaped, one crescent being larger and more cup shaped, the smaller end had multiple protrusions and jagged looking, alot like a \"ferengi ship\" in its general shape, though it was spinning horizontally about a central axis. I thought right off the bat, that it was something special and rare. I grabbed up my baby and quick ran and got my video camera. When we got back out side it wasn't where it should have been for its speed, I thought I had lost it, then I spotted it. It had moved well to the Northwest, and climbed very very high. I got it in the camera and zoomed in as best I could, and trying to hold it still to keep it in focus. As I was viewing it later on a bigger screen, there is a small orb that zips past the craft in the opposite direction. The large craft going to the Northwest, and the orb going East-Northeast. I lost sight of the craft when I couldn't keep the zoom out as far as I had it, and keep my hands from shaking it out of the frame. About an hour later I also zoomed in on a commercial jet to get a size comparison."],"Object Flight Path":"Other","Case Number":"8076","map":"<A HREF = \"http://maps.google.com/maps?q=40.488373,+-88.985987(8076)&iwloc=A&hl=en\"> mufon case (8076) map </A>","Object Shape":"Other","files":["/var/www/straped/mufon/html2text/8076.html.txt","/var/www/straped/mufon/org/8076.html"],"Disposition":"Unresolved","Date Submitted":"09/01/2004 09:00 UTC","Log Number":"US-10062007-0002","Longitude":"-88.985987","Country":"United States","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Date of the Event":"09/01/2004 09:00 UTC","Sighting Duration":"00:05:00","Object Features":"Appendage(s), Other"}