{"Weather Factors":"Does Not Apply","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Star-like","Summary":"Out walking and gazed up at the star filled sky. Doing so, noticed a moving object coming from the NE heading SW.","Region":"Alabama","Object Features":"Unknown","Longitude":"-86.568635","Disposition":"Unknown","Latitude":"34.855998","divs":["Sighting DetailsI was out walking on my road. When I got to the end of the road, I turned to begin walking back. The trek to the end and back is almost a mile. As I started back, I looked up at the sky. I live in a fairly active fly zone being near a military base that is about a twenty minute drive way traffic is light and a major airport about another ten minutes from the base. Many stars were out and some were brighter than others. I then noticed something in the sky moving towards the general S.W direction. It was moving faster and higher than a jet normally would travel. I looked for something to scale it to in the sky and once finding something I held it up and counted off five secs. The object had roughly traveled an inch with those counted seconds. I stood and watched it for about three minutes or so till it was too far to detect it among the stars. I then made a mental note to be sure to log on when getting home to report sighting. Thinking about it, I've asked myself that if it were some sort of aircraft from either the International Airport or the military base, the craft wouldn't be flying at such the altitude it was due to the relative closeness of either location from where I spotted it. Don't know what it was so in own view, it was a UFO."],"City":"Meridianville","Country":"United States","Log Number":"US-10062007-0005","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.855998,+-86.568635(8079)&iwloc=A&hl=en\"> mufon case (8079) map </A>","trends":["There have been 8 other sightings in Meridianville","There were no other sightings in Meridianville on or around October 6th 2007"],"Date of the Event":"10/06/2007 08:10 UTC","Case Number":"8079","Object Flight Path":"Straight-line path","Date Submitted":"10/06/2007 08:10 UTC","files":["/var/www/straped/mufon/html2text/8079.html.txt","/var/www/straped/mufon/org/8079.html"],"Viewing Distance":"Unknown"}