{"Latitude":"51.512699","Summary":"high-altitude metallic ufo with trails at both ends of craft","files":["/var/www/straped/mufon/html2text/8082.html.txt","/var/www/straped/mufon/org/8082.html"],"City":"London","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"England","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around November 30th 1996"],"Country":"United Kingdom","Object Shape":"Unknown","divs":["Sighting DetailsWith a newfound interest in the subject of ufos and being 14 years of age at the time; I had resigned myself to spending 2 weeks \"watching the skies\" from my bedroom window! It was a time where I was paying much greater attention to the sky and is really the only reason I noticed what I did. The sky was clear and blue. What I saw first appeared to be a commercial airliner- just as high in altitude, a similar chem-trail, appearing speed, linear movement...nothing out of the ordinary. What drew my attention to it in the first place was the reflection of the sun's light from it's metallic surface. On closer inspection however, the profile of the solid metallic object was not as distinguishable as you would expect it to be if it were a commercial airliner. I also noticed that the white \"chem-trail\" was not lingering for very long either. Something just wasn't quite right and it held my attention. I must have watched it cross the sky in an earthly fashion for around 5-10 seconds...(from LEFT TO RIGHT) however this \"commercial-airliner\" suddenly stopped dead in mid-air. The object then moved much faster than before back in the direction it had came without \"turning\" or rotating(RIGHT TO LEFT) This seemingly irrational change in linear direction was immediately marked by the emission of a very thick, black smoke-trail which came from the \"front\" or \"other\" end of the craft. Watching from a window it quickly disappeared from my available view. Despite having been desperate to see a ufo with my own eyes at the time, it was ironic that what I saw terrified me so much that I ended up in tears! As irrational as it seems now, especially given the altitude of the object, one of the thoughts or feelings I had at the time was \"If I can see it what's stopping it from seeing me?.\""],"Date of the Event":"11/30/1996 12:00 UTC","Case Number":"8082","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Log Number":"GB-10072007-0001","Disposition":"Unresolved","Date Submitted":"11/30/1996 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=51.512699,+-0.126795(8082)&iwloc=A&hl=en\"> mufon case (8082) map </A>","Longitude":"-0.126795"}