{"Summary":"Fleet accompanied by large worm-like manifestation!!!","Object Shape":"Sphere, Unknown","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/8089.html.txt","/var/www/straped/mufon/org/8089.html"],"Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailstotally awesome sighting, if i may say so. this happens to be my second sighting this year, and it definately takes the cake. okay, we were heading to the denver zoo (one of the best i've visited) and were abruptly distracted by this large, wormlike formation floating through the sky. we later came to the conclusion that it was some huge ballon released during the broncos game - i hate skepticism! either way, one thing that definately stood out were these \"orb\"-like formations that were zipping all around the \"balloon\"\\worm-like thingy. in our attempts to write these things off as more balloons we ended up with the notion that they were something else. they were moving incredibly fast around the \"worm\" and eventually we noticed, like, 8-12 of these things way up in the atmospere. orb-like in structure, incredibly bright, color changing and visible through the cloud layer that they had passed behind. we watched them for 15 minutes or so as they quickly rotated around and around - there was no way (in our minds) that these could have been balloons, they were just moving way too fast for that altitude. yeah. . . ."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.742934,+-104.979493(8089)&iwloc=A&hl=en\"> mufon case (8089) map </A>","Region":"Colorado","City":"Denver","trends":["There have been 185 other sightings in Denver","There was one other sighting in Denver on or around October 7th 2007"],"Case Number":"8089","Date Submitted":"10/07/2007 12:00 UTC","Latitude":"39.742934","Longitude":"-104.979493","Log Number":"US-10072007-0008","Date of the Event":"10/07/2007 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Tags":"City","Object Features":"None"}