{"Viewing Distance":"101-500 Feet","Object Shape":"Sphere","Log Number":"","Object Features":"Undisclosed","divs":["sighting detailsit was 1978, two weeks before the big blizzard, between january 5th and febrary7th, the place was3ewarwick, rhode island, the buttonwoods\\appanoag section. it was sometime3elate at night or early morning. my parents were sleeping.3ei went to the bedroom window. i observed round (like a ball) light,3eslowly decending to the ground. the distance id guess was about a city3eblock away. since i was a child, i said to myself, oh a plane light fell3eoff. i had not heard of ufos, etc.3e3ethe next day i went to my babysitters house. i told he about the red3eplane light in a nonchalantly way. it was not a big deal to me. the3ebabysitters husband, worked at tf green airport in warwick about a mile3eaway. when i recall his uniform it had decoration like an airforce3euniform. i guess he might have been in the service somehow. the3ebabysitter told her husband what i saw.3ethe husband came home and i overheard him telling his wife there was a lot3eof phone calls about the red light and that no airplanes lost lights. he3eproceeded to question me about it. i simply told him that i saw an3eairplane light fall. he made a phone call and then returned to work.3e3eas an adult now, i realize that an airplane light, if it fell off a plane,3ewould not still be lighted up red. i researched old newspapers for any3emention of this incident. for all the phone calls there supposedly were,3enot one mention in the local providence journal bulletin. go figure"],"Sighting Duration":"00:05:00","files":["/var/www/straped/mufon/html2text/809.html.txt","/var/www/straped/mufon/org/809.html"],"Object Flight Path":"Other","Tags":"City","Region":"Rhode Island","Date of the Event":"11/30/1977 12:00 UTC","Latitude":"41.700101","Weather Factors":"Unknown","Country":"United States","trends":["There have been 11 other sightings in Warwick","There were no other sightings in Warwick on or around November 30th 1977"],"Longitude":"-71.416167","map":"<A HREF = \"http://maps.google.com/maps?q=41.700101,+-71.416167(809)&iwloc=A&hl=en\"> mufon case (809) map </A>","Source":"MUFON","Summary":"January 25 to February 7 1978 Warwick, Rhode Islan","Date Submitted":"11/30/1977 12:00 UTC","Disposition":"Unresolved","City":"Warwick","Case Number":"809"}