{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.320267,+-105.582561(8090)&iwloc=A&hl=en\"> mufon case (8090) map </A>","Sighting Duration":"Undisclosed","City":"Laramie","Object Features":"Unknown","Tags":"City","Summary":"Looked like contrail in western sky, but did not move for 25 minutes. Had rotating lights on underside","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 5 other sightings in Laramie","There were no other sightings in Laramie on or around September 30th 2007"],"Country":"United States","Region":"Wyoming","divs":["Sighting DetailsOn Sunday September 30th,at about 6:30 PM, about 20 miles south of Laramie Wyoming while driving north on highway 287, my wife spotted what, at first, looked like a white cloud or contrail in the west high above the Snowy Range mountains. I was driving and listening to the radio. It was a cloudless sky, so the white streak stood out. After watching about five minutes she alerted me that it was a craft. She saw revolving lights under the object. The lights also changed color to blue and then red, then back to white. I looked and saw it and pulled off the road to get a good look. The object was not moving. We had the mountain range to use as a marker.As we continued to drive toward Laramie we could see the object did not move. It was about two inches wide at arms length and we estimate it to be 30-40 miles west of us.It was about a fist above the mountains. We continued to watch until we reached Laramie about twenty to twenty-five minutes after we first spoted it. There was no mistaking it with anything we know. We are both experienced sky-watchers and this was the real deal."],"files":["/var/www/straped/mufon/html2text/8090.html.txt","/var/www/straped/mufon/org/8090.html"],"Object Shape":"Other","Longitude":"-105.582561","Case Number":"8090","Log Number":"US-10082007-0001","Date of the Event":"09/30/2007 06:30 UTC","Disposition":"Insufficient Data","Object Flight Path":"Stationary","Date Submitted":"09/30/2007 06:30 UTC","Weather Factors":"None","Latitude":"41.320267"}