{"Date of the Event":"10/03/2007 12:00 UTC","Case Number":"8091","Source":"MUFON","trends":["There have been no other sightings in Saco, Lewiston,","This sighting has never been favorited."],"Summary":"Flying between Saco and Lewiston Maine with heavy cloud cover. Wanted to take aerials of foliage but too many clouds. So I just shot pretty and interesting cloud shots. Saw nothing remarkable till all shots were unloaded into my computer.","Object Features":"Undisclosed","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=43.71158,+-70.307848(8091)&iwloc=A&hl=en\"> mufon case (8091) map </A>","Weather Factors":"Fog","Object Flight Path":"Undisclosed","Country":"United States","Disposition":"IFO","Viewing Distance":"Unknown","City":"Saco, Lewiston,","divs":["Sighting DetailsWe left from the Laconia Airport, Laconia, New Hampshire at about 8:30 Am on Wednesday morning October 3, 2007. Our plane was a small single engine plane. I have not disclosed these findings of UFO's to the pilot as I would prefer you examine the original shots and the photos I enhanced via contrast and color saturation...before I talk to him. Only the two of us were in the plane and we observed no unusual sitings during the plane ride. The objects only appeared to me as I looked through the shots ON MY COMPUTER and I noticed the light dots in the distance. Because I shot these pictures through the windows of the plane I tried to determine if the dots were reflections from inside the plane.. We encountered the heaviest of cloud cover over and between Saco and Lewiston, Maine...having reached Saco about 20 minutes into our flight. The radio transmission reported cloud cover at about 400 feet. Since I took over 150 photos that morning using a 6.5 megapixel Nikon D40 SLR, I will only email a few shots. If you would like a disc of all the shots for your perusal only I will send one to you upon your request. I would like to remain ANONYMOUS."],"Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/8091.html.txt","/var/www/straped/mufon/more/8091_submitter_file1__DSC_0050CROPGOODPOSTER.jpg","/var/www/straped/mufon/more/8091_submitter_file2__DSC_0054CLOSE7ENHANCED.jpg","/var/www/straped/mufon/more/8091_submitter_file3__DSC_0056CLOSE2AWESOME.jpg","/var/www/straped/mufon/org/8091.html"],"Longitude":"-70.307848","Region":"Maine","Log Number":"US-10082007-0002","Sighting Duration":"Undisclosed","Latitude":"43.71158","Date Submitted":"10/03/2007 12:00 UTC"}