{"Object Features":"Window(s)","divs":["Sighting DetailsOnce I spotted the object I immediately recognized it as the same look as the one photographed in gulf breeze. Immediately i went outside in the darkness and with the binoculars could easily make out the disk and its apperance. The strobe on top of the machine lit up the entire object as it turned around and around. There were compartments or the appearance of as the structure looked worklike and functional. I watched for about 5 minutes when a B-52 flew directly for the object and directly above my head. It scared me to death as the disk was to my east and south and the B52 came from the north and west. It flew directly at the object and the object just moved upward at unbelievable speed. The disc stayed at that altitude for about an hour. I called my son and my wife also saw the craft but after the B-52 incident. The craft stayed in the air until sunlight and i showed it to my son. At sunlight the craft was still there but we couldn't see it any longer in the sunlight. I am thinking the B-52 must have come from one of the SAC bases to the west. The disc was emitting a brilliant white light from its bottom and possessed unbelievable maneauverability. It was just toying with the B-52 and the jet made just one pass and was gone. Obviously the air force was tracking it. The disc stayed visible for over an hour. I have no sketches of the disc but will make a detailed drawing if it is desired."],"files":["/var/www/straped/mufon/html2text/8095.html.txt","/var/www/straped/mufon/org/8095.html"],"Latitude":"43.223292","Date of the Event":"10/04/2007 05:45 UTC","Disposition":"Unknown","Sighting Duration":"Undisclosed","Summary":"Saw a brilliant white light approaching from the east. Was writting an e mail befor work and thought it strange that i hadn't seen this light befor., Grabbed my binoculars and it was a disc shaped object. Like the one photographed in gulf breeze some yrs","trends":["There have been no other sightings in Crystal Lake","This sighting has never been favorited."],"Case Number":"8095","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.223292,+-93.792443(8095)&iwloc=A&hl=en\"> mufon case (8095) map </A>","Log Number":"US-10082007-0006","Viewing Distance":"501 Feet - 1 Mile","City":"Crystal Lake","Weather Factors":"None","Object Flight Path":"Hovering then path","Region":"Iowa","Date Submitted":"10/04/2007 05:45 UTC","Longitude":"-93.792443","Tags":"City","Object Shape":"Disc","Source":"MUFON"}