{"Country":"United States","Object Shape":"Other","Case Number":"8098","Date Submitted":"06/30/1973 12:00 UTC","Longitude":"-88.093411","Disposition":"Unknown","Latitude":"42.196969","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8098.html.txt","/var/www/straped/mufon/more/8098_submitter_file1__Wulf_map.jpg","/var/www/straped/mufon/org/8098.html"],"Date of the Event":"06/30/1973 12:00 UTC","Log Number":"US-10092007-0003","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=42.196969,+-88.093411(8098)&iwloc=A&hl=en\"> mufon case (8098) map </A>","City":"Lake Zurich","trends":["There has been one other sighting in Lake Zurich","There were no other sightings in Lake Zurich on or around June 30th 1973","This sighting has never been favorited.",""],"Region":"Illinois","divs":["Sighting DetailsMy fiance (now my wife)and I were taking a drive. We had exited US Highway 12 at Lake Zurich, on the old highway that runs a short distance before entering downtown and intersecting with Rt22. Being young and in love we had stopped on this rarely used road to do a little necking when we both noticed an exceptionally bright light about SSW from where we were. At first we thought it was a jet from Ohare airport that was about 20 miles away but as it came closer we noticed it made no sound whatsoever. I was intrigued and stepped out of the car for a better look. What interested me was that I could not tell exactly how close or the altitude since I had no point of reference and the exact size of the light not known. Looking into the dark sky it would have been about the size of a quarter if it were held up in front of you. The shape was hard to define but I would say it was more round than long, but not a ball or saucer that could be defined. As it seemed to come closer it also seemed to drop toward me, growing larger. At that time my fiance was literally yelling at me to get back in the car since she was petrified. I had recently left the US Marine Corps and did not see any logic or added safety inside the car, so I stood there and stared at it as it came closer. All of a sudden I felt illiminated, sort of tingly, and felt that this thing was taking a close look at me. There is no other way to describe the sensation. My fiance said I was lit up with a kind of glow around me, but there was no discernable light projected on me. I was not afraid in any way but my fiance was screaming by then to get back into the car and go. About that time we heard the sound of jets coming closer and I immediately recognized the sound as Phantom's since I was an AO in Viet Nam with the Marines and had considerable experience with the Phantom sound. The object seemed to pull back up and I no longer felt tingly. It then moved West for 5 to 6 miles, again with no noise, and the jets from the Glenview Naval Airstation passed overhead and went right after this thing. I would say that they were about 1500 agl and moving without burners, but moving fast. We watched the object from the rise we were on for a few more minutes as it steadily moved South in what looked like a wide, slow circle. I could see the lights of Barrington Illinois and it looked like it was over them as the jets closed in. Then it just dissappeared like someone turning off a light. The jets formed up and headed back towards Glenview Naval Airstation. We sat there and talked about what we had just whitnessed, me taking abuse since I did not listed and leave. After about 15 minutes I saw another light in the sky, similar looking but not the same, coming towards us from the West. As it closed we could hear the jet engine sounds and I identified it as a Boeing 737 as it flew overhead. I never felt afraid since it only illuminated me and I was facinated. We discussed what might of happened if the jets had not come. Personally I think the outcome would have been the same except we would have been able to view it longer."],"Object Flight Path":"Hovering then path,Path with directional change","Summary":"Light in the sky descended to me and illuminated me up before USN jets came and it moved away","Object Features":"None","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed"}