{"Object Flight Path":"Hovering then path","City":"Albuquerque","Object Features":"Undisclosed","Date of the Event":"08/18/2006 09:15 UTC","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around August 18th 2006"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","Date Submitted":"08/18/2006 09:15 UTC","Country":"United States","Object Shape":"Chevron, Triangle","Sighting Duration":"Undisclosed","Longitude":"-106.642357","files":["/var/www/straped/mufon/html2text/8100.html.txt","/var/www/straped/mufon/org/8100.html"],"Region":"New Mexico","Latitude":"35.092091","Summary":"UFO hovers over Unser area and heads WSW","divs":["Sighting DetailsI was watching TV with my wife in our apartment. I looked out our window and saw a large bright light. So I got up and went out on the porch and started watching the light. It was just one single bright light and it was hovering above what looked to be the area of Unser Blvd. and Cabezon, or thereabouts. It stayed in one place with very little extraneous movement. This made me think that it was possibly a helicopter with a searchlight on a possible manhunt. After watching this light hover for about 4 or 5 minutes it began moving in a WSW direction. It came toward the apartment building and that's when I saw that the light didn't belong to a plane or helicopter. The object made no sound as it flew overhead at a startlingly low altitude (maybe 1000 feet). Rather, I should say it made very little sound. A very quiet humming whistle sound was only audible when the object was directly overhead. I was absolutely energized when I realized this was not like any flying machine I had ever seen and I dashed indoors to grab my small binoculars. Also, I observed the object had no red wing lights or tail lights anywhere to be seen. And I'd describe its shape as a triangle or chevron because that is what it looked like when it caught a little moonlight overhead, but it was awfully dark. And I only lost sight because it flew over our building and continued out of my sight range. I SAW THIS OBJECT THREE TIMES IN THE NEXT TWO WEEKS, and then never again."],"Log Number":"US-10102007-0002","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.092091,+-106.642357(8100)&iwloc=A&hl=en\"> mufon case (8100) map </A>","Weather Factors":"Unknown","Case Number":"8100"}