{"Disposition":"Unresolved","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/8101.html.txt","/var/www/straped/mufon/org/8101.html"],"Longitude":"-81.303428","City":"St Augustine","Object Flight Path":"Unknown","Object Features":"Unknown","Object Shape":"Diamond, Egg, Oval","Latitude":"29.899504","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/23/2007 12:00 UTC","Log Number":"US-10102007-0003","Case Number":"8101","trends":["There have been 18 other sightings in St Augustine","There were no other sightings in St Augustine on or around September 23rd 2007"],"Date of the Event":"09/23/2007 12:00 UTC","Region":"Florida","Sighting Duration":"Undisclosed","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=29.899504,+-81.303428(8101)&iwloc=A&hl=en\"> mufon case (8101) map </A>","Summary":"Object first noticed Oct 7, while viewing vacation photos taken on Sep 23. Photo taken at Vilano Beach at St Augustine FL.","Source":"MUFON","divs":["Sighting DetailsMy wife and I were on vacation Sep 23 at Ocean Blue Motel on Vilano Beach at St Augustine FL. I took many digital photos during our 11 day vacation. We first noticed the object on Oct 7, while viewing the photos on our computer. I did not notice the object while taking the photo. I have many other photos of the area and sky, if needed. It was a strange weather day with times of brightness and the largest rainbow I have ever seen; I have photos of that too. There were times of rough, dark weather and storms in the area. Photos taken from the beach. Object was SW of my position on the beach. Note I am MUFON member 11744. The photos taken had to be recovered my a local computer company after they were deleted by the new camera SW that was not completely loaded the first time. I talked to the tech that I have known for about four years; he says he did not play with the photos, and I believe him. I filled out this report on Oct 8, but could not send it properly; I think I have that problem fixed. I called MUFON and left a msg. I got a very quick response from Chuck Reever. I finally was able to send the photo to him yesterday; I had problems with that too. The photo is large; about 1.4 MB. He does have the photo and it will not be sent again as requested below. I did think the object could be some special hot air balloon, however, the weather that day was not appropriate for hot air ballooning."]}