{"Log Number":"CA-10102007-0004","Case Number":"8102","Date Submitted":"07/12/1969 09:30 UTC","Weather Factors":"Fog","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Disposition":"Unresolved","Date of the Event":"07/12/1969 09:30 UTC","Longitude":"-75.682522","trends":["There have been 6 other sightings in Brockville","There were no other sightings in Brockville on or around July 12th 1969"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=44.610614,+-75.682522(8102)&iwloc=A&hl=en\"> mufon case (8102) map </A>","Object Shape":"Triangle","City":"Brockville","Viewing Distance":"21-100 Feet","Summary":"LARGE TRIANGULAR CRAFT WITNESSNESSED BY TWO PEOPLE","Sighting Duration":"Undisclosed","Latitude":"44.610614","divs":["Sighting DetailsI WAS ONLY NINE WHEN THIS OCCURED WHILE IN A CAR DRIVEN BY MY MOTHER. I AM BEGINNING TO RESEARCH TRIANGULAR CRAFTS ON MY OWN NOW. TYPICAL SIGHTING EQUALATERAL IN DESIGN FIRST APPEARS AS A HUGE BALL OF LIGHT THEN AS MY MOTHERS CAR BECAME AFFECTED IT MANIFESTED INTO A HUGE TRIANGLE WITH THREE LIGHTS ON TIPS AS WE WERE DIRECTLEY UNDER IT AN UNDERCARRIAGE WAS ALSO NOTED UNLIKE MOST TRIANGLES THAT I HAVE READ ABOUT THIS ONE SEEMED TO HUM AND BUILT UP A PRESSURE IN MY HEAD STILL DONT KNOW IF IT WAS FROM HUM OR FEAR ITSELF. I REMEMBER WHAT I WAS WEARING I REMEMBER BEING SCARED AND CRAWLING INTO THE FRONT SEAT OF THE CAR. I REMEMBER SCREAMING AT MY MOTHER NOT TO STOP THE CAR AT THE TIME SHE DID NOT TELL ME OF MECHANICAL FAILURE. THIS ACCOUNT IS IN VICKI CAMERONS BOOK\" DONT TELL ANYONE BUT UFO SIGHTINGS IN EASTERN ONTARIO\" .... THE BOOK HAS A LOT OF CRAP IN IT BUT I AM SURE SOME ARE AUTHENTIC UNEXPLAINED SIGHTINGS... I AM NOT PARTICULARLEY REPORTING THIS AS A SIGHTING AS I CONTINUE MY RESEARCH OF CLOSE CONTACT RE; UNDERNEATH THE UNEXPLAINED.... I AM WONDERING IF MENS FERTILITY RATES HAVE BEEN AFFECTED BY POSSIBLE RADIATION AND IF THERE HAS BEEN AN INCREASE OF HYDATED MOLE FORM PREGNANCIES WITH WOMEN IT HAPPENED TO ME AND MY DOCTOR AND IS AN EXTREMELEY RARE THING TO HAVE HAPPEN VERY FATAL TYPE OF PLACENTA AND NO FETUS OR FETAL DEVELOPMENT IT IS ALSO VERY FATAL MINE WAS CAUGHT JUST IN TIME... PLEASE IF ANYONE COMES ACROSS ANY INFO PERTAINING TO MY QUEREY PLEASE EMAIL ME BACK... I HAD TWO OTHER SIGHTINGS BUT I DONT FEEL IT IMPORTANT FACTORS IN MY SEARCH FOR ANSWERS THANK YOU FOR YOUR TIME AND GOD BLESS!!!!"],"Object Features":"Unknown","Country":"Canada","files":["/var/www/straped/mufon/html2text/8102.html.txt","/var/www/straped/mufon/org/8102.html"],"Source":"MUFON","Region":"Ontario"}