{"map":"<A HREF = \"http://maps.google.com/maps?q=35.060694,+-78.876098(8103)&iwloc=A&hl=en\"> mufon case (8103) map </A>","Date of the Event":"01/08/2007 06:00 UTC","Longitude":"-78.876098","Object Features":"Unknown","Weather Factors":"None","Source":"MUFON","Summary":"Along with myself 4 other men were with me and saw the same thing to include Aliens","Latitude":"35.060694","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Object Shape":"Circle, Egg, Sphere, Other","City":"Fayetteville","Region":"North Carolina","Disposition":"Unknown","Case Number":"8103","Tags":"City","Date Submitted":"01/08/2007 06:00 UTC","Country":"United States","trends":["There have been 20 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around January 8th 2007","This sighting has been favorited 1 time.",""],"divs":["Sighting DetailsMy son and 3 other men were over a mile off the main road on the cape fear river fishing all afternoon, Just before dark my son wandered into the woods to mabey spot deer feeding in the afternoon. I decided to walk up the two rut muddy road thick woods on both sides to the main road because fishing was slow. The guys had a fire right on the river bank and so I told them I will be back in a while. As I was walking along the road I was hearing lots of scurring in the woods on both sides I had no flashlight and thought man there are a lot of deer around because this area is known for lots of wildlife. As I made it along I was unnerved at the sounds in the forest so I found my self steady looking to mabey see what I thought was deer and mabey it was. The woods were realy dark the road leads to a field which is mabey 200 yards or more wide just short of the main road as I came up on the hill to the edge of the field I was shocked to see 3 Large orange balls moving down towards the ground and towards myself and they stoped just over the trees mabey a mile away or closer and hovered there. I knew it was not natural I am a comercial pilot and I know aircraft. I stood in shock thinking this cannot be real. I stayed mabey 10 to 15 minutes then began to feel nervious so I made my way back to the men on the river in a hurry mud and all. Names removed to preserve anonimity. I then in a panic took off looking for my son which was 17 years old at the time and as I started into the woods calling him he came towards me totaly shaken telling me dad you will never belive me but I have been hidding from Aliens I am scared they are in the woods and I believed at that time he had seen something he was serious. I told him Jr. I just saw three orange UFOs up at the road and It scared me so I came looking for ya. We made it back to the river and My son excited began to tell the other 3 men what he had seen and they started on the both of us. What I did not know was the three of them saw the same thing as my son during that time the sequence I am not sure but we all saw the same. It was a clear cold night stars were bright and about that time one of the other men holding a fishing pole hollered look up and to all our amazement the stars looked as if 6 to 8 of them from different parts of the sky moved very fast seeming to converge in a group and then all of the sudden three of the objects side by side came over our heads and landed or went out of site on the other side of the river mabey 2 to 400 yards away all three lights were round bright white blinding lights as big as mabey 100 yards in diameter all side by side all touching down or going out of site in the forest just on the other side of the river. It scared all of us so bad the three friends of mine along with my son and myself droped our fishing poles screaming lets go home. We left fire poles and all speeding up the muddy road to the main road each and every one in a panic some of the men were fussing take me home first I need to find my wife and children. When we made it to the top of the hill this is where the trees on both sides end and the field starts I slamed on the brakes all of us in shock to see what looked like a (Brilliant White egg shaped sphere with a tail with long spikes all around the middle and front section hovering 20 feet over the main road 200 yards from us and it looked as if it or the spiked part of it was making slow revolutions. This I tell you this is true four grown men as old as 50 and my 17 year old son was frozen in my truck looking at this thing straight in front of us the lights were brilliant white the object then apeared to raise up started down the road in the direction that we intended to go and then it shot off just over the trees out of sight. The 3 orange balls were no longer there. All 5 of us were terified we raced to Donnies home first He ran to the door his wife came out and We all told her of the story and were all looking at the sky. Gene 50 years old lived next door we ran him home and then raced to Davids home. His wife came out to meet us and all of us witnessed strange lights over the trees behind his home. My son and I started home to see cars stoped along side of the road looking at the same lights. We made it home and was terified trying to calm down we found ourselves sitting in what we call is the red room which is my private study off of my bedroom on the rear of the home staring out the window at the sky. I live on 6 ackers of land and we have a large dog kennel just in the woods behind my home and a Chesapeak Bay Retriver which lives on my back steps a guard dog she lets us know if any thing from a person to a squirl is on our property. We were home mabey 4 hours calmed down alot no tv didnt have one at that time I guess it was around 1 to 2:00 am and there was a noise that sounded sorta like a prop jet flew tree top high right over the house I ran out side and could see nothing. Within 30 to 45 minutes all of the dogs in the kennel were roaring they are all hounds and they will tell you when there is something there that is not supposed to be. At that time My Retriver was going crazy hair standing up on her back barking towards the Kennel. My son was scared but I convinced him to go with me to see what had the dogs stired up. My son and I opened the door and the retriver took off you see she most of the time will not leave the patio unless I go out if she is stired up. There was frost on the ground didnt even have shoes on we took off behind her and she ran just behind the kennels and all of the dogs were roaring and she was hair standing up barking at something in the bushes along with all the other dogs in the kennel and then she took of after what ever it was and so my son and I ran back down the road that leads to the kennel to my back yard at the very rear of the property trying to cut off what ever it was she was chasing. When I got to the Blue Berry Hedge Row which at the very rear of the property she was still the dog making her way to me in a roaring like panic. At that time I stoped not really scared but kinda numb to see this max of 4' tall Creature person Alein staring at me. It looked as if it had a clear glass like covering around it,it apeared to have a faint glow of red and black the face I could not see nothing but what looked like it had a red set of goggles and a black or dark covering over the lower part of its face sorta like a mask. The body appeared to sorta glow. I can probally draw it better than explain it. It then dissapeard just as my son and the dog got right up on it and my son then told me you see I am not crazy this was the same description as he told everyone. I will not go into detail but my son and I were commited to an insane assulym by our family because they realy thought we were crazy. We were realeased within 2 days and then my Father came to me and appologized when he said he had heard on the radio and the news that lots of people had been seeing strange lights and that the goverment reported that a Soviet Satilite had fallen that same night. I am 45 years old with 4 children church goer Retired Builder and Commercial pilot. I have been riddiculed commited along with my son and opressed to say anything but I know what I saw and four other men will say the same I have been since hooked on UFO files trying to find others that have had the same experience. I will take a lie detector be hipmotized whatever to bring the truth to the public. My son and the other three men all saw the same and have their own accounts. Thanks {pid}"],"files":["/var/www/straped/mufon/html2text/8103.html.txt","/var/www/straped/mufon/more/8103_submitter_file1__JrDrawing.jpg","/var/www/straped/mufon/more/8103_submitter_file2__DadDrawing.jpg","/var/www/straped/mufon/org/8103.html"],"Log Number":"US-10102007-0005","Viewing Distance":"21-100 Feet","Sighting Duration":"07:00:00"}