{"City":"Covington","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 5 other sightings in Covington","There were no other sightings in Covington on or around October 10th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.596782,+-83.860183(8108)&iwloc=A&hl=en\"> mufon case (8108) map </A>","files":["/var/www/straped/mufon/html2text/8108.html.txt","/var/www/straped/mufon/org/8108.html"],"Weather Factors":"None","Source":"MUFON","Date of the Event":"10/10/2007 08:14 UTC","Country":"United States","divs":["Sighting DetailsI left a friend's house just after 8:10 p.m. E.S.T. She lives on Elks Club Covington, GA. When I left her house I looked at the stars and was amazed at how bright they seemed and how crisp and clear the sky was. Then I remembered reading something a few weeks ago about Mars being the brightest object in the sky sometime soon. This had me watching the sky as I left her house just because I was amazed at how beautiful the stars looked. I made a right hand turn out of her driveway and then a left on to Starrsville Rd. I went up and down the first hill and was coming up to a brand new subdivision on my right when I noticed a bright glowing light...light a giant red street lantern through the trees. I undid my seatbelt and glued my face to my windshield to try to see it. I could not clearly because of the trees. I continued up the road just a bit all the while watching for this light. Then I saw it. It was above the treetops of the pines, good old GA pine trees. It looked metal, but not shiny. It had a glowing aura, like it was on fire, but no flames of course. It seemed to be orangish-reddish...At glance it would have been mistaken for an extra bright harvest moon. I fiddled for my phone as I slammed on my brakes but then realized the darn thing was moving slowly down and diagonal to my right. What I wanted to do was what you see people do in movies, get out of my car and try to walk closer to it, hehe. However, instead of stopping I realized it was moving and decided to keep moving in my car since I was driving in its direction. My fist would have covered it up had I held my arm out. I know it's really hard to judge an object's size from the ground when it is in the sky, but I'm going to say 50 feet across, which would be guessing a little large, because it was not very high in the sky. It was not even a mile away either. It was freaking close. It seemed to have two halves, kind of like how a brain is split, but a sphere and not the shape of a brain. In actuality, it almost could have been two objects right next to each other. There seemed to be other lines on it too. Anyway, I rounded another curve and lost sight of the object for the trees and the curve. However, as soon as I lost sight of it sparks caught my attention to my left. My initial response to the sparks were the glowing embers left over from fireworks that fall out of the sky, but these were moving up like something had exploded or something. As I was coming up to the stop sign where I turn left and cross over RR tracks to approach the intersection of Hwy 213, I noticed a red blinking light on the transformer at that intersection blinking. I don't know much about transformers except that I believe that they do have something to do with magnets.....and I don't know for what that red light was blinking, but I'm calling the power company tomorrow morning to find out. There were no power lines down, the transformer had not blown, and the people across the street from the transformer had power....maybe it had a short overload from whatever object was in the sky that I saw. I had thought maybe a transformer had exploded but there are no power lines running where I believe my orange ball was in the sky and everyone had power that I saw. The red blinking light may be totally insignificant. However, I drive that road all of the time at night and have for almost 5 years. That is the first time I have ever seen the red blinking light on it. To make circumstances seem even more unusual: I still had my eyes glued to the sky looking for anything else or my orange ball again when I noticed an airplane moving incredibly fast in the direction of the sighting. I then looked around and noticed numerous other lower flying craft that obviously were not commercial planes heading in for a landing at Hartsfield International. I made my right hand turn, still with my face plastered against the windshield, on to Hwy 213 headed to Ga Hwy 36. I called my boss's son and asked him what a red blinking light on a power transformer meant. This call took place about 8:17. I was telling him the story and watching and telling him about the planes I was seeing. I picked one out that seemed to be headed in the same direction I was, which happens to be on the outskirts of Covington. When I made my right hand turn on to Ga Hwy 35, the plane I had picked out to observe also seemed to make a right hand turn and then about a half mile down 36 the plane seemed to make another right as if it was circling a perimeter. It seemed as though the planes or aircraft I saw were looking for something. There were about 10 aircraft...I really did actually try to count them. However, I was also trying to drive and focus on that one. They just seemed to be fishy. It was dark and they were high enough I could not tell what type of plane they were but much lower than airliners and obviously not on any route of a commercial plane. I cannot have been the only person to see this object or possibly even notice the unusually high number of planes that seemed out of place in the sky. I never saw the orange object leave in to the night sky or shoot away somewhere and I never saw it \"disappear.\" I only had lost sight of it. .....I wonder if it landed or hovered low among a clearing in the trees or what. That is the part that really baffles me...what happened to the darn thing. Just to note....I've always been interested in UFO's, ones that can be explained by Earthly human creations and such and the others that still cannot be explained. Not until after this sighting tonight that I did some research had I ever even heard about a bright orange fiery thing like I saw. I found some reports of what almost exactly I saw that are fairly recent...I'm talking within the past two months..in the ten minutes I looked around on the net, I found at least 5 or 6 recent ones from all over the US and Canada and some older sightings from Europe. My first thought when I saw the light through the trees was, \"Darn, that's a really huge bright street lantern.\" and then immediately following that, was \"What the he!! is that?!?!\" hehehehe However, there's not subdivision where I saw it and then I found it it was above the treeline down the road."],"Longitude":"-83.860183","Disposition":"Unknown","Latitude":"33.596782","Log Number":"US-10102007-0010","Summary":"Orange harvest moon type sphere moving slowly down toward treetops","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Other","Case Number":"8108","Region":"Georgia","Date Submitted":"10/10/2007 08:14 UTC","Tags":"City","Object Shape":"Fireball, Sphere","Object Features":"Patterned Surface, Other"}