{"Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/8112.html.txt","/var/www/straped/mufon/org/8112.html"],"Sighting Duration":"00:05:00","Source":"MUFON","Case Number":"8112","Tags":"City","Disposition":"Insufficient Data","Log Number":"US-10112007-0001","Object Shape":"Circle, Fireball, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=41.686231,+-86.241097(8112)&iwloc=A&hl=en\"> mufon case (8112) map </A>","Object Features":"None","Date Submitted":"10/08/2007 09:14 UTC","divs":["Sighting DetailsOn the evening of Oct. 10th, 2007 as I was letting my dog out of our back door, as I do every evening around nine p.m. I looked out to the southern sky a habit I repeat everytime I let my dog out. We live just on the edge of farm land and have a great view of the stars at night. My dog Rudy started to bark at the object. So as I looked up at the clear night sky, I saw a ball shaped object traveling due south at a slow rate of speed. The object appeared to be a bright orange in color. It seemed to be flying at about the same highth that small crop dusters would be flying. It was close enough to the ground for me to tell that it was not an airplain of any kind. The object flew in a straight line and was not desending as far as I could tell. It actually began to go higher in the sky.The ball shaped object made no sound, nor was there any sort of vapor trail or any thing coming off of the object as it flew. There were no marks visible on the object. It really did appear as a glowing sphere in the sky as it continued on a southerly course and went out of sight. This is the third time I have seen this same type of object, it was not a plane or a falling star or even Ball lightning. I am convinced that this was something under pilot control. A few days later, my dog died in my arms."],"trends":["There have been 38 other sightings in South Bend","There were no other sightings in South Bend on or around October 8th 2007"],"Summary":"LARGE BASKETBALL SHAPE GLOWING ORANGE","Weather Factors":"None","Longitude":"-86.241097","Region":"Indiana","Country":"United States","Object Flight Path":"Straight-line path","Date of the Event":"10/08/2007 09:14 UTC","City":"South Bend","Latitude":"41.686231"}