{"Date Submitted":"03/18/2005 09:30 UTC","Log Number":"US-10112007-0002","Region":"Nevada","Case Number":"8113","Date of the Event":"03/18/2005 09:30 UTC","Summary":"larger orb became six orbs all very quickly with a large flash of light, like flares but all the six orbs moved quickly into seperate directions lasted for three or four minutes.","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Egg, Fireball, Flash, Sphere","Tags":"City","Sighting Duration":"Undisclosed","Country":"United States","Latitude":"36.098325","City":"Las Vegas","map":"<A HREF = \"http://maps.google.com/maps?q=36.098325,+-115.051873(8113)&iwloc=A&hl=en\"> mufon case (8113) map </A>","divs":["Sighting DetailsI had a very strange road trip one evening on March 18th 2005. I was travelling through Nevada, approaching las vegas from lauphin. It was around 9:30pm I saw a large orange orb directly over the top of me around 10,000 feet rouphly. I pulled over to see what it was. I had no idea, When I got out of the car I saw 6 smaller orbs eject from the larger orb. The larger orb became six orbs all very quickly with a large flash of light, like flares but all the six orbs moved quickly into seperate directions lasted for three or four minutes. I got back in my car and I called everyone I knew. When I was about 2 hours outside of my home. I pulled over on the highway at a rest stop to rest and I got out of the car, around 5:00 am I looked up to see a round shaped orb in the distance around three or four miles away at around 8,000 feet. The orb was a large sphereical shape glowing orange and zipping around as if it were looking for something. I watched it for close to ten minutes until I thought it looked at me, I't started moving toward me, I got a Erie feeling and I got in my car and headed home. I lost sight of the orb when I got to frightened to stay any more. So I got out of there in a hurry. I remeber looking around and adjusting my mirrors to see if it as still following me, I remeber this strange high pitch sound and bright light, lighting up the morning sky thats when I got in the car and left, and thats the last place I saw the orb. A friend told me to tell my story..."],"Object Features":"Other","Object Flight Path":"Path with directional change,Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8113.html.txt","/var/www/straped/mufon/org/8113.html"],"Longitude":"-115.051873","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around March 18th 2005"],"Disposition":"Unknown"}