{"Log Number":"US-10112007-0006","files":["/var/www/straped/mufon/html2text/8117.html.txt","/var/www/straped/mufon/org/8117.html"],"Source":"MUFON","Object Flight Path":"Undisclosed","Disposition":"Unknown","Latitude":"37.727273","divs":["Sighting DetailsI was driving home from Carbondale on Oct. 9th and was stopped at the stoplights in front of the mall. I was headed East towards Marion and was waiting for the light to change when I looked up and saw a silver blimp shaped object hovering in the sky above the highway in front of me. My 13 yr. old daughter was alseep in the seat next to me and I shook her leg and said, \"Wake up...what is that?\" She looked and said, \"I have no idea\" We watched it till the light turned green and it was still hovering in the same spot. I looked at the clock to be sure of the time then rolled down my window to see if I could hear any noise but there was too much traffic noise to really hear anything else. We were starting to move about this time and it suddenly very slowly started moving towards the south east. It was a very clear and sunny day and this was the only object in the sky and it was very clear. It finally moved off so far away that we lost sight of it. My daughter and I kept talking about it the whole time we were watching it to be sure of what it really looked like. It was silver and had a black strip across it from the bottom to the top. There were no windows, no tail, no wings, nothing hanging from the bottom like a blimp has. It just seemed to be floating."],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.727273,+-89.21675(8117)&iwloc=A&hl=en\"> mufon case (8117) map </A>","City":"Carbondale","Summary":"Silver blimp looking object over Carbondale, Il.","Object Features":"Undisclosed","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-89.21675","Date of the Event":"10/09/2007 04:02 UTC","Tags":"City","Case Number":"8117","Object Shape":"Blimp","Viewing Distance":"Unknown","Region":"Illinois","trends":["There have been 5 other sightings in Carbondale","There were no other sightings in Carbondale on or around October 9th 2007"],"Date Submitted":"10/09/2007 04:02 UTC"}