{"Viewing Distance":"501 Feet - 1 Mile","Summary":"Blue-white light.","Region":"Nebraska","Date of the Event":"10/05/2007 11:45 UTC","Date Submitted":"10/05/2007 11:45 UTC","City":"Omaha","Latitude":"41.259463","map":"<A HREF = \"http://maps.google.com/maps?q=41.259463,+-95.989048(8118)&iwloc=A&hl=en\"> mufon case (8118) map </A>","Log Number":"US-10112007-0007","Tags":"City","divs":["Sighting DetailsJust to let you know beforehand. I am a MUFON member. I was coming home from a friend's house and was heading south on interstate I-680. I was just about up to the Dodge Street exit when I noticed a very bright blue-white light coming in from the west. This light was headed east and moving way too fast for an aircraft in the Tower controlled airspace over Omaha. As I passed under the Dodge Street overpasses I watched as the object appeared to fly over the interstate heading east and pitch up a bit before going dark. At first I thought I was looking at a meteor but I saw no luminus tail or contrail. There were none of the red or green wingtip lights associated with conventional aircraft or helicopter either. I noted the time and place before heading home to check the Heavens-above.com website for any satellite, HST, or ISS overflights. I checked and could not find anything that was overflying the Omaha area at the time in question. I did find out the ISS was flying over on Saturday Oct,6th. at 7:39pm. I went out and stood in my front yard with 15X63 power binoculars to look for it. The ISS passed directly overhead at 7:40pm. It was nowhere near as bright as the object I had seen the night before. Neither was it anywhere near as fast as it travelled from horizon to horizon making a very shallow S-turn in the process. This motivated me to report the sighting to a friend and local MUFON investigator and he suggested of course that I report it here."],"Longitude":"-95.989048","Source":"MUFON","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8118.html.txt","/var/www/straped/mufon/org/8118.html"],"Object Shape":"Star-like","trends":["There have been 83 other sightings in Omaha","There was one other sighting in Omaha on or around October 5th 2007"],"Weather Factors":"None","Object Features":"Unknown","Object Flight Path":"Straight-line path","Case Number":"8118","Sighting Duration":"Undisclosed"}