{"Object Features":"Unknown","Disposition":"Hoax","Case Number":"8127","Latitude":"30.468043","divs":["sighting detailsi was at a get together and i brought my camera and tripod. after sitting outside and chatting away my little girl asked me to turn up the radio and when i got up from the table and did a 180 towards my truck we saw a huge (at least 400ft rectangular craft) with an (low lit) amber light on each corner. it was barely moving and made no sound. it flew straight for a good 2 miles at around 1000ft maybe and turned and faded out. we were kind of caught off guard so i didn't get a chance to film it so close. i started up the camera and kept looking in the direction it flew when a few seconds went by it flashed into the sky a bright white and that's when i started filming. it's a new camera and i still don't have all of my own tweaks out on using it properly to film at night. so please bare with my focusing. i was using a sony hdd handycam\\ model dcr-sr42. with super night shot. 40x optical zoom and 2000x digital zoom with a carl zeiss lens. if anyone knows how to get this thing infared; i'm all for it. this is the first one i've ever caught on tape. i've been seeing them since i was a kid."],"Viewing Distance":"101-500 Feet","Sighting Duration":"Undisclosed","Log Number":"US-10122007-0009","Date of the Event":"10/11/2007 12:00 UTC","City":"Baton Rouge","Summary":"Rectangular ufo-passed by first. Turned around and was caught on film second passby","trends":["There have been 27 other sightings in Baton Rouge","There was one other sighting in Baton Rouge on or around October 11th 2007","This sighting has never been favorited.",""],"Longitude":"-91.13674","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.468043,+-91.13674(8127)&iwloc=A&hl=en\"> mufon case (8127) map </A>","files":["/var/www/straped/mufon/html2text/8127.html.txt","/var/www/straped/mufon/org/8127.html"],"Region":"Louisiana","Object Flight Path":"Straight-line path,Path with directional change,Other,Unknown","Tags":"City","Weather Factors":"Unknown","Object Shape":"Square, Rectagular","Date Submitted":"10/11/2007 12:00 UTC","Country":"United States"}