{"map":"<A HREF = \"http://maps.google.com/maps?q=25.086515,+-80.44728(8134)&iwloc=A&hl=en\"> mufon case (8134) map </A>","Object Features":"Unknown","divs":["Sighting DetailsWe were at a camping ground near Caloosa camping ground,playing with my 2 dogs,when I looked up and saw 6 very bright circles coming from the south (key west?) I started to yell loud \"U.F.O.s\" some people started to come out of their tents & trailers, they started to say ufos ufos, some of them mentioned cameras, but I coulnt take my eyes off the bright circles one of the circles broke off formatiom and shot out to the east.the other ones continued at the same speed, and going north. The one that broke formation. flew back into the line formation,and its original spot.without losing any speed, and with surgical precision.I had my eyes fixed on the six flying discs. they kept flying noth towrd Miami untill they disappear. I was very happy, it was the second time in my life ,and I know it will happen again. The first time ,happened , when I went to visit Colombia South America, all I can remember we were in the city of Cali, with about 15 other people in the group and we all saw a very bright circle, or disc, flying at incredible speed until it disappear in the distance"],"Viewing Distance":"Unknown","Country":"United States","Tags":"City","City":"Key Largo","Case Number":"8134","files":["/var/www/straped/mufon/html2text/8134.html.txt","/var/www/straped/mufon/org/8134.html"],"Source":"MUFON","Weather Factors":"Unknown","Region":"Florida","Log Number":"US-10132007-0004","Object Flight Path":"Straight-line path,Path with directional change","Latitude":"25.086515","Sighting Duration":"00:03:00","Object Shape":"Circle","trends":["There have been 4 other sightings in Key Largo","There were no other sightings in Key Largo on or around August 31st 1985"],"Date Submitted":"08/31/1985 05:00 UTC","Summary":"six very bright circles flying north in straight formation,fast.","Disposition":"Unknown","Longitude":"-80.44728","Date of the Event":"08/31/1985 05:00 UTC"}