{"Source":"MUFON","Longitude":"-73.47687","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Region":"Connecticut","Summary":"Bright light, extreme accelleration.","Viewing Distance":"501 Feet - 1 Mile","Case Number":"8140","trends":["There has been one other sighting in Sharon","There were no other sightings in Sharon on or around December 10th 2002"],"Date Submitted":"12/10/2002 12:00 UTC","Disposition":"Insufficient Data","Latitude":"41.879375","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.879375,+-73.47687(8140)&iwloc=A&hl=en\"> mufon case (8140) map </A>","Log Number":"US-10142007-0006","files":["/var/www/straped/mufon/html2text/8140.html.txt","/var/www/straped/mufon/org/8140.html"],"Country":"United States","Date of the Event":"12/10/2002 12:00 UTC","Sighting Duration":"Undisclosed","Object Shape":"Unknown","Tags":"City","divs":["Sighting DetailsWhile driving my wife to work on the approximate date stated above, we both saw an extremely bright light in the sky, appearing to us as a spotlight. The distance was less than 1 mile and the elevation above ground level appeared to be several hundred feet. I stopped the car to watch it and it suddenly went out. At the time I was thinking a helicopter searchlight was looking for a lost hunter or something, as the area is quite remote. i drove my wife to work and returned by the same route some 45 minutes later. The road was Skiff Mountain Road in Sharon, CT, opposite Pecks Pond, which will be shown on a map of the area. Stopping in the same spot but with the car pointing in the opposite direction which was North. Nothing was visible but I stopped the car and got out a very powerful spotlight of 1 million candlepower. I shined the light to the east, toward where I saw the object earlier. Suddenly and instantly, the light came back on, this time shining in my direction. It was of extreme brightness, beyond anything I have seen on an aircraft before. I turned my light off but the object kept its light focused on me and began to slowly move to the north. I returned to the car to turn the engine off in my car to better hear if there were rotor or engine sounds. As I went to my car to turn off the engine, I saw my distinct shadow and that of my car so I am certain this spotlight was pointed in my direction.This is an extremely rural area and there were no sounds detectable. I could see some reflection of the light in a pond that was situated between me and the object. I am very familiar with the area as I have hunted deer in that precise area for years. There are no homes, businesses, or installations of any kind in that area. I cannot say anything definitive about the shape of the object other than that my impression was that it was of a diamond or delta shape. There were no position or navigation lights visible. There was no moon or other artificial light in the area; No streetlights or house lights either. The object began accellerating to the north but the light continued to shine in my direction. There was still no noise. Based on the terrain and my familiarity with the area, I would say that it could not have been higher than several hundred feet. My shadow and that of my car were extremely elongated, indicating that its height above terrain was quite low. All of this happened within 3 to 4 minutes or so. Then the accelleration became extreme and the light remained on. Within in the next 20 to 30 seconds, it accelerated, without any apparent increase in altitude, to the northeast at an incredible speed and as the light became more and more faint, until it appeared to be extinguished. It traveled 8 to 10 miles to the Northeast in those 20 to 30 seconds. I was prompted to report this incident as I have just had another tonight which I will detail in the next report, following this one. I am retired now but hold a Commercial Pilots license with, Aircraft Single, Multi-Engine, Instrument Airplane, ratings. I currently have 2,500 flight hours, 1500 night and I no longer fly due to a back injury. In my flying I never saw anything that could not be identified as a normal aircraft. I kept this to myself but decided, based on tonights sighting to tell the story. Wayne Stoops"],"City":"Sharon"}