{"Country":"United States","Case Number":"8142","map":"<A HREF = \"http://maps.google.com/maps?q=41.887005,+-73.47546(8142)&iwloc=A&hl=en\"> mufon case (8142) map </A>","Log Number":"US-10142007-0008","Longitude":"-73.47546","Sighting Duration":"Undisclosed","Summary":"Red and White lights, rapid directional change and accelleration","City":"Sharon","Region":"Connecticut","divs":["Sighting DetailsI was sitting in my hot tub tonight which is outside on my deck. I had been in the tub for approximately 10 minutes and was casually looking at the night sky. I watched several jet aircraft pass over head. No noise as they approach then as they pass overhead, the sounds of their engines can be heard. I watched as an object, which appeared to be at a somewhat lower altitude that the others I had seen, assuming that the lights on the object were of the same size. It was traveling from south to north at what seemed an appropriate speed, compared to others I had seen cross over on this and other nights. What caught my attention about this object was that it had a lot of lights on it. White and Red, appearing to be mixed together. There could have been as may as 15 to 20 lights. None seemed to pulsate or blink. As I watched it, I was amazed to see it make an extremely abrupt left turn of approximately 110 to 120 degrees to an approximate heading of 250 to 240 degrees. The entire turn took place within no more than a tiny fraction of a second. After the turn it began to accellerate very quickly to an amazing apparent speed and as it approached within 10 degrees of directly overhead, all the lights went off. I listened and there was no noise as it should have passed over. No aircraft that I am familiar with can make a turn like that and certainly no pilot could withstand the g-forces. There did not appear to be any radius to the turn, more of an instant change in the direction of travel. At the time of the sighting, the sky was clear and there were starts visible in all quadrants of the sky. I just filed another report of a sighting I had 5 years ago but kept silent about until tonight."],"Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/8142.html.txt","/var/www/straped/mufon/org/8142.html"],"Disposition":"Unknown","Date of the Event":"10/14/2007 08:10 UTC","Object Flight Path":"Path with directional change","trends":["There has been one other sighting in Sharon","There were no other sightings in Sharon on or around October 14th 2007"],"Date Submitted":"10/14/2007 08:10 UTC","Weather Factors":"None","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Unknown","Tags":"City","Latitude":"41.887005"}