{"trends":["There have been 4 other sightings in Stockholm","There were no other sightings in Stockholm on or around December 25th 2000"],"Longitude":"18.06491","City":"Stockholm","Date Submitted":"12/25/2000 01:59 UTC","divs":["Sighting DetailsWe were so amazed! We heard the sound of dripping water outside as we lay in bed waiting for Santa to come. We over at my Uncle Bjorn's house in Stockholm celebrating Christmas with dancing and ABBA discos! We thought it was Santa feeding his reindeer outside, so we ran out with our video camera to greet him. It wasn't him. We were just so shocked! There were all these little guy with slimey green skin and 10 hands and 100 legs and 20 arms and 78 feet and seven heads! There skin was so neon green it glowed in the dark and they didn't need lights because they had night vision contacts! My little brother who is just so bold walked right up to them and asked them what they were doing in our garden. My mommy scolded him and told him to be more polite as the martians were our guests. The martians were celebrating Christmas they said. My brother was all of a sudden happy and interested in every little thing they said. Apparently they knew Santa Claus and he was on holiday in Perth, Australia so the martians were filling in for him that year. They had just finished delivering all their presents to all the little human children that they decided to land in our garden for a little party before returning to Wackatanilani(planet undiscovered by those silly humans). They invited us to join in tango dancing and offered us Gourmet Slime Chocolate Chip Cookies with a glass of slime for us children and a glass of Martini Slime for my mommy. We had sooo much fun. It was sooo AWESOME. Next, they took us to their ships of all different assorted sizes. They often escort many different species so they must have different shaped ships to accomodate different amounts of legs and heads and whatnot. They gave us a ride on the UFOs and took us to Mars. It was all red and dusty and it made me sneeze and feel nauseous. I just wanted to go home. They took us to Wackatanilani next which was much better than Mars. It was all tropical and looked suspiciously like Hawaii except that there were all these martians and their purple spikey dogs sitting on levitating porches. They took us back home and laid us in bed because we were so tired. They said they would visit us on December 25, 3000 when Santa Claus is going on holiday to Iceland. We didn't have enough time to remind them that we wouldn't be alive then when one of them said \"Beam me up Slimey\" before disappearing in a cloud of dust. We fell asleep immediately and awoke in the morning as if nothing had ever happened. We ate scrambled eggs for breakfast which was really good because my mom cooked them and then put them on toast. You see my brother can't cook very well and usually the eggs come out all watery and somehow orangy with all this gunk like liquidy stuff on the side and he burns the toast and uses cheap margarin instead of Irish butter which my mom says is the best kind and then she uses it on bagels too not just toast. And then we opened our presents. I got the bike I had always wanted and my brother got the plastic UFO toy he wanted. Haha! It was a bit of a joke after we been on the real thing. We went to school on January 1 and we told all our friends what had happened. None of them believed us and they punched us in the noses and refused to be our friends. We have never had any friends since because we keep telling them about the martians. This is okay though because we know the truth about UFOS now!!! We are so glad to have found the Mutual UFO Network to find people who know the truth and aren't blinded by the social norms of these brainwashed humans. We have dedicated our lives to the research of UFOs."],"Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/8147.html.txt","/var/www/straped/mufon/org/8147.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=59.32893,+18.06491(8147)&iwloc=A&hl=en\"> mufon case (8147) map </A>","Latitude":"59.32893","Object Flight Path":"Other","Object Features":"Dome, Window(s), Patterned Surface, Insignia, Appendage(s), Louvres, Wings, Other","Country":"Kingdom of Sweden","Weather Factors":"Windy, Lightning, Fog, Rain, Hail, Sleet, Snow, Heavy, Medium, Light, Unknown, Does Not Apply","Region":"Stockholm County","Case Number":"8147","Tags":"City","Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Disc, Egg, Fireball, Flash, Oval, Saturn-like, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Other","Date of the Event":"12/25/2000 01:59 UTC","Log Number":"SE-10152007-0005","Sighting Duration":"12:59:59","Viewing Distance":"20 Feet or Less","Source":"MUFON","Summary":"It was soooooo cool! There were all these little green martian dancing the tango on our front lawn whilst OINKing! It was sooooo like totally cool, you know? OMIGOD!!!"}