{"map":"<A HREF = \"http://maps.google.com/maps?q=42.736695,+-84.545565(8148)&iwloc=A&hl=en\"> mufon case (8148) map </A>","Disposition":"Insufficient Data","Object Features":"None","trends":["There have been 54 other sightings in Lansing","There were no other sightings in Lansing on or around"],"Source":"MUFON","Weather Factors":"Unknown","Date Submitted":"10/15/2007 04:21 UTC","Viewing Distance":"Unknown","Latitude":"42.736695","Summary":"slightly V shaped formation of about 30-40 saucers which faintly glowed white, no sound, very fast and precise moving.","Date of the Event":"Unknown","Log Number":"US-10152007-0006","files":["/var/www/straped/mufon/html2text/8148.html.txt","/var/www/straped/mufon/org/8148.html"],"Object Flight Path":"Path with directional change","divs":["Sighting DetailsI went out to smoke a cigarette at home at about nine pm and I always look at the night sky. I simply caught it as it went by my field of vision coming from the west heading east. It was a slightly V shaped formation of 30-40 silver saucers which faintly glowed white, but bright enough to see distinctly.Even with trees I have a good look at most of the sky, I sighted when it was already halfway across and in about 3-4 seconds it veared right and disapeared because of what I percieve was too great of a distance to see which makes me think they were large and very high. they (or it ,although I saw many individual replicated shapes) moved very precisely as one large unit sized at about three inch span of my thumb and forfinger at arms length. The first thing my mind flashed to was that it was a flock of geese, but it only took an instant for me to think huh? what the H***. This is the third time I've been in this situation so my freak mode is getting tempered. I always think, what should I do, who else saw it ect... someone said later I should have call really their the cops, but 1. it isn't really their \"juristinction\" like calling 911 about burnt turkey and 2. I don't like that whack-job label so much. My last sighting was in the same place and similair, but the formation and obects were totally different."],"Case Number":"8148","Longitude":"-84.545565","City":"Lansing","Region":"Michigan","Country":"United States","Object Shape":"Disc","Sighting Duration":"Undisclosed","Tags":"City"}