{"Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Case Number":"8155","Object Shape":"Saturn-like","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.951814,+-75.829286(8155)&iwloc=A&hl=en\"> mufon case (8155) map </A>","Date of the Event":"06/30/1999 12:00 UTC","files":["/var/www/straped/mufon/html2text/8155.html.txt","/var/www/straped/mufon/org/8155.html"],"Region":"Pennsylvania","Date Submitted":"06/30/1999 12:00 UTC","divs":["Sighting DetailsI was walking to the train station in Huntingdon Valley, PA to go to work. I saw a silver object in the woods near the field I was walking by. It was far away and hard to see. Later after work I went home and saw it was still there. I got changed and went over to where it was. It was a small saturn shaped object. It was a beautiful silver ublike any metal I was familiar with. It was about the size of a car. I looked up and did not see any tree breakage. However I did not cross the stream between me and that object. I thought if it was a UFO it might have radiation and I didn't want to get sick. It really scared me though. It was there for a week or so and then left and came back again for another week. It was in a place where other people should have noticed. this is why I think it must have been a trick or a movie prop. Except it looked so real and like no other thing I have ever seen. I was afraid to take pictures or call anyone because I was afraid the government would come after me or something like in the movies. I was 19 then. Anyway, there's lots more but too much to write I guess. Tom Carey's headquarters is right up the street in Huntingdon Valley so I feel like it could have been a prop or something. I just never had the guts to find out until now."],"Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","Summary":"UFO sitting on the ground near a field by my house","City":"Coatesville","trends":["There have been 8 other sightings in Coatesville","There were no other sightings in Coatesville on or around June 30th 1999"],"Object Features":"None","Object Flight Path":"Stationary","Log Number":"US-10162007-0005","Latitude":"39.951814","Disposition":"Insufficient Data","Longitude":"-75.829286"}