{"divs":["Sighting DetailsI was outside of my apartment named Julia apartmaents I had no phone because the power was out I went outside to the payphone to call and check on my grandmother it was dark outside so many people were sitting outdide drinking ( I wasn't drinking )I was talking to my grandmother and I was looking up at a pretty pink tree beside me think how pretty it was when just above the trees about 5 ft. I seen something light up as bright as a strobe light shoot forward and disappeared not behinde anything because it was an open space just gone in the dark seen no shape just a flash of light and movement that couldn't be explained I drop the phone and look behinde me to see if anyone else seen it I heard someone say \"I have never seen anything like that before\" But of course my only wittnesses were drunk. But the weekend before that My husband and his friend came in saying they saw a UFO I laughed at them because they were drinking But they claimed to see it the next street over where I was.I had no ideal what I saw and I still don't ,but I do know it was amazing after I went back to my apartment i was scared closed my windows and blinds because I was standing under it! and that scared me after about an hour of thinking I went back outside and layed on the grass looking for it again but I never saw it anymore this happened to me back in 1999 but in 2001 I was woken in my bedroom by a flying yellow orb i slowly got up to turn on the light while watching it it dissapeared when I reached for the light I don't know if they are connected."],"Disposition":"Insufficient Data","Case Number":"8161","City":"Logan","Sighting Duration":"00:00:05","Source":"MUFON","Object Features":"Unknown","Tags":"City","Summary":"A very bright light flashed like a strobe and shot forward and was gone","map":"<A HREF = \"http://maps.google.com/maps?q=37.854945,+-81.988658(8161)&iwloc=A&hl=en\"> mufon case (8161) map </A>","trends":["There has been one other sighting in Logan","There were no other sightings in Logan on or around July 20th 1999"],"Latitude":"37.854945","Date Submitted":"07/20/1999 12:00 UTC","Log Number":"US-10172007-0004","Longitude":"-81.988658","files":["/var/www/straped/mufon/html2text/8161.html.txt","/var/www/straped/mufon/org/8161.html"],"Date of the Event":"07/20/1999 12:00 UTC","Country":"United States","Viewing Distance":"20 Feet or Less, 21-100 Feet","Region":"West Virginia","Object Shape":"Flash","Weather Factors":"Unknown","Object Flight Path":"Hovering then path"}