{"Latitude":"34.399664","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.399664,+-118.533756(8164)&iwloc=A&hl=en\"> mufon case (8164) map </A>","trends":["There have been 33 other sightings in Santa Clarita","There were no other sightings in Santa Clarita on or around October 14th 2007"],"Viewing Distance":"Unknown","Source":"MUFON","Disposition":"Unknown","Object Flight Path":"Path with directional change","Summary":"Looked like Saturn, gold with a red ring around it, flew very fast and in crazy directions, it was like nothing I've ever seen before.Last night around 4 in the morning. Me and my mom both saw it. It was amazing. It kind of looked like Saturn. It was gold","Case Number":"8164","Object Features":"None","Longitude":"-118.533756","Country":"United States","Log Number":"US-10172007-0007","Date Submitted":"10/14/2007 04:00 UTC","Region":"California","divs":["Sighting DetailsMy mom and I were driving home from my friends house at around 4 in the morning. It started out as just another ride home; we talked, stopped at the drive-thru to get something to eat, and then we were back on our way. We were about 15 minutes from home when I saw it. It took the shape of Saturn. It was gold with a faint red ring around it. Though it was not huge, it shone brightly. It was that brightness that is what initially caught my eye. At first I thought it was just a bright light coming from one of the houses that resides way up in the hills. But I soon noticed it was moving. We noticed that it flew in all kinds of crazy directions- something an airplane wouldn't do, and of course, it looked nothing like a plane. And if flew so fast. We couldn't keep up with it. We tailed it the whole ride home, until it eventually it flew into the distance. After all that, I was very amazed and overjoyed at what I had just seen. I've alway been a believer in UFO's, and this just confirmed everything I've ever thought."],"Tags":"City","City":"Santa Clarita","Object Shape":"Saturn-like","files":["/var/www/straped/mufon/html2text/8164.html.txt","/var/www/straped/mufon/org/8164.html"],"Sighting Duration":"00:15:00","Date of the Event":"10/14/2007 04:00 UTC"}