{"trends":["There have been 6 other sightings in Chester","There were no other sightings in Chester on or around October 29th 2006"],"Object Flight Path":"Undisclosed","Source":"MUFON","Object Shape":"Cigar","Latitude":"53.201282","Longitude":"-2.890655","files":["/var/www/straped/mufon/html2text/8165.html.txt","/var/www/straped/mufon/org/8165.html"],"Date of the Event":"10/29/2006 12:00 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=53.201282,+-2.890655(8165)&iwloc=A&hl=en\"> mufon case (8165) map </A>","Case Number":"8165","Viewing Distance":"Unknown","Disposition":"Unresolved","City":"Chester","Country":"United Kingdom","Summary":"very bright green","Date Submitted":"10/29/2006 12:00 UTC","Log Number":"GB-10172007-0008","divs":["Sighting DetailsThe afternoon i saw this object it was a very blue sky witth no clouds. i was out walking my dog at the local heritage park in greenfield, holywell N. Wales when i looked up at the sky and saw this object which was cigar shaped and bright green, there was nothing else in the sky not even a cloud which made it stand out more. I watched it for nearly 5 minutes, then i must have blinked at one time and it was gone. I remember thinking there was no sound coming from this object and that it seemed motionless. this makes a total of 4 UFO i have seen. 1. in 1975 this was what i would describe as a saucer shape 2. in 1978 this was a ball of light that in the beggining looked begger than the setting sun, and moved across the sky doing a figure eight, then darting zig zaggerdly from one side to the other , constantly changeing size as it moved then it shot off so quick nothing i knew could move that fast. i was with 3 other people at the time and we just stood watching it in disbelief of what we were wittnessing. 3. in 2000 this was what i can only describe as an arrow shapped object which seemed to be concaved at the back with what appeared to be flames coming out of the back area that gave it the look of a tail. It was very low in the sky and i could clearly see the shape and thought it was crashing, then it disapeared behind the houses. 4. in 2006 this is the UFO described above"],"Region":"England","Tags":"City"}