{"Source":"MUFON","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","Region":"Illinois","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around October 18th 2007","This sighting has never been favorited.",""],"Object Flight Path":"Path with directional change,Other","Sighting Duration":"00:03:00","Case Number":"8168","Disposition":"Unknown","Object Shape":"Star-like, Unknown","Date Submitted":"10/18/2007 05:25 UTC","City":"Chicago","divs":["Sighting DetailsI was standing on the Metra Paltform at Van Buren street waiting for the South Shore train to Indiana when I noticed out of my peripheral vision a light in the sky. I glanced up and saw what I initially thought was a flare rising at approximately a 45 degree angle (north to south). The flare then leveled out and traveled for roughly three seconds from my left to my right (north to south), then immediately and without indication of a turning motion or stop the light began moving the opposite direction (south to north). At that time another light moved from a lower elevation out of my sightline up to roughly the same elevation as the first light. The two lights then began traveling within my range of vision back and forth and up and down very strangely. I have never seen anything move in such a manner. I then tapped the shoulder of the gentleman next to me, pointed into the sky at the object and asked \"Do you see that?\", to which the gentleman replied \"What the **** is that?!\" when he located the objects. At roughly the same time another object appeared (exactly similar to the first two) from a cloud bank to the north and joined the other two. All three objects were moving erratically and completely independantly of each other for apporximately 4 more minutes. During this period several other people (roughly 10-20 people) noticed us staring into the sky and pointing and began looking at the objects as well. There were several exclamations of excitement and amazement from the other witnesses. My train arrived at 5:31PM and I boarded. Within 30 seconds of boarding the train we experienced a very furious hail storm for roughly 2 minutes. After the hail cleared and as the train was travelling south I was watching out the window and saw two military fighter jets travelling at an extremely high rate of speed and very low to the group toward the location the objects were originally sighted. This sighting occurred at the onset of some serious weather storms and the objects were actually in the sky between the normal clouds to the north and the dark clouds to the south. The best description I can offer was that the objects looked like stars. They were very bright, shape and size was undiscernable. Distance over the lake and elevation were also impossible to determine. At the rate in which they crossed back and forth across the horizon, the speed was amazingly fast if they were more than 5 miles away. I contacted WGN News and ABC News during the evening to see if anyone had reported the lights. I was told that no one had reported anything. I unfortunately did not have any type of camera when this occurred. This is my first \"sighting\" of something strange. I do not know what I saw, therefore it remains UNIDENTIFIED as far as I am concerned. It was obviously in flight and tangible, so therefore I am reporting that it was an Unidentified Flying Object (UFO). When I first saw it I thought to myself, \"Dont over-react. There is a perfectly logical explanation for what you are seeing. You arent crazy\". Now I feel like I was part of something amazing, something that doesnt happen everyday. I will remember this for the rest of my life, even though it will be determined to be a weather balloon or a natural weather phenomena."],"Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/8168.html.txt","/var/www/straped/mufon/more/8168_submitter_file2__Newton_map.jpg","/var/www/straped/mufon/org/8168.html"],"Tags":"City","Log Number":"US-10192007-0002","map":"<A HREF = \"http://maps.google.com/maps?q=41.883774,+-87.619988(8168)&iwloc=A&hl=en\"> mufon case (8168) map </A>","Date of the Event":"10/18/2007 05:25 UTC","Weather Factors":"Windy, Rain, Hail, Medium","Summary":"Three bright points of light traveling erratically above Lake Michigan","Longitude":"-87.619988","Latitude":"41.883774"}