{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","City":"Highland","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.128344,+-117.208651(8174)&iwloc=A&hl=en\"> mufon case (8174) map </A>","Disposition":"Unknown","Case Number":"8174","trends":["There have been 15 other sightings in Highland","There were no other sightings in Highland on or around October 2nd 2007"],"Viewing Distance":"Over One Mile","Date of the Event":"10/02/2007 01:00 UTC","Date Submitted":"10/02/2007 01:00 UTC","Log Number":"US-10202007-0002","Summary":"Flying round object","Latitude":"34.128344","Object Shape":"Sphere","Region":"California","Object Features":"Unknown","files":["/var/www/straped/mufon/html2text/8174.html.txt","/var/www/straped/mufon/org/8174.html"],"Tags":"City","Weather Factors":"None","Country":"United States","Sighting Duration":"Undisclosed","Longitude":"-117.208651","divs":["Sighting Details I was bringing my sixth grade students back in from the playground at 1:00 in the afternoon. I noticed a small, white, circular object following a westbound passenger jet. The object then stopped and began heading in the opposite direction for a few seconds. It then started slowly heading north towards the San Bernardino Mountain range. One of my male students was watching this object with me, and he stated that had seen the same type of object the previous week at about the same time. (I remember that he had told me about his sighting from the previous week.) The object eventually stopped and hovered (it was about 20,000 ft. in elevation) for a few minutes. It was at this point another similar object swooped down and began to rapidly spin around the original round object. It almost looked like some type of dance. Then as suddenly as this \"dancing\" object appeared, it shot back out into space at a very high rate of speed. The original round object then began to head east at a slow pace. At this point I entered the classroom and lost site of the object. The whole event lasted less than ten minutes."]}