{"Longitude":"-80.353664","map":"<A HREF = \"http://maps.google.com/maps?q=25.605106,+-80.353664(8178)&iwloc=A&hl=en\"> mufon case (8178) map </A>","Viewing Distance":"Unknown","Summary":"in bed, heard voices,awakened,listened to voices to discern location. kept eyes closed, but when voices said i was awake and listening i looked up and saw 3 beings","Object Features":"Unknown","Latitude":"25.605106","Log Number":"US-10202007-0006","Sighting Duration":"00:05:28","Object Flight Path":"Undisclosed","City":"West Perrine","Source":"MUFON","Disposition":"Unknown","divs":["Sighting Detailsas above i heard voices, they were near but i wasn't sure. alli know is that they were there to talk about me and i was the subject of the conversation. i was about 10 to 12 years old. stangly enough over the years i have been mentally logging in numerous events where i have seen events befor they occured. some big some small. i won't mention the events for fear of you deleting this entry. it's wierd i have even seen events of my own life. as far as the incident i was in bed,the being's were colorful,and had character defining each one from the other,i literally screamed and they disappeared,the babysitter came running in the bedroom and i was screaming rather hysterically from my memory,she left and came back in a hurry with a plate of oreo cookies, i flung them aside in hysterics.I VIVIDLY REMEMBER THESE EVENTS EVEN THOUGH THEY ARE MORE THAN 30 YEARS OLD. IV'E TOLD THIS STORY DOZENS OF TIMES, HOPING TO FIND SOMEONE WHO CAN GIVE ME AN ANSWER.i'm tired,so this will probably be on of the few last times i will talk about it. they are here among us,with their infinite technologies,show yourself you stinkers."],"Date Submitted":"06/15/1976 10:30 UTC","Case Number":"8178","trends":["There have been no other sightings in West Perrine","This sighting has never been favorited."],"Region":"Florida","Date of the Event":"06/15/1976 10:30 UTC","Tags":"City","Object Shape":"Other","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/8178.html.txt","/var/www/straped/mufon/org/8178.html"],"Country":"United States"}