{"Summary":"Jellyfish-like white dots in a corset shape hovering and moving all directions near airport","trends":[""],"Source":"MUFON","Viewing Distance":"Unknown","Date Submitted":"10/21/2007 03:00 UTC","Region":"Texas","Object Shape":"Cylinder, Other","map":"<A HREF = \"http://maps.google.com/maps?q=31.975199,+-99.896053(8182)&iwloc=A&hl=en\"> mufon case (8182) map </A>","Object Flight Path":"Path then hovering","Object Features":"Dome, Other","Log Number":"US-10212007-0003","Sighting Duration":"00:45:00","Longitude":"-99.896053","files":["/var/www/straped/mufon/html2text/8182.html.txt","/var/www/straped/mufon/more/8182_submitter_file1__DSC06163.JPG","/var/www/straped/mufon/org/8182.html"],"Weather Factors":"None","divs":["Sighting DetailsMy daughter and I went out to watch the meteor shower and when we looked at the sky several very bright object caught both our eyes. We had 10x50 binoculars and took a look to see a cluster of lights in the shaper described above. After watching it move for a bit we thought that the object did not behave like a meteor. It was to the South of our house and appeared to be above George Bush Intercontinental Airport I went inside to get my 10mp digital camera and a 60x spotting scope. Through the scope at 15x the jellyfish-like appearance was clear to both of us.By the time I attached my camera, it had moved further away and appeared only as bright bluish-white like. We saw at least one other similar object to the Northeast it had a reddish color. It was mostly stationary, but moved from it's original position to about a ten degree arc in the sky toward the east over the course of about 10 minutes. All of my pictures do not show any detail. They had moved further away and just showed as points of light. We notice that at times they had tails similar to a comet that ranged in color from blue to orange. My wife looked too and saw the shape we did, but believed it to me a meteor. However, it hovered, moved side to side, up and down, closer and further."],"Country":"United States","Latitude":"31.975199","City":"Undisclosed","Case Number":"8182","Disposition":"Unknown","Tags":"City","Date of the Event":"10/21/2007 03:00 UTC"}