{"trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around September 20th 1978"],"divs":["Sighting DetailsBack in the late 70's when we lived near DeSoto Kansas on Cedar Creek hill on highway 10 East my husband and myself were washing a car out on the drive way. In the distance to the SE we saw something in the sky, it was not yet dark and we could see it very clearly as there were no clouds in the sky. It was a stationary object in the sky and looked unlike anything we have seen before or since. I went in the house to get the binoculars to see it better and it tilted made a zag to the right (West) and took off directly South at an extremely rapid speed. We had some friends that lived directly to the South about 20 miles from us and we called them on the phone and asked them to go outside and look to see if they saw anything but they did not. What seems unusual about this is that I have never heard of any UFO looking like the one that we saw. What we saw looked like a Black 6 hole muffin pan....and the holes were sort of Greenish. It was not square but longer than it was wide and the edges seemed slightly rounded and not real square. That is the best way I can explain it. Later on a year or so later we went to see Stanton T Friedman speak at Johnson County Community College and was very interested in the program he presented. We did not get a chance to talk to him of course as it was very crowded but though the years I have often thought of this. The other night we saw Stanton on TV and decided to see if I could find anyone to tell this to and if anyone else has seen anything like it. Most times it seems the UFO are saucer shaped or cigar etc. Thanks very much for your time."],"Date of the Event":"09/20/1978 06:01 UTC","Object Features":"Window(s)","Viewing Distance":"501 Feet - 1 Mile, Unknown","Log Number":"US-10212007-0006","files":["/var/www/straped/mufon/html2text/8185.html.txt","/var/www/straped/mufon/org/8185.html"],"Longitude":"-94.927864","map":"<A HREF = \"http://maps.google.com/maps?q=39.27956,+-94.927864(8185)&iwloc=A&hl=en\"> mufon case (8185) map </A>","Case Number":"8185","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Summary":"Like a black Muffin pan with 6 holes lit up","Disposition":"Unknown","Source":"MUFON","Latitude":"39.27956","Tags":"City","City":"Leavenworth","Object Flight Path":"Stationary,Path with directional change","Region":"Kansas","Object Shape":"Square, Rectagular","Date Submitted":"09/20/1978 06:01 UTC"}