{"Date Submitted":"10/22/2007 07:15 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Ontario","Viewing Distance":"Unknown","Log Number":"CA-10222007-0004","Latitude":"43.130556","Longitude":"-80.746667","Date of the Event":"10/22/2007 07:15 UTC","Disposition":"Unresolved","Object Shape":"Disc","Country":"Canada","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.130556,+-80.746667(8191)&iwloc=A&hl=en\"> mufon case (8191) map </A>","divs":["Sighting DetailsI had just arrived at work, then went outside to do get ready for inventory in the yard. I was checking out the really nice sunrise, And noticed a jet with a bit of a contrail behind it. The jet looked like it was going up on an angle, and maybe roughly 200 feet or more to the right of the jet was this very bright looking objet. It seemed motionless, or it was just hovering. I looked at it for about five seconds or more, and looked away for a few seconds to make sure I wasn't just seeing thing's, being so early in the morning for me. As I looked up again there it was still hanging there not far from the jet. I couldn't believe it. To me it looked like I was seeing the edge of a disc, and it was either giving off it's own very bright goldish, white light, or it was a metallic object that was reflecting the sun off of it's surface. I know it wasn't a star because it was very horizontal looking(one side of a disc). I then looked over at a friend of mine who had just started to look where I was looking. I said ,do you see that. He said, it's just a jet. So when I looked back up it was already gone. So he missed seeing it just within those few seconds, and I didn't get to see how it made it's exit. I told him that he was so close to seeing something very cool. And he would have also made a great witness for me if he had seen it with me. It's a hard thing for most people to grasp until they actually see something like that for themselves, or haven't done any of their own research on ufo's. I really can't imagine what else it could have been to shine so brightly, and be there and gone in a matter of ten or twelve seconds."],"trends":["There has been one other sighting in Woodstock","There were no other sightings in Woodstock on or around October 22nd 2007"],"Summary":"I looked up at a jet in front of a nice red sunrise, and noticed a very bright goldish, white object near the jet","Weather Factors":"Unknown","Tags":"City","City":"Woodstock","Case Number":"8191","files":["/var/www/straped/mufon/html2text/8191.html.txt","/var/www/straped/mufon/org/8191.html"],"Source":"MUFON"}