{"Object Flight Path":"Undisclosed","Latitude":"40.717313","files":["/var/www/straped/mufon/html2text/8201.html.txt","/var/www/straped/mufon/more/8201_submitter_file3__IMG_6322.JPG","/var/www/straped/mufon/org/8201.html"],"Disposition":"Unresolved","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-73.999293","Summary":"Two Day UFO Sight, Strange Clouds and Contrails.","Weather Factors":"Unknown","Object Features":"Undisclosed","Tags":"City","City":"New York","Date of the Event":"10/20/2007 12:00 UTC","Log Number":"US-10232007-0006","divs":["Sighting DetailsOn Saturday, October 20, 2007 I videotaped two metallic orbs in Levittown, New York, at approx. 5:00 PM. The first orb basicly seemed to come out of the clouds, then level off and floated out of sight. At first I thought it was a balloon. Then when it either returned or an other orb showed up. This one was seen just floating over the area and not really moving like the first. It seemed like it knew I was there. I waved at it, but no responce. It slowly floated away after hanging around. My next sighting was on Monday, October 22, 2007 at 3:15 PM. I was working when I noticed something spinning through my window. I grabed my camera and filed what looked like a spinning metallic cube. It also came down from the sky. When it (seem to) notice me tapeing it, it slowed down and hovered turning like a top. I have noticed a lot of contrail activity these last two weeks, and feel they're some how connected, as all my sights have been on somewhat cloudy days. I have posted my videos on You Tube and Google Video. The search words are \"Ufos In Levittown, NY\". I will also attach some files for your viewing with this message. Thank You."],"Date Submitted":"10/20/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.717313,+-73.999293(8201)&iwloc=A&hl=en\"> mufon case (8201) map </A>","Source":"MUFON","trends":["There have been 579 other sightings in New York","There were 2 other sightings in New York on or around October 20th 2007","This sighting has never been favorited.",""],"Case Number":"8201","Country":"United States","Region":"New York","Object Shape":"Sphere, Other"}