{"Tags":"City","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Object Shape":"Blimp, Disc, Oval","Summary":"Waiting around and taking pictures","Country":"United States","trends":["There have been no other sightings in Oak Brook","This sighting has never been favorited."],"Date of the Event":"09/23/2007 11:36 UTC","Object Features":"Patterned Surface, Wings","Region":"Illinois","Date Submitted":"09/23/2007 11:36 UTC","City":"Oak Brook","files":["/var/www/straped/mufon/html2text/8202.html.txt","/var/www/straped/mufon/more/8202_submitter_file1__IMG_4724.JPG","/var/www/straped/mufon/more/8202_submitter_file2__IMG_4721.JPG","/var/www/straped/mufon/more/8202_submitter_file3__IMG_4729.JPG","/var/www/straped/mufon/more/8202_submitter_file4__IMG_4725.JPG","/var/www/straped/mufon/org/8202.html"],"divs":["Sighting DetailsI was in Oak Brook,IL attending a book signing event for Nikki Sixx. I was there with my girlfriend Susan. We were waiting outside the Borders Bookstore, specifically the rear which faced West onto Route 83(15th St & Frontage Rd.). I was facing North-Northeast watching the planes take off out of O'Hare Airport. I looked North and saw a round object moving westerly and a leisurely pace. I had my EF 100-300 F4-5.6 lens mounted to my Canon 20D. I set my lens to just over 200mm and set the focus to manual. I know my lens is soft on the focus as it get over 275mm. So I set the focus to be on the center at infinity. I had taken some shots of a nearby building just to check the focus. Originally I thought it was a black plastic bag. It seemed to turn and tumble as it moved. I wish I had my Celestron Regal LS 10X42 binoculars. I know the object was North of Route 56 and probably Route 38. It was had to tell the distance, as I was trying to keep the object in the viewfinder. It appeared to condense and the expand. It seemed to get bright but I believe it was from reflections. I really did not feel excited nor afraid. I just really wanted to capture the image of the object. I have seen some strange lights and objects before but not during the day. I lost sight of the object after about 20 minutes. Before it disappeared it seem to get elongated and seemed to have a lighter appearance. I kept checking the sky for other objects but found nothing."],"Object Flight Path":"Straight-line path","Log Number":"US-10232007-0007","Case Number":"8202","map":"<A HREF = \"http://maps.google.com/maps?q=41.839786,+-87.953553(8202)&iwloc=A&hl=en\"> mufon case (8202) map </A>","Sighting Duration":"Undisclosed","Latitude":"41.839786","Disposition":"Unknown","Source":"MUFON","Longitude":"-87.953553"}