{"Object Shape":"Egg","Viewing Distance":"501 Feet - 1 Mile","Object Features":"None","Log Number":"CA-10242007-0002","Case Number":"8204","City":"Edmonton","Object Flight Path":"Straight-line path","trends":["There have been 70 other sightings in Edmonton","There were no other sightings in Edmonton on or around October 24th 2007"],"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"10/24/2007 03:55 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=53.552364,+-113.484622(8204)&iwloc=A&hl=en\"> mufon case (8204) map </A>","Longitude":"-113.484622","Disposition":"Unresolved","Region":"Alberta","divs":["Sighting Detailsat about 3:55 am I was having a look out my windows around my house as I usually do when I awaken in the middle of the night and as I was looking west over my driveway I saw a flashing light in the sky below the full moon heading east, as the light moved east I went to my front window and continued to watch the light continue east under the cloud cover. At first I thought it might be a plane or helicopter, but there was no noise like a helicopter and it appeared to be moving to slow for a plane. These lights were not like the strobes on the bottom of an airplane or helicopter which usually display a red or blue light between the actual flashing of the strobe, and small lights at the tips of the wings and it is unusual for planes and helicopters to be flying at this time of night in the hinton area. I could not see any form to the object other than the lights looked like an egg shape. The flashing was constant but was still lighted up between the actual bright flashes. The colour of the light was white. The object moved under what clouds there was over hinton towards the east of hinton."],"Sighting Duration":"Undisclosed","Summary":"saw flashing light travelling east from mountains","Date Submitted":"10/24/2007 03:55 UTC","files":["/var/www/straped/mufon/html2text/8204.html.txt","/var/www/straped/mufon/org/8204.html"],"Country":"Canada","Tags":"City","Latitude":"53.552364"}