{"Longitude":"-86.148784","Region":"Indiana","City":"Indianapolis","Source":"MUFON","Summary":"a bright light that varied in brightness with smaller lights to the sides that also blinked and then all became bright at the same time. Other smaller colored lights exploded to the sides of these lights. Other lights on the sides madea triangular shape.","Log Number":"US-10242007-0004","Object Flight Path":"Hovering then path","Disposition":"Insufficient Data","Country":"United States","Date Submitted":"10/22/2007 12:10 UTC","divs":["Sighting DetailsI live in a wooded residential neighborhood on the Northeast side of Indianapolis, IN. At 12:10am I turned off my light to go to sleep and glanced outside my bedroom window as I always do. I noticed what I thought was a bright star in the sky which I thought was strange because it was really cloudy out. I looked at it closer and realized it was much closer that a star would be. It seemed to be just below the tree line in my back yard. I was horrified but couldn't take my eyes off of it. It had one big light that pulsed in brightness and was for the most part constant and two smaller lights, one on each side of the main light that also pulsed but at some times became completely dark. At times all three lights became really bright and illuminated the trees around the area. You could see a triangular shape in the glow. At times lights shot down the sides. Also even smaller lights seemed to explode to the sides of the side lights that were different colors, blue, orange, yellow. Twice lights flashed along the base quickly then disappeared. It seemed to hover, moving slightly up and down. I was extremely scared because I was alone. I thought about calling someone but I was afraid that it would draw the attention of the \"thing\". At times it went completely dark. I watched it until about 4:30am. During that time it slowly moved lower and then to the right until I was unable to see it through the window. While watching it I didn't notice that it was moving vertically or up and down at all until it was out of my sight which is strange. I think I was looking too hard at just the lights. I went downstairs and grabbed a large knife and a camera. I was too scared to take a picture of it. I watched it by peeking from behind a wall in my kitchen until it moved slowly away back behind trees in my neighbors yard which is set back from our street. It glowed to each side of a tree trunk. At that point I went back upstairs and sat in my room with the knife listening to every little sound in my house, absolutely terrified. I slept from exhaustion around 4:45pm until 6:00am when I had to get up to go to work. It was gone when I woke. At this point I am unable to sleep at my house and am staying with my sister."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.773616,+-86.148784(8206)&iwloc=A&hl=en\"> mufon case (8206) map </A>","Tags":"City","Weather Factors":"Unknown","Object Shape":"Triangle","Date of the Event":"10/22/2007 12:10 UTC","Sighting Duration":"Undisclosed","trends":["There have been 126 other sightings in Indianapolis","There were no other sightings in Indianapolis on or around October 22nd 2007"],"Object Features":"Unknown","Case Number":"8206","Latitude":"39.773616","files":["/var/www/straped/mufon/html2text/8206.html.txt","/var/www/straped/mufon/org/8206.html"],"Viewing Distance":"21-100 Feet"}