{"Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Case Number":"8210","Object Features":"Undisclosed","divs":["sighting detailshi my name is aaron waddington aka sqorpio1980 and i thought you could use these encounters the first photo is a ufo my dad captured by mistake on top of ayres rock wile photographing his mate and son the second photo is one a friend took in his back yard wile having the erge to go out side early one morning you can see the moon in the back ground this was taken in kinglake vic and finaly the last jpg is my grandmares confession before she past on i had asked her to write it down years before and she did as i asked before she died of a long lived life building bouford bombers and as a house wife and mother of one child my father this happened in sydney nsw i have a webpage up and still in the making as i gather more facts it has the full size pics on it and my personal experiances without photos it explains in detail more than i do on this form cheers http:\\\\au.geocities.com\\sqorpio1980\\earthlyindex\\friendsandfamilyties.html if in the future the page is down and no longer available you will be able to reach it by searching sqorpio1980 in most search engines thanks aaron waddington sqorpio1980"],"City":"Alice Springs","map":"<A HREF = \"http://maps.google.com/maps?q=-23.70021,+133.880611(8210)&iwloc=A&hl=en\"> mufon case (8210) map </A>","Longitude":"133.880611","Log Number":"AU-10252007-0001","Disposition":"Unresolved","Weather Factors":"Unknown","Object Shape":"Circle, Disc, Sphere, Other, Unknown","Country":"Australia","Latitude":"-23.70021","trends":["There have been no other sightings in Alice Springs","This sighting has been favorited 1 time."],"Region":"Northern Territory","Date of the Event":"Unknown","Summary":"These are numerus happenings 2 with photos all in Australia.","Sighting Duration":"Undisclosed","Date Submitted":"10/25/2007 07:01 UTC","Source":"MUFON","Tags":"City","files":["/var/www/straped/mufon/html2text/8210.html.txt","/var/www/straped/mufon/more/8210_submitter_file1__dadufo2.jpg","/var/www/straped/mufon/more/8210_submitter_file2__marrasmall.jpg","/var/www/straped/mufon/more/8210_submitter_file3__grandmare.jpg","/var/www/straped/mufon/org/8210.html"]}