{"Tags":"City","Object Shape":"Star-like","Longitude":"-90.483146","Weather Factors":"Unknown","Object Features":"Unknown","Log Number":"US-10262007-0002","Disposition":"Unknown","divs":["Sighting DetailsMe and 2 freinds (Rudy and Mecheal) went camping in an area called \"the gravel pit\" in the rural town of tickfaw La. We had brought a hand held CB, flashlight, and portable radio. We were laying side by side (Me on the left, Mechael in the middle, and Rudy on the right). The first thing we noticed were the bats. They begain flying around us in a circle, then at us. One even made contact with my face. Next, the radio, which I had right above my head (and I suspecy may had something to do with the bat attacking me) started picking up static and acted as if it lost power(we had just put new batteries in it). Rudy picked it up and played with it and it sprang right back into action. Then, about 15-20 min later, all three of us started getting bit by something. I got up, turned the flashlight on and saw something I had never seen before. Hundreds, if not thousands of ants had converged in a PERFECT circle around us! we couldnt find where they had come from. We moved our gear a few yards away and the ants stayed marching in this circle for some time. Onced moved, we took the same position as before. The sky was crystal clear and we were all silent with just the radio on. As I was looking into the sky I saw a star like object. I first thought it was a plane. I then realized it was acting to bizzare to be a plane. It was more like \"jumping\" Than flying. It sarted jumping in a triangle pattern.It did this for a few moments. I stayed queit becuase I was still thinking it was just my eyes and the motion of th eEarth playing tricks on my mind. Then, Rudy asked If I was seeing the samething in the sky that he was. Then Mecheal said she had been watching it to. We looked at it moving from triangle, to square, to circle lik epaterns for about 15 mins. Then, two more smaller star-like objects joined it. At first, they seemed to be almost \"playing\" with each other. All three joining together in various geometeric-like shapes. They did this for a few mins, then the two smaller ones broke off and engauged in what I can only describe as a \"dog fight\" They chased each other and exchanged \"energy\" almost like shooting at each other. The larger light did not join in this. In fact, it had become sationary once the two small ones broke off from formation with it. This \"dog fight last 2 mns at most. Then, they shot away from each other at speeds I have NEVEr seen an aircraft travel at. They were gone in less than a blink of an eye. The larger object remained still for a long time. Long enough for us to lose the intial awe of it all and start to talk about it. We went back and forth about what it could have been, but we were all in agreement that it was no kind of aircraft we had ever seen. I jokingly picked up the hand held CB and started \"talking\" to the light. Giving it silly greetings, insulting it, telling it to come on down and sit next to the fire with us. Then, it came to life! It shot right over our heads....CLOSE! right above the tree line and passed us, out of our sight. I was startled so bad that I had drop the CB and prepared to run. In the process, I broke the antenna off of it. We all 3 jumped up by the fire and started to debate wether we should leave I didnt want to tell rudy I broke his CB antanna so I thew it into the woods close to us. Then the object returned, slowly hovering just above the tree line, maybe 100-150 yards away. It was so close that we could see a distinct \"core\" which was brillant bright white, and sheathed in a radiant aura of white light (glowing I guess you could call it. We set motionless and silent and just watched it. What I call a \"spotlight\" beam, only slightly cone shaped came on underneath the object and it started slowly moving just above the inside of the tree line. It was completely silent.I got the impression it was looking for something, but if they were so advance they would have found us without effort. It moved on until we couldn't see it any more. It was then that without much debate we decided it was time to leave. We started packing and Rudy saw that the antanna was missing. I voiced up and told him the truth about what happened to it and where I threw it. He was of course a bit upset and asked that I go find it. Giving the current situation I was VERY reluctant; however. I know it landed only about 15-20 feet away from us right on the tree line. The area was so close it was recieving light from the fire so I decided Id go get it. I got the flashlight and went to the tree line. I hoped that the shiny metal would reflect the fire's light and be easy to spot. I didnt see it. I shined the flashlight into the trees and almost instantly saw a portion of the antanna amoung thick bushes just inside the trees. I almost decided to leave it and say i couldny find it. I did NOT want to go into the woods after what we just experienced. But, Rudy was a good freind and I felt bad so I went in after in. I had to get on on my hands and knees to crawl under the bushes. I kept shining the light but lost the location of the antanna while crawling. I stoped for a moment to shine the light around and try and find it. Rudy and mecheal were yelling at me to hurry so we could go. While looking around, I saw the antanna in the light, It was infront of me at arms length on the other side of the bushes. When I reached for it I heard a slight crackling in the leaves on the otherside of the bushes. It was very close. I froze. The next thing I noticed was a smell I can only describe as mild musky odor mixed with anesthetic chemicels like in hospitals. I shined the light in the direction of the crackle sounds. At first I thought what I saw was the root base of two small trees growing close to each other. I quickly decided it wasn't trees, or roots. It was feet! In the light I could see thin fleashy legs, pronounced knees. What I tought was roots where three thick toes. I didnt noticed toe nails, but did see defined \"knuckle\" joins midway in the toes. One of the toes moved slightly. I quickly shined the light up. I'm sorry that I cant recall the exact details, but it was short. I would say maybe 4\" It was humaniod with long thin arms. I didn't notice the hands in any detail. The head was large and the eyes reflected the light almost like a cat or dogs eyes in the dark. I had the light on it for MAYBE a second before I jumped up (getting cut ans scraped by the bushes and ran back to the fire screaming.I was so in shock that I didnt even noticed that I had ran and stopped in the remains of the fire. They kept asking me what was wrong. All I could do was beg them leave with me. The heat and burning of the fire sort of snapped me back a little. They got me out of it. I told them I would tell them once we left. They started grabbing up the gear. I grab the machette we used on fire wood ready to strike at that thing if I saw it again. Once we got out of the woods and on the road walking back to Rudy's house, I explained what I saw. They picked up the pace. We made it back to the house and lay down in our beds. We briefly went over the episode of the night then went to sleep. I for one had wild and vivid dreams about the gravel pit. In the dream, the song we where listening to when the event started played back to back very vividly. At one point, I dreamed that I woke up because something was coming into the window. I then realised that I was still dreaming and laid back down. When I did the strange gravel pit dream continued. When I woke up for real. I told them bits of my dream. Before I could mention the song, Mecheal said that she kept dreaming abou the song. Rudy claimed he did two. That morning (more like noon) we told his mom and a neighbor. I believe it was his mother that said people had been reporting seeing something that looked like a \"faun\" (Like Puck...half man half deer). Well what I saw didn't look like that, but regurdless, there was something there. These days. I sometimes wonder if I acually saw it. I recall the lights in the sky like it was yesterday, but the \"creature\" event is kind of fuzy to me. I attribute it to the shock and state of mind that I was when when I saw \"it\" that obsures my memory of it."],"Date Submitted":"11/30/1990 03:00 UTC","Date of the Event":"11/30/1990 03:00 UTC","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/8214.html.txt","/var/www/straped/mufon/org/8214.html"],"Country":"United States","Case Number":"8214","trends":["There have been no other sightings in Tickfaw","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"30.577412","Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=30.577412,+-90.483146(8214)&iwloc=A&hl=en\"> mufon case (8214) map </A>","Source":"MUFON","Sighting Duration":"Undisclosed","Summary":"lights making geometric symbols in sky, electronics malfunctioning, wildlife acting strange, and a humanoid in the woods.","City":"Tickfaw"}