{"Sighting Duration":"00:03:00","City":"Egg Harbor","Longitude":"-87.29705","Case Number":"8218","Object Shape":"Unknown","Latitude":"45.046381","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=45.046381,+-87.29705(8218)&iwloc=A&hl=en\"> mufon case (8218) map </A>","Country":"United States","Region":"Wisconsin","Summary":"WE SAW A STRANGE LIGHT IN THE NIGHT SKY","Disposition":"Insufficient Data","trends":["There have been no other sightings in Egg Harbor","This sighting has never been favorited."],"Date of the Event":"08/18/2007 12:00 UTC","divs":["Sighting DetailsI consider myself an intelligent person and I have a successful business in the Milwaukee, WI area. I have visited northern Wisconsin many times in my life and enjoy watching the night sky. At about 10:00 pm this particular clear summer night, one of my sons, my brother in law and I were sitting on my brother in law's deck outside of Egg Harbor, WI over looking the water to the east on Green Bay which is part of Lake Michigan. The water was very calm that night which made for a nice quiet night. We were looking at many things that we had seen in the sky before, stars, the space station, satellites, planes, etc. Looking over the water I noticed a light at about a 2 o'clock position in the sky. I said to my brother in law that this plane was flying in an unusual path, slow and straight towards land to our right. This was something that we had never seen previously. Expecting to hear the sound of an airplane engine I noticed that there was none. My brother in law said that was strange and as we both watched, the light blinked and went off at an unbelievable speed to the north and disappeared. We have seen jets fly over before and this was alot faster than any jet we had ever seen. My brother in law started to laugh and looked at me. I said I think we just saw something and before I could finish my 14 year old son said he was scared and wanted to go in the house. I told him there was nothing to worry about and looked back at my brother in law who had a funny look on his face. I said to him I think we just saw a UFO. He said with a kind of laughing tone that he agreed that what we saw was a UFO. We had not been drinking and we were not tired from the day. In fact we stayed out for another 2 hours waiting to see it again but it never came back. I know I felt fine, just amazed at how fast the light moved. Not much was said the next day, however after we told our wives and the other kids, everybody was sitting out watching the next night. Nothing like this was seen that night. Not much has been said about this since but lately I have had the feeling that I need to get this out and let someone know about this. I hope this helps myself as well as anyone else who may have seen something like this."],"Tags":"City","Object Flight Path":"Path with directional change","Date Submitted":"08/18/2007 12:00 UTC","Log Number":"US-10262007-0006","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/8218.html.txt","/var/www/straped/mufon/org/8218.html"],"Object Features":"Unknown"}