{"Viewing Distance":"Over One Mile","Object Features":"Unknown","Log Number":"US-10262007-0007","Summary":"Was a bright light @ 30,000' or higher.","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/8219.html.txt","/var/www/straped/mufon/org/8219.html"],"trends":["There has been one other sighting in Welch","There were no other sightings in Welch on or around August 15th 2000"],"Weather Factors":"None","Longitude":"-81.584551","City":"Welch","Date Submitted":"08/15/2000 02:30 UTC","Region":"West Virginia","Object Shape":"Star-like","Tags":"City","Latitude":"37.432891","Country":"United States","Source":"MUFON","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.432891,+-81.584551(8219)&iwloc=A&hl=en\"> mufon case (8219) map </A>","divs":["sighting details a friend and i were fishing\\camping up pond holler in premier, wv. at about 2:30 am we were just getting ready to go to sleep. we were lying on our sleeping bags talking. we were both looking up at the stars when a really bright light came into view. i guess it was traveling about 600 mph. we thought it was a satellite at first. it traveled for some ways and then it dimmed and took off like a bat out of hell, it disappeared within two seconds. shortly after it took off we saw a streak of fire chasing after it. the object left it like it was sitting still. we then saw the fighter jet. the missle was traveling about 2,500 mph, and the object left it like it was sitting still. the missle traveled for a short distance before the flame from it's engine went out. there was a flash when it exploded and we heard the boom about 30-40 seconds later. the jet had already turned around when the object disappeared. my fishing buddy was freaking out because it scared the hell out of him. i knew exactly what was going on and he didn't even want to believe what had just happened. he was in his early 20's and i was in my late 30's. myself, i was awestruck and excited, my heart felt like it was going to come out of my chest. i finally had proof that they were out there. he wanted to leave and go home and i talked him out of it. we didn't get to sleep until about 5:00 am. if you need to contact me, call after 9:00pm on weekdays and anytime on weekends. please leave brief message what call concerns."],"Date of the Event":"08/15/2000 02:30 UTC","Case Number":"8219","Sighting Duration":"00:01:00"}