{"files":["/var/www/straped/mufon/html2text/8220.html.txt","/var/www/straped/mufon/more/8220_submitter_file1__UFODrawing.jpg","/var/www/straped/mufon/org/8220.html"],"Latitude":"35.150917","Tags":"City","Object Shape":"Sphere, Star-like","divs":["Sighting DetailsWe were camping at Pettit Jean State Park. Sitting around the camp fire I was looking up at the stars when I noticed what looked like two of them slowly moving. At first I thought it was a tree limb swaying in the breeze giving them the appearence that they were moving. I stood up to walk to a clearing for a better view. As I watched closely they became brighter and moved a little faster, staying perfectly parallel coming from a north east direction. I said to my wife, what the hell! Those aren't jets, they don't have any running lights (I had seen jets fly over earlier and they all had the usual red flashing lights)these had no lights. They were about the brightness of the planet Jupiter and about the same size at first. She couldn't see them from were she was sitting because of the trees.By the time she finally got up they were gone. As they got closer they seem to get brighter for a split second, then changed to a north west direction still staying perfectly parallel. At this time they started to fade, then they kind of flickered and disappeared. This all took place in about 20 seconds. I coundn't get it out of my mind all night. My wife thinks I'm crazy! She said they must be jets. I said jets wouldn't be flying that close together. I know they weren't jets because earlier I could watch the jets cover the sky and slowly disappear on the horizon. These objects came and left in a short area of space."],"Viewing Distance":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.150917,+-92.744054(8220)&iwloc=A&hl=en\"> mufon case (8220) map </A>","Case Number":"8220","Source":"MUFON","Log Number":"US-10262007-0008","Sighting Duration":"Undisclosed","City":"Morrilton","Date Submitted":"10/21/2007 06:50 UTC","Object Flight Path":"Path with directional change","Weather Factors":"None","Object Features":"None","Summary":"Two spheres flying parallel, changed direction then quickly disappeared.","Region":"Arkansas","Disposition":"Unknown","trends":["There have been 2 other sightings in Morrilton","There were no other sightings in Morrilton on or around October 21st 2007","This sighting has never been favorited.",""],"Longitude":"-92.744054","Date of the Event":"10/21/2007 06:50 UTC"}