{"Log Number":"US-10272007-0005","Weather Factors":"None","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8228.html.txt","/var/www/straped/mufon/org/8228.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.421989,+-82.364607(8228)&iwloc=A&hl=en\"> mufon case (8228) map </A>","Region":"Ohio","Object Shape":"Oval","Summary":"July 6th, 2007 early AM sighting of silver oval object that moved at incredible speed.","Date of the Event":"07/06/2007 12:00 UTC","Case Number":"8228","Object Features":"None","Disposition":"Insufficient Data","Country":"United States","Tags":"City","Date Submitted":"07/06/2007 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsOn July 6th, 2007 I was at my sister's house in Northern Ohio. I believe the city is Birmingham, OH, just South of Vermilion. It was late and everyone had turned in with the exception of myself, my nine-year-old niece, and twelve-year-old nephew-in-law. We were discussing some pretty deep subjects all night regarding ghosts, re-incarnation, etc. For some reason, I had an intuition to step out into the night sky with one kid under each arm. As we glanced upward, we thought we were seeing a falling star and as quick as we tried to mouth the words, it stopped mid sky, only to shoot off in the opposite direction. The trajectory was uncanny. When it approached, it appeared to be coming from our upper right side as we were facing South. It looked as if it was coming AROUND the earth, not dropping straight down. It looked like a white light when it approached with incredible speed. When it stopped it looked like a silver oval object with no sound or light. It stopped near the star Deneb in the Cygnus constellation. This was no coincidence to me since I was just introduced to knowing this constellation a month prior through a web site that had a lot of synchronstic type experiences going on...like connecting dots. It stopped momentarily and then as fast as it approaced, it took off to our left in an upward trajectory. The children said they both saw a green energy come out of it as it left the stationary position. We were all speachless at the timing of it all. Why did we step out into the night sky at that time? We were in awe and to make sure we didn't influence one another, we went inside and each drew a picture of what we saw. All three matched. There was more here than a simple coincidence. I had a reading done a month prior to this that said I was from the stars. Cygnus was the place a friend of mine said we had originated from. Was this a sign? Since then, my neice said she had seen the craft in what I understand was a similar account, at dark, near their home in Crawfordsville,Indiana. I did not get the details, but my sister knew that she was telling the truth, and I believe her."],"Latitude":"41.421989","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","City":"Vermilion","trends":["There have been 2 other sightings in Vermilion","There were no other sightings in Vermilion on or around July 6th 2007"],"Longitude":"-82.364607"}