{"Weather Factors":"Windy","divs":["Sighting DetailsI was watching TV and I was sat next to my terrace sliding doors, as my arm chairs are next to the terrace windows, then suddenly something caught my attention from the corner of my eye. Outside in the distance towards the Mediterranean sea, I saw this bright orange illuminus long shaped line, very rectangular shaped, and thin looking, like if someone had painted an orange line on the dark sky. I started to doubt what i was seeing so to make sure what I was seeing was true, I opened my terrace doors and stepped outside thinking it was a reflection on the glass, it wasn't a reflection and then i noticed how this orange rectangular light, started to fade away slowly into the dark. During those moments I had mixed emotions, i started to doubt myself and then reality set in, i felt my blood go to my feet as i got a bit scared, I don't know why. Maybe because I couldn't find a rational explanation. I hope that someone just like myself, did see this phenomenon, all along the busy Costa Del Sol here in the south of Spain. I'm sure, that i was not the only witness to this. I hope I get news to confirm this or to give me some explanation of what it was."],"Latitude":"36.137741","Object Shape":"Other","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8229.html.txt","/var/www/straped/mufon/org/8229.html"],"Tags":"City","Date Submitted":"10/27/2007 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.137741,+-5.345374(8229)&iwloc=A&hl=en\"> mufon case (8229) map </A>","Log Number":"ES-10272007-0006","Longitude":"-5.345374","Summary":"a line of orange light","Case Number":"8229","Object Features":"None","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Region":"","Date of the Event":"10/27/2007 08:30 UTC","Sighting Duration":"00:00:30","Country":"Gibraltar","trends":["There have been no other sightings in Gibraltar","This sighting has been favorited 1 time."],"Disposition":"Unresolved","City":"Gibraltar"}