{"Region":"California","divs":["sighting detailsapproximately 10:20am sunday oct, 28th i noticed a moving white object against the clear blue morning sky as i sat on my patio enjoying cup of coffee. as i have seen objects in our skies before, i always scan the sky when i come out onto the patio as we have a clear blue sky, unobstructed by other buildings when looking to the n\\w. this object seemed to be a metallic floating construct and it looked like no other form i've seen in the sky, except maybe a hot-air balloon, in that it seemed to have a bulbous balloon top and a 'basket' , or smaller, narrower form near the bottom, but all metalic and solid. i realized it was gleaming and slowly moving along a clear path headed n over downtown san jose, ca, i can only guess it was 1000 ft high in the sky. i quickly grabbed my canon pro1 8mp and began to relocate it against the blue sky. i sat down and tried to steady camera, could not see object through view finder so i just began shooting at the specific area. i knew from previous experience that even if i don't see it, it may still be there. i shot around 15 pics and tried to capture it on video, but i can see nothing on the short clip. i then watch as it continued it's slow pace n of san jose and then it dissappeared, not from distance, just blinked out, i suppose. i felt that this object was 'observing' as a natural course of action, that it was there for a purpose. i have some images that i was able to zoon into to see the object and it's varying shapes, up close, when i downloaded and reviewed the images. the attached photos are at at least 100% and some up to 300%. i have all the originals, but i did apply photoshop cs auto contrast and auto levels to the posted pics, to show more detail. i have other photos available for review. this is not the first time i witnessed and captured pics of this kind of anomoly; last year my wife and i observed a similar object while living in a nearby part of town. as i recall, we were able to see that anomoly three different weekends in 1.5 months: i have pics of that, too. in fact, if this were next week, when we 'fall back' on our time, it wouild be the same 9:15-9:20am time frame and time of year as last years sighting. whatever these are, we see our fair share of them and other strange anomolies in the sky over san jose, ca....silicon valley, ca!"],"Weather Factors":"None","Object Flight Path":"Hovering then path,Straight-line path","Source":"MUFON","trends":["There have been 106 other sightings in San Jose","There was one other sighting in San Jose on or around October 28th 2007","This sighting has never been favorited.",""],"Date of the Event":"10/28/2007 10:20 UTC","Longitude":"-121.891736","Viewing Distance":"Unknown","Log Number":"US-10282007-0006","Country":"United States","Summary":"Looked up on clear blue morning to see slowly hovering object, straight path, no wavering, seeming to change shapes","City":"San Jose","map":"<A HREF = \"http://maps.google.com/maps?q=37.341916,+-121.891736(8237)&iwloc=A&hl=en\"> mufon case (8237) map </A>","Sighting Duration":"Undisclosed","Latitude":"37.341916","Object Shape":"Square, Rectagular, Teardrop, Other","Case Number":"8237","Object Features":"Appendage(s), Other, Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/8237.html.txt","/var/www/straped/mufon/more/8237_submitter_file1__IMG_1805AC.jpg","/var/www/straped/mufon/more/8237_submitter_file2__IMG_1819300ACAL.jpg","/var/www/straped/mufon/more/8237_submitter_file3__IMG_1819200AC.jpg","/var/www/straped/mufon/org/8237.html"],"Disposition":"Insufficient Data","Date Submitted":"10/28/2007 10:20 UTC"}