{"Viewing Distance":"Unknown","Date of the Event":"12/24/1973 12:00 UTC","Date Submitted":"12/24/1973 12:00 UTC","Source":"MUFON","Summary":"We saw a blue white light, that came onto the highway, on our side of the street. We lost 9 1/2 hours of time.","Tags":"City","Log Number":"US-10292007-0001","Sighting Duration":"Undisclosed","Country":"United States","divs":["sighting detailswe were traveling at about 5pm on our way to las vegas nevada. we stopped at a gas station,to called my mother who was living in las vegas nv. we were about 100 miles or less from las vegas. we bought 2 cokes and got back on the highway. we traveled for about 30 minutes. a blue white light came from around the mountain, onto the highway, on the same side of the highway that we were traveling on. it was going so fast until it came and went at the same time. we lost approx 9 1\\2 hours of time.we got to las vegas at 2:30am. as far as we know, we never stoped after the gas station. i started having nightmares about strange looking people. the nightmares came often. after many years i started to remember what had happened. i think that i have the smoking gun. i know a lot of scientific things that the strange looking people told me that scientist of today don't know yet. they told me where they came from, what they were doing here. where the planets came from, where the earth, moon and other planets came from. i have a lot of information and i would love to tell you about. i learned about time travel. the information that they told me about can be proven."],"files":["/var/www/straped/mufon/html2text/8241.html.txt","/var/www/straped/mufon/org/8241.html"],"Object Flight Path":"Undisclosed","Object Shape":"Flash, Oval","Object Features":"Undisclosed","Longitude":"-115.165496","City":"Las Vegas","Case Number":"8241","map":"<A HREF = \"http://maps.google.com/maps?q=36.120426,+-115.165496(8241)&iwloc=A&hl=en\"> mufon case (8241) map </A>","Region":"Nevada","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 24th 1973"],"Latitude":"36.120426","Disposition":"Unknown","Weather Factors":"Unknown"}