{"Longitude":"-81.510744","Source":"MUFON","Summary":"Very Large Silver Sphere passed near our house in Sumter County","Region":"Florida","Weather Factors":"Unknown","Log Number":"US-10292007-0004","Date Submitted":"09/10/2006 03:00 UTC","Country":"United States","Tags":"City","divs":["Sighting DetailsOur family was working on remodeling a house in Sumter county Florida and we had taken a break. standing on the roof of our house, I noticed in the distance a black dot, what I suspected was a hot air balloon moving in a roughly west to east direction. We have Hot air balloons come over from time to time accept the usually move in groups (balloon rally). We watched for a few minutes as the object move directly toward us and became larger. The object appear to be a silver sphere with a black dot on the bottom. Then it moved abruptly to the left (South). The item was some distance off and must have been quite large. I though at least 50 ft in diameter perhaps larger. There was no sound of any kind that I could hear as eminating from the sphere as it continued to move south. As it moved away the object climbed and eventually we could not see it. I photographed the object with the digital camera I was using to take progress pictures of the house. I assume this is a Radar target or something else, but it was definitely not a conventional hot air balloon. I had no unusual feelings of any type. This occurence was also witnessed by my parents and my brother."],"Object Shape":"Sphere","Viewing Distance":"Unknown","Sighting Duration":"00:10:00","Disposition":"Hoax","Latitude":"27.671707","Object Features":"Undisclosed","Case Number":"8244","files":["/var/www/straped/mufon/html2text/8244.html.txt","/var/www/straped/mufon/more/8244_submitter_file1__P1010005.JPG","/var/www/straped/mufon/more/8244_submitter_file2__P1010006.JPG","/var/www/straped/mufon/more/8244_submitter_file3__P1010007.JPG","/var/www/straped/mufon/org/8244.html"],"Object Flight Path":"Undisclosed","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.671707,+-81.510744(8244)&iwloc=A&hl=en\"> mufon case (8244) map </A>","Date of the Event":"09/10/2006 03:00 UTC","trends":[""]}