{"Longitude":"-90.953365","Source":"MUFON","Country":"Canada","divs":["Sighting DetailsAt approx. 19:00 hrs. my two children were looking out our living room window watching for their mother who was walking our dog. While looking out the window which faces to the West, my children (ages 6 and 10) saw what they described to me as a circle shaped object flying across the sky. They described it as circle shape with flashing lights. There were 2 sets of lights under the object. The colours were red, blue, yellow and green. They described to me that the object was not moving fast or slow, but somewhere in between. They told me it was flying about as high as our communication tower (500 ft.) and that they watched it for about 10 seconds, until it went in behind our house and out of view, heading across the lake. The sun had set about a half hour before this event and there would not have been and flights scheduled or any reflections in the sky at this time. When I asked my 10 year old daughter if she was sure it wasn't a plane, she just looked at me funny and said, dad I know what a plane looks like, and this was not a plane. The next day I asked each of them to draw what they had seen the night before, and each drew a circle shaped object with lights below. They were also specific in telling me that the lights did not flash all at the same time, but instead came on in pairs. Both my children know the difference between the truth and a lie and have been raised to respect authority. Both children were quite calm as they retold the event to me and I have every reason to believe that what they saw was something that defies reason."],"Region":"Ontario","Sighting Duration":"Undisclosed","City":"Bearskin Lake","Disposition":"Unresolved","Object Flight Path":"Straight-line path","Weather Factors":"None","Summary":"circle shape object flying at 500 ft. with flashing lights on underside, red, green, blue and yellow lights","Object Shape":"Circle","map":"<A HREF = \"http://maps.google.com/maps?q=53.913262,+-90.953365(8249)&iwloc=A&hl=en\"> mufon case (8249) map </A>","Latitude":"53.913262","Object Features":"Other","Log Number":"CA-10302007-0001","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Case Number":"8249","trends":["There have been no other sightings in Bearskin Lake","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/8249.html.txt","/var/www/straped/mufon/org/8249.html"],"Date Submitted":"10/26/2007 12:00 UTC","Date of the Event":"10/26/2007 12:00 UTC"}