{"Object Shape":"Undisclosed","Region":"Iowa","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/04/2000 09:30 UTC","Object Flight Path":"Unknown","Sighting Duration":"01:00:00","City":"Des Moines","Disposition":"Unresolved","Case Number":"825","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around July 4th 2000"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.609165,+-93.601616(825)&iwloc=A&hl=en\"> mufon case (825) map </A>","Log Number":"","Source":"MUFON","Date Submitted":"07/04/2000 09:30 UTC","Country":"United States","Object Features":"Undisclosed","Longitude":"-93.601616","Latitude":"41.609165","Weather Factors":"Unknown","Summary":"Red light transit,2 control descent,45 witnesses","divs":["sighting detailsjuly 4, 2000 sighting of bright, red glowing (steady)light over des moinesmetro-area, which transited west des moines, urbandale, clive, windsor heights,and des moines proper, sometimes hovering for several minutes, then movingslowly - during 45 - 60 minute period no sound. 2 red-light (steady) controlleddescents (from the main object) occurred in widely separate locations, withseveral witnesses seeing descent object then make a 90-degree turn. mainobjects transit was somewhat horseshoe shaped around the city and it would havetraveled against the wind, no matter what the wind direction. cloud ceiling at8,000 feet. various calculations seem to indicate the size probably in 70-100foot category, with the altitude somewhere between 3,000 - 6500 feet. shapevariously described as: rounded rectangular\\tubular-vertical; oval; roundedtriangle; 3 light cluster;round red light. one couple described the main objectas larger than an airliner on approach (about 2600 ft.) near their home with theobject farther away and above the airliner. (perhaps red light made it seembigger,but since it was farther away, their description was taken seriously). two other witnesses (one a pilot, and one a manager - both male) observing themain object at 80-85 degrees up from horizon not far from the \"couple\" referredto above, indicated they thought object sizeable enough to rival size ofairliner. light airplanes, helicopter, and airliner seen and recognized as suchby some of the witnesses during sighting along with also seeing the main object."],"files":["/var/www/straped/mufon/html2text/825.html.txt","/var/www/straped/mufon/org/825.html"]}