{"map":"<A HREF = \"http://maps.google.com/maps?q=35.994033,+-78.898619(8258)&iwloc=A&hl=en\"> mufon case (8258) map </A>","Case Number":"8258","Longitude":"-78.898619","Weather Factors":"Does Not Apply","Region":"North Carolina","Tags":"City","trends":["There have been 29 other sightings in Durham","There were no other sightings in Durham on or around October 15th 2007","This sighting has never been favorited.",""],"Log Number":"US-10312007-0006","City":"Durham","divs":["Sighting DetailsI was photographing a nice sunset. I did not see anything unusual until I reviewed the photos on the camera screen. Then I saw a cluster of lights making a rough diamond shape. I was very surprised. The camera I was using is a digital SLR with a sharp lens. I should have noticed lights this bright. The lights were fuzzy and white except for one which was blueish green. They changed position in the photographs. Six minutes after the first frame, three of them can be seen farther to the west. Two are nearer each other and a third is much lower. Birds, stars, planets and airplanes don't makes these kinds of images. I've photographed all these subjects before under various conditions. Also when enlarged and enhanced on the computer screen there appears to be a bright elliptical core surrounded by a pale but distinct halo reminiscent of a comet without a tail. The waxing crescent moon was up and I did photograph it, but it was not near the location of the lights. At first I thought it might be a reflection from street lamps, but the lights are not present in the sunset shots before file 6647. Four minutes later they show up in the next two files then don't appear again until file 6662 two minutes after that. I've photographed from this same location before and since then at sunset with no odd lights appearing so I don't think it was reflections or dust on a sensor."],"Source":"MUFON","Latitude":"35.994033","files":["/var/www/straped/mufon/html2text/8258.html.txt","/var/www/straped/mufon/more/8258_submitter_file1__DSC_6648UFOframe2.jpg","/var/www/straped/mufon/more/8258_submitter_file2__DSC_6648UFOframe2closeup.jpg","/var/www/straped/mufon/more/8258_submitter_file3__DSC_6662UFOsframe4threescattered.jpg","/var/www/straped/mufon/org/8258.html"],"Date of the Event":"10/15/2007 06:05 UTC","Object Shape":"Oval","Viewing Distance":"Over One Mile","Sighting Duration":"Undisclosed","Object Features":"None","Summary":"Cluster of lights appeared on photos","Date Submitted":"10/15/2007 06:05 UTC","Object Flight Path":"Path with directional change","Disposition":"IFO","Country":"United States"}