{"Region":"Oregon","Latitude":"43.805973","files":["/var/www/straped/mufon/html2text/8263.html.txt","/var/www/straped/mufon/more/8263_submitter_file1__RLUFO-2.jpg","/var/www/straped/mufon/more/8263_submitter_file2__DLUFO.jpg","/var/www/straped/mufon/org/8263.html"],"Longitude":"-120.547771","Tags":"City","Object Features":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/22/2007 09:00 UTC","Object Shape":"Cigar, Fireball, Oval","Weather Factors":"None","City":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path","divs":["Sighting DetailsMy husband & I were in our backyard when we sited what appeared at first to be perhaps satellies to us- flying in close proximity to each other and moving from west to east. As they approached a small hill nearby they seperated from each other and we could see their silver color and their appeard elongated. The one continued east- the other veering off to the northeast. My husband took 2 steps toward me as we were talking about what we had seen when he noticed the object just above our heads out of the corner of his eye & pointed up asking me \"do you see that?\" There was a fully charged looking object moving slowly just above the tree tops in our yard & directly over our heads. It was oblong in shape the brightest orange and red and shooting what appeard to be sparks from it. Big hunks of what appeared to be debris were falling to the ground. It had to of come directly over our house as it was travelling from south to north. We stood in amazement watching it glide to the north at the same altitude and out of sight. None of these objects made any noise & the silver did not appear to have any other lights on them. It was a clear night with no cloudcover."],"Disposition":"Unknown","Date Submitted":"09/22/2007 09:00 UTC","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.805973,+-120.547771(8263)&iwloc=A&hl=en\"> mufon case (8263) map </A>","Summary":"2 long silver & one glowing red & orange object seen in our backyard one evening","Log Number":"US-11012007-0004","Case Number":"8263","Source":"MUFON","trends":[""]}