{"Weather Factors":"None","Date Submitted":"09/25/2007 09:30 UTC","Object Features":"None, Other, Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Country":"United States","Latitude":"40.552776","Sighting Duration":"Undisclosed","Log Number":"US-11012007-0005","trends":[],"Tags":"City","Viewing Distance":"101-500 Feet, Over 1 Mile","Date of the Event":"09/25/2007 09:30 UTC","Object Shape":"Boomerang, Sphere","Case Number":"8264","map":"<A HREF = \"http://maps.google.com/maps?q=40.552776,+-85.599064(8264)&iwloc=A&hl=en\"> mufon case (8264) map </A>","City":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8264.html.txt","/var/www/straped/mufon/org/8264.html"],"divs":["Sighting Detailslarge bright object thought was airplane as live in nw Indiana but saw the object stop drop zigazg go forward stop drop and stayed stopped seemed for 5 minutes could have been less also was startled. the house i'm in has a window as you come down from the top floor you can see north and east out of the window, well I was bringing down a load of laundry and to my eyesight I saw a large very bright light coming from the east moving west thought it was a large plane until I noticed its movement forward then stopped then like disappeared but dropped down then zigzagged then stopped I kept checking my eyesight to see if I was just seeing things but no it kept doing these movements, then what startled me(scared the hell out of me) another object like a v shaped boomerang ? like that stealth plane shape kind of, but it was silent glowing RED and headed fast at that other object I jumped to the floor dropping the basket and hesitated to get up and look out the window because this thing was so close and low, my heart was pounding in my mouth as this was totally out of nowhere when I got up freaked out I looked out the window and neither that glowing nor the very bright object were any where to be seen, the last eye view of this sight was to the north? I was shaken for the next 40 minutes or so thinkinig did I just see that or am I going crazy? I did think about it the followuing week also . It is clear in my mind to this day! what got me was that RED GLOWING FLYING OBJECT! that scared the HELL out of me ( because it was much lower in the sky) I saw the red glow!!!!!! Has anyone reported a red glowing object??????"],"Region":"Indiana","Summary":"large very bright object and other ?","Longitude":"-85.599064","Disposition":"Unknown"}