{"Case Number":"8265","Object Features":"None","Region":"South Carolina","Tags":"City","Country":"United States","Weather Factors":"None","Log Number":"US-11012007-0006","map":"<A HREF = \"http://maps.google.com/maps?q=34.77873,+-82.310119(8265)&iwloc=A&hl=en\"> mufon case (8265) map </A>","Object Flight Path":"Straight-line path","divs":["Sighting DetailsWe were driving home that evening; and as we turned to enter our neighborhood, I spotted lights in the sky. When I looked through the windshield and then out my side window (by this time it was almost directly overhead, flying toward us), I clearly saw a fairly large, elongated triangle shape that was darker than the sky. There were multiple green lights running lengthwise down the center. The shape was very distinct--no protrusions anywhere, just straight edges. Because of the terrain and trees which obscured my view as we turned, I could only get one more brief glimpse--this time from the rear. All the lights appeared yellow from that angle. I was unable to see a side or top view at any point, only the underside. My husband did not see it (though he was certainly aware that I did!), and we did not stop the car or cut off the engine; however, in retrospect, neither of us remember hearing any sound. I know it was not an ordinary airplane; and it seemed too low for a flight approaching the Greenville-Spartanburg airport. It all happened VERY quickly, and I very much regret not insisting that we turn around and try to catch sight of it again."],"Viewing Distance":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8265.html.txt","/var/www/straped/mufon/org/8265.html"],"Disposition":"Unknown","Summary":"Elongated triangle aircraft","Object Shape":"Triangle","Date Submitted":"10/20/2007 09:45 UTC","trends":["There have been no other sightings in Mauldin","This sighting has never been favorited."],"Longitude":"-82.310119","Sighting Duration":"00:00:20","City":"Mauldin","Latitude":"34.77873","Date of the Event":"10/20/2007 09:45 UTC"}