{"Date of the Event":"11/01/2007 12:00 UTC","divs":["Sighting DetailsIt was around 9 pm Eastern Time Canada. I was outside with my room mate taking a smoke. It was chilly outside, around 2 degrees celcius. So I wanted this smoking time to be as bref as possible. My Room mate and I started talking about a subject regarding the univers and all its mysteries. The conversation lasted about 15 minutes. I was just about to finish my cigarette when I looked up at the sky and saw two redish orbs fly about less than 3000 feet across the sky perpendicular to us. At first I thought it was a falling star. But I noticed that It did not leave that typical trail of light. I am a pilot and I know about all flying vehicles. They all standardly hold a starbord green light and a Port red light, strobe lights, and rotating beacon. And at that altitude and thats speed, it would have made an incredible noise. But thoses objects where flying at about 1000 km and made absoluteley NO SOUND. What I noticed really odd is that they where criss crossing and rotating around each other. Like if playing with each other. This part is the hardest to describe but I hope the reader understand what I mean by this. The flight patern and the way they where flying was not rectilinear. The flight paterns of those UFOs where constatly moving either in front, back, rotating around each other. They acted as two birds who fell in love. The most impressive part is that they did not make any sound. There where no clouds around. So it could not be a form of projector or light at any kind. I grabed my room mate by the arm as strong as I could, started to yell at him, told him to look up because there was an incredible event happening. He did not see anything. My adrenaline whent up because I knew what I had witnessed. At that instant I wanted to call the authorities and the news broadcasting company to tell them what I had seen. I ended up not doing that. Those objects disapeared behind the houses."],"Summary":"Double Red Light Orbs Silent Rapid Flight","Longitude":"-75.688193","Latitude":"45.42596","Date Submitted":"11/01/2007 12:00 UTC","Country":"Canada","Object Features":"None","Viewing Distance":"20 Feet or Less","City":"Ottawa","Disposition":"Unresolved","Source":"MUFON","Object Shape":"Fireball, Star-like","Tags":"City","Sighting Duration":"Undisclosed","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around November 1st 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.42596,+-75.688193(8266)&iwloc=A&hl=en\"> mufon case (8266) map </A>","files":["/var/www/straped/mufon/html2text/8266.html.txt","/var/www/straped/mufon/org/8266.html"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Region":"Ontario","Log Number":"CA-11022007-0001","Case Number":"8266"}