{"files":["/var/www/straped/mufon/html2text/8267.html.txt","/var/www/straped/mufon/org/8267.html"],"Object Shape":"Circle, Star-like","trends":["There have been no other sightings in Balad","This sighting has never been favorited."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","divs":["Sighting DetailsI was a Marine in Iraq on a post tower at about 1am Iraq time. Two other marines were in the tower with me and we were watching the stars and talking. In iraq in the middle of the night u can see everything, it seems like u can see every star. There isnt many planes that fly at all. You see are planes and when they get lower there lights go out. Plus u can here them from very far away. We were talking when one of my marine buddies said whats that and pointed to the sky in shock. I missed it, but he said he saw a object brake apart in the sky and that when i began to watch. The now two objects were flying as if they were folowing each other. Nothing much from wat i saw at first untill they would move vertical together in the sky at the sametime, stop in one spot, and then turn to a horazontal path. This would happen many times. Then they would sort of disappear and we would look fro them in the sky and one would appear. Maybe two sec later the other would appear and be away from it and catch up and be right behind it again. They would sometimes fly apart fast and then meetup when they turn back and when they get close enough stop and then move again together. Now sometimes they would go apart from each other and start to do their own thing. Once one of the obejects shot up and then made a half circle like turn and then shoot down at amazing speeds. Now we did see at least one plain go by because it seemed as if the objects were goin to fly at it. This really showed how fast they could move. These objects were as bright as the brightest star in the sky. They had a light blue look to them. Once when they were apart one of the objects was flying around when the other one shot into it and they made a bigger obeject. I would say 3 times the size of the biggest brightest star in the sky. They had like a almost flash when they came togther to be one in the sky. Not some flash in the enire sky, sort of just around them. Later after a 15-30 sec time the object broke apart to be two again. That along with this was the most amazing part of the night. At one point when they disapeared and we were looking for the obejects we saw one apear in the main area we had been looking at that night, (that area was about 45 degrees up away from us, like you were looking at stars from your roof that were away from your house not just about you) When we were looking fro the other object i saw it at the corner of my eye. I then had to turn my body to see the obeject. After about a few seconds it shot across the sky all the way to the main area we had been looking at in about one second. I watched it move across the sky and i had to turn my body back to the orginal spot to see that it had now stoped next to the other obeject and they begain flying together again. This all went on for about 45min. After about 25-30 min, my ssgt, my sgt and two or three other marines showed up. When we began to tell them what we were watched my ssgt started making jokes and thinking we were being stupid and just watching plains or jets. When he came up to the tower his jokes and laughs at us stopped almost the second he saw what we saw. This man never shut up so for something to leave him speachless, had to have blown his mind. He then in a serious voice asked if any of us had a camera (most the time we always had one, and he said ,\"Yall always wanna record yourself doin dumbshit, but then something like this is in the sky and no one has one!\") We had some marines in the humvee on post below us and im sure they saw some of this along with one of the marines that was in the humvee that my ssgt showed up in. The speeds and the moves that we saw that night are inpossible. The three of us in the tower, the sgt,ssgt, and two other marines that showed up, and also the marines on the ground all saw this. We are trained military personal. Some who have been on airbase and seen what jets can do and no jet can do what we saw. No jet can stop and freeze in the middle of the sky or go across the sky at the speeds we saw, plus when they came together. This all is easier to explain in person then just words."],"Country":"Iraq","Viewing Distance":"Over One Mile","Region":"Salah ad-Din","Weather Factors":"Unknown","Summary":"Objects moving across sky this size of largest star out, sometimes coming together to make larger object","Source":"MUFON","Object Features":"Unknown","Latitude":"34.016389","Longitude":"44.145278","Sighting Duration":"Undisclosed","Case Number":"8267","Tags":"City","Date of the Event":"07/31/2006 12:00 UTC","City":"Balad","map":"<A HREF = \"http://maps.google.com/maps?q=34.016389,+44.145278(8267)&iwloc=A&hl=en\"> mufon case (8267) map </A>","Date Submitted":"07/31/2006 12:00 UTC","Log Number":"IQ-11022007-0002","Disposition":"Unresolved"}