{"Latitude":"31.973109","Disposition":"Unknown","Object Shape":"Diamond, Other","City":"Undisclosed","Object Features":"None","Log Number":"US-11022007-0004","Weather Factors":"Unknown","Date of the Event":"11/01/2007 05:31 UTC","Region":"Texas","files":["/var/www/straped/mufon/html2text/8269.html.txt","/var/www/straped/mufon/org/8269.html"],"divs":["Sighting DetailsI stepped out onto the front patio of my house, which faces directly SE, to enjoy my daily ritual of the morning coolness with my coffee and cigarette. The sky was quite clear, no clouds or fog, tempurature about 45 degrees centigrade, with a very light breeze from the South. The Milky Way was clearly visible. I was looking up towards the East at Venus, which is quite bright this time of year, when I noticed a very bright object appear from behind and just above the treeline across the street from my home. When it first appeared, it's angle was about 30 degrees above the horizon and due SE. The object was unusually bright; I estimate it to be about twice the brightness of the planet Venus at the time. When I first saw it, it was about 20 degrees to the right of Venus. It was moving slowly (roughly 2-3 degrees of arc per second) and I initially thought that it was an airplane. There was no sound. I observed this object for another 10-15 seconds as it moved higher above the horizon, moving NW and eventually above my head. I began to notice that the object was not only getting much brighter, but it had no visible clearance lights of any kind. I also noticed that it began to have a visible shape to it. It was irregular in appearance, roughly diamond-shaped, but it was still way too small to make out any details. I then thought that maybe I was looking at a satellite or maybe the International Space Station, but I also realised that such objects don't move from East to West. This got my curiosity up. I ran inside my house to grab my binoculars, a Vivatar 7x50 (297ft @ 100yrds). At this moment, the object was directly overhead. Knowing this, I ran to the back of my house to the back porch that faced NW. At this point, the object had just become visible overhead. I quickly adjusted the focus on my binoculars. What I saw through the eyepieces was a solid potato-shaped object, slightly irregular in appearance, appoximately the size of a grain of rice held at arm's length. No details could be seen. No lights of any kind. No visible contrail, glow, or halo. It did not appear to rotate or have any other kind of movement along any axis. It was bright white in color. After observing this object for about another 10 seconds, I noticed that the object began to quickly change color from bright white to grey and then to a ruddy red. At this moment, the object was approximately 50-55 degrees above the horizon, directly NW. I deduced that the object was possibly passing through the penumbra and into the shadow of the Earth. It then suddenly went dark at about a 45 degree angle above the horizon. I checked my watch and the time was 5:41am CDT. Personal backround: I'm a US Army-trained observer, familiar with almost all both civilian and military aircraft configurations and nighttime lighting. I have good knowledge of established civilian air traffic patterns in my area. I am also an amateur astronomer who owns an 6 inch Newtonian telescope which I use for personal enjoyment. I have way above-average knowledge of Astronomy. Based upon my personal observations of the object in question, along with it's angle and direction of travel, brightness in magnitude and variations in said magnitude as it passed overhead, and other characteristics, I have ruled-out any civilian or military aircraft, or possibly most any low-earth orbit satellites. The object could possibly have been a stratospheric-level weather balloon, but the wind directions on the ground and higher elevations at the time rules this out (I checked the NOAA reports before I posted this). I believe that I may have observed the passing of a Earth-Crossing Object."],"Case Number":"8269","Country":"United States","Summary":"Irregularly-shaped object, x2 times the brightness of Venus, moving slowly from SE to NE","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-99.892673","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.973109,+-99.892673(8269)&iwloc=A&hl=en\"> mufon case (8269) map </A>","trends":[],"Tags":"City","Object Flight Path":"Straight-line path","Date Submitted":"11/01/2007 05:31 UTC"}