{"Source":"MUFON","Region":"Kansas","Country":"United States","Sighting Duration":"00:01:00","Viewing Distance":"Unknown","Object Shape":"Other","Object Features":"Undisclosed","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.806688,+-100.3482(8273)&iwloc=A&hl=en\"> mufon case (8273) map </A>","City":"Cimarron","Log Number":"US-11032007-0002","Object Flight Path":"Undisclosed","Tags":"City","Case Number":"8273","Disposition":"Unknown","Latitude":"37.806688","divs":["Sighting DetailsFour people were traveling in a car eastward on Kansas Highway 50 toward Dodge City. About 4 miles east of Cimarron, KS, at 9:40 A.M. on Saturday, November 3, 2007, an aircraft was sighted flying at low altitude over the fields north of the highway. It appeared to be flying approximately 500 to 1000 feet above the ground. The aircraft, from a distance, appeared to be low flying crop-dusting aircraft making a wide counter-clockwise arc around the field less than half a mile from the highway. Two people witnessed this object: the driver and front passenger. As we drove further along, we noticed that the craft was shiny silver in color with some areas of red along the side and rear of the plane. However, when we were nearest to it, we realized it had NO WINGS. It had a crumpled appearance, as if the outside shell of the craft had large dented areas. It also had a single rear fin. It left no vapor trail and was completely silent. The front passenger of the car watched the object continuously and exclaimed that it had suddenly disappeared. The driver was looking at the road briefly while driving then looked back out the left window and saw that the aircraft was gone. It had not landed or flown out of view. It had simply disappeared. The two witnesses scanned the entire clear blue sky, and the aircraft could not be located. Both witnesses are familiar with various kinds of low-flying aircraft that are normally visible in the area, such as crop-dusting propeller planes and ultralight aircraft. This aircraft was neither of those. It was not a conventional aircraft."],"Longitude":"-100.3482","Summary":"Wingless Aircraft Disappears While Flying at Low Altitude over Kansas Fields","Date Submitted":"11/03/2007 09:40 UTC","Date of the Event":"11/03/2007 09:40 UTC","trends":["There have been no other sightings in Cimarron","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/8273.html.txt","/var/www/straped/mufon/org/8273.html"]}