{"Weather Factors":"None","City":"Omaha","files":["/var/www/straped/mufon/html2text/8275.html.txt","/var/www/straped/mufon/org/8275.html"],"Date of the Event":"11/02/2007 11:52 UTC","Latitude":"41.256523","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around November 2nd 2007"],"Longitude":"-95.990678","Disposition":"Unknown","Date Submitted":"11/02/2007 11:52 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.256523,+-95.990678(8275)&iwloc=A&hl=en\"> mufon case (8275) map </A>","Country":"United States","Object Features":"Other","divs":["Sighting DetailsHigh, strangely moving cirrus clouds that seemed to have appeared out of nowhere turned our direction skyward.We witnessed two flat, noiseless objects within five minutes of each other. They appeared to have a skeletal, wishbone like frame and moved across the sky like a glider might move. We could not make out any defined body but there did seem to be some kind of dark area within the frame. The back end or tail had no real definition it seemed to almost fade into the sky. The crafts were in sight for approximately ten seconds each, before we lost sight of them. These two crafts came out of what appeared to be high altitude cirrus clouds, moving in a east-southeasterly direction. The clouds were long, thin and transparent, localized to a specific area in the sky. The clouds themselves seemed to last no more then two hours in duration. I noticed the clouds at eleven pm central time and they had completely vanished out of sight by about one fifteen am. The crafts seemed to emerge directly out of the cloud bank and both crafts heading in a southeasterly fashion. The overall feeling of the event was very negative."],"Case Number":"8275","Sighting Duration":"00:05:00","Region":"Nebraska","Tags":"City","Source":"MUFON","Object Flight Path":"Path with directional change","Object Shape":"Boomerang","Log Number":"US-11032007-0004","Viewing Distance":"501 Feet - 1 Mile","Summary":"Two WIshbone shaped objects glided silently out of high alititude cirrus clouds over southwest Omaha Nebraska"}