{"Object Flight Path":"Undisclosed","Region":"New York","map":"<A HREF = \"http://maps.google.com/maps?q=40.6587,+-73.94754(8277)&iwloc=A&hl=en\"> mufon case (8277) map </A>","divs":["sighting detailsi made a report on another web site on the day of the event. i came across a report that tx made for the same day to see that he posted somthing major that i forget to type. the crafts moved in a straight line horizontal to the earth but in a diagonal formation. 4\\29\\2006 19:30 and still the sun is out and bright. while in my backyard sneaking a smoke i saw what looked like 3 seagulls coasting in the wind. i bacame concerd when the \"birds\" got closer without ever flapping a wing. at this point i threw my cig down and call my brother on his cell, he lives on the upper level of our house and has 20\\20 vision ( i wear glasses and the prescription is not all that great) by the time he makes it to the window, the craft were as close as planes coming in for a landing. i didnt need glasses to see that my brother said wtf is that. it is now passing directly over our house. i run inside to the 3rd floor on the opposite side of our house to see the 1st 2 crossed over and the 3rd one 3 seconds later. tech stuff... the objects came in from the horizon at 260 deg sw flew at the closest point over my house i ran from the back yard to the front ( 60' ) just to see it come out from over my house and head ne at 80 deg toward long island. i'm attaching a picture keep in mind the were in a group of 3"],"Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/8277.html.txt","/var/www/straped/mufon/more/8277_submitter_file1__ufos001.JPG","/var/www/straped/mufon/org/8277.html"],"Summary":"3 cigar crafts should be cross ref with TX event","Country":"United States","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"04/29/2006 07:30 UTC","Case Number":"8277","Source":"MUFON","Latitude":"40.6587","City":"New York","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around April 29th 2006","This sighting has never been favorited.",""],"Date Submitted":"04/29/2006 07:30 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-11042007-0001","Longitude":"-73.94754","Tags":"City","Object Shape":"Cigar, Cylinder"}