{"trends":["There have been 3 other sightings in Oakhurst","There were no other sightings in Oakhurst on or around July 31st 1994"],"files":["/var/www/straped/mufon/html2text/8278.html.txt","/var/www/straped/mufon/org/8278.html"],"Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/31/1994 12:00 UTC","Summary":"Red oval ship - white lights going into ship - ship slowly moving away....","Object Shape":"Oval","Region":"California","City":"Oakhurst","Country":"United States","Case Number":"8278","Latitude":"37.328","Sighting Duration":"Undisclosed","Date Submitted":"07/31/1994 12:00 UTC","divs":["Sighting DetailsIt was late summer in the lower Sierra Mountains. I got home after work and the electricity was off. This wasn't unusual in the mountains. It was warm, but overcast; as though there was going to be a thunder storm. My house was dark inside, so I decided to read outside on the porch until the electricity came back on. I'd been reading about 10 minutes when I saw a flash of light in my peripheral vision and figured it was lightening. I stopped reading to watch the sky for more lightening. I saw another flash of light, but it was not lightening. I watched and discovered the light was not only flashing on and off, but was moving to the left. I followed the light and I saw it go into a ship. I was awe struck. I saw more flashing lights go into the ship and tried to decide if I should go get my camera or binoculars. I didn't want to miss anything, so I decided to stay and watch. I remember wishing my roommate was home to see it too. The ship, at that time, was stationary. No sound, just hanging in the air. It resembled a raspberry lighted from he inside. It was the size of the end of my thumb, making it hard to tell its size or distance. When the last of the flashing lights had entered the ship, it began to move South. I watched it until it disappeared behind the hill behind my house. Not too long after, the electricity came back on. I called the local TV station, but no one had reported anything unusual and I was told a transformer had been the electrical problem. I saw your ad on the TV and decided to finally report this. I currently live in Southern Oregon and in Nov. of 2004, there was a lot of air craft in the area as Pres. Bush was staying overnight here. I was outside after dark and saw a bright light come on from the South. I waited for it to get bigger as it came closer, but it appeared to be stationary. After a while, it went off and then two bright lights came on. They were much bigger than any other aircraft and there was no sound. They went off and when they came back on, there were three bright lights. They appeared to be in a straight line. They blinked off and when they came back on, they were in the shape of a triangle. They blinked off again and when they came back they were in the shape of a smile. I started for my neighbor's house as I wanted someone else to see this too. Unfortunately, they blinked off again and didn't come back on. On New Year's eve, eve, (Dec. 30th) 2005, I noticed lights dancing in the clouds. It was after dark and I thought it must be one of those huge lights they use at movie premiers shining up at the clouds. A few minutes after I had gone inside, my neighbor came over and asked me to look at some lights in the sky. I told her I had noticed them, but figured they were man made. She said, the light was not coming from the ground and after looking more closely, I could see she was right. The lights were either on the other side of the clouds pointing down, or within the clouds themselves. There were three or four of them and they \"danced\" around and around. We talked about them for a long time afterwards. I have seen other remarkable things in the sky and even have a couple of pictures, but these incidents were definately UFO's. I've had friends and relatives tell of their UFO sightings, but I was never totaly convinced until I saw the red, oval, UFO in the sky over Eastern Madera County, California. Vickie J. Pippett"],"Longitude":"-119.649315","Object Flight Path":"Hovering then path","Log Number":"US-11042007-0002","map":"<A HREF = \"http://maps.google.com/maps?q=37.328,+-119.649315(8278)&iwloc=A&hl=en\"> mufon case (8278) map </A>","Object Features":"Patterned Surface","Disposition":"Insufficient Data","Tags":"City","Weather Factors":"Unknown"}