{"Region":"Oklahoma","divs":["Sighting DetailsDrinking coffee and going outside my husband observed something and came in to get his binoculars and said he was seeing something strange. I walked out and saw the object. My first thought was it must be a blimp (the speed and the altitude I suppose) but then loking through the binoculars there was nothing between the two lights - no gondala, craft or wings. There was simply a blue space that appeared to be the sky. Observed in clear pre-dawn sky two lights that appeared to be in the normal flight altitudes of approx. 500 feet. It was traveling SW to NW; front white light appeared similar to a 1st magnitude star and the trailing white light appearred more like a 2-3 mag. star (one witness has a background in amatuer astronomy). I looked closely to see the normal tell-tale blinking lights required for flying craft (the red ones) and there were no other lights on this object. There was just the bright, white, unblinking lights. We do ot know what this object was - no doubt it will prove to be something pretty normal but it was simply very strange and something neither of us had ever seen before despite years of doing amatuer astronomy. Clear sky - little wind. Totally silent. No engine or noise. 10x50 binoculars revealed NO connecting structure from front white light to back white light. Crossed the clear sky in 3-5 minute to disappear in the dawn glow to the NW. If within flight path speed appeared close to small craft flight speed - if astronomical it was traveling fast. The only lights showing were clear, bright white with no other regulation lighting seen."],"Viewing Distance":"Unknown","Date Submitted":"11/05/2007 06:29 UTC","Case Number":"8279","map":"<A HREF = \"http://maps.google.com/maps?q=35.354829,+-97.503067(8279)&iwloc=A&hl=en\"> mufon case (8279) map </A>","Object Shape":"Other","Log Number":"US-11052007-0001","Longitude":"-97.503067","Summary":"Observed two white tandem lights in pre-dawn SE-NW sky","Object Flight Path":"Straight-line path","Date of the Event":"11/05/2007 06:29 UTC","files":["/var/www/straped/mufon/html2text/8279.html.txt","/var/www/straped/mufon/org/8279.html"],"Disposition":"Unresolved","trends":["There have been no other sightings in Norman-Moore","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Tags":"City","Latitude":"35.354829","Weather Factors":"Unknown","City":"Norman-Moore","Object Features":"None","Country":"United States","Source":"MUFON"}