{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=27.833916,+-97.061099(8281)&iwloc=A&hl=en\"> mufon case (8281) map </A>","Date of the Event":"11/04/2007 06:25 UTC","trends":["There have been 4 other sightings in Port Aransas","There were no other sightings in Port Aransas on or around November 4th 2007"],"Case Number":"8281","City":"Port Aransas","Source":"MUFON","Disposition":"Unknown","Object Shape":"Star-like","Tags":"City","Latitude":"27.833916","Sighting Duration":"00:25:00","Date Submitted":"11/04/2007 06:25 UTC","Log Number":"US-11052007-0003","Object Features":"Unknown","divs":["Sighting DetailsI am a retired airline pilot and Coast Guard licensed Master (captain). I was giving instruction in celestial navigation to a student at North 27 degrees 49 minutes lattitude, West 97 degrees 03 minutes longitude. We were shooting Venus and the moon. Sky clear, visibility 10 miles. We had watched the ISS pass about an hour and a half earlier. Venus' altitude was 44 degrees azmith 128 degrees. At the 10 0'clock position on Venus about 5 degrees separation was a celestial body that I could not identify. It was the approximate intensity of Jupiter. It remained stationary at the above position for the 20 minutes while we were taking our shots. It was a steady star like body. No flashing or colored lights or any other remarkable characteristics. Following our shots we departed to the class room, resolved and plotted same, by then it was about 9 AM. I proceded to the star charts in order to identify the body in question and could find nothing. No stars, no planet. This morning it was gone. No trace of it within 20 degrees of Venus. I have never seen swamp gas but I don't think that's what it was because it was too high. It was not a satelite because it was too bright and never moved. I have seen weather baloons on many occasions and this was not. It was not an aircraft approaching with the landing light on because of lack of movement over 20 minutes and no other flashing or otherwise lights. I have no idea what it could have possibly been hence it was an unidentified object in the sky, possibly flying."],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Summary":"Star like object in the morning sky","Object Flight Path":"Stationary","Longitude":"-97.061099","files":["/var/www/straped/mufon/html2text/8281.html.txt","/var/www/straped/mufon/org/8281.html"],"Region":"Texas"}