{"Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-83.482116","Tags":"City","Object Shape":"Disc","divs":["Sighting DetailsMy son is 14 years old and observed a strange object in the sky while riding the bus to school. At approximately 06:55, My son's bus was on Beck Road at the Joy Road intersection, in Canton, Michigan. He looked out the bus window to the west and he saw 3 dim white lights at about 40 degrees above the horizon. The lights then started to brighten and became very bright white. The object then began to move slowly upward and to the north. It went a short distance then stopped, changed direction, going upward and to the south for a short distance. The object stopped again, then began moving slowly north and upward. It stopped again, then flew south and upward again for the last time. It stopped, tipped vertically revealing a distinct saucer-shaped craft with 3 bright white lights in a triangular formation. Remaining in that sideway's position, it slowly ascended, then instantly disappeared. My son was too shocked to think to point it out to anyone else on the bus. He said no one else took notice that he was aware of. That evening, I told my wife that our son saw what he thought was a UFO while riding to school and I didn't describe anything to her about what our son said to me. She immediately said that she saw something very strange that morning also, while driving to work. She said, whatever it was, it had 3 impossibly bright white lights and was hovering in the field north of the road, just above the trees, as she drove past it on Ford Road, going west, near the Ridge Road intersection. She said it was huge. She said it was about the size of a small ranch home. She said she wanted to stop, but there was too much traffic and she couldn't pull over safely. She also said that it felt like she wasn't supposed to stop. She said that it almost felt like the idea was implanted in her head that she was observing some farm equipment like a large irrigation system. She saw this very similiar looking craft approximately 10 to 15 minutes earlier than my son at around 06:40. Her location was approximately 2.5 miles away from my son's location when he saw the saucer. This was amazing since I didn't give my wife details of what our son saw and to have her tell me the same number of lights as our son along with seeing it 10 minutes apart in the same area. Drawings and a map are attached."],"Weather Factors":"Unknown","Date Submitted":"09/13/2007 12:00 UTC","Disposition":"Unknown","Summary":"2 Separate Sightings - Saucer with 3 Very Bright Lights Observed In Non Ballistic Flight, Then Disappeared","Object Flight Path":"Undisclosed","Sighting Duration":"00:01:00","Country":"United States","Region":"Michigan","Latitude":"42.308644","files":["/var/www/straped/mufon/html2text/8286.html.txt","/var/www/straped/mufon/more/8286_submitter_file1__IanUFOSighting091307.jpg","/var/www/straped/mufon/more/8286_submitter_file2__MapofIanCarolineUFOsighting091307.jpg","/var/www/straped/mufon/more/8286_submitter_file3__PictureCarolineUFO091307.jpg","/var/www/straped/mufon/org/8286.html"],"Log Number":"US-11052007-0008","Date of the Event":"09/13/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.308644,+-83.482116(8286)&iwloc=A&hl=en\"> mufon case (8286) map </A>","Source":"MUFON","City":"Canton","Case Number":"8286","trends":["There have been 16 other sightings in Canton","There were no other sightings in Canton on or around September 13th 2007","This sighting has never been favorited.",""]}