{"Case Number":"8287","files":["/var/www/straped/mufon/html2text/8287.html.txt","/var/www/straped/mufon/org/8287.html"],"Date of the Event":"11/05/2007 04:10 UTC","Summary":"Watched object move for two hours in side to side and up and down manner","Weather Factors":"Windy, Lightning, Rain, Medium, Light","Longitude":"-155.906006","Tags":"City","Country":"United States","Object Features":"None","Sighting Duration":"02:05:00","Source":"MUFON","City":"Milolii","Object Shape":"Star-like","trends":["There have been no other sightings in Milolii","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Log Number":"US-11052007-0009","map":"<A HREF = \"http://maps.google.com/maps?q=19.18652,+-155.906006(8287)&iwloc=A&hl=en\"> mufon case (8287) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Disposition":"Unknown","Date Submitted":"11/05/2007 04:10 UTC","Latitude":"19.18652","Region":"Hawaii","divs":["Sighting DetailsWe were having storms, power went out about 9PM, came back on around 4am. Got up to do rounds and saw what at first appeard to be a ship with a bright light out on the ocean to the west. Then figured it was just a bright star, so went back to bed. Then realized that it was an extreemely cloudy night, with no stars visable. If this was a star, it had to be beneath the clouds. Got back up to watch the object. Marked my position with a post and wathed the object go up and down about 15 degrees and side to side about 30 degrees. I am an ex-marine with the fighter wing, so I know aircraft and SAR planes. This was not a conventional aircraft. It was so captivating that I spent the rest of the night in the back yard watching this thing. Watched this thing until it got fairly light. It finally went into a dark thunder cloud due south. Called and talked with a couple of friends in the mainland to keep from freaking out while watching this thing. Trying to come to terms with this event. It is the first time I have ever seen anything like this."]}