{"map":"<A HREF = \"http://maps.google.com/maps?q=48.993723,+-122.747119(8289)&iwloc=A&hl=en\"> mufon case (8289) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8289.html.txt","/var/www/straped/mufon/more/8289_submitter_file3__objectchangeddirections4.46.42PDT6-24-07.JPG","/var/www/straped/mufon/org/8289.html"],"Object Features":"None","Disposition":"Unknown","Source":"MUFON","Longitude":"-122.747119","Object Flight Path":"Path with directional change","Weather Factors":"None, Lightning, Light","trends":["There have been 7 other sightings in Blaine","There were no other sightings in Blaine on or around June 24th 2007","This sighting has been favorited 1 time.",""],"Latitude":"48.993723","Date of the Event":"06/24/2007 04:15 UTC","Date Submitted":"06/24/2007 04:15 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Summary":"cylinder shape large shiny when hit by sun dark the rest","Region":"Washington","Country":"United States","Object Shape":"Cylinder","Case Number":"8289","Log Number":"US-11062007-0002","Tags":"City","divs":["Sighting DetailsAt apprx. 4:15pm PDT, Sunday 6-24-07 my husband called me to come outside. He sounded like it was urgent. When I went outside he pointed up & asked me what I thought that was, that it was there for a while and was traveling parallel to the street (from south to north)I ran in and got my binoculars & it looked to be a large cylinder. At first I thought it might be a balloon, but it was too large and it didn't move like a balloon. It stayed horizontal for a long time, then it made a turn (east to west) parallel to our front street. When it started traveling I ran in to get my video camera but it was out of battery. I remembered I had my digital camera in my purse & brought it outside to get a video. When I came back outside it started to change direction from being hrizonal to vertical. In the horizontal mode it looked to be very shiny, like tin foil, on the top where the sun hit it, but the rest of it seemed very black. I had trouble capturing it on photo or video (my camera had dust & stuff on it from being in my purse). When this thing started it was a nice blue sky day and then it started getting cloudy and then it got really dark skies with lightening (we rarely have lightening here). It climbed up and finally disappeared into the clouds. Since we are on the Canadian Border here, I called the Border Patrol and told them what we had seen (even my neighbor's daughter saw it). I told them I was not a nut job or crazy. They said I should call 911. I told them the reason I called Border Patrol was because it was flying towards White Rock, Surrey, BC. I asked if they would just go out and look up to see if they could see it. I know that laughed their butts off when they got off the phone and thought I was crazy. My husband & I got in the car and tried to keep up with it, but we lost it in the dark clouds. About an hour later, my husband went to fill up the car at a gas station and he heard on the radio a lady asking if anyone else saw something flying over Canada. Since we are on the border, we get the Canadian stations better. Anyway, I was going to call the radio station, but my husband said not to and just let it go because he didn't want people thinking we are crazy. Ever since then I have been wondering what it was. If it is a balloon I'll be so happy that I am not a nut. But, this really didn't look like a balloon, it was very large, silent and moved in a rational direction. Balloons usually just float around. Hope someone can help settle my mind. (I took about 5 pictures & 2 mpgs, but my camera is old.)"],"City":"Blaine"}