{"Object Features":"None","trends":["There have been 10 other sightings in Alexandria","There were no other sightings in Alexandria on or around November 5th 2007"],"City":"Alexandria","files":["/var/www/straped/mufon/html2text/8291.html.txt","/var/www/straped/mufon/org/8291.html"],"Longitude":"-77.042341","Region":"Virginia","Object Flight Path":"Straight-line path","Latitude":"38.807226","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsI was watching a movie in my living room at about 11pm on Monday, Nov. 5th when I noticed it had started to rain outside. We are in the middle of a drought and I had not heard it was going to rain so I went to the front door to look outside and see how hard it was coming down. As I approached the door I heard a strange noise that sounded like a low wooshing almost like a high pressure fire hose off in the distance. I opened the door and looked outside into the sky, immediately noticing a large dark triangle shape above out courtyard. The object was approximately 600 feet off the ground, passing over our courtyard and looked as large as a commercial airliner. It was an equilateral triangle with bright white lights (not blinking) at each corner, one fainter white light (also not blinking) just in back of the forward light and a bright red blinking light in the center of the craft. I watched in awe as it cruised slowly west across Highway 395 and out of sight. I live less than 4 miles from the Pentagon and we have military helicopters flying over our house several times a day, but I have never seen anything like this."],"Object Shape":"Triangle","Log Number":"US-11062007-0004","Date Submitted":"11/05/2007 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.807226,+-77.042341(8291)&iwloc=A&hl=en\"> mufon case (8291) map </A>","Summary":"Black triangle passed near house and headed west","Sighting Duration":"Undisclosed","Case Number":"8291","Source":"MUFON","Country":"United States","Date of the Event":"11/05/2007 11:00 UTC"}