{"Latitude":"35.21004","trends":[],"Summary":"observed 2 star-like objects, one behind and to the left of the other, moving from southwest to northeast, one brightened and then dimmed, no sound","Disposition":"IFO","Case Number":"8292","Date of the Event":"11/06/2007 05:15 UTC","Weather Factors":"Unknown","Source":"MUFON","City":"Undisclosed","Object Flight Path":"Straight-line path","Log Number":"US-11062007-0005","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8292.html.txt","/var/www/straped/mufon/org/8292.html"],"Longitude":"-91.830223","Date Submitted":"11/06/2007 05:15 UTC","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Object Features":"Unknown","Region":"Arkansas","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.21004,+-91.830223(8292)&iwloc=A&hl=en\"> mufon case (8292) map </A>","Country":"United States","divs":["Sighting DetailsI was out for my morning walk in my neighborhood. It was 5:15 a.m. and the sky was completely clear. I go for a walk every morning so I am pretty familiar with the stars and such at that time of day. I have observed numerous shooting stars and passenger jets which is what made this sighting very different. I always try to look upwards as much as possible as I enjoy seeing Orion, very prominent this time of year, and watching the progression of Venus and the moon in the east. I observed two star-like objects travelling from the southwest towards the northeast. One was behind and slightly to the side of the other. Both were of the same brightness, which was steady and non-twinkling. Neither had flashing lights common to passenger jets and there was no sound. I have seen numerous jets at that time of morning and can tell one immediately by the flashing lights as well as the fact that they always are travelling from east to west or west to east, never in the direction I saw these objects travelling. The objects maintained a straight line and consistent speed. When they appeared about due east from me, and about a 30 degree angle from the horizon, the one behind suddenly brightened, almost as bright as Venus. It then dimmed til it was dimmer than the one in front, and dimmer than it was before it brightened. Both maintained the same speed and direction, and distance and orientation from each other, until they disappeared in the northeast. I live very close to our local airport, which has an Air National Guard unit stationed there. These were definitely not jets from the unit--there was no sound or the flashing lights associated with the jets. Believe me, as close as I am to the airport, I am very aware when they take-off and land. I also do not believe they were passenger jets due to the direction they were travelling as well as the absence of the flashing lights I always notice on them. The fact that one was behind and offset from the other was also curious, as well as the sudden brightening and then dimming of the one behind. They did not twinkle like a star as they moved through the sky nor did they deviate at all from their course. They were certainly not shooting stars--I have seen numerous of those and they last only a couple of seconds. These objects took about two minutes to disappear in the northeast. I am not sure what they were but I am very certain as to what they were not. They did not appear to be as high in altitude as a passenger jet, in fact they appeared quite low. So low that they appeared in size only slightly smaller than Venus. I have to admit that this is one of the most fascinating and interesting things I have seen during my walks. I will certainly be paying more attention upwards."]}