{"Source":"MUFON","City":"Runnelstown","trends":["There has been one other sighting in Runnelstown","There were no other sightings in Runnelstown on or around November 5th 2007"],"Object Flight Path":"Path with directional change","Log Number":"US-11062007-0006","Summary":"Strange unidentified objects moving irractically in eastern sky.","Viewing Distance":"Unknown","divs":["Sighting DetailsMe and my daughter and wife had been viewing the night skies the past several nights from our upstair's balchony. After viewing the stars awhile I noticed at what I first thought was a star changing colors. The colors changed from red to white and to a blue at different times. The object would fly on a horizontal path slowly then position itself a good distance from it's origin position irratically and quickly. I have seen this object in the sky for over three nights in a row now. I noticed not to far from this object another object that I can best describe as a figure that contained what looked to be six ufos in the area that fly back and forth very quickly and were changing colors. What made the whole experience even more freaky was the fact that the whole figure that contained the ufos was moving slowly in the night sky towards the west of my house. This was a first in seeing anything similiar to this type of object. I have seen plenty of individual objects in our are that are simply ufos; not man made craft that fly and move at great rates of speed."],"Disposition":"Unknown","Object Shape":"Cylinder, Unknown","Tags":"City","Date of the Event":"11/05/2007 12:00 UTC","Region":"Mississippi","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/8293.html.txt","/var/www/straped/mufon/org/8293.html"],"Case Number":"8293","map":"<A HREF = \"http://maps.google.com/maps?q=31.375556,+-89.111667(8293)&iwloc=A&hl=en\"> mufon case (8293) map </A>","Date Submitted":"11/05/2007 12:00 UTC","Object Features":"Unknown","Country":"United States","Sighting Duration":"Undisclosed","Latitude":"31.375556","Longitude":"-89.111667"}