{"Log Number":"US-11062007-0008","Date Submitted":"10/10/1989 08:00 UTC","Object Flight Path":"Undisclosed","Longitude":"-76.141764","files":["/var/www/straped/mufon/html2text/8295.html.txt","/var/www/straped/mufon/org/8295.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=43.054622,+-76.141764(8295)&iwloc=A&hl=en\"> mufon case (8295) map </A>","Object Shape":"Cigar, Circle","Latitude":"43.054622","Disposition":"Unknown","Case Number":"8295","Country":"United States","divs":["Sighting DetailsI was 15 years ol or so at the time. It was a cool october night and i was in my parents house watching t.v. All of a sudden my sister and her sister -in-law pulled in the driveway and ran inside the house frantic telling me there was a ufo down the road in the sky. I wasnt sure to believe them butall three of us got into the truck and drove down the raod about a half mile where they saw it. As we drove i saw nothing in the sky. AS my sister turned the truck around to go back home the sky light up over the left side of the truck we pulled the truck over and saw a huge ufo, with huge lights on the side and a glowing bottom that had vented rigges on it. It flew very low to the point to where you could see it very well. It was flying over the tops of the trees and flew across a feild at a very slow pace till it went over the tree lines never to be seen by us again. It was the most amazing thing we had ever seen!! It moved without sound and seemed to be just on route. I know 100% that it wasnt anything other than a ufo.It was to close and to bright not to know this.Ever since that day i have looked to the skies in hope to seeit again. I never feel the need to debate the existance of ufo,s because My sister and her sister-in-law and i saw one that day in october!"],"City":"Syracuse","Date of the Event":"10/10/1989 08:00 UTC","Viewing Distance":"Unknown","Summary":"big. roundish ,big lights on the side Quiet and flew very low.","Source":"MUFON","Tags":"City","Weather Factors":"Unknown","trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around October 10th 1989"],"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"New York"}