{"Weather Factors":"Unknown","divs":["Sighting DetailsI video taped a semi-cloaked UFO a couple of weeks ago and many others. I'm sending you a link to the high res version. Passing by the star Arcturus is definitely one of our friends. This was filmed two weeks ago October 2007 at my house which is two hundred yards from Newport's Old Stone Mill. It works best to right click the movie for full screen in a completely dark room with a good monitor as it seems to be semi-cloaked. Some people say they can't see it but I sure can. Turn up your sound, you can hear a woosh as it glides by also notice the green flash interacting with my infrared camera as the UFO enters at bottom right. I seem to be in close contact for about seven years I've had many sightings and finally their showing up on film. Some of my family members where the ultimate skeptics until they saw this one. Don't miss Larry Kings UFO show coming up this Thursday at 9:00 pm. Also listen to the Ronald_Reagan_UFO_Briefing.htm at my site webcamufo.com you can contact me at ufos@youfo.us with comments or questions. -DC )-("],"Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Newport","There were no other sightings in Newport on or around October 15th 2007","This sighting has never been favorited.",""],"Log Number":"US-11062007-0009","Object Features":"Undisclosed","Object Shape":"Boomerang","Date of the Event":"10/15/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.494372,+-71.303728(8296)&iwloc=A&hl=en\"> mufon case (8296) map </A>","Sighting Duration":"08:00:01","Case Number":"8296","files":["/var/www/straped/mufon/html2text/8296.html.txt","/var/www/straped/mufon/org/8296.html"],"Disposition":"Hoax","Region":"Rhode Island","Longitude":"-71.303728","City":"Newport","Summary":"ANOTHER SEMI-CLOAKED BOOMERANG WITH AUDIO FLYING BY ARCTURUS","Latitude":"41.494372","Country":"United States","Date Submitted":"10/15/2007 12:00 UTC","Viewing Distance":"Unknown","Tags":"City","Source":"MUFON"}