{"Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=40.719793,+-73.996033(8302)&iwloc=A&hl=en\"> mufon case (8302) map </A>","Date of the Event":"09/11/2006 12:00 UTC","Viewing Distance":"Unknown","Region":"New York","City":"New York","Tags":"City","Case Number":"8302","Latitude":"40.719793","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around September 11th 2006","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/8302.html.txt","/var/www/straped/mufon/more/8302_submitter_file1__TowersofLight2002-03-11-.jpg","/var/www/straped/mufon/org/8302.html"],"divs":["Sighting DetailsThe following picture is on file with the FDNY. When I first saw the picture (taken on the anniversary of the 9-11 attack but don't know which year. I thought it was a smudge. On further investigation (enlarging the area) you can see what appears to be some kind of craft. believe it or not this same craft was in the sky on 9-11-01. I reported it then also. This cigar shaped object is illuminated with lights. I was thinking of taking the photo to a good photography place to see what it is. On my own computer I am able to enlarge it to see some of the details. I am sure it is an object used for patrolling. My guess it is an unmanned space craft. The one I saw on 9-11-01 looked like something from the \"Jetsons\". In that cartoon, the exhaust of their flying vehicles is portrayed as clear bubbles coming from the rear of the air craft. On 9-11-01 the same \"bubbles\" could be seen. It would only make sense to patrol the skies on ensuing 9-11 anniversaries. I'm sure our gov't isn't telling us what it is. I just hope it is being used for our protection. I think we now possess in our technology a way to propel an aircraft without jetfuel, and I think we have the capability to use it in automobiles. Although this craft may be nuclear. That is something our gov't doesn't want us to know. One day the truth will come out."],"Country":"United States","Object Flight Path":"Undisclosed","Object Shape":"Cigar","Source":"MUFON","Date Submitted":"09/11/2006 12:00 UTC","Summary":"A cylindrical craft (illuminated) can be seen in this picture","Weather Factors":"Unknown","Log Number":"US-11072007-0004","Longitude":"-73.996033","Sighting Duration":"09:00:00","Object Features":"Undisclosed"}