{"Object Shape":"Star-like, Triangle","Object Flight Path":"Hovering then path","Log Number":"US-11082007-0002","Object Features":"Unknown","Longitude":"-95.990788","files":["/var/www/straped/mufon/html2text/8304.html.txt","/var/www/straped/mufon/more/8304_submitter_file1__UFO1.jpg","/var/www/straped/mufon/org/8304.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.258083,+-95.990788(8304)&iwloc=A&hl=en\"> mufon case (8304) map </A>","Viewing Distance":"Over One Mile","Region":"Nebraska","Summary":"Triangular object or triangular formation of lights in the sky. Omaha, NE, douglas county, benson area","City":"Omaha","divs":["Sighting Details On Tuesday, October 9, 2007 at around 11:05 pm, I was sitting on my back deck smoking a cigar. I had recently started looking at constellations while I smoke my cigars at night. I looked towards the sky and saw what I thought was a triangular pattern of 8-10 stars that I never noticed before directly to the east. I am not very knowledgable about constellations and wasn't suprised to see stars that I've never noticed. Then the starlike lights started moving south at a constant speed. I had to stand up because I was amazed. I watched the white lights until a street light was in between myself and them and I could no longer see them at about South South East of my location. When I first noticed the lights until I could no longer see them was about 30-45 seconds. They seemed to move a little slower than an airplane. The lights only appeared to be stationary momentarily when I first saw them. They did not flash or change colors. At the time, I figured it was a large V shaped object with lights in a row on each \"wing\" of the V, but it could have just been smaller objects with lights in a V pattern. It appeared to be around 2 miles to my east. It was approximately the size of a quarter at arms length. I went inside and wrote down what happened and a drew a picture of the object in a notebook.(Attached) It was 11:11 pm when I started writing. I went back outside hoping to see more. The next few nights I was ready with my camera, but I haven't seen anything else. -Attachment- I dont have the best handwriting, and I was writing fast. -"],"Tags":"City","Date of the Event":"10/09/2007 11:04 UTC","Date Submitted":"10/09/2007 11:04 UTC","Sighting Duration":"00:00:30","Case Number":"8304","Country":"United States","Source":"MUFON","Latitude":"41.258083","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around October 9th 2007","This sighting has never been favorited.",""],"Weather Factors":"None","Disposition":"Unknown"}