{"Date of the Event":"08/28/2007 05:35 UTC","City":"weaton","Object Flight Path":"Stationary,Straight-line path","Log Number":"US-11082007-0003","Case Number":"8305","map":"<A HREF = \"http://maps.google.com/maps?q=39.055205,+-76.632081(8305)&iwloc=A&hl=en\"> mufon case (8305) map </A>","Country":"United States","Weather Factors":"Unknown","Latitude":"39.055205","Disposition":"IFO","Source":"MUFON","Longitude":"-76.632081","Summary":"an angel riding the sky","files":["/var/www/straped/mufon/html2text/8305.html.txt","/var/www/straped/mufon/more/8305_submitter_file1__PICT0236.JPG","/var/www/straped/mufon/more/8305_submitter_file2__PICT0238.JPG","/var/www/straped/mufon/more/8305_submitter_file3__PICT0241.JPG","/var/www/straped/mufon/org/8305.html"],"Sighting Duration":"00:05:00","trends":["There have been no other sightings in weaton","This sighting has never been favorited."],"Date Submitted":"08/28/2007 05:35 UTC","Region":"Maryland","Object Shape":"Diamond, Star-like","divs":["Sighting DetailsOn the morning of Aug. 28th I went out to search and take pictures of the luna eclipse which was to begin at 0552 am on the east coast.I knew it would be difficult to find the moon so I left my house at 0525 am to get a head start.I could not loacte the moon at all and I thought this may be due to the surounding buildings and brightly lit area in which I live.I decided to walk to an area where my view wouldnt be obstructed.I found myself about a half a mile away from home and still no sight of the moon,although a bright star ( at least I thought it was)caught my attention.This star like object shined very brightly almost like a diamond then dimmed dramatically,it repeated this sequence 4 or 5 times as I managed to get off 5 photos.As I was taking shots of this object I said to myself,please come closer,dont go away.No sooner than I said this the object blinked out and never returned.What I felt next was a feeling that told me to go to the park.I knew the park was at least a little over a mile and a half away but I had to be there.I thought that going to this park with a wide open space would give me a better chance to observe the luna eclipse.It was now 0600 hrs and nothing.Im in the middle of a park at 6 in the morning,what the hell am I doing here?I believed my venture to be a lost cause so I began to take pictures of the sun rise which was just begining. I took 9 photos and started back home.When I arrived home I went through the photos and almost fell out by what I saw in 1 of the 9 pics.Was this my angel?The image was not in my viewfinder or in the sky when I shot the photo.My gut reaction was that this was the most beautiful thing I have ever seen.It also tunrned out to be one great big spiritual event for me.So if you can help me find out what it means not just for myself but for the world and confirm my angel maybe we would all be better off."],"Viewing Distance":"Unknown","Tags":"City","Object Features":"None"}