{"Source":"MUFON","Summary":"Saw bright green streak of light over Potomac river heading south","City":"Washington","Latitude":"38.902692","Weather Factors":"Unknown","Date of the Event":"11/08/2007 10:14 UTC","Viewing Distance":"Unknown","Country":"United States","Tags":"City","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.902692,+-77.033176(8311)&iwloc=A&hl=en\"> mufon case (8311) map </A>","Date Submitted":"11/08/2007 10:14 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/8311.html.txt","/var/www/straped/mufon/org/8311.html"],"Object Shape":"Bullet, Missile, Flash, Star-like","Object Flight Path":"Undisclosed","Case Number":"8311","Sighting Duration":"00:00:02","divs":["Sighting DetailsI was driving south on the George Washington Memorial Parkway about 10:14 pm on November 8, 2007. I was returning home after my Coast Guard Auxiliary meeting that night. I happened to look to my left and saw a streak of green light in the direction of the nearby Potomac River, seeminlgy over it. If I did just not happen to look that way, I would not have seen it. There was no sound. It resembled the bright green light seen in fireworks. It gave me the impression of a large firework traveling horizontally. There are a lot of trees in that area, and it was difficult to see whether the object's track continued and that my view of it was just obscured, or whether it was just a brief glimpse, almost as if the phenomenon appeared and then disappeared, as in going in and out of dimensions or 'planes.' There might have been a leading edge of plasma ball at the southward end, but it all happened so fast that I cannot be sure. I have that impression in memory. I remember feeling good about the sighting; having a feeling of elation at the time. The light streak was bright and beautiful, and I like fireworks. However, I was also struck that this just did not seem normal--a firework-like phenomenon traveling horizontally. This occurred in the flyway (landing and takeoff path) of Washington Reagan National Airport, and I had the thought that what I saw could have been a military flare of the type that I believe many nations use to dispense from aircraft as decoys to spoof anti-aircraft missiles. After I saw the phenomenon and lost track of if, I was hoping that I would get a chance to see it again in the sky, but could not. I was also wondering if other people in cars or observing from a stationary point on the ground had seen anything. I felt frustrated at being around other drivers but having no way to just stop them and say, Did you see what I saw? I was wondering if the phenomenon would become stationary and then people would stop and get out of their cars to watch it, but that did not happen. I do not know what I saw that night, but it seemed to be more of a plasma or streak of light than an object. I would say it resembled a large, green flare, traveling horizontally. I looked around as I got off the Parkway and onto 395 South, but saw nothing more."],"trends":["There have been 9 other sightings in Washington","There were no other sightings in Washington on or around November 8th 2007"],"Log Number":"US-11092007-0001","Region":"Virginia","Longitude":"-77.033176"}