{"Date Submitted":"11/08/2007 06:40 UTC","Object Features":"Window(s)","Source":"MUFON","Date of the Event":"11/08/2007 06:40 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.436723,+-78.652424(8321)&iwloc=A&hl=en\"> mufon case (8321) map </A>","Viewing Distance":"Over One Mile","Region":"Virginia","City":"Undisclosed","Object Shape":"Star-like, Teardrop, Triangle, Other","Object Flight Path":"Stationary","trends":[""],"files":["/var/www/straped/mufon/html2text/8321.html.txt","/var/www/straped/mufon/more/8321_submitter_file1__8nov-6am.jpg","/var/www/straped/mufon/org/8321.html"],"Longitude":"-78.652424","Weather Factors":"Unknown","Latitude":"37.436723","Summary":"Saw a bright morning 'star' that should not have been there and I could just discern a disk to it so I took a view pictures","Country":"United States","Log Number":"US-11112007-0002","Tags":"City","Disposition":"Unknown","Case Number":"8321","divs":["Sighting DetailsI sleep in my attic bedroom under a skylight sometimes.. I awoke on Nov 8 at about 6:40 AM I Saw a bright morning 'star' that should not have been there and I could just discern a disk to it so I grabbed the binoculars (I keep binoculars and camera on attic bed stand) and saw I could see an odd object. This was not a planet nor a star.. unless planets look like glowing blobs..with arms.. and a dark windscreen on one side.. AT first I though morning planet.. I then grabbed the camera and running on manual focus, because of the glass of the skylight, focused the camera (Fuji FinePix) on the object, and took many images... at 10x optical zoom.. of the 9 images, three were shake-free... so I copied the images from two of the shake free images onto one image.. and cropped it so it wouldn't be a huge file. There was one object, the upper and lower one in the image are from other frames.. Re feelings etc, it was very pretty, and a exquisite bluish tint to the color. It did not appear to move at all, I lined up by eye with a leaf edge on the skylight and watched for some time and could note no motion at all. And I was able to see it until after the sun had risen about 45 minutes later and then I lost it in the rapidly brightening sky. There were high light clouds, but I couldn't tell you which side of clouds this thing was on, It was at about 11 oclock in elevation from the southwest. It was not there the following morning, nor today."]}