{"City":"Lemont","map":"<A HREF = \"http://maps.google.com/maps?q=41.673642,+-88.001726(8324)&iwloc=A&hl=en\"> mufon case (8324) map </A>","divs":["Sighting DetailsOn July 11, 2007 I went out to get some cat nip for my cat, at about 9:15. I walked out on to the drive way, faceing (West) to see Venus. Out of the south west, traveling quickly, four, red orange bright (like (neon) orbs headed my way, northeast. As soon as I saw them I ran and got my husband.(it took 5 seconds, to and back to lights) We watched them fly across the sky, equal distant apart,soundless. They were low. We watched them till they hit the tree line,(old Oak trees) and could not see them anymore. They looked like the size of a high moon, from ground to orb. Speaking of moon, sighting was during darkside of moon. The orbs, were some what in the usual fight patterns of plane travel in our area. There were no other planes in the sky. We are baby boomers, we have seen alot of things in the sky but nothing like this. We tried to use reason to explain what we saw to ourselfs. We thought maybe because they were in the flight pattern, they flew in for the air show. We wondered if they were dropping something off at Argonne National Lab. Weather ballowns even, but how come if they were,no one reported seeing them. We asked others in our area if anyone had seen any thing, but they only looked at us funny. We found nothing about it in the paper or on the radio the next day. We could not beleive no one had seen it and reported it to the news, local even. But, then again we hadn't either. (It's not like your in the phone book.) I tried to call W.G.N. next day, but called at the wrong time, and was not well recieved. Did not call back. People when we told them were not comfortable hearing about it. So were are not comfortable with telling it. I just wanted to know what it was. But, I will say this. I am glad I saw it. We do not feel the need to prove it to anyone, because to us, it was very cool finialy seeing something that you could say, with out a doubt, what you had seen was a UFO to you. I am not saying they were from outer space, all were are saying is, we have never seen anyting like this in the sky before. We did not take pictures of it. But, when I went to the National ufo reporting web sight, the sighting seen in portland, is what we saw, only four of them and alot closer. And that is why I am reporting this to you now. Thanks for your time."],"Disposition":"Insufficient Data","Longitude":"-88.001726","Tags":"City","Object Shape":"Circle, Fireball","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Illinois","Date Submitted":"07/11/2007 09:18 UTC","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"41.673642","trends":["There have been 3 other sightings in Lemont","There were no other sightings in Lemont on or around July 11th 2007"],"Object Features":"Undisclosed","Case Number":"8324","Log Number":"US-11112007-0005","Source":"MUFON","Summary":"saw four orbs ,red, orange center. neon like. traveling low in sky, equal distant apart. no sound.","Date of the Event":"07/11/2007 09:18 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/8324.html.txt","/var/www/straped/mufon/org/8324.html"]}