{"divs":["Sighting DetailsAT a civil war re-enactment at Anderson river park around 11:00pm I saw several bright spot-looking lights in the clouds. It lit the whole area up where we were camping. I waited for the thunder but there was absolutely no noise. thunder clap, helicopter or airplane sound. The lights were bright blue led looking diffused in the cloud cover. It was almost to bright to look at. They went from west to north east for 20 to 30 seconds. People around the camp fires started to ask what the heck was going on. It was raining lightly. Several times at least 4 times the sky was lit up with the bright blue light straight over head turning the clouds so bright you could have read by it. The lights went over a bluff to the east and strobed bright blue for at least a minute. you could see all the details of the hills and trees on the ridge. Someone said a transformer blew but there are no over head lines in the area and there was no noise. A lot of people was this. I have never seen such bright blue lites in my life. I have seen a lot of lightning storms but not a silent one that lit up everything for 10 to 30 seconds and move around so fast.When they stopped they never came back but someone said they saw lights like that the night before. They were in the clouds at a minimum of 500 to 1500 feet up. at one point they looked to be over 2000 feet in the clouds."],"Sighting Duration":"Undisclosed","Region":"California","files":["/var/www/straped/mufon/html2text/8327.html.txt","/var/www/straped/mufon/org/8327.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.455208,+-122.296182(8327)&iwloc=A&hl=en\"> mufon case (8327) map </A>","trends":["There have been 2 other sightings in Anderson","There were no other sightings in Anderson on or around November 10th 2007"],"Country":"United States","Disposition":"Insufficient Data","Longitude":"-122.296182","Tags":"City","Date of the Event":"11/10/2007 11:03 UTC","Summary":"Bright Blue Lights, then the whole sky was lit up several times ending in blue stobes all completly silent.","Case Number":"8327","Weather Factors":"Unknown","Date Submitted":"11/10/2007 11:03 UTC","City":"Anderson","Source":"MUFON","Log Number":"US-11122007-0003","Object Flight Path":"Other","Latitude":"40.455208","Object Shape":"Unknown","Viewing Distance":"Unknown","Object Features":"Unknown"}