{"Log Number":"US-11122007-0006","divs":["Sighting DetailsIt was about a mile away near a jet engine powered power plant in a town called Rathdrum ID. The object hung just above the tree tops and would climb and drop over and over. Sometimes small lights would come and go from the object. A few minutes after I saw this object (maybe 20-30) three planes flew over the area. The ufo would disappear just long enough to avoid them. The next day I notice two military helicopters, they flew around the general area for two days. The only reason I bring this up is because their is never military helicopters in this area because there is no base around here. I was also wondering if anyone at MUFON know about the submarine base in the lake at Athol ID I will attempt the spelling of the lake...please don't judge me on this. I think it is Lake Ponderillie, now I will try it the way it sounds.....Ponderay, I worked on that base for a year and a half as a journeymen HVAC supervisor. I also lived in Great Falls Mt from 1967 to 1996 and there was a lot of activity around there (Malmstrom? AFB. Please contact me if you have anything to add."],"map":"<A HREF = \"http://maps.google.com/maps?q=47.685833,+-116.772486(8330)&iwloc=A&hl=en\"> mufon case (8330) map </A>","Country":"United States","Region":"Idaho","Latitude":"47.685833","Disposition":"Unknown","Date Submitted":"11/10/2007 12:00 UTC","Source":"MUFON","Summary":"bright color changing jelly fish shaped ufo","Date of the Event":"11/10/2007 12:00 UTC","Object Shape":"Other","City":"Coeur d'Alene","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Coeur d'Alene","There were no other sightings in Coeur d'Alene on or around November 10th 2007"],"Longitude":"-116.772486","Tags":"City","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Case Number":"8330","files":["/var/www/straped/mufon/html2text/8330.html.txt","/var/www/straped/mufon/org/8330.html"]}