{"Weather Factors":"Unknown","Disposition":"Unknown","divs":["Sighting DetailsEX-HUSBAND AND I WERE COMING FROM EL PASO IN A BLUE MINI TRUCK WE CAME THRU CARLSBAD THRU ARTESIA THRU LOCO HILLS N.M MINUTES AFTER LEAVING LOCO HILLS HUSBAND NAMED JOSE MEXICAN ASKED ME IF SOMETHING WAS WRONG AND I SAID NO AND I ASKED WHY? AND HE SAID THAT SOMETHING IS WRONG WITH THE RADIO BECAUSE THE RADIO STARTED MAKING STATIC NOISES AND THE STATION WENT OUT AND HE WAS MESSING WITH THE STEREO HE WAS MAD AND TURNED IT OFF AND THEN HE STARTED COMPLAINING THAT IT SEEMED AS IF THE TRUCK WAS GOING BY ITSELF HE SAID IT SEEMED AS IF THE MOTOR WAS TURNING BUT WITHOUT THE TRUCK BEING ON AND HE KEPT STEPING ON THE GAS AND THE TRUCK SEEMED TO BEING GOING AT THE SAME SPEED WE WERE GOING AT ABOUT 70 MILES THE TRUCK IS STANDARD AND THEN ALL A SUDDEN HE TURNED TO ME AND ASKED ME IF WE WERE IN A DREAM AND I SAID NO (I THOUGHT HE JUST WANTED ATTENTION) ALL THE TIME WE WERE TRAVELING I WAS THINKING TO MYSELF THAT IF I SHOULD HAVE GONE BACK TO HIM SINCE WE WERE RECENTLY SEPERATED WE WERE ON OUR WAY TO PICK UP SOME FURNITURE THAT I HAD IN LOVINGTON, NM IM A LOVINGTON NEW MEXICO RESIDENT BORN AND RAISED THERE SO ANYWAYS HE ASKED ME TO PINCH HIM ON HIS HAND TO SEE IF WE WERE NOT DREAMING (I THOUGHT NOW HE REALLY WANTS ATTENTION) AND HE ASKED ME IF HE CAN PINCH ME ON MY HAND AND I SAID YEAH WHY? BEFORE HE SAID ANYTHING HE PINCHED ME AND OF COURSE IT HURT AND I SAID OUCH! AND I SAID WHAT IS WRONG? AND THEN HE SAID DONT BE AFRAID HE SAID ON MY LEFT SIDE LOOK SLOWLY OUT THE WINDOW AND HE SAID TO ME AM I SEEING THINGS OR WHATEVER IS OUT THE WINDOW IS IT REALLY THERE? AND I LOOKED AND SURE ENOUGH THERE WAS A SILVER DISK FLOATING NEXT TO US AS WE WERE TRAVELING IT SEEMED TO BE LOOKING AT US AS IT FOLLOWED US SLOWLY HE TOLD ME AS WE CAME TO A CURVE MAKE SURE I DONT LOSE SIGHT OF IT AS HE PAID ATTENTION TO THE ROAD IT SEEMED TO GO IN FRONT OF US AND WITHIN SECONDS IT DISAPPEARED AND WE WERE AMAZED AND SPEECHLESS AND WE SAID TO ONE ANOTHER I WONDER WHAT THAT WAS AS WE NEARED MALJAMAR ON TOP OF THE MOUNTAINS OF CAPROCK I SPOTED ANOTHER SHIP (I DONT THINK IT WAS THE SAME ONE) A MUCH BIGGER IT WAS MOVING ACROSS THE MOUNTAIN SLOWLY THIS SHIP SEEMED TO HAVE SOME SILVER PURPLEISH COLOR AND IT ALSO DISAPPEARED AFTER A FEW MINUTES OF LOOKING AT IT MAYBE THREE MINUTES THREE TO FIVE MINUTES (I THINK) AFTER IT DISAPPEARED WE CAME UPON THE CURVE OF MALJAMAR ON TOP OF THE CURVE OF MALJAMAR TO THE LEFT SIDE WE CAME UPON A VERY HUGE SHIP!!! IT WAS A PALE COLOR LIGHTER THAN GRAY AND IT WAS FLOATING OR SUSPENDED IN THE AIR A FEW FEET OFF THE GROUND AND MY HUSBAND WAS SCARED! I ASKED HIM TO PULL OVER SO WE CAN LOOK AT IT AND HE SAID NO HE DID SLOW DOWN WE STUDIED THE SHIP FOR A MINUTE OR TWO AND IT DISAPPEARED AND WE DROVE TO LOVINGTON CONFUSED AND SPEECHLESS AND WE LOST AN HOUR OF TIME HE ALSO WAS MAD AT ME BECAUSE HE SAID THAT I HAD TOLD HIM THAT FROM ARTESIA TO LOVINGTON IS 65 MILES AND WE TOOK TWO HOURS TO GET THERE AND HE DID NOT WANT TO TALK ABOUT THE INCIDENT ANY LONGER AND UP TO THIS DAY WHENEVER I SEE HIM HE DOES NOT WANT TO TALK OR MENSION ANYTHING ABOUT IT. WHAT I SAW WAS REAL MY FAMILY LAUGHS AT ME AND MAKES JOKES. BUT TO ME IT WAS THE MOST AMAZING THING ON EARTH I HAVE EVER SEEN, FOR THE SHIP WAS VERY HUGE! THERE IS A LITTLE MORE TO MY STORY BUT ILL LEAVE THESE WORDS FOR NOW UNSPOKEN. THE UNSPOKEN WORDS ARE OF DREAMS AND GOING INTO THE OCEAN IN STRANGE SHIPS. BUT THIS IS ALL FOR NOW. I DO PLAN TO WRITE A BOOK ABOUT IT, BUT I AM NOT A GOOD WRITER. I BELIEVE WE ARE NOT ALONE."],"trends":["There have been no other sightings in LOCO HILLS","This sighting has never been favorited."],"Log Number":"US-11122007-0011","City":"LOCO HILLS","Source":"MUFON","Object Flight Path":"Undisclosed","Case Number":"8335","Tags":"City","Longitude":"-103.97773","map":"<A HREF = \"http://maps.google.com/maps?q=32.819006,+-103.97773(8335)&iwloc=A&hl=en\"> mufon case (8335) map </A>","Summary":"I SAW 3 DIFFRENT UFOS ,HUSBAND AND WERE COMING EL PASO CAME THRU ARTESIA N.M THRU LOCO HILLS WHERE SIGHTING STARTED A LITTLE AFTER LOCO HILLS FINISHED IN MALJAMAR N.M","Region":"New Mexico","files":["/var/www/straped/mufon/html2text/8335.html.txt","/var/www/straped/mufon/org/8335.html"],"Object Features":"Undisclosed","Date Submitted":"06/07/1992 01:00 UTC","Object Shape":"Disc","Latitude":"32.819006","Date of the Event":"06/07/1992 01:00 UTC","Viewing Distance":"Unknown","Country":"United States","Sighting Duration":"00:20:00"}