{"Object Shape":"Disc","Viewing Distance":"Unknown","trends":["There have been 36 other sightings in Henderson","There were no other sightings in Henderson on or around September 15th 1987"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.048985,+-114.974091(8336)&iwloc=A&hl=en\"> mufon case (8336) map </A>","Disposition":"Insufficient Data","Summary":"I looked up and saw a circle above my house one moment, the next it was gone.","Region":"Nevada","Case Number":"8336","City":"Henderson","Longitude":"-114.974091","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Stationary","Date of the Event":"09/15/1987 07:45 UTC","Latitude":"36.048985","divs":["Sighting DetailsI walked out to my car to go to work, it was probably about 7:30 or 8:00am; the sky was blue and very clear. As I walked through the yard to get to my car parked in the street, I glanced up in the sky above me and saw a round object sitting perfectly still very high above. I remember the object having a shiny silver color and I also remember seeing detail underneath. From my perspective it appeared to be the size of a nickel or a quarter, but very high. The object disappeared almost immediately, it did not fly away, it just vanished; it almost looked like \"oops, he saw us.\" I did a double take while I continued to the car, the object was not there. I got in, drove to work and continued my day like nothing had happened. I can't remember very much because this happened so long ago. What's bothering me is the fact that I suppressed the memory. I don't know why so many years later the memory has returned and it is stuck in my head as though it happened yesterday. I remember around that time having an abduction type nightmare. I accepted the dream that night as having been a bad dream and nothing more, and the memories of that nightmare never left me so I'm not as bothered by the nightmare as I am by the silver circle in the sky. The object above the house was real and my recent memory of it has me wondering if I'm going nuts (lol). I have recently been reading up on UFO stories and trying to find similar stories on-line. I read where people have gone to psychiatrist and the therapist have brought up suppressed memories. I have also heard reports on talk shows and news reports of therapist bringing up suppressed memories of abuse cases. I have not been to a therapist and have not discussed my recent recollection with anybody whatsoever. This is the first time I am talking about it and it is only because I stubled across a site that asked me to tell the story."],"Log Number":"US-11122007-0012","Country":"United States","Object Features":"Other","files":["/var/www/straped/mufon/html2text/8336.html.txt","/var/www/straped/mufon/org/8336.html"],"Date Submitted":"09/15/1987 07:45 UTC"}