{"Object Shape":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Case Number":"8340","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been 2 other sightings in Belvidere","There were no other sightings in Belvidere on or around January 31st 2007"],"Sighting Duration":"Undisclosed","Longitude":"-88.842107","Weather Factors":"None","Date Submitted":"01/31/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.26965,+-88.842107(8340)&iwloc=A&hl=en\"> mufon case (8340) map </A>","City":"Belvidere","Latitude":"42.26965","Date of the Event":"01/31/2007 12:00 UTC","Tags":"City","Log Number":"US-11132007-0004","Summary":"Two lights go over me","divs":["Sighting DetailsI was working on the Chrysler plant in Belvidere, IL at night moving cars from the plant to a large staging area ( parking lot ) on the grounds. I watched two lights go over me toward the airport in Rockford. What I can not explain is the following: First, the two lights were horizontal traveling toward the west to Rockford. Then as they headed away they did something that I will not forget ever in my life. They two lights began to rotate to the vertical, this was what they looked like before: a) * * And this is what they looked like after: b) * * They rotated from the \"a\" counter clockwise to the \"b\" position with the left side light dipping first. And then the lights started to spread out at the same time ! so when it got to the vertical, they were 3 times or more spread farther apart! I then pointed to the lights as the little van came to pick me up and a few guys asked what the hell I was doing pointing up in the air like that! And I let them know what I saw. Now, the UPS has a hub out there and a lot of their flights come over the plant in the middle of the night and I see the jets come over all the time, you hear them as they come in and as they head out to Chicago. I was just standing around in the cold, waiting for the little van to come and pick me up when I happened to look up at the lights when I seen the two lights. I was in awe of what I seen. And as a person who likes Sci-Fi, I think I was lucky enuff to see the two lights do what they did, with no sound at all."],"Region":"Illinois","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/8340.html.txt","/var/www/straped/mufon/org/8340.html"],"Country":"United States"}