{"Source":"MUFON","Weather Factors":"Unknown","Date of the Event":"11/11/2007 02:30 UTC","City":"New York","files":["/var/www/straped/mufon/html2text/8343.html.txt","/var/www/straped/mufon/org/8343.html"],"Disposition":"Unresolved","divs":["Sighting DetailsI was on my way to a wedding with my brother-in-law who was to be the father of the groom. We needed to get to a part of Queens and I decided to take Bay Parkway in Brooklyn to get to the Belt Parkway. When we were still yet a very good distance from the Belt Pkwy. when my brother-in-law Frank asked me what that was while pointing ahead up towards the sky. At first I found it hard to see, but thought that it was an air plane that would come into better view soon, but it never did. It was high up and just hovering. Then Frank thought it was a kite, but I knew it wasn't. Too high up and no distinguishing formation. It look like a silver metal ball that was reflecting the sunlight, but when we got really close we could see that it was emitting its own light and had lights around the center and was luminous. I didn't stay to continue to watch it cause I thought we would be late. I even had a camera and failed to take the picture. It was quite a treat to share with my brother-in-law. I remember Frank saying that he expected as we got closer to see a string hanging from it cause he thought from a distance back on the road that it was a kite, and was really bugging out when he didn't see one and began to see the luminous lights around its center. I don't think anyone even noticed or paid any attention to it. Thank You, Charlie It was over the water I would say, where Shore Road is near Cesar's Bay Bazar, and we were going South on Bay Parkway when we saw it."],"Object Features":"Undisclosed","Tags":"City","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Longitude":"-73.94207","Object Shape":"Sphere","Object Flight Path":"Stationary,Hovering then path","Summary":"Silver Metallic luminous lights around center and hovering","Date Submitted":"11/11/2007 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.65787,+-73.94207(8343)&iwloc=A&hl=en\"> mufon case (8343) map </A>","Latitude":"40.65787","Region":"New York","Case Number":"8343","Sighting Duration":"Undisclosed","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around November 11th 2007"],"Log Number":"US-11132007-0007"}