{"Region":"Nevada","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"We saw a lighted object that flew erratically","Latitude":"39.476342","Longitude":"-118.777143","Date of the Event":"10/29/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.476342,+-118.777143(8345)&iwloc=A&hl=en\"> mufon case (8345) map </A>","divs":["Sighting DetailsMy friend and I were coming home from the backsides of Fallon Naval Air Station. We had been XRaying jets for the Navy farther out in the desert. As we got into the vehicle we use for transport, we saw a bright oval shaped object in the air directly in front of us. Well working on the flight line for 25 years we are used to such, but this one looked funny, and my friend and myself are both pilots, so what happened next was bizarre. As we watched for a good 5 minutes, this object scooted about the sky doing impossible flying, (or so I thought up until now) moving thousands of feet in split seconds. Although we were relatively close, we could hear no sound either. As this sighting came to a close, this object accelerated to the left at about 45 degrees and just disappeared in a streak of light. We both looked at each other and laughed, of course the old joke about \"I didn't see anything\" \"You see anything?\" Later, we, and especially me was excited. I had finally seen a UFO."],"Object Features":"Unknown","City":"Fallon","Log Number":"US-11132007-0009","files":["/var/www/straped/mufon/html2text/8345.html.txt","/var/www/straped/mufon/org/8345.html"],"Case Number":"8345","Weather Factors":"None, Does Not Apply","Object Shape":"Oval","Tags":"City","trends":["There have been 4 other sightings in Fallon","There were no other sightings in Fallon on or around October 29th 2007"],"Date Submitted":"10/29/2007 12:00 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Straight-line path,Path with directional change,Path then hovering","Country":"United States","Disposition":"Insufficient Data"}