{"Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Windy","Log Number":"US-11132007-0011","divs":["Sighting DetailsI was taking photos of a storm that was moving into the area. I was standing in a WalMart parking lot in Downers Grove, IL. I did not load these photos onto my computer until a couple of months later. When I was loking at the photos I noticed something on one of them and my first thought was, \"What is that?\" I zoomed in on the object and it is definitely not a bird or an airplane. I will submit the photo to you for you to look at. I have submitted it to NUFORC before. I just found this website and thought I would submit it to you. This is not my first experience of sightings. I could tell you many stories my family and I have had with sightings of UFO's. There have been some I would give anything to be able to go back and experience and have a camera with me to catch it on film. The photo I will attach will be normal and an inverted one. The inverted one will show the UFO in white against the dark sky."],"Date of the Event":"05/15/2007 05:00 UTC","Object Flight Path":"Unknown","Latitude":"41.814079","Longitude":"-88.002795","Date Submitted":"05/15/2007 05:00 UTC","Object Features":"None","Summary":"Captured UFO unknowingly while taking photos of storm clouds","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/8347.html.txt","/var/www/straped/mufon/more/8347_submitter_file1__P1010056.JPG","/var/www/straped/mufon/more/8347_submitter_file2__P1010056inverted.JPG","/var/www/straped/mufon/org/8347.html"],"Object Shape":"Cigar","Region":"Illinois","Tags":"City","Case Number":"8347","trends":["There have been 3 other sightings in Downers Grove","There were no other sightings in Downers Grove on or around May 15th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.814079,+-88.002795(8347)&iwloc=A&hl=en\"> mufon case (8347) map </A>","City":"Downers Grove"}