{"divs":["Sighting DetailsI was walking the dog, alone. I noticed overhead what I initially thought was a plane (local airport is nearby) but realized it was too big and too silent. If the plane were that large, it would have been very loud. There was no noise. So I looked more closely. I noticed what seemed like square panels of light on what I thought ws the bottom of the flying object. I do not think they were blinking, but can't be sure. It was directly overheard,but seemed very high up (not close to me, or the trees). It sped away very quickly. As it moved away I 1) started running trying to follow it and 2) as it got farther away, I thought, is that a bird soaring? For a bit I thought maybe I was really confused and a bird was soaring overhead being lit up by the street. I was trying to put it in some real context, figure out what it was, what I was seeing. But I am sure it wasn't a bird, it shot away so fast -- it was big overhead and then in the course of a minute was minute (as in tiny)... as it seemingly flew south. Because there was no real way to judge distance, the only thing that was remarkable was how quickly it grew small in the sky, but it wasn't shrinking. I am fairly sure it was flying due south. I knew it was a UFO and was not scared, only excited. It was so very real, I started running, with the dog on the leash looking up to the sky. I was running with a grin on my face, as it seemed so 1)safe and 2)extra terrestrial. It grew dim and small so fast, I tried to keep my eye on it -- but it was dark, I had the dog on the leash and I had to slow down and look down. It was then that I lost sight of it. It was such a brief period of time, but I knew what I saw and came home and promptly told my family that I'd seen a UFO. I am 50 years old, a very sane, employed female."],"Viewing Distance":"Unknown","Country":"United States","trends":["There have been 16 other sightings in Englewood","There were no other sightings in Englewood on or around November 4th 2007"],"Object Shape":"Boomerang","Region":"Colorado","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/8349.html.txt","/var/www/straped/mufon/org/8349.html"],"Date Submitted":"11/04/2007 12:00 UTC","Disposition":"Unresolved","Longitude":"-104.98244","Case Number":"8349","map":"<A HREF = \"http://maps.google.com/maps?q=39.648815,+-104.98244(8349)&iwloc=A&hl=en\"> mufon case (8349) map </A>","Summary":"evening siting of silent boomerang shaped lighted object overhead","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"39.648815","City":"Englewood","Date of the Event":"11/04/2007 12:00 UTC","Object Features":"None","Log Number":"US-11132007-0013","Source":"MUFON","Tags":"City"}