{"Disposition":"Insufficient Data","Viewing Distance":"21-100 Feet","Tags":"City","Sighting Duration":"Undisclosed","City":"Loch Sheldrake","Longitude":"-74.651153","Date of the Event":"02/28/1997 12:00 UTC","Summary":"Round Objects in the sky","Object Features":"Window(s)","Region":"New York","Latitude":"41.77153","Country":"United States","trends":["There have been no other sightings in Loch Sheldrake","This sighting has never been favorited."],"Case Number":"8350","Weather Factors":"Unknown","Source":"MUFON","Object Shape":"Other","divs":["Sighting DetailsI was outside around 4 pm in the afternoon, taking down clothes, as I was walking around to the front of the house. My daughter who was then about 7 years old, told me there was something wrong with her eyes because she kept seeing spots in front of them. I humored her and looked to the sky and there were four round objects in the sky. You could see little windows in them. I dropped the laundry basket and said \"What the hell is that?\"They were flying above the tree tops, with no noise.They were flying very fast. My daughter replied \"I told you I was seeing spots in front of my eyes\" I told my daughter to go get her brother as no one would believe me and think I was crazy. As I was watching them I was reasoning that it could not be birds as the sun would not reflect off of them.They could not be planes as they were silent and skimmed the tops of the trees. Suddenly as we were all watching them. Three of them went to form a point for a triangle, the fourth one was on the side flying along. We looked back to the spot where we first spotted them and there were six more of them flying along without sound. We watched them as they formed a diamond with four of them at each point and two on each side. I was trying to rationalize what I had just seen. Weather balloons cannot make shapes in the sky. We were all in shock of seeing these little circles in the sky. We finally watched them until you could no longer see them in the sky. I am sorry to say that we have no pictures or recordings of it."],"Log Number":"US-11132007-0014","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=41.77153,+-74.651153(8350)&iwloc=A&hl=en\"> mufon case (8350) map </A>","files":["/var/www/straped/mufon/html2text/8350.html.txt","/var/www/straped/mufon/org/8350.html"],"Date Submitted":"02/28/1997 12:00 UTC"}