{"Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Longitude":"-99.131618","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8351.html.txt","/var/www/straped/mufon/more/8351_submitter_file1__Picture015.jpg","/var/www/straped/mufon/more/8351_submitter_file2__Picture020.jpg","/var/www/straped/mufon/more/8351_submitter_file3__Picture100.jpg","/var/www/straped/mufon/org/8351.html"],"Latitude":"19.435938","Weather Factors":"Unknown","Log Number":"MX-11132007-0015","Disposition":"Unresolved","Region":"Distrito Federal","City":"Mexico City","map":"<A HREF = \"http://maps.google.com/maps?q=19.435938,+-99.131618(8351)&iwloc=A&hl=en\"> mufon case (8351) map </A>","Country":"Mexico","Date of the Event":"11/09/2007 11:25 UTC","divs":["Sighting DetailsMy wife was in Mexico City at the Teotihuacan pyramids at 11:25 and was just taking random pics of the pyramids, this was on November 9, 2007. She realized nothing at the time, only noticed when uploaded pics to computer (pics 15 & 20). On November 11, my wife was walking through Tequisquiapan at 16:45 and was taking pictures of the monolith. At the time she was taking the pictures she didn't see anything unusual and again only noticed when uploaded pics to computer(pic 100). I believe these objects are the all the same object even though it was two different days. I was just wondering if you had any idea on what you think they might be. I find picture # 100 is the best for clarity. There all hard to see and must be zoomed in, but once there zoomed in there quite clear. The reason i first noticed is because on picture # 100 theres a black circle and above the spot i saw a bright blue spec, this one is the only picture with the black circle. If you find these pictures of interest i have more of the same object. Thank you"],"Tags":"City","Source":"MUFON","Summary":"Not Provided","Object Shape":"Cross, Oval","trends":["There have been 23 other sightings in Mexico City","There were no other sightings in Mexico City on or around November 9th 2007","This sighting has never been favorited.",""],"Date Submitted":"11/09/2007 11:25 UTC","Case Number":"8351","Object Flight Path":"Undisclosed"}