{"Summary":"two sightings in one evening","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8353.html.txt","/var/www/straped/mufon/org/8353.html"],"Region":"Florida","map":"<A HREF = \"http://maps.google.com/maps?q=28.60494,+-81.330375(8353)&iwloc=A&hl=en\"> mufon case (8353) map </A>","Log Number":"US-11132007-0017","Object Flight Path":"Hovering then path,Straight-line path","Case Number":"8353","Tags":"City","Country":"United States","Longitude":"-81.330375","Date Submitted":"11/13/2007 09:32 UTC","Date of the Event":"11/13/2007 09:32 UTC","trends":["There have been 10 other sightings in Winter Park","There were no other sightings in Winter Park on or around November 13th 2007"],"Viewing Distance":"Unknown","divs":["Sighting Detailswhile looking at the stars, on my patio, suddenly i saw a long, brightly lit, white lighted, elongated, cigar shaped object,(solid), appear from nowhere, flashing across the sky, lasting about a second, ... completely silent, passing into a cloud, and not emerging from behind it, where i lost sight of it. it appeared from a point of north-east, heading south-west.. when the thing first emerged out of nowhere, i was stunned, as it was too low and too fast and too silent for an airplane,... yet i could clearly see its shape. Earlier this evening, while also looking at the stars, i was looking at a triangular star constellation that appears every night in the sky, and i call it \"the little kite\" (i am not an astronomer, so i call it what it looks like); then, i looked away for a moment; then, when i looked back at the little kite, i suddenly saw a fourth star within its triangle- line, wondering how that could be, whereof the fourth star suddenly began moving and at the approximate speed of an airplane, yet completely silently; it too came from north-east, heading south-west; ..i was following the little \"star\" intently with my eyes, realizing stars don't travel across the sky, leaving their constellation... the sighting lasted about 15 seconds, at which point i lost sight of it due to distance. something strange is going on in the skies... also, there is a very bright star showing up lately every night here, flashing lights of a very light bright blue, followed by bursts of orange and white... sometimes the orange is a red; ..it is very energetic and no other star does that (which is why i am compelled to watch it every night); i don't know what it is, maybe a satelite? it is not a star, as it flashes vivid colors like no other star; it also moves its position, but very slowly; -what is it? it's position from the front of my house is north-east."],"Source":"MUFON","Object Shape":"Cigar, Flash","Weather Factors":"None","Disposition":"Unresolved","Object Features":"Window(s), Other","City":"Winter Park","Latitude":"28.60494"}