{"Date of the Event":"11/13/2007 07:40 UTC","Source":"MUFON","Country":"United States","Log Number":"US-11132007-0018","City":"Harbor Beach 6 Miles Away","divs":["sighting detailsi am a mufon member. i reported another observation a few years ago of an object i observed in 2\\1966. as i was driving home, easterly, and about .5 miles from my driveway, i observed a cluster of intense lights to the nw of my position. moving to the se. thought at first it was an aircraft, but it had r\\g\\b lights. not the usual r\\g\\w of aircraft. when i pulled into my driveway i was going to run into the house to get my binoculars. but as soon as i got out of my car, i saw it was right behind my house, above the woods. it was moving silently to the ne at maybe 15 mph. i estimate it was no more than 100 yards away. hard to judge height because it was so dark. my guess was it was well below the 500 foot faa minimum. i observed it for approximately 20 seconds before i decided to make a dash for the binoculars. even though they were right inside my back door, when i returned with the binoculars the object was gone. the lights were in a chevron shaped configuration. instead of jumping back into the car, i ran down the road about 100 yards to see around the woods. i saw it in the distance, but it was too far away to see any detail even with the binoculars. within a minute i heard the sound of a jet going into re-heat to the se of me. wether it was an aircraft scrambled to intercept, or on normal maneuvers, i do not know. they do use the area over lake huron to the east for mock combat, but in 3 years living here i never heard or saw them do it in the dark. only during daylight hours. i live in an area that is fairly unpopulated. nearest occupied home is about .5 miles from me. at the time there was no moon, but mostly clear skies. very little, if any ,ambient light in the area. it was quite black out. wind was from the sw at 10-15 mph. if the b light was in front of craft,the direction of flight,then the r\\g light position were opposite of what they should be on normal aircraft. no local airports within 20 miles of my house. i am fairly sure the closest is a vfr airport with no operational night lights. after i settled my nerves, i timed and retraced my movements to get the total time of the event. i think about 1 minute of the total time was what i spent actually looking at the object."],"Case Number":"8354","Weather Factors":"Windy","trends":["There have been no other sightings in Harbor Beach 6 Miles Away","This sighting has never been favorited."],"Object Flight Path":"Path with directional change","Date Submitted":"11/13/2007 07:40 UTC","Object Features":"None","Object Shape":"Chevron","Tags":"City","Summary":"Observed Chevron Shaped Object With R/G/B Lights Moving Slowly at Close Range","map":"<A HREF = \"http://maps.google.com/maps?q=44.323124,+-85.599234(8354)&iwloc=A&hl=en\"> mufon case (8354) map </A>","Viewing Distance":"101-500 Feet, Over 1 Mile","Disposition":"Unknown","Sighting Duration":"00:02:30","Latitude":"44.323124","files":["/var/www/straped/mufon/html2text/8354.html.txt","/var/www/straped/mufon/org/8354.html"],"Region":"Michigan","Longitude":"-85.599234"}