{"Region":"Illinois","files":["/var/www/straped/mufon/html2text/8360.html.txt","/var/www/straped/mufon/org/8360.html"],"Weather Factors":"None","Case Number":"8360","divs":["Sighting DetailsI was on my way home, about 11:45 pm, after attending an outstate (non-UFO) event. I was only about five minutes from home, traveling north, in a residential area, when I noticed a very bright light approaching from a northeasterly direction. It caught my eye because it seemed much brighter than an airplane, and it was obviously not a planet (too big and too close). Only a minute or two later, it was suddenly on my right, moving soundlessly and very slowly, at almost eye level as I bent down slightly to watch it out of my righthand window. It was much, much too low, and moving too slowly, to be a plane coming in for a landing; Rockford's airport is on the very southern edge of town, and I was in the northern part of town. I continued on for a few seconds before the enormity of what had happened sank in and then I pulled over, stopped and looked out my rear window to see if I could still see it, but it was gone. It all happened very quickly, but it was unmistakably a UFO. It was black, a triangle shape, with bright white lights on the underside. There were no red lights or blinking lights. My mind was very still and I experienced no fear, but afterwards I had the strange feeling that it was there at that moment on purpose, wanting me to see it. My car experienced no electrical effects that I am aware of (I did not have my radio on) during or after the experience, but I felt a heightened sensation within myself. My feeling is that it was very benevolent."],"Object Shape":"Triangle","Country":"United States","Summary":"Black, triangular object with white lights on the bottom, low in the sky, moving slowly with no sound","map":"<A HREF = \"http://maps.google.com/maps?q=42.274901,+-89.090535(8360)&iwloc=A&hl=en\"> mufon case (8360) map </A>","City":"Rockford","Log Number":"US-11142007-0006","Latitude":"42.274901","Date Submitted":"10/29/2007 11:45 UTC","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","Source":"MUFON","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Unknown","Date of the Event":"10/29/2007 11:45 UTC","trends":["There have been 20 other sightings in Rockford","There were no other sightings in Rockford on or around October 29th 2007"],"Object Features":"Undisclosed","Longitude":"-89.090535"}