{"files":["/var/www/straped/mufon/html2text/8361.html.txt","/var/www/straped/mufon/org/8361.html"],"divs":["Sighting Details A freind and I were returning home from a night out, the road to his place ran underneath the 'approach' for planes to land at (then)Carswell AFB. We saw what we thought were 2 red lights of a B-52 flying from right to left across the road. All of a sudden, as we were getting closer to the plane, the lights stopped in thier tracks and began flying back, this time from the left to the right. We had the windows down, and the only thing wqe could hear were the winds blowing inside the3 truck. We stopped along the road, to our left was a deep and wide canyon that a fork of Eagle Mountian Lake winded down. We stepped out of the vehicle only to see the lights circling, dancing playfully around each other. We were in Awww, and the only thing we could hear were the crickets alnong the road. As we were parked there, 2 friends from High School stopped, one jumped out and shouted, 'See, I told you!' Us 4 just standed there with mouths wide open in disbelief. The lights, one flahing red, one solid red, floated above, towars us, back out above the canyon as if they were observing us. This lasted about 10-15 minutes, then the lights 'packed up' and began drifting over our shoulders and slowly back towards the NE. We attempted to follow down backroads, but it seemd they graqdually picked up speed as if they were leaving for another destination. I was 'exstatic', I was SO amazed and happy that we had witnessed such an event. I HAD to do something, tell somebody, so I called Meacham Field and asked if there were any reports similar to ours. They said there was nothing out of the ordinary going on, so, though I 'burned' to tell someone that may have answers, I had nobody to tell or ask. Of course, the next day, I was ridiculed and the other 3 remained tight-lipped from then on. At footabll practice, a helicopter flew low over the team, the head coach laughed and said, 'That must've been Montgomery's UFO', the rest of the team busted out laughing at me, but I pleaded, 'I know what I saw!'. One of the things that happened the next few days that supported our 'sighting' was an apparant sighting of 4 red UFOs in France that forced down and airplane for a while. The description was eerily like ours, and recently, I've seen other accounts of UFOs from this time, around AFBs and described as the same thing we saw that night. I'm VERY interested in becoming involved with your sites and groups, please contact me if you wish. Thank you, Kirk PS, and PLEASE write or call if you'd like to ask any questions or anything."],"Longitude":"-97.31612","Object Shape":"Flash, Star-like","Region":"Texas","Object Features":"None","Country":"United States","Disposition":"Unknown","Tags":"City","Log Number":"US-11142007-0007","Object Flight Path":"Hovering then path","City":"Fort Worth","map":"<A HREF = \"http://maps.google.com/maps?q=32.730259,+-97.31612(8361)&iwloc=A&hl=en\"> mufon case (8361) map </A>","Date of the Event":"10/15/1980 10:00 UTC","Sighting Duration":"00:15:00","Latitude":"32.730259","Source":"MUFON","Viewing Distance":"101-500 Feet","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around October 15th 1980"],"Case Number":"8361","Weather Factors":"None","Date Submitted":"10/15/1980 10:00 UTC","Summary":"Two Red orbs (one flashing, one not) dancing, floating, interracting out over the valley on approach to Carswell AFB"}