{"Object Features":"Other","Object Shape":"Fireball","trends":["There has been one other sighting in Chisholm","There were no other sightings in Chisholm on or around June 9th 2007"],"Object Flight Path":"Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Latitude":"47.493707","Longitude":"-92.880746","Country":"United States","Sighting Duration":"00:05:00","City":"Chisholm","Date of the Event":"06/09/2007 12:00 UTC","Disposition":"Insufficient Data","Date Submitted":"06/09/2007 12:00 UTC","Source":"MUFON","Summary":"Fireball moving horizontally, then arcing up and away until out of sight.","map":"<A HREF = \"http://maps.google.com/maps?q=47.493707,+-92.880746(8362)&iwloc=A&hl=en\"> mufon case (8362) map </A>","divs":["sighting detailstwo friends and i saw a large fireball - about the size of a large roll of hay (5'- 6' in diameter) moving horizontally over the city of chisholm, mn, at an altitude of about 150 - 200 feet. the fireball was moving so slow that we could make out flames licking off the fireball. we began to discuss what it could be, a meteor? nope moving too slow, and still not out yet. a jet? nope, jets have a pressurized flame, not a ball of fire. then the object moved at a slow arc up and away from us, and steadily increased its speed. it was gone within 20-30 seconds after that, as we watched it literally go \"up & out\". 1. we were camping in chisholm, mn for a united way ride. 2. it was a large fireball moving over the town, kinda hard not to notice. 3. either a meteor, or a jet\\missle, but it was fire, and it was moving too slowly. 4. as i said, a large fireball, initially moving horizontally, then arcing away, up and away. 5. we were not afraid, we were puzzled, and inquisitive. ot took a bit of discussion to become weirded out about the sighting, because none of us could explain it. 6. it gradually got so far away, it was hard to make out among the stars."],"files":["/var/www/straped/mufon/html2text/8362.html.txt","/var/www/straped/mufon/org/8362.html"],"Region":"Minnesota","Log Number":"US-11142007-0008","Tags":"City","Weather Factors":"Unknown","Case Number":"8362"}