{"Date Submitted":"04/11/1997 09:55 UTC","files":["/var/www/straped/mufon/html2text/8364.html.txt","/var/www/straped/mufon/org/8364.html"],"trends":[],"Date of the Event":"04/11/1997 09:55 UTC","Object Shape":"Triangle","Summary":"THREE ROUND WHITE LIGHTS","Region":"Manitoba","divs":["Sighting DetailsABOUT THIS TIME, CENTRAL , I WAS OUTSIDE THE HOUSE, ALONE, HAVING A CIGARETTE. I JUST LOOKED UP AND SAW THREE WHITE LIGHTS. BRIGHT THEN ANY OTHER STARS I EVER SAW.(CAN'T REMEBER IF THERE WERE STARS OUT THAT NIGHT) I STOOD QUIETLY AND NOTICED THAT ALL THREE LIGHTS WERE MOVING REAL, REAL SLOW, HEADING NORTH, AS IF THEY WERE ONE. I REMEBER THINKING, THIS IS IT, THIS IS WHAT A UFO LOOKS LIKE, I GOTTA TELL SOMEONE. I REALIZED THEN THAT A FEW MINUTES AGO, I HAD SAW A RELATIVE NEAR BY. I JUST LOOKED TO SEE IF THE RELATIVE WAS SEEING WHAT I WAS SEEING AND BY THE TIME I LOOKED BACK TO FIND IT, IT WAS GONE. THE RELATIVE WAS GONE TOO, BUT HAD JUST STEPPED BACK INTO THEIR HOME AND DID NOT SEE WHAT I HAD SAW. I FEEL TODAY, LIKE IT MUST OF KNEW THE EXACT TIME I WOULD LOOK AWAY. ANYWAY, AFTER IT WAS GONE, I HAD TO SECOND GUESS MYSELF AS TO WHAT I JUST SAW, LIKE, \"DID I JUST SEE THAT?\" THEN I SEARCHED FOR AN OUTLINE OF IT BUT COULDN'T TELL IF IT WAS STILL THERE, THE SKY WAS TOO DARK AND PLUS THERE WERE STREET LIGHTS NEAR BY. I'VE TOLD PEOPLE WHAT I SAW THAT NIGHT BUT THEY SMILE AND SAY \"OH! YEAH!\" I JUST FOUND THIS WEBSITE AND THOUGHT, WHY NOT TELL. THAT NIGHT I COULDN'T SLEEP IN MY BED, IN MY HOME, I WENT TO THE RELATIVE'S HOUSE AND TOLD WHAT I HAD JUST SAW, I TRIED TO DESCRIBE IT THEN, SAYING, IT'S A CIRCLE, NO-A RECTANGLE, NO-A DIAMOND, THE FINALLY I BLURTED, A TRIANGLE, THEN MY RELATIVE SAYS, YOUR ALREADY LYING, YOU CAN'T EVEN TELL ME THE RIGHT SHAPE. SO, I SAY 'CAN I SLEEP ON THE COUCH TONIGHT?\" AND I DID. EVEN TODAY, I DON'T LOOK UP IN THE SKY WHEN I WALK HOME. I SAW IT ONCE, DON'T NEED TO SEE IT AGAIN."],"Viewing Distance":"Unknown","City":"Undisclosed","Object Features":"Undisclosed","Case Number":"8364","Latitude":"53.760861","Source":"MUFON","Weather Factors":"Unknown","Log Number":"CA-11142007-0010","Country":"Canada","Longitude":"-98.813876","Object Flight Path":"Undisclosed","Tags":"City","Sighting Duration":"00:00:06","map":"<A HREF = \"http://maps.google.com/maps?q=53.760861,+-98.813876(8364)&iwloc=A&hl=en\"> mufon case (8364) map </A>","Disposition":"Unresolved"}