{"Region":"Texas","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Viewing Distance":"Over 1 Mile, Unknown","Tags":"City","Source":"MUFON","trends":["There have been no other sightings in Las Cruces, NM","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.485767,+-106.723464(8366)&iwloc=A&hl=en\"> mufon case (8366) map </A>","Summary":"Black changing shape and occasionally what looked like black haze around it.","divs":["Sighting DetailsI was walking east of the Franklin Mountains with my dog in my neighborhood in the northeast of my city. I was looking up at the sky and noticed a black object moving from east to west. It had a blackish haze surrounding it. The object kept changing shape from oblong and then a circle form and it kept repeating this sort of formation in changing shape. A few minutes later two jets came into sight from below the object, one from the northwest and the other from the southeast. The jets where very clear to see. The jets circled this object three times. The jets seemed to be staying with the object for about 4 minutes. A third jet then came from the west over the Franklin Mountains going east, it also was below the object. All this time the object kept moving to the west in the direction of the Franklin Mountains. I hurried home in about 8 minutes to get the attention of my mother. She went outside with me and she also saw the three jets and the object which was getting further away. I retrieved a pair of binoculars. My mom was able to focus on the object and this is what she saw. The object seemed to be made of at least three sections, the sections were moving causing the object to look oblong for a moment and then into a circle. During this time a black like haze was around the object. The haze would grow and dissipate and grow again. The object continued to move west until it was out of sight. Two of the jets went in the same direction with the object and still under it until the object and the two jets were out of sight. Both my mother and I tried to reason that it may have been some sort of balloon, but we can't explain the black like haze that seemed to be coming from the object. While neither I nor my mother are good a judging distance, the size of the object, considering the distance, was about the size of my finger, yet it seemed to be larger than the jets. It was just a very strange sight."],"Date of the Event":"11/14/2007 05:21 UTC","Date Submitted":"11/14/2007 05:21 UTC","Object Features":"Unknown","Log Number":"US-11142007-0012","files":["/var/www/straped/mufon/html2text/8366.html.txt","/var/www/straped/mufon/org/8366.html"],"Country":"US","Weather Factors":"None","Case Number":"8366","City":"Las Cruces, NM","Longitude":"-106.723464","Latitude":"32.485767","Object Shape":"Cigar, Circle, Oval, Sphere"}