{"Case Number":"8370","Sighting Duration":"Undisclosed","Latitude":"47.914496","map":"<A HREF = \"http://maps.google.com/maps?q=47.914496,+-122.094855(8370)&iwloc=A&hl=en\"> mufon case (8370) map </A>","Object Flight Path":"Stationary,Straight-line path,Path then hovering","Region":"Washington","Date of the Event":"11/30/1961 08:00 UTC","divs":["Sighting DetailsSometime during the school year of 1962-3 when I was 13-14 years old, my mother and I saw a UFO from the East window of our house at 231 Ave. D, Snohomish, WA. I was getting ready for school and I looked out the window to the East, toward the sky to see the weather. This was probably around 8 A.M. I am not sure of the time of year, however, I do know that on this particular day, it was already light outside and the sky was clear. I remember noticing what I thought was a bright star way up in the sky toward the S. East and wondering why there was a star shinning when the sun was already up. The object I was seeing was approximately the same size, shape and color of a bright, nighttime star, only it was not dark out at the time. I took a longer look to see exactly what this was, still thinking it had to be a star of some kind. Suddenly and with unimaginable speed, the object shot straight across the sky from its point in the S. East, to a new point in the N. East sky, stopping just as suddenly as it had taken off. After sitting perfectly still in the new location for a short while, the object once more shot at incredible speeds, straight toward a new location, this time in the S. East sky again, yet at a lower part of the sky than before. And like before, it stopped just as fast as it had shot across the sky. By this time I could not believe what I was seeing and called for my Mother to come look. From what I remember, we probably watched the object together for around 20 minutes. During this time, the object would either be sitting perfectly still in the sky, or it would be zooming in a straight line at mind-boggling speeds, to stop instantly at a new location again. I remember how amazed my Mother and I both were at what we were seeing. It was truly unbelivable how fast the object could go and how fast it could stop. My Mother finally had to leave for work and I started out for school. I could still see the object, but it was smaller now, like it was further up in the sky. I was hoping to show it to my Science teacher when I got to school, but it vanished before I could get there. I don't know what we saw that morning in 1962-3, but I realized then that whatever it was, it absolutely went much too fast for anything on Earth. If I were to see this same, or similar object, now, in 2007, I would still believe there was nothing from Earth that could possibly go so unbelievably fast across so much of the sky and stop so instantly too."],"Weather Factors":"None","Country":"United States","Disposition":"Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/8370.html.txt","/var/www/straped/mufon/org/8370.html"],"Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","trends":["There have been 9 other sightings in Snohomish","There were no other sightings in Snohomish on or around November 30th 1961"],"Date Submitted":"11/30/1961 08:00 UTC","Summary":"I saw a UFO shoot incredibly fast and straight across large portions of the sky and then stop instantly at a new location.","City":"Snohomish","Object Shape":"Star-like","Log Number":"US-11152007-0001","Object Features":"None","Longitude":"-122.094855"}