{"Tags":"City","Summary":"I saw 4 Jets pursuing a triangular object that moved sideways quickly then disappeared.","trends":["There have been 11 other sightings in Joplin","There were no other sightings in Joplin on or around November 15th 2007","This sighting has been favorited 1 time.",""],"Date of the Event":"11/15/2007 01:10 UTC","City":"Joplin","Case Number":"8372","Object Shape":"Triangle","Region":"Missouri","Source":"MUFON","Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"00:01:00","Object Features":"Unknown","divs":["Sighting DetailsAt 13:10 I was going home from work to have lunch. As I drove south of Joplin on Business 71 (Range Line Road in Joplin) I first noticed 4 jets with long contrails in the southern sky. This is not usual for this area and I am an aircraft enthusiast so it got my attention. I could not see the jets very well because they were so small in the sky, but I wondered why they would be moving so fast with what looked like their afterburners on full. I then turned to the left where they were headed and saw a triangular object that was at least 10 times bigger than the jets hovering in the South East sky. The object appeared to be like a pyramid on it's side, the top section or triangle was very reflective like it was made from a mirror. The other side I could see was dark gray and dull, it did not reflect very much light. When holding my arm straight out the object was the size of a dime in the sky. The point of the object was pointing South-to-South West. About 3 seconds after I saw the object it first looked like it fell down in the sky but I realized that what actually had happened was that the object moved south toward the horizon in less than half of a second. The total distance was about the length of my hand when holding my arm straight in front of me. While it moved south it also turned or rotated about 180 degrees. It was now pointing due East. About two seconds later the object just disappeared as if it blinked out of the sky, I did not see it fly away or go in any direction. After that the aircraft continued on their course. I looked away for a second or two and when I looked back up the contrails were gone and I could not make out the jets very well because of their small size. It appeared that they slowed down or turned off their afterburners to stop making the contrails. I watched this area for about two hours after this event to see if anything further would happen. I did not see the object again, however I did see at least 4 more jet aircraft crossing the sky in various directions the whole time. At 15:15 I stopped watching and there were still 3 aircraft leaving contrails crossing the sky in this area. They seemed to be looking for something. I am a trained observer; I have worked most of my life as a Paramedic, and a Police officer. I am also a storm watcher for my area and an ex-pilot. I have spent a lot of time looking at the sky. I know what I saw was not a balloon, commercial or military aircraft, cloud, or anything other than what it appeared to be. It appeared to be a metallic, intelligently controlled craft that maneuvers faster than a human body could withstand in G forces. I have included a computer drawing that I created to diagram the event as closely as possible."],"Longitude":"-94.513281","map":"<A HREF = \"http://maps.google.com/maps?q=37.084227,+-94.513281(8372)&iwloc=A&hl=en\"> mufon case (8372) map </A>","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8372.html.txt","/var/www/straped/mufon/more/8372_submitter_file1__UFOjoplinmo11_15_07.jpg","/var/www/straped/mufon/org/8372.html"],"Weather Factors":"None","Log Number":"US-11152007-0003","Date Submitted":"11/15/2007 01:10 UTC","Object Flight Path":"Hovering then path","Latitude":"37.084227"}