{"Object Flight Path":"Stationary","Object Features":"Other","Source":"MUFON","trends":["There have been no other sightings in Chilpancingo","This sighting has never been favorited."],"Latitude":"17.55","Object Shape":"Circle, Triangle","files":["/var/www/straped/mufon/html2text/8375.html.txt","/var/www/straped/mufon/org/8375.html"],"Date of the Event":"11/15/2007 05:00 UTC","Weather Factors":"Unknown","Sighting Duration":"02:00:00","Tags":"City","Longitude":"-99.5","Country":"Mexico","divs":["Sighting DetailsI couldent sleep well that nigh and upon my moms discovery of seeing a bright light in the middle of the night sky at around 5 a.m. I got out of bed and proceeded to take a look at it for myself.I was very surprised and convinced that it was a light bigger than any of the light from the city below and brighter than any of the stars around it at the tme i saw it 5:30 am the small dipper seemed to be above the bright object but the bright object seemed to be close but yet high up in the sky although it was atan easy eye glance.It gleamed a bright white color and seemed to be twinking ackwardly. The object remained still but moved as if it were pinned to a coordenate of some sort for as the day got brighter the light moved higher up into the sky until it lost its clear apearnace and became too small to see, although it could still be noticed that it was in the sky but almost impossible to notice. I was very excited to see the object for i beleive it to be my second UFO sighting and although nothing majorly spectacular happened with the object so as to see movement or lighting effects or such, I was motivated to log on the internet immediately and try to search for some kind of online telescope if it existed, to attempt seeing it closer but i did not find any that could be on the watch for the actual look out at the sky I had above me.I Searched some brief info on what to do if encountering a UFO sighting so i followed directions and began recording my observations on the brilliant object and took pictures along with it. I felt like reflecting a mirror at the light when it was still very bright and the night sky was darkbut i didnt find a smal enough mirror to carry twowards the window. Here are my recordings 06:15a.m.: Brilliant & twinkeling 06:25 a.m:The object seems to be moving higher as the day dawns.Smaller than a grain of sand 06:30 a.m: from the location higher up of my building fading a bit due to the brightness of the day 06:45 a.m. Object loses its clearness due to the morning light but it can still be distinguished by the naked eye. 06:50 a.m : Object has almost dissappeared of sight still static without movement but still gowing upwards as d=the day goeas brighter. 06:55 a.m :The object can hardly be noticed. Unfortunatelly I am unable to send the pictures for some reason it dosent want to download it to my computer but please forward me to know how i can send them to you later i have 26 pictures of my sighting at 2 different locations. Thankyou i would really like to know your point of view on this sighting starmaxforever@hotmail.com"],"Region":"Guerrero","Case Number":"8375","Summary":"white circular object of around a mostard seed size with a triangular aurea that surround it. The object stood still but moved ina vertical position as the day dawned as if it were in cordination with a coordenate at all time till it faded away.","Log Number":"MX-11162007-0001","Date Submitted":"11/15/2007 05:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=17.55,+-99.5(8375)&iwloc=A&hl=en\"> mufon case (8375) map </A>","Viewing Distance":"Over 1 Mile, Unknown","City":"Chilpancingo","Disposition":"Unresolved"}