{"Date Submitted":"11/14/2007 07:10 UTC","trends":["There have been 5 other sightings in Waycross","There was one other sighting in Waycross on or around November 14th 2007"],"Case Number":"8378","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=31.213551,+-82.354018(8378)&iwloc=A&hl=en\"> mufon case (8378) map </A>","Date of the Event":"11/14/2007 07:10 UTC","Disposition":"Hoax","Latitude":"31.213551","Country":"United States","Object Shape":"Square, Rectagular","Log Number":"US-11162007-0004","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/8378.html.txt","/var/www/straped/mufon/org/8378.html"],"Viewing Distance":"Unknown","Longitude":"-82.354018","Sighting Duration":"Undisclosed","Weather Factors":"None","Region":"Georgia","Summary":"4 to 5 lights,rectangular,Moves in the top of the tall trees.","divs":["Sighting DetailsThis thing came in from south east about 7pm wed night the 14th sorta from Jacksonville..It looked like a jet on fire fixing to crash.Instead it stopped in mid air leaned side ways and went down in the timber.A minute later it came back up moved around and lite it's self up. It done this 6 to 7 times.We got spooked and left. Thurday night we went back to same spot about 7pm my son spotted it in the trees it moved around lite up and showed out.It would stay within a mile of the tree horizon it was in atop the trees as it floated back and forth.You could actually see the timber behind the lights it lite up,but it was only about 3 miles from us at all times.We could have got closer but we didn't want to be to close.It's at least 50 yards wide where the array of lights are.The thickest it is 10 yards.My guess,along with others.One side of it has a huge red orange light that lites up then fades out after a few seconds.It's lights are never on over 10 seconds.It moves around in the timber atop the trees as if it's hunting something,or just stays under radar .But the way it goes down it goes in a clear cut close to the edge of the swamp or it's going down on the edge of the swamp edge,where timber ends and the praire grass begins. We have lots of clear cuts now with swamp being burnt.10 of thousand of acres of clear cuts."],"Source":"MUFON","City":"Waycross","Tags":"City"}