{"Log Number":"US-11172007-0002","Date Submitted":"11/16/2007 12:10 UTC","Longitude":"-85.685515","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"11/16/2007 12:10 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","divs":["Sighting DetailsI was sitting in my van smoking one last cigarette (before taking a nap) while waiting for newspapers to be brought at the whse. where I pick them up, listening to the radio and watching the incoming UPS jets come in to land at Standiford Field which is approx. 7-8 miles NW. I always joke that I'll never see anything in the sky because every night the sky is filled with them landing and later leaving all night long over me even when I deliver my route from Mt. washington through the western part of Spencer Co. My van was facing west and the flights as usual were stacked up 2 at a time coming in NW to the 2 main runways. I heard a helicopter coming which is not unusual as at that point we're 7-8 miles from Ft. knox or Standiford & Ky. Air national guard and stat flights pass over sometimes. I was an army brat so I've been around them all my life. What struck me was this chopper seemed a little louder than most and appeared to be dark or black but also had an intense red flasing strobe and was flying opposite the the incoming jets by going SE and later south. it was flying low well underneath the jets (maybe 500'). But at one point it passed over enough lit background that I could see a trailing object going the same speed but just a little higher. I thought it was another chopper but in that brief few seconds it appeared to be the shape of a black triangle a little bigger and a little longer than the chopper which seemed to be like but a little bigger than an Apache helicopter. I did a quick doubletake because of what I was seeing but it quickly went out of view and I assumed headed south with the helicopter. There was no sound to the object, no lights, no markings and both at the cruising speed of the helicopter. I tried to reason if I was seeing things because I could not figure out why that would happen like that other than if they wanted to sneak something by, I guess that was pretty damn good, possibly below radar and flight path but high enough under those conditions not to be seen except for the spot of sky it had just passed and I saw it. There is a doppler radar site less than 4 miles east of where I was but all anyone would see was the flashing red light of the helicopter. The helicopter did return but was approx. 10 miles away west of Shepherdsville and headed north towards Standiford pretty much the same direction it originated from with no way to tell if the other object was with it. I've heard of these before but didn't believe it. Now I know there's no telling what's up there that we just can't see them.I deliver pizzas in Shepherdsville every night, take a little break, then deliver a newspaper route so I'm on the road pretty much most of the night 7 days a week from 4:00 p.m. until I get done usually by 6:30 a.m. and I probably look up as much as I do the road and normally don't see any thing but big beautifull sky (and UPS flights)but this quick little happening caught me by surprise and makes me wonder if I really saw it. So if anyone else saw it or has any ideas, I'd probably feel a little more settled. Otherwise I can just add this to a few other odd things I've seen on the job and consider them to be bonuses. Regards, Will Mason"],"City":"Hillview","Case Number":"8382","Region":"Kentucky","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"unlit black triangle following but above lit helicopter","map":"<A HREF = \"http://maps.google.com/maps?q=38.069789,+-85.685515(8382)&iwloc=A&hl=en\"> mufon case (8382) map </A>","Latitude":"38.069789","trends":["There have been no other sightings in Hillview","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/8382.html.txt","/var/www/straped/mufon/org/8382.html"],"Tags":"City","Object Shape":"Triangle","Country":"United States"}