{"Case Number":"8389","Log Number":"US-11182007-0001","Viewing Distance":"Unknown","Country":"United States","Weather Factors":"Unknown","Date Submitted":"11/18/2007 12:29 UTC","Sighting Duration":"Undisclosed","Latitude":"36.857939","Source":"MUFON","Disposition":"Insufficient Data","Object Features":"Undisclosed","trends":["There have been 24 other sightings in Norfolk","There were no other sightings in Norfolk on or around"],"City":"Norfolk","files":["/var/www/straped/mufon/html2text/8389.html.txt","/var/www/straped/mufon/org/8389.html"],"Summary":"UFO filmed at Norfolk Naval Air Station air show, Norfolk, Virginia","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Disc","Date of the Event":"Unknown","divs":["Sighting DetailsUFO? Unknown aircraft? Government black ops? Analysis: Unknown 20 years of Naval Aviation and shooting aviation videos since 1983, this is a puzzler for me. I was going through some old footage during an edit session and found this artifact flying through the shot of the AV-8B Harrier jet. The video was shot at the Naval Air Station Norfolk, Virginia airshow several years ago. I was shooting from the control tower's walkway- really high up! At first I thought it was another aircraft flying in the background. If this is some kind of plane, the tail looking part is in the front,(!) not the rear. It doesn't appear to have any wings either.(?) I ran the tape at normal speed on the first clip. The second clip is 10% slow motion. Note: the momentary blur of the object is when it crosses behind the downward exhaust gases of the jet. The third clip is zoomed in on the object as it approaches the nose gear of the AV-B and is 10% slow motion. The fourth clip is a freeze frame. The fifth and last clip is from the freeze frame and processed as a photo(.jpg file) with Microsoft Digital Image Pro 9. To get better detail, I re-sized it to a larger size and increased the pixel count to 300, then converted it to black and white. I sharpened the image to 25 on a 100 scale. The last step was to apply contrast which really brought out the shape better. So...what the heck is this thing? See video"],"Longitude":"-76.279513","map":"<A HREF = \"http://maps.google.com/maps?q=36.857939,+-76.279513(8389)&iwloc=A&hl=en\"> mufon case (8389) map </A>","Region":"Virginia"}