{"divs":["sighting detailswe were at our annual father\\daughter camp out near lake wales, florida at the circle f dude ranch, heavily attend by vero beach residents. at 6:37 pm, my daughter, myself and more than 50 fathers and daughters(possibily up to 100 but not sure) whose cabins faced the lake, saw 2 lights in the dark, western sky hovering. very bright. could hardly tell shape - they looked like circles. the 2 then joined together and became 1, then split apart, became 3 objects. they hovered then joined, became 1, then split again into 4, rejoined into 1, then split into 5. at that point, they hovered, became one again and disappeared, reappearing about 10-15 seconds later - as 1. same bright intensity of light. suddenly the light was gone. waiting about 15 minutes and it never came back. my daughter tried to take a picture and we have 2 - one of which when light enhanced, shows 2 circular objects touching. the other shows obvious movement, which our daughter pointed was 2 then 3 lights. my husband is a former decomarate usmc and is 100% sure that he did not see either flares, aircraft or parachutists. (this was my husband and daughters 9th year). this event was witnessed by at least 50 fathers and daughters, many of whom were very scared. i can't atttach the photos now (technologically challenges with photo programs but will work on it."],"Log Number":"US-11182007-0005","Summary":"2 very bright lights hovering in sky joining into one, then split off into3 repeated up until 5","Date of the Event":"11/17/2007 06:37 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.909033,+-81.57895(8393)&iwloc=A&hl=en\"> mufon case (8393) map </A>","Source":"MUFON","Weather Factors":"None","City":"Lake Wales","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Disposition":"Unknown","Longitude":"-81.57895","Case Number":"8393","Object Shape":"Circle, Sphere","Tags":"City","Object Features":"Unknown","Country":"United States","Viewing Distance":"Over One Mile","Region":"Florida","trends":["There have been 9 other sightings in Lake Wales","There were no other sightings in Lake Wales on or around November 17th 2007","This sighting has never been favorited.",""],"Date Submitted":"11/17/2007 06:37 UTC","Latitude":"27.909033","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8393.html.txt","/var/www/straped/mufon/more/8393_submitter_file1__Mantell.jpg","/var/www/straped/mufon/more/8393_submitter_file2__Mantell2.JPG","/var/www/straped/mufon/org/8393.html"]}