{"Disposition":"Unknown","Object Features":"Unknown","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"10/19/2007 08:23 UTC","Log Number":"US-11182007-0006","Region":"Pennsylvania","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","Object Shape":"Circle, Star-like, Other","Weather Factors":"Does Not Apply","Case Number":"8394","Summary":"Bright Object Above Soccer Field With Plane above it","files":["/var/www/straped/mufon/html2text/8394.html.txt","/var/www/straped/mufon/more/8394_submitter_file1__220018476_733829252_0.jpeg","/var/www/straped/mufon/org/8394.html"],"City":"Philadelphia","divs":["Sighting DetailsI was sitting on the bleachers at my girlfriends soccer game when i kick went astray and the ball rolled off the field past and behind the bleachers. I turned around to follow the ball and out of the the corner of my eye I noticed a bright object hovering (seemingly) above the farther soccer field in the park. At first I thought its just a plane flying towards me but a few seconds later to the objects Northeast (assuming the top of the object is North on a compass) I noticed the signature flashing lights of a plane fly right past the object. The plane was incredibly small compared to the object that was hovering. I continued to watch the object for about 4 more minutes in which it did not move at all until it suddenly blinked out and I turned back to the game. It is interesting enough to note that the soccer fields are right across the street from an abandoned air base (which is now a retirement home complex)."],"Country":"United States","trends":["There have been 216 other sightings in Philadelphia","There were no other sightings in Philadelphia on or around October 19th 2007","This sighting has never been favorited.",""],"Longitude":"-75.160289","Date Submitted":"10/19/2007 08:23 UTC","Latitude":"39.956455","map":"<A HREF = \"http://maps.google.com/maps?q=39.956455,+-75.160289(8394)&iwloc=A&hl=en\"> mufon case (8394) map </A>"}