{"Source":"MUFON","Case Number":"8396","Longitude":"-69.975998","Object Features":"Undisclosed","Date Submitted":"11/18/2007 03:10 UTC","Viewing Distance":"Unknown","Disposition":"Unknown","Weather Factors":"Unknown","trends":["There have been 3 other sightings in Eastham","There was one other sighting in Eastham on or around November 18th 2007"],"Summary":"Stationary Disk that appeared like a second \"sun\"","Log Number":"US-11182007-0008","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.843667,+-69.975998(8396)&iwloc=A&hl=en\"> mufon case (8396) map </A>","Country":"United States","Object Shape":"Disc","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","City":"Eastham","Date of the Event":"11/18/2007 03:10 UTC","Region":"Massachusetts","Latitude":"41.843667","divs":["Sighting DetailsAs I was walking home from the grocery store in Allston, MA (a suburb of Boston), I looked up into the sky and was confused, for it appeared that there were two suns in the sky above me. In a split second I realized that the \"sun\" to the left of the real sun was a shining orb of light, the same size of the sun and bright enough to nearly equal that of the sun. I shaded my eyes to look at it for a few seconds. It was stationary (not moving) and it had what appeared to be part of a rainbow like band of orange and pink extending from it. I looked around me to see if anyone else noticed this or was looking up at the sky, but everyone was oblivious. I convinced myself that it must be a natural phenomenon and I crossed the street to deposit my groceries in my apartment. When I went out again approximately 15 minutes later and looked up at the same area of the sky, it was gone. What was this? Has anyone else reported this? What could it have been? I'm not a ufo watcher by any means, but I'm always looking at the sky - I have never seen any thing like this before."],"files":["/var/www/straped/mufon/html2text/8396.html.txt","/var/www/straped/mufon/org/8396.html"]}