{"Date of the Event":"11/18/2007 08:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.975445,+-93.997968(8398)&iwloc=A&hl=en\"> mufon case (8398) map </A>","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/8398.html.txt","/var/www/straped/mufon/org/8398.html"],"Tags":"City","Summary":"2 Gold Globes Glowing in sky, when finally moving lights motioned in chasing triangular pattern.","Longitude":"-93.997968","Sighting Duration":"00:07:00","Date Submitted":"11/18/2007 08:15 UTC","Latitude":"31.975445","City":"Logansport","Object Shape":"Sphere, Triangle","Region":"Louisiana","divs":["sighting detailsmy wife and i went out into our back yard and then looked up to the sky when the two of us saw these two gold globes in the sky. we began watching them and talking. objects were stationary for about 3 minutes. i ran into the house during that time while my wife stayed and watched. by the time i made it back outside my wife said something kind of like a flair fell from the higher one and disapeared a short distance from it. finally the the highest one began to disapear and then about 15 seconds later it came back into sight. the other did the same at a different time. the highest one then began to travel southwest to northeast across the louisiana\\texas border. it made it right overhead and then we noticed a light pattern on it that was like watching chaser lights going in a triangular pattern but with only three lights. the lower one had been dimming and brightening over and over again and then finally started to move. it was much slower than the higher one."],"Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","trends":["There has been one other sighting in Logansport","There were no other sightings in Logansport on or around November 18th 2007"],"Log Number":"US-11182007-0010","Case Number":"8398","Country":"United States","Object Features":"None"}