{"Source":"MUFON","Date Submitted":"11/18/2007 07:05 UTC","Region":"California","divs":["sighting detailswhile picking up an arriving passenger and driving away from the passenger loading area at the long beach airport, we saw a green light moving rapidly in the sky off to the right (and behind us) as we drove away from the airport. (\"off to the right and behind\" is from the driver's perspective.) we were still in the parking area, inside the streets within the airport complex. it appeared to be over the buildings adjacent to the airport, possibly ending its flight over the airport. we were exiting the passenger pick up area, just past the left turn at the end of the pick up area. we were on the stretch of road lined with waiting taxis (i think this is their waiting area). i do not know the compass orientation here, but if you were standing in the middle of the street facing the airport, next to the waiting taxis (on your left), the object appeared off to what would be your left and flew toward the airport grounds. off to your left are, i believe, buildings belonging to aircraft companies and such. the object moved rapidly from higher altitude to lower on a path that gave the impression of being a gentle arc. it gave the impression of being very close and very small. the only thing i could compare it to would be a small remote-controlled toy airplane with a bright green light, which seems very unlikely to be flying in the immediate vicinity of a busy airport. the light was very bright, very distinct. i am curious if your organization knows anything about such sightings. the vicinity to the airport makes me think it might be a military\\security apparatus of some sort, but i have never seen anything like it in my life near any other airport. (i should also note that i spend time near the lb airport picking someone up regularly, sometimes waiting for extended periods in parking lots nearby or near the taxi stands, and have never seen this before. also--the area near where we saw it was very close to the taxi waiting line, so perhaps some of the waiting drivers saw it.) this was at 7pm on a sunday night (tonight) and the airport was busy, though the parking and pick up areas were not as packed as they have been on other occasions."],"Object Flight Path":"Path with directional change","Country":"United States","Longitude":"-118.155376","Case Number":"8400","Sighting Duration":"00:01:00","Disposition":"IFO","City":"Long Beach","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.805727,+-118.155376(8400)&iwloc=A&hl=en\"> mufon case (8400) map </A>","Viewing Distance":"Unknown","Object Shape":"Star-like","Log Number":"US-11192007-0001","files":["/var/www/straped/mufon/html2text/8400.html.txt","/var/www/straped/mufon/org/8400.html"],"Summary":"Tiny green light in the air over/near Long Beach Airport","Latitude":"33.805727","trends":["There have been 45 other sightings in Long Beach","There were no other sightings in Long Beach on or around November 18th 2007"],"Weather Factors":"None","Date of the Event":"11/18/2007 07:05 UTC"}