{"divs":["sighting detailsi just got off of work and saw a bright light zoom from the left side of the street to the right then back to the left side of the street then hover in place for about thirty seconds. i then ran inside and grabed my camera and my step-dad came back outside and it was still hovering in the same place.; it slowly begain to move toward us in a sweeping arch almost like a helicoper but no sound was being made and there were no roters. at first i thought it was a helicopter but as it drew near i had a feeling like my chest was being pushed on it stop its arch and hovered for bout five seconds then started to move in an arch away from us over the city. it looked almost like it was landing about half a mile away because it was dipping below house height at a steady pace. i then got into my truck and drove to were i could see the whole city and nothing was in the air the time between i first lost sight of the object to the point where i could see anything in the city air was bout forty seconds to a minute. the object appeared to be disc or cigar shaped with a with a larger disc running through the center of the object. a red light was on the top leading edge and a blue light on the top trailing edge. as it moved over amarillo the city lights partially illumminated it. a blue\\white light seemed to be emminating from the bottom."],"Source":"MUFON","Log Number":"US-11202007-0011","Country":"United States","City":"Amarillo","Longitude":"-101.823367","Tags":"City","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Cigar, Disc","Case Number":"8418","Date Submitted":"11/20/2007 12:00 UTC","Date of the Event":"11/20/2007 12:00 UTC","Latitude":"35.224247","map":"<A HREF = \"http://maps.google.com/maps?q=35.224247,+-101.823367(8418)&iwloc=A&hl=en\"> mufon case (8418) map </A>","Region":"Texas","Disposition":"Unknown","trends":["There have been 15 other sightings in Amarillo","There were no other sightings in Amarillo on or around November 20th 2007"],"Object Features":"Dome, Other","Summary":"Bright steady white light red and blue lights fadeing in and out long cigar shaped steady blue light on bottom.","files":["/var/www/straped/mufon/html2text/8418.html.txt","/var/www/straped/mufon/org/8418.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}