{"Region":"Arizona","Sighting Duration":"Undisclosed","Date of the Event":"10/10/2007 10:12 UTC","Weather Factors":"Unknown","Case Number":"8431","files":["/var/www/straped/mufon/html2text/8431.html.txt","/var/www/straped/mufon/more/8431_submitter_file1__HPIM0379.1.JPG","/var/www/straped/mufon/more/8431_submitter_file2__HPIM0379.2.JPG","/var/www/straped/mufon/org/8431.html"],"Latitude":"33.453067","Longitude":"-112.069547","Date Submitted":"10/10/2007 10:12 UTC","Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was flying from Phoenix, AZ to Buffalo, NY and took a picture out the window. The flight left at 9am PDT on October 10, 2007. The attendant said on the loudspeaker that electronic devices could be used, so I decided to get some pictures from the window. I took a total of five pictures out the window, starting at 10:06am PDT and ending at 12:50pm PDT. Everything went well, possibly the best flight I have ever been on. I didn't notice anything at the time. I first noticed the objects when uploading the pictures to my Flickr page. I was going through them and came across one of them taken at 10:12am PDT. I thought something happened when uploading, but went to the originals and the objects were there too. I first thought that the objects were meteroites or space junk, then I thought it was military formation flying. Could even be a reflection. Many people have told me the same and some said it was ice coming off the wing. One suggested this website and report to see if anyone could help. Thank you for your time and look forward to hearing from you."],"Summary":"Something falling through the atmosphere","Object Shape":"Bullet, Missile","Disposition":"IFO","Viewing Distance":"Unknown","City":"Phoenix","map":"<A HREF = \"http://maps.google.com/maps?q=33.453067,+-112.069547(8431)&iwloc=A&hl=en\"> mufon case (8431) map </A>","Object Features":"Undisclosed","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around October 10th 2007","This sighting has never been favorited.",""],"Log Number":"US-11232007-0001","Tags":"City","Source":"MUFON","Country":"United States"}