{"trends":["There have been no other sightings in Monostorapáti","This sighting has been favorited 1 time."],"Weather Factors":"None, Does Not Apply","Log Number":"HU-11232007-0002","Date Submitted":"08/20/2003 03:00 UTC","Latitude":"46.925123","Longitude":"17.55551","Disposition":"Unresolved","Sighting Duration":"Undisclosed","Case Number":"8432","files":["/var/www/straped/mufon/html2text/8432.html.txt","/var/www/straped/mufon/org/8432.html"],"Viewing Distance":"20 Feet or Less","Object Shape":"Flash","Region":"VeszprÃƒÂ©m","Country":"Hungary","Date of the Event":"08/20/2003 03:00 UTC","Source":"MUFON","divs":["Sighting Details It was a hot summer night in Hungary. I was in the middle of the countryside on a slope of a hill, surrounded by forrests and vineyards. There was a beautiful panoramic view of a big lake called, Balaton. I was at this family vinyard, with my boyfriend and we were sleeping in a tent. I would like to point out also, that there was no electricity, no water, none of the comforts of the 21st century. You could only reach this part of the country if you travelled on a bad quality dirt road, and if you walked a good bit after. So there we were sleeping inside a small tent. Around 3 AM I walk up because of some strange, extremelly strong scanning light shone through the tent, making me feel that I was light through like in an x-ray examination. I was trying to move, but my body was strongly paralized, so for some time I was just laying there listening to the very mechanical, very loud sound, like that of an airplane turbine, but somehow softer, and I was wondering, what on earth was happening outside. I also have to state that due to my beleive in Christianity at that time, I would have considered myself as a \"born-again\" Christian, who doesn't beleive in that obvious hoax that extraterrestrial beings would manifest in the form of uFOs. So first I thought there must be a big airplane of some sorts landed outside on the field in the night, which was quite strange at this location. So I gathered my strenght, and was trying to wake up my boyfriend who was not reacting at all. I was trying to shake him up, I was shouting at him, but nothing. Also, I was still feeling strongly paralized, so this experience was turning into a nightmare. I was really afraid of some unseen force that was outside the tent. By this time I kind of crawled to the entrance of the tent, and was really struggling to open the zip, due to my lack of force. Once I managed to open the tent and looked outside there was complete darkeness, like nothing have happened a few minutes ago. I clambered outside, still difficultly moving, and sat on the grass beside the tent, looking around. There was a small white holidayhouse on my right about 6-8 meters away, and as I looked at that direction, my fear suddenly reached a peakpoint. I was looking at a creature in the moonlight that was 2-3meters tall, standing on two feet, kind of dark skinned, very alongated head, but absolutely non human looking. This creature was looking at me, I was looking at the creature...and the fear I felt was so immense, that I felt an instant urge to let my bowels loose...really crazy. I have never felt this strong fear before, an all engulfing fear shaked my body like a leaf, and I had to turn my head off this vision. The only thing my mind was constantly telling me, that it is not possible, you don't beleive in aliens!You don't beleive in UFOs! The next thing I remember I was laying in the tent silently murmoring that this is impossible...then I fall asleep, or rather stumbeled into a comalike sleep. The next day, when we wake up, I was discussing the event with my boyfriend who saw and heard nothing, making me feel rather stupid. Nonetheless we walked around looking for clues. The only thing that we found at the exact spot where I observed this being was a front leg of a small deer. It wasn't torn offbut cut off with a sharp object, looked very fresh, but no signs of blood, or dried blood was visible, witch was quite odd. And later that day I also noticed a tiny cross-shaped scar of a cut on my skin, between the inner corner of my eye and my nose, which was reather scary. After this I was trying tu burry these traumatizing memories for years, untill now. Maybe one day I will be able to find out what exactly happened wiht me and my boyfriend."],"City":"MonostorapÃƒÂ¡ti","Object Features":"None","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=46.925123,+17.55551(8432)&iwloc=A&hl=en\"> mufon case (8432) map </A>","Object Flight Path":"Path then hovering","Summary":"A very bright, blinding, paralizing light shone through the tent I was sleeping in with my boyfriend. I heard a loud, strange noice, like the sound of some sort of buzzing. I couldn't move, I got paralized for some time. tryng to wake up my boyfriend,but"}