{"Log Number":"US-11232007-0003","files":["/var/www/straped/mufon/html2text/8433.html.txt","/var/www/straped/mufon/org/8433.html"],"Object Features":"Undisclosed","Object Flight Path":"Stationary","Tags":"City","Latitude":"40.736038","Weather Factors":"Does Not Apply","Date of the Event":"11/23/2007 02:00 UTC","divs":["Sighting DetailsI woke up last night. It was about 2 pm but I'm not exactly sure. I woke up from a very bright light that filled out the whole room. The minute I saw the light I was sure it was directed at ME- the angle it was positioned at was in such a way that I saw it as soon as I opened my eyes, shining down on me through the window. I did not feel threatened but amused, and fell back asleep immediately. I only remember thinking \" I have to check if there is a streetlight that could cause this\". But at the same time, I knew already that it wasn't a streetlight as it was too bright, and I had never noticed lamps like that before. I woke up about two hours later, and the same oval object was still present, shining down on me. I fell back asleep and woke up at 5.30 am, when it was gone. I checked for lamps, streetlights, or any object that could have caused the light but could see nothing but the open sky. The object was situated above the treetops, or above our neighbor's house. It didn't move. It seemed to be investigating or searching something ( thus the bright light). There was a strange energy since the light was extremely bright and white. I was sure that I (our house) was an object under investigation."],"Longitude":"-74.073942","trends":["There have been 7 other sightings in Jersey City","There were no other sightings in Jersey City on or around November 23rd 2007"],"Region":"New Jersey","Country":"United States","Disposition":"IFO","Viewing Distance":"21-100 Feet","Summary":"stagnangt very bright oval light directed at our house or even me, while sleeping, light filled up the whole room, remained there for approx 2 hours.","Object Shape":"Egg, Oval","City":"Jersey City","Date Submitted":"11/23/2007 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.736038,+-74.073942(8433)&iwloc=A&hl=en\"> mufon case (8433) map </A>","Source":"MUFON","Sighting Duration":"02:00:00","Case Number":"8433"}