{"City":"Tampa","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Latitude":"27.958005","Date of the Event":"03/19/1996 12:00 UTC","Object Shape":"Fireball, Sphere","Source":"MUFON","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.958005,+-82.453088(8447)&iwloc=A&hl=en\"> mufon case (8447) map </A>","Region":"Florida","Object Features":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"03/19/1996 12:00 UTC","Disposition":"Hoax","Case Number":"8447","files":["/var/www/straped/mufon/html2text/8447.html.txt","/var/www/straped/mufon/org/8447.html"],"Country":"United States","Longitude":"-82.453088","Summary":"They atempted to take me again after failing about 23 times prior","Tags":"City","Log Number":"US-11252007-0004","divs":["Sighting DetailsI was asleep, then i awoke to see these short statured men witha odd coloring. They surrounded me, and the light was white in color it was picking me up and i felt, as now in my current experience as being shot at for the first time your mind shuts down and you can't react with cognitive thought. I was being taking somehow with out being in physical contact with a ladder or a net or anything thing it sucked. Then as i was about to be taken through my window and out to the fire ball outside and presumably into the craft my higher brain functions came back to me i grabing the wall around the window and tryed to stop them from taking me at first my hand went right through the wall and then to their surprise my hands actualy stoped on the wall. I feel after that about 6 feet to the floor. The beings attempted to pick me up and bring me back into the light beam. But i punched the being that had grabbed my left arm in the eye. It startled him i could actualy see a unsure reaction on him. The his buddy on the right attempted to put me into a paralysis state agian and failed. I then stood up and started to fight these beings, they were my same hieght at my age of 11. I appeared to have broken one of the beings legs. They then gave up and left my room. I didnt know it but my little brother had witnessed what had just happened and what i had done to them. They have never come again since that day, I believe i am a oddity to them they coulnd;t control me. I am shaking writing this right nwo"],"trends":["There have been 105 other sightings in Tampa","There were no other sightings in Tampa on or around March 19th 1996"]}