{"Case Number":"8456","trends":["There have been 7 other sightings in Meriden","There were no other sightings in Meriden on or around July 31st 2007"],"Date of the Event":"07/31/2007 08:00 UTC","Tags":"City","Country":"United States","Summary":"flying fire ball","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.541054,+-72.799944(8456)&iwloc=A&hl=en\"> mufon case (8456) map </A>","Weather Factors":"None","Latitude":"41.541054","Sighting Duration":"Undisclosed","Region":"Connecticut","Longitude":"-72.799944","files":["/var/www/straped/mufon/html2text/8456.html.txt","/var/www/straped/mufon/org/8456.html"],"Date Submitted":"07/31/2007 08:00 UTC","Log Number":"US-11252007-0013","Source":"MUFON","Object Shape":"Fireball","Object Flight Path":"Straight-line path","divs":["Sighting Details My Boyfriend and I were driving home from Wallingford to Meriden using back roads going toward route 70. Once we turned north onto Old Colony Rd we noticed a fire ball in the sky above our car to our left. At first We thought it might be a meteor but the flight path was very level. I didn't appear to be falling from the sky but rather maintaining a course parallel to ours. It was fairly low in the sky, lower than a plane would fly. There is an air port pretty close to this area so out next notion was that it might be a plane in distress attempting to land at the air port. Then the object passed over our car so it was now located on the right side of us, still driving north this is away from the air port and we quickly dismissed the thought that it may be a plane. Now out of the trees in an more open view to our right it appeared to be just fire flying at least as fast as out car if not a little faster. There was no visible material to the object. No visible metal or rock just flames. Once we go to Route 70 we took a left hand turn and the object was still visible. We took a right hand turn and parked in the parking lot of the AOH club and got out of the car and walked toward the back where the object was still visible. The object continued just past the back of the AOH and disappeared, it didn't fall or move up, it just disappeared. When we got home over the next couple of day I searched local news papers and news reports because I thought there would be some report of some sort of incident related to this object. I found nothing, no plane crash no meteor, nothing related or indicating that anyone else had even witnessed this fire ball."],"City":"Meriden","Viewing Distance":"Unknown","Disposition":"IFO"}