{"Source":"MUFON","Latitude":"39.849557","City":"Chester","Disposition":"Unknown","Country":"United States","Date of the Event":"11/23/2007 01:38 UTC","Object Shape":"Oval","divs":["sighting detailsi was looking out of my living room window which faces n\\ne observing the stars with my celestron binoculars. my eyes needed a break so i lowered the binoculars and was observing with eyes only. movement caught my eye when i focused on the location, observed a v formation of 7 craft with 3 or 4 more in a circular formation to left and 1 on the right flank between the first and second object, they looked like lightly glowing whitish grey ovals almos translucent like a jellyfish. said to my wife \"holy sh.. they are flying in formation look, look.\" there they were moving towards me in a stright line about twice as fast as a commercial jetliner from the ne to sw, i observed them for about 6-8 seconds then i could not see them any more they were over the house. i ran downstairs and out back to the deck with the binoculars to try and track them. it took about 3 seconds to get out back, i could not see them i lost them in the moonlight, the sky was pretty clear, small puffs of clouds (clouds were travelling n the opposite direction of the objects). the moon was very bright and was in the westeern sky. there was no noise what so ever, if it was human aircraft 7 or more they would have made some kind of noise. i live a few miles from philadelphia airport and know what planes look and sound like, and where they were flying i have never seen any planes take that path and i lived here for about twelve years. 1 no commercial aircraft travel in groups or formation 2 there were no blinking lights or beacons 3 no noise 4 was not birds or geese\\no wings or heads\\ travelling too fast for birds and also most of the birds have already gone south for the winter and birds typically do not fly at night. 5 i am an avid skywatcher every night it is clear enough i use my telescope or binoculars. i have seen other uexplainable events in the sky but nothing like this."],"Tags":"City","Date Submitted":"11/23/2007 01:38 UTC","trends":["There have been 3 other sightings in Chester","There were no other sightings in Chester on or around November 23rd 2007"],"Longitude":"-75.355746","Sighting Duration":"00:00:10","Viewing Distance":"Unknown","Summary":"Fleet in a V type formation lightly glowing whitish grey NO flashing beacons","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=39.849557,+-75.355746(8464)&iwloc=A&hl=en\"> mufon case (8464) map </A>","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/8464.html.txt","/var/www/straped/mufon/org/8464.html"],"Case Number":"8464","Log Number":"US-11262007-0005","Object Features":"None","Weather Factors":"Unknown"}