{"trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around July 21st 1997"],"files":["/var/www/straped/mufon/html2text/8473.html.txt","/var/www/straped/mufon/org/8473.html"],"Date of the Event":"07/21/1997 05:00 UTC","Country":"Canada","Date Submitted":"07/21/1997 05:00 UTC","Object Shape":"Circle","City":"Ottawa","Longitude":"-75.695193","Summary":"CAR SIZED ORB SWITCHING FROM CHROME TO BLACK AND REPEAT.","Object Flight Path":"Straight-line path","Disposition":"Unresolved","Log Number":"CA-11262007-0014","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=45.43023,+-75.695193(8473)&iwloc=A&hl=en\"> mufon case (8473) map </A>","Region":"Ontario","Sighting Duration":"Undisclosed","Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","Case Number":"8473","Tags":"City","Latitude":"45.43023","Source":"MUFON","divs":["Sighting DetailsI had just stepped out onto my sisters front yard and started to take a deep breath of fresh air. It was a beautifull sunny day and I was stretching out the way people often do, enjoying the warmth of the sun on my face, and there it was above the houses. The car sized orb was slowly and silently moving perfectly horrizontally at a steady pace and every 2 or 3 seconds would change from a chrome looking ball to a black one. There was no breeze! This was not a balloon either! I couldn't believe what I was seeing. Just from those few seconds of observation I could tell that the object had absolutely no buisness being where it was. Were the object a helium filled balloon it would have either risen straight up or wobled and fell. After 10 or 15 seconds, it's hard to judge time when amazing things are happening, but any way I went to get my sister but it was too late. By the time I went out again only about 6 seconds had passed but the object was gone. I even ran down the street to look for it! It was gone.A balloon would have more or less continued on it's course and at roughly the same pace. This object must have excellerated very quickly to be completely gone from view within 6 seconds.This occurred about 1.5k from CANADA'S spy agency CSIS.I know what I think. What do you think?"]}