{"files":["/var/www/straped/mufon/html2text/8477.html.txt","/var/www/straped/mufon/more/8477_submitter_file2__Copyofnov2007003.jpg","/var/www/straped/mufon/more/8477_submitter_file3__nov2007004.jpg","/var/www/straped/mufon/org/8477.html"],"Summary":"This UFO was much higher than 35,00 feet","Disposition":"Unknown","City":"Houston","Object Shape":"Chevron, Cylinder, Diamond, Triangle","Date Submitted":"11/11/2007 07:15 UTC","Object Features":"Unknown","Date of the Event":"11/11/2007 07:15 UTC","Source":"MUFON","Object Flight Path":"Hovering then path","Case Number":"8477","Region":"Texas","Viewing Distance":"Over 1 Mile, Unknown","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 11th 2007","This sighting has never been favorited.",""],"Longitude":"-95.36316","map":"<A HREF = \"http://maps.google.com/maps?q=29.764003,+-95.36316(8477)&iwloc=A&hl=en\"> mufon case (8477) map </A>","Tags":"City","divs":["Sighting DetailsI was turning the pool filter on when I noticed a bright blinking light .I thought it was a very bright star.. Upon further investigation with high power binoculars I saw many lights revolving around a craft .The craft changed shapes frequently and darted and dashed around the sky. at one point it was joined by 2 more . I signaled the craft with my pool light and then with a lasar pointer at which point something flew directly over my head {I'd say 12 feet above} so quickly that had I blinked I would have missed it .I watched it for nearly 2 hours when it just blinked and disappeared. This sighting was witnessed by myself and a friend at my home . I also called my friend across town who then went outside and observed the same craft. I felt very excited but also a sense of peace from thsi sighting. as I watch the video over and over it gives me a peace I cannot describe. video and pictures attached. This is my second sighting . My first is documented with Mufon . 1999"],"Weather Factors":"None","Sighting Duration":"Undisclosed","Latitude":"29.764003","Country":"United States","Log Number":"US-11262007-0018"}