{"trends":["There have been 10 other sightings in Winter Park","There were no other sightings in Winter Park on or around November 27th 2007"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Source":"MUFON","Region":"Florida","Case Number":"8485","Disposition":"Unresolved","Object Features":"None","Date of the Event":"11/27/2007 07:32 UTC","Sighting Duration":"Undisclosed","Log Number":"US-11272007-0005","City":"Winter Park","map":"<A HREF = \"http://maps.google.com/maps?q=28.60233,+-81.330025(8485)&iwloc=A&hl=en\"> mufon case (8485) map </A>","Latitude":"28.60233","divs":["Sighting DetailsI was standing by Lake Virginia at Dinky Dock Park this morning just after 7:30am. This is a daily ritual for me on the weekdays before I start work in the area. The sun had risen, and there were a few light clouds. There was no wind. The area is in the flight path of jets landing at Orlando International Airport, which is approximately 10 miles to the south. I was staring out over the lake when I looked up and noticed a black form flying towards the lake from the west. At first I thought it was a large bird such as a vulture or eagle circling over the lake. The object was dark, big, silent, and was not traveling at a high rate of speed. As I examined it more closely, I could see that it was not a bird. The object descended, and for a moment, I thought it could be someone parachuting into town, but I didn't see any evidence of a person beneath the object. It stopped descending and began to slowly fly to the northeast, towards the Casselberry area. Despite the object being very dark, the rear of the object reflected in the newly risen sun as it flew out of sight. There are some cypress trees by the lake, which obscured my view of the object as it flew away. When it was shining in the sun, it appeared to be spherical - I'm not sure if the object actually changed shape as I watched it, or if I had misjudged its shape when I first noticed it. A few strange things about the object: It seemed to be flying low. It was difficult to determine its exact shape. It was completely silent. It seemed big, but I was unable to determine its size without a nearby sufficient frame of reference. The moon was still visible in the sky - if I had to compare it to the moon, I'd say that it wasn't big enough to have obscured the moon had it flown over it. Also, it seemed to appear from the west - it was just there over the lake somewhat suddenly, but it's possible that nearby trees obscured it from my view. My only thoughts on what it might have been is a balloon, but not a hot-air balloon. It seemed to be following a definite flight path - not randomly being carried by air currents and ascending and descending. Also, the shape seemed to be off. I'm wondering if anyone else saw this object today. It flew towards a very busy road during morning rush hour traffic - Highway 436 in Winter Park - when I lost sight of it."],"Summary":"Strange Object over Winter Park","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","Date Submitted":"11/27/2007 07:32 UTC","files":["/var/www/straped/mufon/html2text/8485.html.txt","/var/www/straped/mufon/org/8485.html"],"Object Shape":"Unknown","Longitude":"-81.330025","Country":"United States"}