{"Object Flight Path":"Undisclosed","Date Submitted":"11/01/2007 12:00 UTC","Longitude":"-114.176633","Weather Factors":"None","Region":"Arizona","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-11292007-0001","map":"<A HREF = \"http://maps.google.com/maps?q=34.344812,+-114.176633(8498)&iwloc=A&hl=en\"> mufon case (8498) map </A>","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8498.html.txt","/var/www/straped/mufon/org/8498.html"],"City":"lake havasu","Country":"United States","Object Features":"Undisclosed","trends":["There have been 8 other sightings in lake havasu","There were no other sightings in lake havasu on or around November 1st 2007"],"Case Number":"8498","Latitude":"34.344812","Disposition":"Unknown","Summary":"object decended off mount. range and landed in lake.","Date of the Event":"11/01/2007 12:00 UTC","Source":"MUFON","divs":["Sighting DetailsAt around midnight early in november-07 i was in front of my home having a last cig for the day when my wife lori came out to do the same and she pointed out a set of lights off to our west accross the lake, (lake havasu) the light were, one main very bright light in the center and onr green light on each side. The main light was very bright when it shown directly in our direction. The object wes coming off the mountains on the Calif. side of the lake when we noticed it and it came down the valley heading east towards us, desending also. We were assuming the object was a helicopter landing at the casino accross the lake. But it did not land there, it passed it towards the water and landed in the water and disappeared into it!. We watched the area for it to re-amerge but it did not. I also did not see any emegency vehicles approach the area. we are about 2.5 miles from the lake and live on a bluff area and have great view of the mount range and can see portions of the lake. we are on the North-central part or town. I stayed out for around another 20mnts or so thinking about what we saw, my wife went in soon after as she accepted the helicopter expl. I have asked some concerning this but no one seen it. I am not crazy or seeing things it did land in the water, the lights did distort some what when it submerged. Take it for what its worth.."],"Object Shape":"Unknown"}