{"divs":["sighting detailsas i walked out the front door of my apartment building i looked up and saw a huge thick contrail which my eye followed going down towards the lake. the contrail was in a east\\west position. the rest of the sky was clear blue. when i stepped out of my front door i was alittle taken back by this enourous cloud that almost looked like a tornado cloud elongated from the lake at such a distance past 900 west. while i stood there and just looked at this i then saw a white circle that had a greenish almost lime green cast to it and from my point of view was a big as a very large beachball at an altitude of about 500 feet above me. it was transparent and it was moving like it was gliding in the west direction several feet away from this contrail. it almost looked like someone was shining a spotlight in the sky. i looked to see if i could see anything making this transparent circle but did not see any other aircraft such as a helicopter with a spotlight hiding inside this huge contrail. i also did not hear any aircraft. i watched as this orb then changed direction towards the south and went under the contrail and dissappeared."],"Longitude":"-87.627438","Viewing Distance":"Unknown","Source":"MUFON","Date of the Event":"11/30/2007 07:06 UTC","Object Features":"Undisclosed","Object Shape":"Circle","files":["/var/www/straped/mufon/html2text/8513.html.txt","/var/www/straped/mufon/org/8513.html"],"Tags":"City","Date Submitted":"11/30/2007 07:06 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.887274,+-87.627438(8513)&iwloc=A&hl=en\"> mufon case (8513) map </A>","Case Number":"8513","Sighting Duration":"Undisclosed","Disposition":"Unknown","Weather Factors":"Unknown","Summary":"white/greenish cast translucent flat orb in blue morning sky moving around next to huge contrail that did not disapate","City":"Chicago","Country":"United States","Latitude":"41.887274","Object Flight Path":"Undisclosed","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around November 30th 2007"],"Log Number":"US-11302007-0008","Region":"Illinois"}