{"Longitude":"-73.602237","Viewing Distance":"Unknown","Disposition":"Unresolved","Region":"New York","files":["/var/www/straped/mufon/html2text/8515.html.txt","/var/www/straped/mufon/org/8515.html"],"Case Number":"8515","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=41.516641,+-73.602237(8515)&iwloc=A&hl=en\"> mufon case (8515) map </A>","Date of the Event":"11/29/2007 02:26 UTC","Object Features":"Unknown","Tags":"City","trends":["There have been 2 other sightings in patterson","There were no other sightings in patterson on or around November 29th 2007"],"Sighting Duration":"00:00:48","Object Flight Path":"Straight-line path","Object Shape":"Other","City":"patterson","Latitude":"41.516641","Date Submitted":"11/29/2007 02:26 UTC","Summary":"saw it in sky after being wakened strangley in middle of night","Weather Factors":"Windy, Light","Source":"MUFON","Log Number":"US-11302007-0010","divs":["Sighting DetailsAt approximatly 2:26 am on November 29, 2007, i was awoken from a deep REM cycle strangley and for no reason as it would seem. I went downstairs and out the door into my front yard to clear my head - for it felt slightly fuzzy. I was looking at the stars and saw an object's distorted outline in the sky, only visible because of the moonlight. At first, I thought it was a place or something; i waited for the tell-tale flashing lights of Earth's aircrafts. It was slowly creeping a cross the sky, and I wondered what in the world it was. A thought of aliens filled my head but I shook it out. Then less than a minute after the sighting, there was a blinding flash of light; a star shape was in my vision for a couple of minutes after because of the brightness and the shape of the flash. I felt as if I knew something, but couldnt' remember what. The feeling is hard to explain, and I feel silly writing about it. Anyway, right after the flash, the object had disapeered. I searched the sky for what seemed like an hour but not a trace could be seen from my point of view. I then knew it was not a technology of Earth's."]}