{"Date Submitted":"09/30/2000 12:35 UTC","Case Number":"853","Summary":"UFO sighting","Log Number":"","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Stationary","City":"Brownsville","Country":"United States","Region":"Pennsylvania","Source":"MUFON","Longitude":"-79.883936","Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.023685,+-79.883936(853)&iwloc=A&hl=en\"> mufon case (853) map </A>","files":["/var/www/straped/mufon/html2text/853.html.txt","/var/www/straped/mufon/org/853.html"],"Latitude":"40.023685","Weather Factors":"Unknown","divs":["Sighting Details (you can type over theseinstructions.)Please limit your narrative to 500 words (equivalent to 1 typedpage). My husband and I were driving along the highway when I spotted the objectto my left above the trees. It was silver-colored and spherical in nature. Ipointed it out to him, noting that it was probably the light shining off aplane, since it shone brightly with a metallic tinge. He nodded and said he sawit as well. It did not appear to be moving as we watched it while still drivingalong the highway. I maintained eye contact with it as long as possible, lookingfor wings or any sort of identification marking3B wondering if it was from any local airport although the nearest one was milesaway. We dont get a lot of air traffic around here and I love planes, so I tendto latch onto anything flying in the sky. A clump of trees obscured our view ofthe object for a few seconds and when the area came back into sight it haddisappeared. I looked around the sky for where the plane had gone to, but couldnot see anything at all. My husband who grew up in this area noted that he wassure it was not any local antenna or reflective surfaces he knew of. Inaddition, he is an Air Force Veteran and agreed that it was unlike any plane hehad ever seen in the air. Only after it had disappeared did we wonder if it hadactually been an UFO and agreed that it was highly likely, given thecircumstances and the fact that we could not see any other objects in the sky."],"trends":["There has been one other sighting in Brownsville","There were no other sightings in Brownsville on or around September 30th 2000"],"Sighting Duration":"00:00:59","Date of the Event":"09/30/2000 12:35 UTC","Disposition":"Unresolved","Object Features":"Undisclosed","Tags":"City"}