{"Weather Factors":"Unknown","Log Number":"US-12032007-0007","City":"Fort Bragg","Summary":"This was a reddish vertical streamer that drifted to the south and was in the western sky.My wife and child noticed a reddish streamer type of object in the western sky that was drifting toward the south.The object appeared to have something hanging form","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"08/30/2007 12:00 UTC","Longitude":"-78.999167","Sighting Duration":"Undisclosed","divs":["sighting detailsthis was a reddish vertical streamer that drifted to the south and was in the western sky. my wife and child noticed a reddish streamer type of object in the western sky that was drifting toward the south. the object appeared to have something hanging form it but we were not able to make out the hanging object. it was not a parachute, as i am a former jumper and it was not a streaming parachute. it was in a slow decent and appeared to be a very large object resembling a wind drift indicator used by sky divers, although it was large and descernible to the naked eye as it appeared to be about 1\\2 mile from our location. we watched this vertical streamer descend for about 5 minutes. we got into our car and drove toward the sighting and were not able to see the object again. i surmise that it went down in a wooded area close to our home which is not accessible to us. there were no aircraft in the area and no sound. there were no jumpers in our area. our home is located in an aerial training area for pope afb and ft. bragg, which are located approximately 60 miles to the nw."],"Object Shape":"Unknown","Case Number":"8539","Source":"MUFON","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=35.139167,+-78.999167(8539)&iwloc=A&hl=en\"> mufon case (8539) map </A>","files":["/var/www/straped/mufon/html2text/8539.html.txt","/var/www/straped/mufon/org/8539.html"],"Region":"North Carolina","trends":["There has been one other sighting in Fort Bragg","There were no other sightings in Fort Bragg on or around August 30th 2007"],"Date of the Event":"08/30/2007 12:00 UTC","Object Features":"Undisclosed","Country":"United States","Latitude":"35.139167","Tags":"City"}