{"Latitude":"42.428332","Region":"Michigan","Object Features":"Undisclosed","Disposition":"Insufficient Data","Date Submitted":"08/22/2007 06:04 UTC","Tags":"City","Weather Factors":"Unknown","Date of the Event":"08/22/2007 06:04 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=42.428332,+-83.733859(8542)&iwloc=A&hl=en\"> mufon case (8542) map </A>","Object Flight Path":"Undisclosed","Country":"United States","Viewing Distance":"Unknown","Summary":"This is not the first sighting over Bankson Lake Lawton Michigan.I'm getting ready to go in for the night and I notice my shadow and I turn my head to see where the lights coming from.. Thought to myself, \"That's an awfully bright star I don't remember se","Sighting Duration":"Undisclosed","Object Shape":"Unknown","City":"lake lawton","Longitude":"-83.733859","files":["/var/www/straped/mufon/html2text/8542.html.txt","/var/www/straped/mufon/org/8542.html"],"Case Number":"8542","trends":["There have been no other sightings in lake lawton","This sighting has never been favorited."],"Log Number":"US-12032007-0010","Source":"MUFON","divs":["Sighting DetailsThis is not the first sighting over Bankson Lake Lawton Michigan. Saturday morning 22nd. I'm getting ready to go in for the night and I notice my shadow and I turn my head to see where the lights coming from.. Thought to myself, \"That's an awfully bright star I don't remember seeing one that bright before.\" So I watch it a little bit and then it begins to move south away from the lake.. By that time I knew it wasn't a star obviously so I flash my light at it. As soon as I did that it did a complete 180 and was coming my way, I said, \"Oh Sh*t\" what have I just done! It's approach was rather rapid and as it got close to me and I knew it wasn't going to stop until it reached me I got spooked and took six steps back. By the six step the object stopped.. It stooped as if it knew I didn't want it any closer. It was directly in front of me. During this time I noted two airlines flying way above the object and to me that confirmed this was something rather unique. This craft had no sound to it the only things heard were the sounds of crickets and me saying, \"what in the F is this thing!\" The object was a greenish yellow color like I have never seen before. coming form the bottom were at times two to four beams of light that only went to a certain distance and stopped. At times these beams would rotate. One time they connected and the craft looked like a diamond. I moved out to the end of the dock to get a better look and as I did that the craft moved back keeping the same distance it had when I saw it from the beach area. I like that, a UFO that knows it's boundaries. Kind of cool huh? :) After I got tired of looking at this from the dock. I moved to an area next door to me.. As I did that, with in 10 to 15 seconds the craft moved with me and was once again directly in front of me keeping that same distance. So I thought I'd try something. When a cloud went under it I would move again.. After the cloud past over the UFO came over to me again. Keeping that same distance. The distance was just over cloud level. One time a cloud went under it and I moved and it shout out from the cloud. This thing was just wild. At one point the craft shot out this green beam of light that came down. half way between it self and the water. I took note that the beam of light did not reflect off the water. The light stayed for five seconds and then traveled back up to the craft. Interestingly enough after the beam travel back up to the craft it left a kind of mist or residue I don't know what you would call it but it disappeared within seconds. This residue I speak of I just remebered it.. Also I will admit I did feel slightly sick to my stomach that day. That's just something I took note of.. Could be nothing but maybe something.. Sick to my stomach as if I had a mild flue or you could I felt woozy or something.. This event lasted between 2.5 hours. It was daylight before it actually left.. It left after I had, had enough I guess.. I went and hid behind my neighbors house for a minute or two and when I came back it was gone.. It was like the craft was watching me as I was watching it. I have video and pictures of the craft. I'm sending you three of the pictures.. I'd like to know you think of the pictures. I want to try and enhance the others before I send anymore.. I also took video. This video seems like classic UFO footage..What I mean by that is while recording, the image in the LCD screen looks different then what I was actually seeing.. It's fuzzy or blurry I guess and it does have like a kind of black outlineing around the object.. These green beams I speak of aren't vissible in the video but they are in the pictures at times that I am glad for. I'm glad those beams are vissible in the pictures.. I have NEVER seen anything like this and it went for 2.5 hours. It was simply amaing. The lights it gave off I have never seen colors like that.. It was just incredible.. The video's the pictures, they don't give credit to what was seen.. But it does give a pretty good idea of it.. As they say seeing is believing..."]}