{"Date of the Event":"04/24/2007 09:30 UTC","Object Shape":"Unknown","Latitude":"40.757054","files":["/var/www/straped/mufon/html2text/8543.html.txt","/var/www/straped/mufon/org/8543.html"],"Longitude":"-73.235971","trends":["There have been no other sightings in North Bay Shore","This sighting has never been favorited."],"Viewing Distance":"Unknown","Summary":"Awesome red lights put on an other-worldly display in Converse, Indiana, and blew my mind. At about 9:30 pm on April 24, 2007, I was looking to the west when two lights appeared for several seconds and then disappeared The lights had a red tint and were b","Object Flight Path":"Unknown","divs":["Sighting DetailsAwesome red lights put on an other-worldly display in Converse, Indiana, and blew my mind. At about 9:30 pm on April 24, 2007, I was looking to the west when two lights appeared for several seconds and then disappeared. The lights had a red tint and were brighter than a normal star or planet. They were not very far apart, maybe the width of two fingers if viewed from an out-stretched hand. A few seconds later, the same pattern appeared about 30 degrees to the north. I had the sense that no normal aircraft could have covered that amount of distance in that short of time. The lights stayed on for a few seconds and then disappeared. Several minutes later, a single light was seen for a few seconds. At this point, I went inside a told my wife and daughter. About ten minutes later, another display occurred, which was witnessed by all three of us. This time, there was a larger light, consisting of three segments, plus two small lights to the right of the big light. All lights in the whole episode had the red tint. They always appeared for several seconds and then disappeared. At their next appearance, the lights seemed to put on the grand finale. At least six lights appeared. They seemed to move. It was an awesome display. I want to see them again."],"Object Features":"Unknown","Log Number":"US-12032007-0011","Region":"Indiana","Tags":"City","Disposition":"Hoax","City":"North Bay Shore","Sighting Duration":"00:10:00","Case Number":"8543","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.757054,+-73.235971(8543)&iwloc=A&hl=en\"> mufon case (8543) map </A>","Weather Factors":"Unknown","Source":"MUFON","Date Submitted":"04/24/2007 09:30 UTC"}