{"Country":"United States","Summary":"Single bright celestial light with dramatic movement observed for four hours in West Virginia Object that looked like a planet was visible as it rose over the eastern horizon in a clear sky. It was immediately apparent that it was moving in a jiggling man","Case Number":"8544","Date Submitted":"04/24/2007 06:47 UTC","Latitude":"39.298156","trends":["There have been no other sightings in Capon Bridge","This sighting has never been favorited."],"Object Features":"Undisclosed","Object Shape":"Unknown","Disposition":"Insufficient Data","Log Number":"US-12032007-0012","map":"<A HREF = \"http://maps.google.com/maps?q=39.298156,+-78.436119(8544)&iwloc=A&hl=en\"> mufon case (8544) map </A>","Date of the Event":"04/24/2007 06:47 UTC","divs":["Sighting DetailsSingle bright celestial light with dramatic movement observed for four hours in West Virginia Object that looked like a planet was visible as it rose over the eastern horizon in a clear sky. It was immediately apparent that it was moving in a jiggling manner. At first we thought it might be a helicopter (one of the observers has an aviation background) but from its dramatic and precise movements this was quickly discounted. Over the next four hours it rose in the sky at roughly the same rate as other stars, but on several occasions it darted between 5 and 10 degrees left and right, up and down. Throughout the observation it jiggled perceptibly, particularly noticable when we positioned ourselves to watch it through stationery objects such as trees, rooflines, etc. This movement was always at sharp angles, never as curves. It was bright white with a steady (not twinkling) light, though sometimes it dimmed. Eventually we got bored and went to bed with it still moving around (like the dot from a laser pointer) in the sky."],"Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Longitude":"-78.436119","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8544.html.txt","/var/www/straped/mufon/org/8544.html"],"Object Flight Path":"Undisclosed","City":"Capon Bridge","Region":"West Virginia","Source":"MUFON"}