{"Region":"Arizona","City":"Phoenix","Sighting Duration":"Undisclosed","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.854335,+-112.125137(8550)&iwloc=A&hl=en\"> mufon case (8550) map </A>","Date Submitted":"12/03/2007 12:00 UTC","Object Features":"None","Country":"United States","Log Number":"US-12042007-0001","Case Number":"8550","divs":["Sighting DetailsI had just arrived at home and went outside to start up the grill and noticed helicopter noise to the southwest. I looked up and saw a helicopter about 1 mile away, between my home and the I-17 highway. I figured there was probably traffic or an accident and went inside to change. I went back outside with a tray of chicken and looked up at the helicopter again, except this time there was a bright triangular object hovering in the sky between the helicopter and my home. It was equal length on all sides and appeared to emit a strong yellow light. It was about the same size as the helicopter. It appeared to be at about the same altitude as the helicopter if not a bit higher. As I blinked several times to make sure I wasn't seeing things, it slowly rotated 90 degrees IN PLACE to face due west without a change in altitude. It then moved very slowly for about 2 seconds and then shot off at a rate of speed impossible to comprehend and disappeared. There was no vapor trail. There was no sound. The entire time the only sound I heard was coming from the helicopter. I have not reported this before for fear of ridicule as I am a doctor. I also know a thing or two about planes because my father used to be a pilot. I used to work just outside of Luke AFB and can tell you with 100% certainty that what I saw was not a military craft. It was not a plane, blimp, weather baloon, bird, hot air baloon, or helicopter. I am hoping that maybe someone else saw what I saw, maybe even the people in the helicopter, and post something regarding this incident. I felt like I was in complete disbelief when I saw the object. When it rotated in place I realized I was not looking at anything I have ever seen before and probably will never see again. I really wish someone else had been there with me to witness this phenomenon. I've told several people, mostly close friends and family, and the majority of them are fascinated by the story. But there are some who don't believe me, which I find upsetting because no reasonable, rational adult would make something like this up."],"Tags":"City","Source":"MUFON","Latitude":"33.854335","Weather Factors":"None","Object Shape":"Triangle","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around December 3rd 2007"],"files":["/var/www/straped/mufon/html2text/8550.html.txt","/var/www/straped/mufon/org/8550.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-112.125137","Summary":"bright triangular light with extraordinary speed","Date of the Event":"12/03/2007 12:00 UTC"}