{"Longitude":"77.22496","divs":["Sighting DetailsToday is 06-11-07, yesterday i watched a programm (on History channel) on UFOs then i do reporting to mufon. I known this event from last 4yrs, first event was occured in july 2003, i had a personal home laboratory, and have keen interest in making mu personal telescope to watch night sky. One night i saw a flying object. initially i think that this is nothing may an aircraft not making sound. but when this objects rounds of my village several times within the time on an hour then i surprised that this may be somthing else. then i took my friends devendra, kamlendra and suryakant to see this object. we all are post graduate in various fields. we r surprised that this objects blinking lights its shape is.........two parallel long rods are interconnected by two bridges. one rode blinking with red light and another with green. then we all think that.. 1. if this is an aircraft or man made thing how this object stop suddenly in air during taking turn and sharply back on to the same path from which it has come. 2. no sound 3. our village as far i know, not in any air force zone. 4. there r most of the people are so poor have no money to purchase so costly flying toys if it is a toy. 5. why it was wandering over village, this is not a well known village. 6. at the last of this event this object goen to forest and fall down. since then there were so many times i have seen this event in the same way from last 4 years. last i seen this in august 2007, me n my wife and suryakant were with me. now i am doing Ph.D microbiology and my wife M.sc microbiology, n suryakant is B.Sc math, physics chemistry. last time we all seen that this object was flying over the forest of our village. this was the rainy season and lightining in clouds was there. in the background of lightining clouds this object was seen clearly from approx. 500-600 meter distance. shape was not so clear, but it must be an object have a size. next day it again seen 9:30 pm then it comes very close to the village and as ever wandering over the village. now i am going to purchase a digital camera then will took some clear photographs then i will send some pictures to mufon. thanks arvind"],"Case Number":"8556","map":"<A HREF = \"http://maps.google.com/maps?q=28.635308,+77.22496(8556)&iwloc=A&hl=en\"> mufon case (8556) map </A>","Disposition":"Unresolved","Source":"MUFON","City":"New Delhi","Object Shape":"Cylinder","files":["/var/www/straped/mufon/html2text/8556.html.txt","/var/www/straped/mufon/more/8556_submitter_file1__1.jpg","/var/www/straped/mufon/org/8556.html"],"Date of the Event":"08/23/2007 08:30 UTC","Object Features":"Undisclosed","Latitude":"28.635308","Viewing Distance":"Unknown","Country":"India","Region":"Delhi","Summary":"a slowly flying cylinderical object, no sound, take breaks in air and moves back, blinking lights, approx 70-100 meter height from ground, takes several round of my village","Object Flight Path":"Undisclosed","Log Number":"IN-12062007-0001","Date Submitted":"08/23/2007 08:30 UTC","trends":["There have been 4 other sightings in New Delhi","There were no other sightings in New Delhi on or around August 23rd 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Sighting Duration":"01:15:00","Tags":"City"}