{"Date of the Event":"11/03/2007 05:35 UTC","City":"Brainerd","Weather Factors":"None","trends":["There have been 4 other sightings in Brainerd","There were no other sightings in Brainerd on or around November 3rd 2007","This sighting has never been favorited.",""],"Disposition":"Unknown","Latitude":"46.3619","divs":["Sighting DetailsI was deer hunting on opener, Nov 3rd near Brainerd on a friends acerage just east of Lower South Long lake. I just climbed into my 18 foot stand on the edge of a 20 acre field looking NW. I got settled to wait for sun up and noticed the object. At first I thought it was just some parking lights from maybe a real tall light pole but it moved up and down slowly approximatly 500 feet above the trees or horizon from my position. It was a shinny cylinder on top, disc around the base and appeared to have 2 or 3 large super bright jets directly under the disc. It was rotating at approx 1 HZ with a black spot on the cylinder. No Id lights of any kind. Through my 30 06 9X scope I could see the features more clearly. It hovered for 10 minutes (up and down a bit) then it drifted off slowely to the North out of site after another 10 minutes. The drifting had elevation changes to it. Not sure how much due to the distance. No other aircraft were seen during this event. I could not believe that I was seeing another object in or near the location as my last report investigated by Mufon MN! I was so disapointed it did not drift my way! And again, no Digital recorder?"],"Case Number":"8558","Object Shape":"Cylinder, Disc","files":["/var/www/straped/mufon/html2text/8558.html.txt","/var/www/straped/mufon/more/8558_submitter_file1__Skip_Nov3_20070001.jpg","/var/www/straped/mufon/more/8558_submitter_file2__Nov3location.jpg","/var/www/straped/mufon/org/8558.html"],"Object Flight Path":"Hovering then path","Log Number":"US-12062007-0003","Date Submitted":"11/03/2007 05:35 UTC","Tags":"City","Viewing Distance":"Unknown","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Region":"Minnesota","Longitude":"-94.18451","Country":"United States","Summary":"Bright rotating object about 5 miles out with brillient jets under, hovering","map":"<A HREF = \"http://maps.google.com/maps?q=46.3619,+-94.18451(8558)&iwloc=A&hl=en\"> mufon case (8558) map </A>"}