{"Object Flight Path":"Undisclosed","Longitude":"-73.998163","Date of the Event":"07/28/2007 01:00 UTC","Country":"United States","Sighting Duration":"00:01:00","Region":"New York","Summary":"Wife and I witnessed unusual event in the sky while at the dock in the cockpit of our boat","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around July 28th 2007"],"files":["/var/www/straped/mufon/html2text/8560.html.txt","/var/www/straped/mufon/org/8560.html"],"Tags":"City","City":"New York","Log Number":"US-12062007-0005","Object Shape":"Circle","Source":"MUFON","Disposition":"Unknown","Object Features":"Undisclosed","Date Submitted":"07/28/2007 01:00 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.715813,+-73.998163(8560)&iwloc=A&hl=en\"> mufon case (8560) map </A>","Case Number":"8560","Viewing Distance":"Unknown","Latitude":"40.715813","divs":["Sighting DetailsWhile relaxing on our boat (no drinking)I noticed a perfectly spherical object moving quite rapidly in a north-westerly direction. Rockland County is one the western bank of the Hudson River, and Westchester County is on the eastern bank along with Westchester County Airport. Corporate jets and smaller commercial airliners very frequently move in a westerly take off pattern, so we are quite accustomed to seeing fast moving objects in the sky. This one was unlike any others we had ever seen. It was matte black,(it actually appeared to be a total lack of color, rather than just black,) was perfectly round and moving at what I would estimate was approximately 300 knots. There were no lights. protrusions, sound or any visible exhaust. It's speed, altitude, attitude and direction never varied. The day was bright and sunny with a few white clouds at varying heights. We watched it till it disappeared over the horizon. My wife(Lori) and I discussed the event, and neither one of us could figure out what the object was. If I had to guess at the obects altitude, I would say it was at approximately 5000 feet."]}