{"Longitude":"-83.880394","Date Submitted":"10/10/2007 02:45 UTC","divs":["Sighting DetailsI was studying late as usual just leaving my gallery walking around back heading home. A light & in the night sky looking to the N. just e. of st. route 68 2:45 am 10-10-07 approx. grabbed my attention. I ignored it first 5 seconds. Compelled again to look, strange feeling now i began to get about it. I again walked on though late tired. Now no longer able to IGNORE IT. The moving light at first I thought was a plane now over the state rt. 68 more so directly over the information center for \"Yellow Springs\" just back of \"Peache's Bar & Grill\" as you enter our little Village. The light was entering the Village. It then became extemely clear i was looking at a \"Triangular UFO\" as it tilted side and was to clear to see it's shape. Just inside each rounded corner was a bright white light round. 15% the size of the craft Inside the very center a large Red light very bright very distinct clear same size as the white lights. It hovered a bit moved slowly over \"Ha Ha Pizza's\" side still more over back of \"Glenn Helen the Nature Preserve\" here 100 sq acre's Sacred to the Indians here prior. & a Portal acording to an Edgar cayce reading here . One of 123 total he loved the energy here. The triangular appeared for a glimpse of a second to move directly toward me quickly bright light also! I paniced a bit, shuffled around back forth, not sure which way to go. Get a camera, hollered some, come out, \"UFO UFO UFO right here , right now\". It drifted west to east now over toward the Glenn. I lost sight & was forced to run back around the frame gallery, to my art gallery right across from the Glenn. It had crossed Route 68 slowing floating effortlessly silently over the tree tops bright as football field lights, crisp! I realized too late for camera in my place & pleaded with the two neighbors who lived above to come out & look as they were at the sidewalk level. They walked around & they saw it. They will verify all from the time it was above the Glenn & disappeared over it 10- 15 seconds max crisp clear triangular all lite up !!! I Noticed on a subsequent ufo show the exact artist's drawing of it, I believe it also was Ohio into Ill. Exciting, sureal & the mystery goes on right here a stone's throw from Wright Patterson Airforce Base where the famed \"Hanger 18\" is & the \"F.T.D. building\". Foreign technology building, supposedly where other nations tech. was reversed engineered as well as the classic \"Rosewell\" Craft & alien bodies. peace"],"Date of the Event":"10/10/2007 02:45 UTC","Viewing Distance":"101-500 Feet","Summary":"Triangular white lights inside each corner & bright red light in the center","Disposition":"Insufficient Data","Region":"Ohio","Case Number":"8571","Object Flight Path":"Hovering then path","trends":["There have been 2 other sightings in Yellow Springs","There were no other sightings in Yellow Springs on or around October 10th 2007"],"Object Features":"None","Log Number":"US-12082007-0002","Country":"United States","Latitude":"39.813729","files":["/var/www/straped/mufon/html2text/8571.html.txt","/var/www/straped/mufon/org/8571.html"],"Weather Factors":"Unknown","City":"Yellow Springs","Sighting Duration":"Undisclosed","Object Shape":"Triangle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.813729,+-83.880394(8571)&iwloc=A&hl=en\"> mufon case (8571) map </A>","Tags":"City"}