{"Object Shape":"Square, Rectagular","Disposition":"IFO","trends":["There have been 10 other sightings in Punta Gorda","There were no other sightings in Punta Gorda on or around February 29th 2004"],"divs":["Sighting DetailsWe were in Punta Gorda, FL for the winter in 2004. One night in March (can't remember the date). I went out on the lanai (screened in porch)about 10:00 p.m. to check to see in the door was locked before I went to bed. I looked up at the sky and I saw a rectangular flying object with lights and there was an orb outlining it when the lights were flashing -- when the lights went out, I couldn't see anything until the flashing came back on. These two flying objects came from the north and then turned and went south. I watched them until they went over the horizon. I mentioned this to my neighbor the next day and she said, \"Oh, those are just the jets flying into the Ft. Myers airport. They couldn't have been jets -- 1) the lights were rectangular in shape and flashed off and on with an outline light around them; and 2) Punta Gorda is only 20 miles north of Ft. Myers and those objects were way too high in the sky for preparing to land only 20 miles away. I watched these 2 objects until I couldn't see them anymore. I could not hear any noise. But I know one thing, they were NOT jet planes. I heard Mr. Friedman on Coast-to-Coast AM the other night and I thought I'd report this sighting even though it's been a few years ago. Sincerely, Kay Letizia grannykayletizia@yahoo.com"],"Country":"United States","Object Features":"Unknown","Summary":"Saw 2 UFO's -- one following the other","Source":"MUFON","Log Number":"US-12082007-0005","Sighting Duration":"Undisclosed","Case Number":"8574","Weather Factors":"Unknown","City":"Punta Gorda","Latitude":"26.929784","Longitude":"-82.045366","Viewing Distance":"Unknown","Date Submitted":"02/29/2004 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=26.929784,+-82.045366(8574)&iwloc=A&hl=en\"> mufon case (8574) map </A>","Tags":"City","Object Flight Path":"Path with directional change","Region":"Florida","Date of the Event":"02/29/2004 12:00 UTC","files":["/var/www/straped/mufon/html2text/8574.html.txt","/var/www/straped/mufon/org/8574.html"]}