{"divs":["Sighting DetailsA friend was driving and we stopped at the intersection of the old Cleveland High School (now a Middle School) and Hwy 321 which goes to Dayton (about 25 miles away). We saw a star. It got brighter and brighter until it was a triangular object over my friend's pickup. I didn't think of UFO, or anything strange, I just said to my friend, \"damn, if that was an airplaine it would blow us off the road\" (it seemed that close overhead.) Later, I started reading articles in the Houston Enterprise of a family in Dayton who got radiation poisoning when they had an incounter with a UFO. Unsolved Mysteries did a bit on this (the TV show). They blamed the Air Force and sued them. According to Unsolved Mysteries, the Air Force tore up the road where the thing landed and hauled it away. I have no first hand knowledge of that. After reading the paper shortly after, I just remember thinking, \"hey, that could have been us!\" I remember that the \"star\" first appeared in one direction, then appearred as a triangular object with different colored lights on each side, the quickly sped away, again appearing as a bright star in the direction of Dayton. This was in about 1980, give or take a year. For some reason this part of Texas is like a beakon to UFOs I think, though I don't know what they are. In the 1970s several times my grandmother while sitting on the front porch at night would tell me about \"something which looked like the full moon that lit up the whole front porch\", and my great-aunt who lived across the pasture would also confirm this. Neither of these women had probably even heard of UFOs."],"Country":"United States","City":"Dayton","Latitude":"30.073949","Viewing Distance":"20 Feet or Less","Source":"MUFON","Date of the Event":"11/30/1980 12:00 UTC","Disposition":"Unknown","Object Features":"None","Summary":"UFO event in which people in Dayton later sued the Air Force","trends":["There have been 2 other sightings in Dayton","There were no other sightings in Dayton on or around November 30th 1980"],"Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=30.073949,+-94.907896(8582)&iwloc=A&hl=en\"> mufon case (8582) map </A>","Weather Factors":"Unknown","Sighting Duration":"00:00:30","Log Number":"US-12092007-0002","Tags":"City","Case Number":"8582","Longitude":"-94.907896","Region":"Texas","files":["/var/www/straped/mufon/html2text/8582.html.txt","/var/www/straped/mufon/org/8582.html"],"Date Submitted":"11/30/1980 12:00 UTC","Object Shape":"Triangle"}