{"Object Features":"Dome","Date of the Event":"12/07/2007 09:30 UTC","trends":["There have been 3 other sightings in Onamia","There were 2 other sightings in Onamia on or around December 7th 2007","This sighting has never been favorited.",""],"Summary":"It flew over the top of the car, then went straight across the road, then just sat by a radio tower and turned off its white lights, as though trying to camoflaug its red lights with the tower.","Tags":"City","Weather Factors":"None","City":"Onamia","Case Number":"8584","Region":"Minnesota","Longitude":"-93.667746","Date Submitted":"12/07/2007 09:30 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=46.070515,+-93.667746(8584)&iwloc=A&hl=en\"> mufon case (8584) map </A>","files":["/var/www/straped/mufon/html2text/8584.html.txt","/var/www/straped/mufon/more/8584_submitter_file1__Elaina1.jpg","/var/www/straped/mufon/more/8584_submitter_file2__Sean10001.jpg","/var/www/straped/mufon/more/8584_submitter_file3__Tammy10001.jpg","/var/www/straped/mufon/more/8584_submitter_file4__Sean_Elaina_Tammy0001.jpg","/var/www/straped/mufon/org/8584.html"],"Sighting Duration":"Undisclosed","Object Shape":"Oval, Sphere","Disposition":"Unknown","Log Number":"US-12092007-0004","Latitude":"46.070515","Country":"United States","divs":["sighting detailswe were driving down highway 169 going north when a large object that was flying very low to the high way went over our car. it had two bright white lights that were almost like stobes, and a bunch of flashing red lights. after it flew over the car it remained flying very low along the tree line on the right side of the high way, it was going very fast, and then all of a sudden it shot straight across the road towards the west (left), and then came back south towards the car but on the opposite side of the highway. my boyfriend followed it with his eyes all the way next to the radio tower, about a 1\\2 mile later we were passing the tower and all of a sudden the brilliant white lights shut off and all i could see was the red lights flashing about 150 feet to the right of the tower, about 250-275 feet up in the air, it looked as though the object was trying to hide its self. we kept driving past the tower and about 1\\4 mile after we past the tower we saw its bright white lights turn back and at it flew straight up in the air and then was gone."],"Viewing Distance":"101-500 Feet"}