{"Object Features":"Dome","Country":"United States","trends":["There have been 3 other sightings in Onamia","There were 2 other sightings in Onamia on or around December 7th 2007","This sighting has never been favorited.",""],"Object Shape":"Oval","Longitude":"-93.662926","Date of the Event":"12/07/2007 09:40 UTC","Region":"Minnesota","Log Number":"US-12092007-0005","Disposition":"Unknown","divs":["sighting detailsi was driving about 65mph to 70mph in vehicle going northbound on 169. i noticed a object go through the top corner of my windshield it had two box lights on each side with flashing red and amber lights the color of it was almost silverish. i didnt know what it was looked very strange and big. it was flying northbound with highway 169 on the right of the highway over the trees about 250 feet in the air going about 90mph going very slow the object then increased speed went about 5 miles up took a right angle turn over the highway followed the highway back towards us but on the other side of the highway going southbound with the highway stoped by a radio tower that is about 300 feet in the air and while this happened i was driving watching its every move. we then went by the radio tower i had my window rolled down to ensure what i was seeing it had its white lights off and it was hovering 50 feet away from the tower in the air about a 3\\4 of mile i was still looking at it in my rear view mirror it hovered up above the tower 100 feet then took off straight up in the air. it was a very amazing sight, as this is my second encounter previous encounter was in 2000."],"Tags":"City","City":"Onamia","map":"<A HREF = \"http://maps.google.com/maps?q=46.077215,+-93.662926(8585)&iwloc=A&hl=en\"> mufon case (8585) map </A>","Viewing Distance":"101-500 Feet","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"None","Case Number":"8585","Source":"MUFON","Date Submitted":"12/07/2007 09:40 UTC","files":["/var/www/straped/mufon/html2text/8585.html.txt","/var/www/straped/mufon/more/8585_submitter_file1__Sean10001.jpg","/var/www/straped/mufon/more/8585_submitter_file2__Sean_Elaina_Tammy0001.jpg","/var/www/straped/mufon/more/8585_submitter_file3__Tammy10001.jpg","/var/www/straped/mufon/more/8585_submitter_file4__Elaina1.jpg","/var/www/straped/mufon/org/8585.html"],"Sighting Duration":"Undisclosed","Summary":"Saw a flying object go over the car going north on highway 169","Latitude":"46.077215"}