{"Latitude":"-34.606888","Viewing Distance":"Unknown","Object Flight Path":"Path with directional change","Longitude":"-58.371891","Tags":"City","Country":"Argentina","files":["/var/www/straped/mufon/html2text/8587.html.txt","/var/www/straped/mufon/more/8587_submitter_file1__DISCO-DE-METAL.jpg","/var/www/straped/mufon/org/8587.html"],"Object Features":"Other","Region":"Capital Federal","divs":["Sighting DetailsTHIS EVENING I COULD HAVE FILMED AN OVNI In broad daylight HAVING THE FORM OF A FLYING SAUCER OR SINCE(AS,LIKE) FORM OF CIGAR OR LENTIL THAT SOME THEY CALL HIM(HER). IT IS POSSIBLE TO TO SEE CLEARLY AS THIS OBJECT TURNS ENVIRONMENT TO HIS(ITS) AXIS(AXLE) BUT HORIZONTALLY AND A LITTLE SCARCELY IT(HE,SHE) CAN THERE TURNS THAT UNDER THIS EXISTS AS A BLACK OBJECT THAT TURNS FOR BELOW, DIFFICULTLY OF SEEING BUT IT IS POSSIBLE TO TO SEE. THE OVNI APARECIO TO 90 DEGREES IN THE ZENITH, BEING I PUT TO BED IN THE SOIL COULD SEE IT TO APPEAR, And THEN IT(HE,SHE) TAKES COURSE TOWARDS THE WEST, WHICH CLEARLY IN THE VIDEO IT IS POSSIBLE TO TO SEE. THERE COMES A POINT IN WHICH I DO ZOOM TO HIM(HER) AND THIS SHIP I KNOW ESCAPES FROM ME OF THE SCREEN, THEN I DO ZOOM BACKWARD AND IT IS ACHIEVED TO SEE THE WALL OF MY ROOF AND ALREADY IN THE SKY I KNOW AT ALL(NOTHING) ONE SEES. I DEVOTE MYSELF TURNED SIDEWARD WITH THE CHAMBER(CAMERA) THAT I KNOW IT ONE SEES ALSO IN THE VIDEO, BUT NOT THIS MORE OVNI. I EXTINGUISH THE FILMADORA, And TO SIMPLE SIGHT I MANAGE TO SEE IT BUT ALREADY WAS NOT ON THE WEST SINCE I KNOW DIRIGIO, BUT THAT WAS IN SOUTH DIRECTION AND ALREADY IT(HE,SHE) WAS MORE ABOVE(UP). THEN DESAPARECIO AT ONE STROKE. THIS OCURRIO IT BE 5:57:28 pm."],"trends":["There have been 17 other sightings in Buenos Aires","There were no other sightings in Buenos Aires on or around December 9th 2007","This sighting has never been favorited.",""],"Log Number":"AR-12102007-0002","Case Number":"8587","Date of the Event":"12/09/2007 05:57 UTC","City":"Buenos Aires","map":"<A HREF = \"http://maps.google.com/maps?q=-34.606888,+-58.371891(8587)&iwloc=A&hl=en\"> mufon case (8587) map </A>","Object Shape":"Cigar","Date Submitted":"12/09/2007 05:57 UTC","Source":"MUFON","Summary":"Cigar of metal.","Sighting Duration":"00:00:45","Weather Factors":"Windy","Disposition":"Unresolved"}