{"Case Number":"8596","Summary":"A strange ball-like thing with dissipating jet stream","City":"Santa Rosa City","map":"<A HREF = \"http://maps.google.com/maps?q=14.284302,+121.088893(8596)&iwloc=A&hl=en\"> mufon case (8596) map </A>","Latitude":"14.284302","Weather Factors":"None","trends":["There have been no other sightings in Santa Rosa City","This sighting has never been favorited."],"Object Shape":"Bullet, Missile, Fireball","Region":"CALABARZON","files":["/var/www/straped/mufon/html2text/8596.html.txt","/var/www/straped/mufon/more/8596_submitter_file1__20052007024.jpg","/var/www/straped/mufon/org/8596.html"],"Date Submitted":"05/20/2007 06:00 UTC","Object Features":"Unknown","Disposition":"Unresolved","Viewing Distance":"Unknown","Source":"MUFON","Country":"Philippines","Tags":"City","Date of the Event":"05/20/2007 06:00 UTC","Object Flight Path":"Straight-line path","Sighting Duration":"00:04:00","divs":["Sighting DetailsIt was approximately 6 pm when I was walking on the sidewalk of my home subdivision located in the city of Santa Rosa, in the province of Laguna of the country, the Philippines. The reason I was walking is to get to the nearby hobby shop to play trading cards and maybe some console games. The sky at that moment was pretty cloudy, although patches of cloudless sky can be seen, and sun, while setting, is partially visible. I first took notice of the object while I was trying to scan my current surroundings. When I first saw it, I thought it was a jet aircraft, since at first it has a jet stream, and the stream it left was really visible . What baffled me is that as it flew further, the jet stream it had produced has seemingly dissipated, although it still produces it, as if it was some kind of fragment. That baffled me because, of what I know of, jet streams produced by aircraft that produce them do not dissipate in a few moments, and, it didn't seem to resemble any conventional aircraft that we have . I also thought that it was a meteor, but it didn't seem to streak rapidly like one. I also thought it was a comet, since it characteristics are somewhat near to those of comets, but there were no announcements whatsoever that a comet was passing, so I also checked that one out. The object, seems to be round, and it gives a jet stream that dissipates rapidly, making it look like a comet or a meteor. Its movement is not erratic, it only moves straight in one direction. It seems to move toward the magnetic north or northwest, although when I saw it, it was in the east because the sidewalk I was walking is facing west. Although I cannot estimate how much, it was fairly high, but not high enough as it seems to pass through the clouds. I was fairly excited when I saw it, since I'm interested in UFOs. I was able to take a picture of it with my cellphone, a Nokia N70 with a 2 megapixel camera. It disappeared for a while due to cloud cover and the limited visibility at the sidewalk because it was near a wall. I tried chasing it by running towards the subdivision gates, as the sidewalk leads to the gates. After the sighting I showed the picture to my friends at the shop when I reached it. I lost sight of the object when it reached some distance, and due to the limited visiblity of the location, even when I got out of the subdivision gates and into the main street, I just lost sight of it, and I think it disappeared into the clouds. In my opinion, there is a high probability that the object I saw is identifiable, although up until now I still do not know what it is. Thank you."],"Longitude":"121.088893","Log Number":"PH-12122007-0002"}