{"Disposition":"Unresolved","Date of the Event":"06/10/2005 12:00 UTC","Log Number":"US-12132007-0002","Country":"United States","City":"Abingdon","Object Flight Path":"Undisclosed","Object Shape":"Circle","Viewing Distance":"Unknown","Longitude":"-90.401795","trends":["There have been no other sightings in Abingdon","This sighting has never been favorited."],"Summary":"I had seen large Orb several times in the area! While in our new pool at night!","Source":"MUFON","Date Submitted":"06/10/2005 12:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8600.html.txt","/var/www/straped/mufon/org/8600.html"],"Tags":"City","Region":"Illinois","map":"<A HREF = \"http://maps.google.com/maps?q=40.804483,+-90.401795(8600)&iwloc=A&hl=en\"> mufon case (8600) map </A>","Case Number":"8600","divs":["Sighting DetailsI told my fiance' several times about this light that would move in strange patterns above the house while I was lounging in the pool! I was floating on Mattress so at first I thought nothing of it! Then it started moving in even stranger patterns! Comming in closer! Then going back up higher! Movement was nothing! Like a plane or helicopter! Even considered it may be a stearman plane as we do have several local guys who fly these types! they said no! So my fiance started teasing! And it ticked me! Because it would come in close when I was alone! and act weird! But not when I would call him to look at! Had dogs in the yard and they would be watching it! and growling! Acting weird too!I would get weird feelings of electricity when I was in the water! Hair standing up! SO....that Christmas we get a New Video camera! And the following summer 2006! I got several different shots of it on tape! And I saw it several times through the winter months! But to cold to stand and video! I still have the tapes! I wouldn't tape over them!Soon after taping! The camera's battery started acting up!Thought I had screwed it up or something! So I bought new battery! Worked fine for a very short time! No problems! Then orb came back later in the summer of 2006 Taped it again! Camera!~ Battery would go low really fast and just shut off again!! I'd charge it again!It Worked fine! When I used it to tape the dogs and granddaughter! Then it came again! So I go get camera! And try to tape and again the cam would just shut off! Even when I new the battery was charged!So I went inside andthe camera would work fine! So then had some friends over!For a Barbique And again there it was! So I asked them what they thought. We laughed and threw ideas around!Andthen She Said that they were coming back to Abingdon from Gilson, IL. which is east of here! Just outside Knoxville! and that when they were out side of town here just out side of tiny town call Delong! That is about 4 miles from my back yard!Our house is located on the back side of abingdon, And They saw it moving strangly in the sky over Abingdon! And she said she told Dave that it looked like it was right over our house from where they were located in Delong!!And Dave said to her! I wonder if Bailey can see it! And they laughed about it! But they thought that it was very strange! Joking!!Not knowing that I had seen it a bunch of times! She also said that they had seen it several other times before that.When they were on the Delong Blacktop! So I know at least that I wasn't the only one that saw it!Don't know why it would hang around here! We are a tiny rural community! Where nothing happens!But if you want to video it ! Come on down! Also! I still have 1 maybe 2 of the recordings that I made! It comes regular & I just stopped trying cause the camera goes dead! I had so much photage!Didn't think I needed to keep all of them!If you would like I can send them to you! You can see what you think!Maybe you can tell me!I would explain it as a very large! Shiney ballbearing!The way that it shined it looked like a silver glass yarg globe! Just like a huge ballbearing! My camera only zooms so far!And it would be very large in the camera! If it was as far up as a star! My camera couldn't zoom in on it! I am not crazy! And it comes around often! and it has been happening regular for 3 years! Come on down! and check it out!Would love to know what it is!I don't have a cord that will allow me to send the video! I have an S-video cam!The tapes are very small! and I have not done anything to them! You can have them!Call me! if you like! I don't have to to fill all these things in!But the video! shows ir pretty well! Sincerely, Bailey"],"Latitude":"40.804483","Weather Factors":"Unknown","Object Features":"Undisclosed"}