{"Date of the Event":"12/13/2007 02:05 UTC","files":["/var/www/straped/mufon/html2text/8603.html.txt","/var/www/straped/mufon/org/8603.html"],"Object Features":"Undisclosed","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around December 13th 2007"],"divs":["Sighting DetailsAs I was leaving my home,I walked towards my car and heard an Airplane in the air.When I looked up I imediately saw 4 ojects following the plane, At first I thought they were gray balloons. As the plane began to make a turn headed North five more objects came into view. What puzzled me was that they were not in any formation. They just looked like balloons. All of a sudden the first 4 objects I saw, split into two pair and sped off and each pair went to oposite sides of the plane (wings) as though they were escorting it.The other 5 objects then came out of there jumbled mess and form a formation(V Type) behind the plane. They moved very quickly.Very controlled with no noise. They appeared to glide into position All you could hear was the plane.In looking at what I was seeing all kinds of things were going off in my mind.I tried to discount it by thinging a big shot from Washington was in town and he had a military escort.But I later found that no-one was in town. and would you really need nine escorts.I remember saying to myself when observing the objects.We must have some very fast small planes.Although I could make out the plane they were following by seeing the wings and body as well as the tail.There were no wings or tail section visable on the objects. Just a grey sphere.I watched the plane and the objects until they were out of view.The encounter lasted 3-4 minutes. This is so true........Someone needs to come clean on what this was. Absolutely incredible!!!!!!!"],"Object Shape":"Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=36.116456,+-115.170286(8603)&iwloc=A&hl=en\"> mufon case (8603) map </A>","Log Number":"US-12132007-0005","Latitude":"36.116456","Object Flight Path":"Undisclosed","Tags":"City","City":"Las Vegas","Sighting Duration":"00:04:00","Country":"United States","Viewing Distance":"Unknown","Date Submitted":"12/13/2007 02:05 UTC","Disposition":"Unknown","Weather Factors":"None","Summary":"Nine Objects folling a large plane","Source":"MUFON","Region":"Nevada","Case Number":"8603","Longitude":"-115.170286"}