{"Log Number":"US-12142007-0002","Object Flight Path":"Undisclosed","Case Number":"8605","files":["/var/www/straped/mufon/html2text/8605.html.txt","/var/www/straped/mufon/org/8605.html"],"Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"00:05:00","Source":"MUFON","Region":"Indiana","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.557196,+-85.599294(8605)&iwloc=A&hl=en\"> mufon case (8605) map </A>","divs":["Sighting DetailsI WAS GOING HOME FROM MY DAUGHTERS HOUSE ON THE BACK COUNTRY ROADS WHICH ARE COUNTY ROAD 450 N AND 300 WEST WHEN I STOPPED AT THE STOP SIGN I SAW A BRIGHT WHITE BEAM OF LIGHT OVER THE TREES TO THE NORTH EAST OF ME ALONG COUNTY ROAD 425 NORTH. I ROLLED DOWN MY WINDOW WHEN I WATCH THE OBJECT QUICKLY SHUT OFF THE BEAM OF LIGHT AND SLOWLY COME ACROSS THE ROAD AND ACROSS THE FIELD IN FRONT OF ME. IT HOVERED DIRECTLY IN FRONT OF MY CAR FOR A FEW SECONDS AT WHICH TIME I BECAME VERY SCARED TO THINK IT WAS SO CLOSE TO MY ONLY GRANDSON'S HOUSE AND I DO BELIEVE IF IT TURNED THE LIGHT ON I WOULD BE A PILE OF DUST IN THE ROAD OR SEVERLY BURNED. IT SUDDENLY BANKED AND TURNED TO THE SOUTHWEST AND CROSSED OVER COUNTY ROAD 500 OR GEM RD AND I FOLLOWED IT. IT APPEARED DARK AND RECTANGULAR CROSSING THE FIELD BUT WHEN IT GOT OVER 500 & 300 I COULD SEE IT HAD A MISTY CLOUD AROUND IT AND IT WAS A GUN METAL GRAY COLOR AND WAS A CIRCULAR OBJECT WITH THREE OLD AUTOMOBILE ROUND LIGHTS ON THE SIDE THAT WERE WHITE AND BLINKED ON & OFF VERY SLOWLY. I HAVE LATER SEEN THE THREE LIGHTS IN THE SAME AREA AND A ROUNT ORANGE-RED BALL OF LIGHT IN THE SAME WOODED AREA WHERE I FIRST SPOTTED THE OBJECT. I AM A 60 YEARS OLD AND I AM NOT ON DRUGS OR DO NOT DRINK OR EVEN SMOKE. I HAVE NEVER SEEN ANTHING LIKE THIS OBJECT. IT DID NOT MAKE ANY SOUND AND WAS ABOUT 25-30 FEET WIDE AND COULD TRAVEL AS IF IT WAS GLIDING THUR THE ATMOSPHERE. I CALLED THE LOCAL AUTHORITIES, CIA, FBI AND THE FAA AND REPORTED THIS AND NO ONE WAS OF ANY HELP IN FINDING OUT WHAT THIS OBJECT WAS AND WHY IT IS IN OUR COUNTRY. I DO NOT BELIEVE IT IS ONE OF OUR MILITARY PROJECTS. I RECEIVED BURNS TO MY EYES AND MY NAILS ON MY LEFT HAND BROKE AND CRACKED AND I FELT WEIRD FOR ABOUT A WEEK. I HAVE FOUND OUT THAT ANOTHER ELDERLY COUPLE SAW AN OBJECT AT COUNTY RD 200 WEST IN THE SAME AREA IN APRIL 2006. I HAVE BEEN TOLD THAT A YOUNG LADY THAT LIVES IN THE SAME AREA HAS SEEN THREE ORANGE COLORED LIGHTS AT DIFFERENT TIMES THAT REMAIN STATIONARY AND FADE IN AND OUT OF SIGHT. I INTEND TO LOOK FOR SIGNS & KEEP A WATCH ON THIS AREA AND GET PICTURES OR VIDEOS OF THESE OBJECTS. I DO NOT LIKE ANYTHING THAT MAY POSE A THREAT TO MY FAMILY OR TO MY COUNTRY. I AM AMAZED AT HOW MANY PEOPLE ARE BRAIN WASHED IN THINKING THAT NOTHING LIKE UFOS COULD EXIST."],"Longitude":"-85.599294","City":"Undisclosed","Object Shape":"Circle, Square, Rectagular","trends":[],"Date of the Event":"04/06/2007 10:45 UTC","Viewing Distance":"Unknown","Date Submitted":"04/06/2007 10:45 UTC","Latitude":"40.557196","Summary":"OBSERVED UFO OBJECT & MISTERIOUS LIGHTS IN SAME AREA IN HANCOCK COUNTY IN","Tags":"City","Object Features":"Undisclosed"}