{"Case Number":"8607","Viewing Distance":"Unknown","City":"Ashland","Disposition":"Insufficient Data","Date Submitted":"12/14/2007 02:15 UTC","files":["/var/www/straped/mufon/html2text/8607.html.txt","/var/www/straped/mufon/org/8607.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.197626,+-122.704917(8607)&iwloc=A&hl=en\"> mufon case (8607) map </A>","Region":"Oregon","Weather Factors":"Does Not Apply","divs":["Sighting DetailsMy name is Adrian Rehn. I was born in my eskimo villiage in Mendecino, California. At my bith, one of the elders predicted that I would have contact with a being unknown to the world. He was very old, though, and many disregarded his remarks. But we should have known better. Just this afternoon, I made the short walk from Ashland High School to my house. Just a few minutes after getting home there was knock on the door. I opened it and it was one of my friends Alex Nagel. I was surprised to see him, as he usually doesn't come over. He told me that I was to come with him somewhere. I asked him where. All of a sudden, my body began to vibrate and then all of a sudden I blacked out. The next thing I knew, I was seated in a white room. Alex was there and so was another of my friends, Wes Overland. I asked the what on Earth was going on. Alex said that we're not on Earrth. All of a sudden, the dome of the room opened and revealed that we were drifting in space. I could clearly see planet Earth from my position. They said that they had chosen me to be the bearer of tidings to our race, that there is another people similar to ours that have come to help us. They said that they have been on our planet for around 10 years or so. They are one of the few survivors of a planet thats history started around three million years before ours. They created ships that could sustain them for many years, but also created a super weapon that detonated before most of the planets inhabitants could escape. They are very similar to us, though they have been unable to reproduce on our planet, due to bad environmental conditions. They also have a life span around five times longer than ours, though many of them have died as their immune system was unready for some of our diseases. They ask that we help them find a way to seproduce in return for helping aide our politicians from making the same mistakes that cost them their planet. I once again blacked and then found myself in my room when I regained conciousness. I pray that we can help these peaceful people so that may help us."],"trends":["There have been 10 other sightings in Ashland","There were no other sightings in Ashland on or around December 14th 2007"],"Log Number":"US-12142007-0004","Sighting Duration":"00:40:00","Country":"United States","Object Shape":"Circle, Oval","Source":"MUFON","Latitude":"42.197626","Tags":"City","Longitude":"-122.704917","Date of the Event":"12/14/2007 02:15 UTC","Summary":"Close encounter of the 4th kind","Object Flight Path":"Unknown","Object Features":"Window(s)"}