{"divs":["Sighting DetailsI was looking out the dining room window at about 7:45 pm, waiting for my wife to come home from work, and was casually scanning the night sky as I usually do, watching the aircraft coming to and from from O'Hare and Midway. I noticed two reddish-orange pulsating lights coming over the horizon, beyond the trees, from the northeast, that immediately struck me as unusual because they were a reddish-orange, rather than white as commercial aircraft lights usually are, but I thought perhaps they were just different colored wing tip lights, and that maybe they looked colored because of the flight path towards me. When I first noticed them, they appeared to be about a handspan apart, then, as I watched with increasing amazement, they came closer together. My next thought was I was that I was watching private aircraft that for some reason were coming dangerously close. At that point, my wife came down the street to our house, and I ran out onto to the front porch (temperature outside was about 23 degrees)and frantically waved at my wife to get out of the car (she had pulled part way into the driveway), gesticulating wildly to get to her to look up to the northeast. She joined me on the porch, as 4 more pulsating lights appeared over the horizon, again ranging from a yellowish red to a reddish orange, with three of the lights spaced equidistantly on a diagonal, with the fourth, brighter \"larger\" light at the bottom of the diagonal and an arms' length from the three. As my wife and I watched, the three lights on the diagonal moved closer together, and then the \"top\" light began to dim, finally disappearing altogether. The other two lights dimmed, and then disappeared. However, the fourth light kept coming towards us, getting somewhat brighter. I ran back into the house and got our binoculars. My wife and I both observed the light through the binoculars, and it appeared to be a solid, glowing, reddish-orange orb. No aircraft light triangulation, no blinking lights. It moved somewhat slowly and deliberately until it appeared to be nearly over our house, and then disappeared, in that the light dwindled in apparent size and intensity and then appeared to blink out. The skies were partly cloudy, but clear over our house, with a crescent moon to the southwest, behind us and not visible in the section of sky we were looking at. The lights all seemed to move at approximately the same speed, which made me think initially I was watching aircraft flying in formation, and strangely occupying the same airspace at the same time. My wife, who is a veteran air traveler, agreed with me that what we saw were not commercial or privaate aircraft. And we both have seen meteors (Perseids) at night,which have a downward trajectory, and these lights moved too slowly and deliberately on an apparent upward trajectory, to have been a series of meteors streaking across the sky. We're hoping to hear something on the news or in the paper, and hoping to hear that others in Naperville saw the same thing. I was very excited after seeing these aerial phenomena - it reminded me very much of the scene in Close Encounters of the Third Kind when the people gather on the hillside and watch the \"lights\" moving gracefully in the valley below."],"files":["/var/www/straped/mufon/html2text/8608.html.txt","/var/www/straped/mufon/more/8608_submitter_file1__UFOSightingEvepagetwo.jpg","/var/www/straped/mufon/more/8608_submitter_file2__UFOSightingEve.jpg","/var/www/straped/mufon/org/8608.html"],"Log Number":"US-12142007-0005","Country":"United States","Object Shape":"Star-like","Weather Factors":"Unknown","Source":"MUFON","Latitude":"41.767915","City":"Aurora","Object Features":"None","Longitude":"-88.316152","Case Number":"8608","Object Flight Path":"Path with directional change","Tags":"City","Summary":"Series of bright single-point colored lights flying in formation from the northeast","Disposition":"Unknown","Date Submitted":"11/14/2007 07:45 UTC","Sighting Duration":"00:15:00","Region":"Illinois","trends":["There have been 7 other sightings in Aurora","There were no other sightings in Aurora on or around November 14th 2007","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=41.767915,+-88.316152(8608)&iwloc=A&hl=en\"> mufon case (8608) map </A>","Date of the Event":"11/14/2007 07:45 UTC","Viewing Distance":"Over One Mile"}