{"Log Number":"US-12152007-0001","City":"Glassboro","trends":["There have been 3 other sightings in Glassboro","There were no other sightings in Glassboro on or around January 15th 1999","This sighting has never been favorited.",""],"Longitude":"-75.105762","Source":"MUFON","Object Features":"None, Unknown","Date of the Event":"01/15/1999 08:05 UTC","files":["/var/www/straped/mufon/html2text/8610.html.txt","/var/www/straped/mufon/more/8610_submitter_file1__mufonreportimg.jpg","/var/www/straped/mufon/org/8610.html"],"Country":"United States","Region":"New Jersey","Case Number":"8610","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=39.707942,+-75.105762(8610)&iwloc=A&hl=en\"> mufon case (8610) map </A>","Viewing Distance":"101-500 Feet","Latitude":"39.707942","Object Shape":"Disc","Weather Factors":"None","Disposition":"Unknown","Summary":"From the road I saw a fiery disc moving just above the treeline surrounding a field.","Sighting Duration":"00:00:40","Date Submitted":"01/15/1999 08:05 UTC","divs":["Sighting DetailsI was a junior in High School at the time; I am now 23. My mother was driving me to a doctors appointment in the next town over. ( I had a sinus infection. ) My appointment was at 8:30Pm. Being that it was wintertime, it was already pretty dark. We left our house at 8:03pm and drove west down the road we lived on, onto a road called Lehigh. On the left hand side of Lehigh rd. was an un-farmed field with a small woods bordering it to the west and South West, if I have my directions straight. ( the woods are probably about 150 yards from the road. ) There are a few homes on the right side of the road. We were riding in a Ford van ( like a church bus ) with windows all around. I was in the second row of back seats. I looked over toward the woods and saw a bright object over the tree- tops. It was bright yellow- almost white and although I couldn't see anything but the glow, it looked very solid. What I mean is, it was not like a reflection in the window but something really there. It was like a little disc- shaped sun. It moved back and forth over the treetops horizontally. The movement was fast but very smooth. It moved as though it could stop on a dime and instantly be moving in the opposing direction. This whole time we were still traveling down the road at about 30mph. Surprisingly my mother did not appear to see it. And as we moved past it and out of view I dazedly said \" hey, stop. \" My mother kept driving to the next stop sign about 20 yards down the road. THEN she stopped and asked me what the matter was. I told her to go back because I saw something and she asked me what I saw. I told her to never mind, lets just go. Though it was a surprise to see the object, for some reason I felt like the whole thing was nothing exciting. By the time I had gotten home from my appointment I had forgotten all about it. I remembered it later that night but it wasn't a big deal and I didn't talk about it to anyone. Sometimes I wonder if my mother did see it but had the same odd \"move along, nothing to see here\" reaction that I did. It was a few years before I really took any interest in my personal experiences. This was triggered by seeing other objects in the sky and having a long rash of unsettling dreams."],"Tags":"City"}