{"Log Number":"US-12152007-0008","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"12/11/2007 06:10 UTC","Weather Factors":"Unknown","Latitude":"26.650478","City":"Fort Myers","Object Shape":"Bullet, Missile, Cone, Sphere, Other, Unknown","divs":["sighting detailsevent; 12-11-07...at approximatly 1800 hours...dark outside...clear sky, no clouds, nothing but stars... facing west at about 11;00 high, almost straight up...bright object, size of a quarter at arms length... looked like comet pictures, bright head w\\ cone shaped white wide tail, not long tail, reminded me of what the shuttle blastoff is like with the short but bright cone tail, but entering orbit. when we first seen it it was coming towards earth, head of it like a star with cone tail, kept coming towards us,but at orbit high...then after about 10-15 minutes it seemed to be moving away with the tail getting fog like, and couldn't see the bright head or front of the object...then dimmer and dimmer until it looked like a haze in the pitch black sky. throughout the whole time it never traveled more than 6 inches, at arms length, across the sky. everyone seen it here, daughter was visiting, she took video but she hasn't checked it yet, called my brother in marco island, an hour south of us, he seen it also, looked the same... checked for comets, missiles online...nothing... anyone that can figure out what it was or seen it, please let me know. thanks, bryan"],"Date Submitted":"12/11/2007 06:10 UTC","Disposition":"Unresolved","Case Number":"8617","map":"<A HREF = \"http://maps.google.com/maps?q=26.650478,+-81.867348(8617)&iwloc=A&hl=en\"> mufon case (8617) map </A>","trends":["There have been 41 other sightings in Fort Myers","There was one other sighting in Fort Myers on or around December 11th 2007"],"Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Longitude":"-81.867348","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/8617.html.txt","/var/www/straped/mufon/org/8617.html"],"Object Flight Path":"Stationary,Hovering then path,Unknown","Region":"Florida","Summary":"Unknown"}