{"Country":"United States","trends":["There has been one other sighting in Stoutsville","There was one other sighting in Stoutsville on or around July 5th 2007","This sighting has never been favorited.",""],"divs":["Sighting DetailsMother-On July 5, 2007 at 11:30 pm I was driving east. In front of me an oject( at first believed to be a plane) looked like it was going to land. (Two headlights on front, shinning through the fog.) We stopped the car so it could land, but it stopped in mid-air, I turned right and it turned with us. We would go, it would go, we would stop , it would stop. I rolled down my car window, looked up and saw a triangular shaped object with pink and blue lights.( It made no sound!) My daughter was crying for me to drive. We got home in our house. Went to the front window. It was sitting (hovering) in front of house and slowly starting going towards the house across the road, barely over trees over their house. Turned to right and continued back on its course. (The bottom of craft looked like the underneath of a car.) Daughter-Traveling East we were turning right onto another road when we spotted the white headlights peering through the fog in front of us. We hesitated as the object turned with us and stopped when we did and went when we did. Looking above us we saw a triangular figure with pink and blue lights (very few). We frantically rolled down the windows to hear silence. The object stayed stationary for an unreal amount of time. We speeded off towards the house and the \"object\" went back to its orginal path barely making it over the 2 story farm house. When we first stopped it was thought to be a plane."],"Sighting Duration":"Undisclosed","Longitude":"-82.826403","Latitude":"39.606595","City":"Stoutsville","Case Number":"8620","Object Shape":"Chevron, Square, Rectagular, Triangle","Source":"MUFON","Date of the Event":"07/05/2007 11:30 UTC","Region":"Ohio","Log Number":"US-12162007-0003","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8620.html.txt","/var/www/straped/mufon/more/8620_submitter_file1__MufonTM050707sketch.jpg","/var/www/straped/mufon/more/8620_submitter_file2__MufonTM050707UFOapparentsizechart.jpg","/var/www/straped/mufon/org/8620.html"],"Viewing Distance":"21-100 Feet","Object Features":"Patterned Surface, Wings","Tags":"City","Weather Factors":"Fog, Light","Date Submitted":"07/05/2007 11:30 UTC","Summary":"Saw object approaching which thought was an aircraft, but the oject got closer and appeared to hover","Object Flight Path":"Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=39.606595,+-82.826403(8620)&iwloc=A&hl=en\"> mufon case (8620) map </A>"}