{"Object Features":"Undisclosed","divs":["Sighting DetailsI bought a home at the edge of a canyon neer around the town of Paradise. Within the first year I began hearing a high pitched sound that resembled a misqueto on the ceiling of my bedroom directally above my head. As time went on I heard this sound neer the light bar above the mirror in the bathroom. Later I noticed that it was following me around the house and into the bathroom late at night or early in the morning when it was quiet. This activity really began to bother me, so I tried to get it to leave by voiceing my illfeelings to it in a loud, threatening tone. To cut to the chase, in the summer of 2005 after watching a movie on TV, I looked out of my office window which overlooks the canyon. There was a large bright object in the sky in the East at about 10 oclock in the sky at about 12 midnight. I thought it must be a helicopter hovering. So I went out on the back porch and didn't hear anything. I sat down and noticed that it was hovering. It was not holding it's position, but slightly bobbing up and down and side to side. With a telephoto lense on my camera I could see a dazzling, sparkeling object with intermittant blue and red flashes. I began hearing the distinct sound of humanoids walking in my bedroom in the night and finally contacted a few local physics to look into the situation. I have taken photo's of being's in my bedroom and some of the lightcraft in the sky. This activity still continues today, and I have reason to believe they have been tracking, and studying me all my life, and in many other past lives. I believe that they have been intentionally isolating me for their purposes. And they have been meddeling in my fianancial affairs and are screening me away from involvement with the ladies. This negitive involvement in my life is totally unacceptable to me and it's time to get these monkeys off my back. I have contacted Jeremy, a Mufon field investigator in Sacramento."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.812106,+-121.578306(8622)&iwloc=A&hl=en\"> mufon case (8622) map </A>","files":["/var/www/straped/mufon/html2text/8622.html.txt","/var/www/straped/mufon/more/8622_submitter_file4__IB_ChannelMixerColor.jpg","/var/www/straped/mufon/org/8622.html"],"Longitude":"-121.578306","Date of the Event":"11/30/2007 12:00 UTC","Object Shape":"Star-like, Other","Viewing Distance":"Unknown","Region":"California","City":"Magalia","Summary":"ongoing visitations from lightbeings in a variety of lightcraft, nightly sinse 2005 years","Case Number":"8622","Log Number":"US-12162007-0005","Object Flight Path":"Undisclosed","Source":"MUFON","Latitude":"39.812106","Date Submitted":"11/30/2007 12:00 UTC","Tags":"City","trends":["There have been 7 other sightings in Magalia","There were no other sightings in Magalia on or around November 30th 2007","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Country":"United States","Disposition":"Unknown","Weather Factors":"Unknown"}