{"Summary":"OBSERVED OBJECT HOVER BLACK & RECTANGULAR THEN CLOSER VIEW CHANGED TO CIRCULAR OBJECT ON 4/6/07.","divs":["sighting detailsi was amazed and stunned while going home from my daughters house late friday eveing of 4\\6\\07. i came to a stop sign at county rd 450s and county road 300 west and looked northeast to see a large white light shinning down on a tree at the edge of the wooded area. i felt something was strange about this right from the start since it immediately switched off the white beam of lihgt as soon as i stopped and watched the object. it came across the road 425 north and across the bean & corn fields and never turned on any lights and it was a cool clear night. it appeared black and rectangular and looked like it was going to come right over me when it stopped across the road from me and hovered for a minute or so. i was scared at this point and with my window rolled down i never heard any noise such as an engine etc. i was glad it turned and went slowly about 4-5 mph over county road 300 west and county road 500 or gem road. i was determined to get a better look so i raced to the stop at 300 & gem rd. it was turning on side lights that looked like old round automobile lights but larger that where white and blinked on and off in some kind of sequence. i could see a cloud or mist surrounding the objcet and it was circular and silver or gray in color. it has three lights on the side that i viewed and appeared to be headed to the south towards us 52 i would guess just east of german church rd and gem road. i watch it till it moved over the tree line and out of sight. i would guess it to have been 30 feet across. i went home and called my sister and told her you would never guess what i have witnessed. i called the local authorites the next day and spoke to a marion county sheriff and was told that no other reports were called in about the object. i was the only one on the county road at the time but there were cars that were going north on gem road when it crossed over them with the lights off. i was determined to find out what this object was so i reported to the cia, fbi and the faa. i was told that the military could not confirm or deny any object on radar. i believe the object flies just under the radar. it was low just above the tree tops. i believe it used the side lights like we use our headlights on cars to keep away from power lines, etc. i was always looking in the area to see if i seen anything else when a couple of months later i saw three orange lights in perfect distance apart just above the tree line in the same area but south of county road 300 west. i never saw the object but i believe these lights were the same side lights i has seen on the object in april just from the spacing and the large round lights. they were orange this time but it was arount 4:30 pm in the afternoon. i was driving one afternoon and spotted a large reddish orange basketball size ball above the tree line in the same wooded area. also, i was coming home on a sunday night about 8pm one evening when i saw a strange thing occur. it looked like a misty cloud over the exact tree line area i first saw the object in april. the misty cloud was like hovering over the tree line when it suddenly shot to the east up into the clouds. it was in august i believe and was still somewhat light outside. i have never seen any cloud look or act like this one. i have been ridiculed and laughed at by me family and oddly my friends that are close believe that i saw an object that was unconventional. i have told people it may be something we have made but it runs off of a different propulsion system than we are familiar with today. i am concerned due to the fact that some object unfamiliar to me in flying withing 1\\4 mile from my only grandson's house. i want to know what it is and why does it act so strange. i did have burning to my eyes and my nails on my left hand cracked and broke off. i had a funny feeling in my body like something crawling under my skin for a couple of days. i would not want anyone to attempt to get any closer that i did to this object and i would advise you to stay in your car or get under something if you ever encounter any object you cannot identify. also, i have been in contact with an elderly couple who seen an object they described as cigar shaped on the ground at the edge of this woods on county road 200 west which is the next road north of where i saw the object. i believe it has a pattern and time of year it appears. the elderly couple said they had seen the object in april, 2006 about the same time of year and the first week of april. i will be equipped next year to get this thing on tape and pictures if i am not so amazed that if forget what to do. i have spoken to jerry sivers several times in reference to my sighting. i will answer any questions you might have about my sighting. i can tell you i am 60 years old and i do not drink or take drugs and i don't even smoke. i have never been treated for any mental problems and consider myself a normal average working grandma that loves her family. i don't worry about myself but about the future generation and the security of our country. it seems to me nobody knows what to do when someone reports something like this. the usaf has been told to ignore and dismiss reports since project blue book was closed but our country also ignored the terriorist attact possibility that happened in new york. i hope we do not ignore signs and reports and find out too late we could and should have taken these sightings as important and significant to the security of our citizens and country."],"Source":"MUFON","Sighting Duration":"00:05:00","Log Number":"US-12172007-0004","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8626.html.txt","/var/www/straped/mufon/org/8626.html"],"trends":["There has been one other sighting in New Palestine","There were no other sightings in New Palestine on or around April 6th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.721988,+-85.889147(8626)&iwloc=A&hl=en\"> mufon case (8626) map </A>","Region":"Indiana","Weather Factors":"Unknown","Case Number":"8626","Latitude":"39.721988","City":"New Palestine","Longitude":"-85.889147","Country":"United States","Object Features":"Dome","Viewing Distance":"21-100 Feet","Tags":"City","Object Shape":"Circle, Square, Rectagular","Date of the Event":"04/06/2007 10:45 UTC","Object Flight Path":"Hovering then path","Date Submitted":"04/06/2007 10:45 UTC"}