{"Country":"United States","Source":"MUFON","trends":["There have been 8 other sightings in Newport","There were no other sightings in Newport on or around December 15th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.494322,+-71.308608(8628)&iwloc=A&hl=en\"> mufon case (8628) map </A>","files":["/var/www/straped/mufon/html2text/8628.html.txt","/var/www/straped/mufon/org/8628.html"],"Date Submitted":"12/15/2007 07:15 UTC","Tags":"City","Longitude":"-71.308608","Log Number":"US-12172007-0006","Object Shape":"Unknown","Case Number":"8628","Date of the Event":"12/15/2007 07:15 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Newport","Viewing Distance":"Unknown","Latitude":"41.494322","divs":["Sighting DetailsFour of us were riding on Ocean Bvd (heading south) in Newport RI trying to observe the seacoast homes (it was dark). As we passed the last ocean front homes and looked out at the open water, I noticed lights over the water's surface, appearing perhaps as far out as the furtherest house jutting out on a peninsula earlier. The lights were vertical, 3 equidistant rows of orange-yellow color, that seemed to hover over the water. I would estimate that the size of the object was equal to my thumb nail at arms-length. I asked the others in the car what they thought the lights were. I have been to the area many times in the past and know that there are no bouys or other objects where the lights were located. We tried to explain the lights as a boat, buoy, island of rocks, but it didn't seem plausible. I stopped the car. There were no other cars coming in either direction, so I drove left facing the lights and turned on my high beams. We still could not make out any shape behind the lights. I backed up and proceeded southerly slowly watching the lights when my son's girlfriend exclaimed \"Look, it's moving\". When I looked it moved rapidly to the south, still just above the water. I accelerated down the road to try to keep up with the lights. It stopped abruptly and I caught up in perhaps 5 - 10 seconds. My wife was frantic at this point wanting to leave while my son's girlfriend was laughing, perhaps nervously. At this point we all realized (me, my son, his friend, and my wife)that we weren't just looking at normal lights. I drove down to the point, turned again in its direction, and again not seeing anything other than the lights, went north back in the direction we had come. The lights stayed in the position we last saw them, so we slowly drove away. The next day we went back in daylight and confirmed the lack of any structure in the bay area."],"Disposition":"IFO","Object Flight Path":"Undisclosed","Summary":"Hovering lights over bay off Ocean Blvd Newport, RI","Region":"Rhode Island"}