{"divs":["Sighting DetailsI was at my brother's house in winfield and we were sitting in the backyard. There's a small cornfield in the back so the sky is viewable for miles. My other brother was shooting his arrows at a target and all of the sudden we heard him gasp. He pointed to the sky and we saw this exact object hovering above a cemetery accross the cornfield. The object was moving, but at a very slow pace. The movement of the object was very smooth from what i remeber. There were no sounds, so it was not an airplane. The object looked like a ringed-planet with a metallic reflection. My thought of it being a plane was then lost. I had never beleived in ufos and thought of everyone who did as crazy. The object had breif periods of pause, and then continued to glide through the sky at a constant height. I was taking pictures of my brother and his arrows prior to the incident. The camera was a throw-away so the picture came out blurred and the detail is poor which I apologize for. The three of us just starred at the object as it glided over Assumption Cemetery. Just for your idea of the location, Assumption Cemetery is across from Cantigny Park. After almost three minutes of watching, the object went higher and then stopped. It then slashed into the sky, leaving a short trail of cloudy white gas. Later that night, my brother called us around 10:45 pm saying he saw \"glowing green streams slithering\" in the same area we had seen the object. This was a scary event and now i truly beleive in ufos. I went to bed shortly after the phone call."],"Object Features":"None","Latitude":"41.887444","Longitude":"-87.625128","Weather Factors":"Unknown","Date Submitted":"09/11/2007 01:27 UTC","Region":"Illinois","Sighting Duration":"00:02:51","Source":"MUFON","Log Number":"US-12172007-0007","Country":"United States","Date of the Event":"09/11/2007 01:27 UTC","City":"Chicago","Summary":"I caught this in Winfield in my brother's backyard. The area is very open. Flashes of light later that night.","Case Number":"8629","Disposition":"Hoax","Tags":"City","Object Shape":"Saturn-like","trends":["There have been 221 other sightings in Chicago","There were no other sightings in Chicago on or around September 11th 2007","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/8629.html.txt","/var/www/straped/mufon/more/8629_submitter_file1__ufos.jpg","/var/www/straped/mufon/org/8629.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=41.887444,+-87.625128(8629)&iwloc=A&hl=en\"> mufon case (8629) map </A>"}