{"Country":"United States","Object Flight Path":"Straight-line path","Date of the Event":"11/06/2007 05:08 UTC","Sighting Duration":"Undisclosed","Case Number":"8638","Latitude":"39.543641","Region":"Nevada","Longitude":"-119.747829","Object Shape":"Other","Summary":"I saw this black glob while stuck in traffic.","Viewing Distance":"101-500 Feet","Source":"MUFON","trends":["There have been 23 other sightings in Sparks","There were no other sightings in Sparks on or around November 6th 2007","This sighting has never been favorited.",""],"divs":["sighting detailson 11\\6\\07, i was driving home from work and stuck in 5 o'clock traffic. the sun just went down so there was still light. i notice in front of me a few miles away this object coming at me. at first i thought it was a helicopter but i thought it odd that it didn't have it's light on. it was moving at a steady rate about 45-50 mph. as it got closer it moved to my left. it was about 300 feet up and about 500 feet away. it looked like big black balloons meshed together. it's weird, it seemed to change shape as it got closer. it stayed in a straight line and headed south then went out of my sight. i thought that hundreds of people must have seen this. as soon as i got home i wrote down what i saw then i called the tv station to see if anybody reported anything. they said it might be the shuttle landing. i live in sparks nv and this happened at 5:08 in between york and mccarren. it flew right over raleys heading sw toward mt rose. there was no wind and no sound. i've never seen anything like it and i'm sure there are allot more people who saw it. i wish i would have had a video cam."],"Weather Factors":"Unknown","Disposition":"Unknown","City":"Sparks","map":"<A HREF = \"http://maps.google.com/maps?q=39.543641,+-119.747829(8638)&iwloc=A&hl=en\"> mufon case (8638) map </A>","Date Submitted":"11/06/2007 05:08 UTC","Log Number":"US-12192007-0007","Object Features":"Other","files":["/var/www/straped/mufon/html2text/8638.html.txt","/var/www/straped/mufon/more/8638_submitter_file1__SIGHTINGCAMPIC.jpg","/var/www/straped/mufon/org/8638.html"],"Tags":"City"}