{"Case Number":"8642","Object Flight Path":"Path with directional change","Date Submitted":"05/21/1994 12:00 UTC","Longitude":"-111.935015","map":"<A HREF = \"http://maps.google.com/maps?q=33.42657,+-111.935015(8642)&iwloc=A&hl=en\"> mufon case (8642) map </A>","Object Features":"None","Summary":"Desended from cloud overhead revolved in a circle then went back up in same exact spot.","Weather Factors":"Unknown","Latitude":"33.42657","Tags":"City","Log Number":"US-12202007-0004","divs":["Sighting DetailsMe and my wife were just about asleep when our big Chow dog jumped on our bed standing looking out the window. I kicked him off. he never does that when i'm in bed. Then he did it again, my wife said Rick look at him so i looked at him. He was standing still as can be staring out the window and growling. I sat up right away and he stayed there without looking at me at all. I looked out side down at the pool but no one was there.( we were in a two story apt.) I looked back at the dog and he wasn't looking at the ground but the sky!!! so I looked up there, it was so quiet and still. no clouds were moving. Then desending from the clouds was a flying saucer as clear as can be. It had lights under the bottom of it, maybe about 10 in the middle as a circle pattern. the lights were all the same color, the same light color as a candles glow. The sky was normally lite by the city so it wasn't dark. When the saucer came straight down from the clouds slowly it was revolving slowly and made a small circle just under the cloud lining then as if it can see the clouds it went straight up the hole in the clouds that it made when it desended. Now when the saucer went up it looked like it pulled some of the clouds after it, like a wake in a pool. By the time i said \"There's a UFO!\" my wife just missed it. we sat there for hours waiting to see it appear at the far edges of the entire cloud. (the cloud was pretty far, about the size of Tempe itself. What is remarkable is that the saucer was close, so close that it would take a basketball at arms length to hide it, YET!!! soon came a regular Americawest airliner STIL UNDER the cloud lining. that same cloud that never moved. The saucer was an easy 30 times bigger than it! Also the lights of the plane were differant than the lights on the Saucer, they were brilliant and white. The next day we called 911,,,they laughed and told us to call the Airport SkyHarbor tower, they gave me the number. I called and they laughed at me too. I was sort of upset because all i wanted to do is let somebody know. Prior to this i NEVER believed in UFO's because being a strong born again christian at the time, I believed it was just people who dabble with the occult, I was wrong the object was real and was out there and not an aperation at all. I never did draw it although i am an artist, i can still picture it. Rick Espejo, Former Federal Courtroom Sketch Artist. for KPHO"],"Country":"United States","Viewing Distance":"Over One Mile","Sighting Duration":"00:00:10","Date of the Event":"05/21/1994 12:00 UTC","City":"Tempe","Region":"Arizona","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8642.html.txt","/var/www/straped/mufon/org/8642.html"],"Object Shape":"Disc","trends":["There have been 36 other sightings in Tempe","There were no other sightings in Tempe on or around May 21st 1994"]}