{"Date Submitted":"12/19/2007 12:00 UTC","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Log Number":"US-12212007-0002","Country":"United States","Region":"Nevada","files":["/var/www/straped/mufon/html2text/8644.html.txt","/var/www/straped/mufon/more/8644_submitter_file1__aerialofpossiblelocation121907.jpg","/var/www/straped/mufon/more/8644_submitter_file2__aerialofpossiblelocation121907.jpg","/var/www/straped/mufon/more/8644_submitter_file3__perspectiveofpossiblelocation121907.jpg","/var/www/straped/mufon/more/8644_submitter_file4__positionofobject121907.jpg","/var/www/straped/mufon/org/8644.html"],"Date of the Event":"12/19/2007 12:00 UTC","Tags":"City","Case Number":"8644","Source":"MUFON","Summary":"My family and I witnessed a UFO on Wednesday evening 12/19/2007 over the Las Vegas skies.","map":"<A HREF = \"http://maps.google.com/maps?q=36.118406,+-115.170896(8644)&iwloc=A&hl=en\"> mufon case (8644) map </A>","Longitude":"-115.170896","City":"Las Vegas","Object Shape":"Sphere","Object Flight Path":"Undisclosed","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 19th 2007","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Weather Factors":"Unknown","Disposition":"Unknown","Latitude":"36.118406","divs":["sighting detailsmy family and i witnessed a ufo last night over the nw las vegas valley. i was outside in my bark yard while my dog relieved himself when i noticed an object the size of a small aircraft flying in our general direction. the reason i keot looking was because the object did not have blinking lights like a normal aircraft does. i called my wife out to witness what i was looking at and my two daughters and grandson came out to seewhat was going on. it lasted about 10 minutes or so. in that time the sphere shaped thing drifted in a southwesterly direction and then stopped and changed from bright flashes of white\\yellow to orange to red. while i went inside to get my camera with a tele-photo lens, my family witnessed this thing start to strobe it's lights. when i came out i photographed it. from where we stood in our back yard the thing looked about the size of a small aircraft. the troubling thing was what happed next. the thing began dropping what looked like small fire balls from the bottom of the craft. they looked like they fell as normal as any heavy object might fall to earth - there were approximately 10 things that dropped, it seems like around the vicinity of lone mountain. right after i took the one photograph the object drifted away in a more norhtwesterly direction and we lost sihgt of it. i have a photo of the object, but my software is not very good and i cannot enhance the photo to get a clear outline of the object - maybe you can help with that. while i was trying to enlarge the photo i pannedover to the left side of the object and found that there was another smaller object to the west of the main object, and then i remembered that my grandson had said that he had seen another object as well. i thought about going out to look around to see if i might find whatever it is that was dropped from that craft but now i'm notso sure i should. my name is robert lucero and you can reach me at 277-4937 if you want. either way, i have always believed in ufo's and now i, and my family, have witnessed a real ufo."]}