{"trends":["There have been no other sightings in Wonder","This sighting has never been favorited."],"Case Number":"8645","map":"<A HREF = \"http://maps.google.com/maps?q=42.391503,+-123.53451(8645)&iwloc=A&hl=en\"> mufon case (8645) map </A>","City":"Wonder","Tags":"City","Weather Factors":"None","Summary":"interupted a wrestling show on t.v. 9P.M.","Log Number":"US-12222007-0001","Country":"United States","divs":["Sighting DetailsIt was 1972 in Wonder Oregon ON Waters Creek..We had company over to watch Portland Wrestling at 9p.m. The Greens I have 4 kids and they had 2 ..We lived near no one but as we began to watch the show we couldnt see it as it looked like a car was running and generater interference. I went out side to see if someone was parked out there with the motor running...didn't see anything went out again as there was still interference and saw this huge globe hanging over the house glowing as if i were looking at the moon same color only like a pendulum hanging over the house..I called in to everyone and said a U.F.O> is here bring me a flash light and I want to signal it...Well from there on it got weird I signaled it and it appeared like it turned its light off nothing there could see the sky everything then poof it was back on again and here..I signaled over and over again as it was playing with us speeding straight up out of sight ,then back hovering then side ways across the trees out of sight then back it answered every signal..There was no noise coming from it..All of a sudden it got huger and huger bigger than the house I knew it was landing or something I told the kids quick get inside as it was landing...from then on we all remember different things..I dont remember anything until later I asked the family if wwe should look and see if it was out there still...I dont remember of watching any wrestling,dont know what happened to our company didnt even think about that till recently...There is time missing dont know how much...My kids remember being on the ship, My youngest said they showed him how it workde and flew us around...The kids saw a beam of light come in our door way but I cannot remember ..It took us all ..We talk about it every time we see each other ..didnt report it as people think you are nuts..We all want to be hypnotised to remember as we all remember different things..We know we was on that ship...none of us have been able to afford hypnotherapy I am 66 and still want to know...My youngest son went into the Army and called home to ask me when he had surgery on his kidneys..I thought he was drunk..He was in the military hospital and they found 2 surgical scars on each side of his back on his kidneys..He had never been in the hospital..Later in Washington the critters grey and short came in my bedroom ane inserted something into my left nostril. leaving blood on my pillow..not seen them since...Please someone get back to me I have always wanted to know some answers it is a daily thought that never goes away.."],"Longitude":"-123.53451","Date Submitted":"11/30/1971 09:00 UTC","Viewing Distance":"20 Feet or Less, 101-500 Feet","Date of the Event":"11/30/1971 09:00 UTC","Object Shape":"Circle, Disc","Sighting Duration":"Undisclosed","Object Features":"Unknown","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8645.html.txt","/var/www/straped/mufon/org/8645.html"],"Region":"Oregon","Latitude":"42.391503","Disposition":"Unknown"}