{"Date Submitted":"06/11/2007 12:00 UTC","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/8647.html.txt","/var/www/straped/mufon/org/8647.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=42.091466,+-75.914359(8647)&iwloc=A&hl=en\"> mufon case (8647) map </A>","divs":["Sighting DetailsI was sleeping in the downstairs guestroom of our farmhouse since my husband was sick in our bedroom upstairs. In a partial sleep, I heard my husband clearly call my name. I quickly got out of bed and went up to check on him but he was fine and sound asleep. I came back down and as I got back into bed I saw a flashing light in the corner of the guestroom window. At first I thought it was lightning but I knew I hadn't heard any thunder and that a storm was not expected. I went to the window and pulled back the shade and stood in front of it and in the rear pasture (about 500 feet away) I saw very large flashing white lights (perhaps 4 to 6 to 8) and it seemed there were smaller lights that were trajected out from the larger lights that were flashing at a faster rate. (From looking at photos on the internet of UFO sitings, it may been not flashing lights but a craft turning fast -- though they appeared to be flashing.)There was no sound at all. It seemed to be a craft but I couldn't see a craft -- only lights --if the lights were attached to something, it seems that the craft should have been round. I guess my first thought was that it was a helicopter but I soon knew this couldn't be the case as it was much too large and didn't make any sound at all. It moved across the pasture and closer to the house and at the end of the pasture (about 300 feet away) it appeared to come down and to try to land. It was only at this point I became frightened. But then it quickly raised up into the air again and went off behind the house where I couldn't see it any longer. The smaller flashing faster lights continued to be on the side of the house where my window was for another 8 to 10 seconds at least. I went to the back of the house but by the time I arrived there, I could see no more lights and was too scared to go outside. The next day I went out to the pasture but saw no evidence of anything that was visible from a landing or an attempted landing. My impression was that it wanted to land, somehow detected me, and then decided not to land. Perhaps an electrical or energy field that it created by being so close is what made me hear my husband's voice wake me up. It was clearly not my husband who was fast asleep upstairs and I still don't know why I woke up. This has affected my life as I now know that \"they\" are out there, but the feeling I have is positive and not negative. I didn't contact authorities in the area as it is rural and no one wants the local authorities to think they might be crazy. I've not been able to find any reported sightings in this area on that day other than a possible one in Canada and a possible one in Connecticut, but nothing nearby. And I 've not been able yet to find a description of a UFO siting that sounds like what I saw. There are not that many sitings in this area of upstate New York anyway."],"Object Flight Path":"Hovering then path,Path with directional change","Sighting Duration":"Undisclosed","Latitude":"42.091466","Log Number":"US-12222007-0003","Case Number":"8647","Summary":"Saw lights -- two sets -- one very large (4 to 6) others smaller and flashing faster. Attempted to alight but then didn't.","Viewing Distance":"101-500 Feet","Longitude":"-75.914359","Weather Factors":"Unknown","Date of the Event":"06/11/2007 12:00 UTC","Region":"New York","Country":"United States","Object Features":"Unknown","trends":["There have been 14 other sightings in Binghamton","There were no other sightings in Binghamton on or around June 11th 2007"],"Tags":"City","Disposition":"Insufficient Data","City":"Binghamton","Source":"MUFON"}