{"Log Number":"US-12222007-0004","Date of the Event":"12/15/2007 11:14 UTC","City":"Wrangell","Object Features":"None","Longitude":"-132.376667","Disposition":"IFO","Object Flight Path":"Unknown","Summary":"FAA webcam image","Region":"Alaska","Viewing Distance":"501 Feet - 1 Mile","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8648.html.txt","/var/www/straped/mufon/more/8648_submitter_file1__UFOsOverWrg.jpg","/var/www/straped/mufon/org/8648.html"],"divs":["sighting detailsi frequently browse the faa weather cams for southeast alaska. i also like to check out the loops and will look at every picture in the loops just to see what i can see. the two small objects caught my attention immediately for some reason. after saving the image to my pictures and zooming up on the images, (especially the lower, closer one), i was flabbergasted to realize what i was seeing did not appear to be birds, choppers, planes or anything i usually observe. i thought even though it looked like a disc i would take some pictures of birds to compare. i was lucky to have an eagle circling right in front of the house about 1\\8 to 1\\4 mile away so i took several shots of it and compared them to the disc objects. there was no similarity at all. the objects flying over the wrangell airport are not birds. the lower closer one even appears to be metallic in that on the lower right hand side it appears to be reflecting light. i know you guys can enhance an image way better than me. even when i zoom way up on the images where they blur out, they retain their disc shape. so please enhance these images and e-mail me the results."],"Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=56.470833,+-132.376667(8648)&iwloc=A&hl=en\"> mufon case (8648) map </A>","Sighting Duration":"00:00:00","Date Submitted":"12/15/2007 11:14 UTC","Object Shape":"Disc","Case Number":"8648","trends":["There has been one other sighting in Wrangell","There were no other sightings in Wrangell on or around December 15th 2007","This sighting has never been favorited.",""],"Tags":"City","Latitude":"56.470833"}