{"Tags":"City","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8650.html.txt","/var/www/straped/mufon/org/8650.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.428312,+-98.485358(8650)&iwloc=A&hl=en\"> mufon case (8650) map </A>","Case Number":"8650","Object Features":"Unknown","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around August 15th 1969"],"divs":["Sighting DetailsI was stationed at a P.A.T.S. (Personnel Awaiting Technical School) at Lackland Air Force Base. An airman who majored in physics and I were discussing science as we lay on the asphalt exercise field to avoid being in the hot, humid, un-airconditioned barracks. As we looked at the clear, dark sky he said, \" Hey look at that over there ! There was a silver, round light moving fast and high going from east to west. I thought it was the belly light of a jet. I wondered why there were no red and green lights, but I said, Damn! That jet is going really high and fast! I scanned the sky and said, \"Look, there's another one just like it ! ( (Coming from East to West) It looks like there going to crash into each other! They almost hit, but at the last moment made a sharp right-angle south. I exclaimed, \" We can't do that ! Do you know what we are looking at? These are UFOS!\" (Meaning ET crafts) They made a plowing pattern by going straight and opposite of each other. Then they did 180 degree turns to start a new lines. I said, \" It looks like they're scanning our base!\" As they accelerated through the turns they flared larger and brighter to about 5 times the original diameter...which was like the head of a straight-pin at arms length. After,I guess, 8 to 10 repetitions, they accelerated in opposite directions as they brilliantly flared, then totally disappeared. There was no contrail. We waited for 5 minutes,but head no jet sound. It was all done in silence. It took my breath away! It was an epiphany. I asked,\" Do you want to report this?\" My friend said, \"No, we are going for our secret (electronics) clearance , And we won't get it if we talk about little green men.\" I agreed. We kept our mouths shut. This event forever changed my perspective on the universe and what our science knows. After searching the skies for 38 years since, I have seen nothing esle like it. My hobby after this became studying unknown mysteries and scientific controversy."],"City":"San Antonio","Object Shape":"Star-like","Date of the Event":"08/15/1969 08:15 UTC","Date Submitted":"08/15/1969 08:15 UTC","Disposition":"Unknown","Region":"Texas","Latitude":"29.428312","Log Number":"US-12232007-0002","Object Flight Path":"Path with directional change","Longitude":"-98.485358","Weather Factors":"Unknown","Viewing Distance":"20 Feet or Less","Summary":"2 bright white lights made scanning pattern over USAF base. Right angle turns + other strange behavior.","Country":"United States","Source":"MUFON"}