{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=36.784081,+-119.412322(8652)&iwloc=A&hl=en\"> mufon case (8652) map </A>","Tags":"City","divs":["sighting detailsit was 1992 about 6 0r 7 pm in the summertime, i had the doors and windows open. i was washing dishes. my boyfriend had drove to the mini mart about 2 blocks away. we had been arguing, so when i heard him yelling for me from the front of the house i ingnored him. after he called out for me 3 times to come and see something, i turned to see his car stopped in the middle of the street at an angle with the door still open. i had a longtime family friend there with me and being stubborn,i asked her to go see what he wanted. a few seconds later she called for me too saying \"look come see. what is that?\" reluctently, i walked calmley outside to see what looked like a black cone-disc shaped object with 3 prong-like legs decending up into the sky. it was moving up slowly, i could see faint orange-yellow fire under. looked blurry and wavey like the sun looks hot. i couldnt determine how big it was or how far away, so i asked my boyfriend and he said it was about as big as 1 car and tall as 2 cars. he said when he came down the street turned left it was about a 1\\2 block in front of him hovering over the street just above the cars. he then said he looked around to see who was doing this and how but no one was around. he said it never made a sound then just started going straight up not fast not slow. he had to turn right before getting to the location where he first saw it and 1\\2 block down to get to our house. thats when he stopped in the middle of the street and called out for me. it took about 15 mins before it disapeared. i didnt have a clue what it was. i was shocked to hear it was so close to the street and was surpprised nobody else was outside at that time. i live in a busy suburb about three 20 miles from l.a. and it was summer evening but yet no one walking or outside. i wonder if anyone else saw it. i wish i had been more curious at the time and asked nieghbors of called someone. ive looked at thousands of ufo pics and cant find one like it. i did see a program on the travel channel that was showing wierd things or places and it show a picture of the us military at some air force landing site with two military men standing in front of a craft ready to take off ready to take off it was the same color, size, shape and had fire under it. it had serial numbers or codes on the side in white. i wish i find out where and when and what it was or find the picture."],"Object Flight Path":"Undisclosed","Summary":"SAW IT DECENDING UP INTO THE FROM THE STREET IT HAD FIRE OR HEAT UNDER IT","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Cone, Disc","Longitude":"-119.412322","trends":[""],"Weather Factors":"Unknown","Case Number":"8652","Region":"California","Disposition":"Unknown","Date Submitted":"07/20/1992 12:00 UTC","Latitude":"36.784081","Country":"United States","City":"Undisclosed","Date of the Event":"07/20/1992 12:00 UTC","files":["/var/www/straped/mufon/html2text/8652.html.txt","/var/www/straped/mufon/org/8652.html"],"Log Number":"US-12232007-0004"}