{"map":"<A HREF = \"http://maps.google.com/maps?q=45.42435,+-75.689983(8655)&iwloc=A&hl=en\"> mufon case (8655) map </A>","City":"Ottawa","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around December 23rd 2007"],"Object Shape":"Disc, Unknown","Object Features":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet","Country":"Canada","Source":"MUFON","Disposition":"Unresolved","Weather Factors":"Unknown","Date of the Event":"12/23/2007 11:20 UTC","Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Longitude":"-75.689983","Tags":"City","Region":"Ontario","Latitude":"45.42435","Log Number":"CA-12242007-0001","Summary":"Arc of lights, golf ball at arms length.","Case Number":"8655","files":["/var/www/straped/mufon/html2text/8655.html.txt","/var/www/straped/mufon/org/8655.html"],"Date Submitted":"12/23/2007 11:20 UTC","divs":["Sighting DetailsLooked out my window to look at a shimmering star, when i saw lights white and red maybe blue also, huvering slowly towards the right, i picked up my binoculars to get a better look at it, i couldnt get it with the binocs, when i put them down i was startled as it was now moving towards me, it was moving too slowly and had turned too sharp for a plane, i saw its lights as it flew over me, much faster, so as must have accelerated, but i missed the acceleration trying to see it with binoculars, the lights were in an arc maybe a circle, this was no helicopter, as it flew over it made a loud loud humming, with a less loud jet noise. Arc of lights maybe a circle as it flew over and revealed its rear light. Actualy larger then a golf ball at arms length. Feeling of a powerful gravity craft was my feeling of it. ps it is now an hour later as I type this at 12:25, and that shimmering lstar, wich has been moving all over the sky over time, is still moving about and shimmering, possibly a satelite i suppose. Note first observed south-west-south, last ovserved VERTICAL."]}