{"Summary":"Pyramid Shape Burn on Knee","trends":["There have been 6 other sightings in Fredericksburg","There were no other sightings in Fredericksburg on or around December 17th 2007","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Undisclosed","Object Shape":"Undisclosed","Log Number":"US-12242007-0003","Date Submitted":"12/17/2007 12:00 UTC","City":"Fredericksburg","Longitude":"-98.871984","Case Number":"8657","map":"<A HREF = \"http://maps.google.com/maps?q=30.275201,+-98.871984(8657)&iwloc=A&hl=en\"> mufon case (8657) map </A>","Latitude":"30.275201","Date of the Event":"12/17/2007 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/8657.html.txt","/var/www/straped/mufon/more/8657_submitter_file1__100_00751.jpg","/var/www/straped/mufon/org/8657.html"],"Weather Factors":"Unknown","divs":["sighting detailsi own a brick home with a metal roof. around 11pm december 17th, 2007, i heard something on my roof. it was 2 thuds, then 2 more thuds followed. my roof has a very steep pitch and i was wondering what could have landed on it without sliding off. my 2 dogs are in the backyard and the youngest dog barked once. the older dog which barks all the time never barked at all, which is very strange. then i heard the dogs make a weird noise i have never heard before. it was like a combination of a whine and a howl, then silence. i kept listening, very alert, trying to figure out what was going on. i looked towards the window. the curtain i close every night was open about an inch and a half, which i know i had closed all the way earlier. as i lie there looking at the curtain i started getting very sleepy and that was it. i didn't remember anything until later the next evening when i decided to take a soaking bath instead of a shower like i usually do. i was in the tub and felt a burning sensation on my left knee. i looked down and there was a pyramid shaped red mark that looks like a burn on my knee. it measures 2\" at the bottom and the sides measure 1 1\\2\". the edges are straight and well defined. my daughter took a photo of it. a week later the mark is still there."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Source":"MUFON","Region":"Texas","Object Features":"Undisclosed"}