{"Object Shape":"Circle, Disc, Flash, Oval, Saturn-like","Log Number":"US-12242007-0004","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was December 11 arond 11pm. I looked out my large livingroom window and noticed that the skies above SLC were clearning. I could see the night sky for the first time since a major storm moved though. I noticed a bleep of white and blue light and thought to myself the storms are gone, the small planes are out! Then I noticed the \"small plane\" wasn't moving. I grabbed my camcorder and sat on the floor and followed the object off and on for about 40 minutes. The object was moving farther to the south and higher in the sky. Mybest footage is when I first started to video the object. Beyond that the object is too far away to view detail. I didn't realize what I had on video until reviewing it. This was a disk shapped object with a small dome on the top. It moved very quickly when it pulsed a burst of white light. The footage I have should be viewed and available to the public. I have never seen a closer view or clearer view. Please assist me in who to contact and how to get this out there!"],"Tags":"City","Longitude":"-111.889427","Latitude":"40.765749","Date of the Event":"12/11/2007 11:00 UTC","Object Features":"Dome","Date Submitted":"12/11/2007 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.765749,+-111.889427(8658)&iwloc=A&hl=en\"> mufon case (8658) map </A>","Case Number":"8658","Summary":"I have detailed footage of disk object in digital video. It's brief, however distinct. This object was in the sky for over 40 minutues moving from SE to the South","Weather Factors":"None","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around December 11th 2007"],"City":"Salt Lake City","Disposition":"Unresolved","Object Flight Path":"Hovering then path,Path with directional change","Region":"Utah","files":["/var/www/straped/mufon/html2text/8658.html.txt","/var/www/straped/mufon/org/8658.html"],"Viewing Distance":"Over One Mile"}