{"Date of the Event":"12/22/2007 12:08 UTC","Case Number":"8665","Object Flight Path":"Hovering then path,Straight-line path","Longitude":"-79.813645","Weather Factors":"None","divs":["Sighting DetailsIt happened on December 22nd, 2007. It was a little past midnight. I was coming out of my bathroom in my apartment, and something caught my eye outside as I glanced through my bedroom window. I noticed the sky was illuminated with a red light. Something round, and bright red was hovering in the sky. It was the same brightness and color as a flare that was lit up in the sky, but it definently had no smoke trail behind it, and it didn't sound off the way a flare would. Distancially, I'd say it was about a quarter of a football field away. It was close. It had NO SOUND at all, so I knew for a fact it wasn't a jet, airplane, or helicopter. Even if it were a plane or helicopter, it wouldn't have been able to hover that close to the ground, there are so many houses. Plus, like I said, there was absolutely no noise. It was in the middle of the night, no cars were out, everyone was asleep. The object looked as though it was landing, or something. I couldn't really make out any other special features about it's appearance, other than it giving off a very bright luminous red light. I seen it clear in the dark sky, and I watched it for about 20 seconds before it descended down behind the trees. It looked as if it had landed somewhere in the woods. It was a very strange experience; I was surprised, and excited at the same time. I knew it was a UFO. It couldn't be anything else. I've never seen ANYTHING like it in my whole life."],"Viewing Distance":"101-500 Feet","Region":"North Carolina","Object Features":"Unknown","Latitude":"35.707915","Log Number":"US-12242007-0011","Sighting Duration":"00:00:20","files":["/var/www/straped/mufon/html2text/8665.html.txt","/var/www/straped/mufon/org/8665.html"],"Country":"United States","City":"Asheboro","Tags":"City","Disposition":"IFO","Source":"MUFON","Object Shape":"Circle, Egg","Date Submitted":"12/22/2007 12:08 UTC","trends":["There have been 3 other sightings in Asheboro","There were no other sightings in Asheboro on or around December 22nd 2007","This sighting has never been favorited.",""],"Summary":"bright red light","map":"<A HREF = \"http://maps.google.com/maps?q=35.707915,+-79.813645(8665)&iwloc=A&hl=en\"> mufon case (8665) map </A>"}