{"Longitude":"-80.344534","Tags":"City","Disposition":"Insufficient Data","Latitude":"39.280645","Date of the Event":"12/23/2007 07:45 UTC","Country":"United States","Object Flight Path":"Undisclosed","Source":"MUFON","trends":["There have been 2 other sightings in Clarksburg","There were no other sightings in Clarksburg on or around December 23rd 2007"],"Log Number":"US-12242007-0014","Case Number":"8668","City":"Clarksburg","Region":"West Virginia","map":"<A HREF = \"http://maps.google.com/maps?q=39.280645,+-80.344534(8668)&iwloc=A&hl=en\"> mufon case (8668) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8668.html.txt","/var/www/straped/mufon/org/8668.html"],"Date Submitted":"12/23/2007 07:45 UTC","Summary":"Bright object circling the moon","Weather Factors":"Unknown","divs":["Sighting DetailsOn the evening of 12-23-2007 at 7:45 PM I went outside to feed our outside cat. The moon was full and very bright with a few passing clouds moving from as I stand facing in a north east position right to left. As I gazed up at the moon and what stars were visible because of the brightness of the moon. I observed while looking at the moon a bright object bouncing and jurking in the 8:00 position of the moon. I rushed in the house and got my Meade DSX-102AT telescope. This aroused my family when I told them what I was watching outside.The temp. outside was 40 or so but there were six of us watching this bright object dance around and jurk side to side. While observing it through the telescope we all observed it changing from egg to oval then oblong shape spinning.After several hours the object moved from the 8:00 to the 2:00 position of the moon. The lens on my telescope was fogging up so I had to call it a night. Needless to say the next night when I went out the objct was gone. I'm very sure that there were others that saw this so I would like to read someone's report to see what they saw."],"Object Shape":"Egg, Oval, Sphere, Star-like","Object Features":"Undisclosed"}