{"Longitude":"-76.004923","Object Shape":"Sphere","City":"Nanticoke","Latitude":"41.20536","Date Submitted":"08/15/1971 11:15 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Object Features":"Appendage(s), Other","Disposition":"Unknown","Summary":"Blackened back ground, Multiple lights which were at times brighter than others appeared to be mounted or held in place by a cage like outer attachment","trends":["There has been one other sighting in Nanticoke","There were no other sightings in Nanticoke on or around August 15th 1971"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.20536,+-76.004923(8671)&iwloc=A&hl=en\"> mufon case (8671) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Country":"United States","Case Number":"8671","Log Number":"US-12252007-0003","divs":["Sighting DetailsI had gone out to visit an auto grave yard. I was about 12 years old, I liked to collect the keys which were ussually found in the ignitions. During the day it was difficult to \"sneek\" in and arround the \"junk\" yard. I crossed an old train bridge over the river to get there. I was getting out of an old car when I noticed lights which I immeadiately assumed were shinning from a distance because the river and a sharp decline to the river were in that direction. As I looked back again within secounds realizing what I was seeing could not be there. I then noticed the lights were moving together and were within minutes of passing directly over head orat least close to me becuase they were headed in my direction. I began to try and figure out what this thing was. I thought maybe its one of those blimps but it was more round not long. I thought maybe it was a helocopter. But I realized there was no sound. As it got closer I began to feel fearful of it. I only had time enough to duck behind the rear fender of the old car. It was I felt, looking at the junk yard of cars. I felt that becuase it moved closer and I feared it might see me. It was only about one hundred feet from me now and it was at about 10 feet higher than eye level. There was a sharp embankment which led to the river below and it was riding the ridge. Agian when I first noticed it, it was a bit further away from he ridge and was apparently originally following the shore line of the river. But it did come closer and as I said, I presumed it was coming close to look at the junk yard of cars. After it moved ever so slowly passed me, it changed it's course and drifted down and above the river it was headed north and was now passing within about ten feet or so above the car bridge which was parallel to the train bridge. I was now able to see it more clearly even thought it was now many hundreds of feet from me. The lights which light up the car bridge allowed me to make out the shape more definately. As it passed earlier it was so black of a night and the back ground was as dark and so close it was difficult to know for sure what shape it actually was . Now as it became back lit I was able to see all of its shape. Also at that momment which it was passing the bridge a car was driving across the bridge and I then knew for sure that unless the driver was blind he had to have seen it. I would estimate and did at that time estimate it was large enought to hold inside of it two of those cars. And so it was fairly large but not enormous. Agian it had not one sound it moved very steadly and it seemed to be able to adjust speed and manuver> The lights dimed after it passed me and the junk yard and they brighted again when it passed over the bridge. Further the lights seemed to flicker and indipendently of each other brighten and dim when they had been near the junk yard. I told no one about this becuase I was not supposed to be out at night as I had been and I decided wait to hear about it maybe from the news or maybe from someone saying it was seen. I also felt I would be teased and not believed anyways. I find it easy to believe that there was some kind of effect on me becuase of this incident but to go into that would take away from the creditabilty of this true story. I did not imagine this happened I lived it and it really happened."],"Viewing Distance":"21-100 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/8671.html.txt","/var/www/straped/mufon/org/8671.html"],"Date of the Event":"08/15/1971 11:15 UTC","Region":"Pennsylvania"}