{"Latitude":"45.255203","Case Number":"8673","Source":"MUFON","Log Number":"US-12252007-0005","Disposition":"Unknown","Date of the Event":"08/24/1975 12:00 UTC","Longitude":"-69.436969","Object Flight Path":"Undisclosed","trends":[],"divs":["Sighting Details While camping with opportunity farm a group home that I grew up at. And at an Odd Fellows Camp. I and Bob Froding, and possibly Tim Fehan were pestering Milton Chapman. We had basically stolen his clothes and collapsed his tent. As he emerged from the tent. He said something like \"no wait hold on listen\" I hear a deep sound. As we stopped and listened we all heard the very deep sound. Just as we all heard the sound Milton said \"look\" gesturing with his hand for us to look out over the water. When I looked I became scared and excited as I saw what was making the sound. I saw an sphere sort of rounded with a roundish belly and a typical dome but a bit larger. around the object were three light colors how many lights I'm not sure but certainly 3 colors one a yellow another a sort of red and the third was sort of a cross between blue and green. About as quick as we saw and heard this craft it disappeared in a blur straight up. I was all hyped up being about 15 years of age. I picked up a stick as though I was ready to face the threat. I did not rest for some time I kept looking and looking for another view of it somewhere. Ultimately I did see the craft again way up beyond the clouds, and what I saw this time intrigued me even more than the close encounter. I saw the craft project a powerful light, and then in an extremely controlled fashion take the light back in. It didn't dim as it projected and it didn't dim as it was brought back in. The light was under absolute control, as though it would be wasted if it were not collected back into the craft. I have only talked about this to people, and have never reported it in this fashion before. I know that Bob has denied seeing it in the past. I'm not sure if Milton would admit seeing it. My pastor say's he believes it was of demonic origin, the supperintendant of opportunity farm whom I told of this the next day thinks it must be something the military is doing. I don't know. But the sound, speed of departure, and incredible control of it's light source, have intrigued me all of my life. I was young, had no camera or recorder and thus only have mental images of these events. It's to bad science didn't have the ability to retrieve this imagery from my mind. I think most people would be stunned as I was. When someone asks me if I believe in UFO's I tell my story. I don't know if it is was terrestrial or extra terrestrial all I know is that the technology to produce what I witnessed does not appear to be possible even to this day. Thanks; Andrew"],"Tags":"City","Object Shape":"Sphere","Country":"United States","City":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.255203,+-69.436969(8673)&iwloc=A&hl=en\"> mufon case (8673) map </A>","files":["/var/www/straped/mufon/html2text/8673.html.txt","/var/www/straped/mufon/org/8673.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","Region":"Maine","Sighting Duration":"Undisclosed","Summary":"sphere 3 light colors deep deep sound","Viewing Distance":"Unknown","Date Submitted":"08/24/1975 12:00 UTC"}