{"Object Features":"Undisclosed","Date of the Event":"09/15/1981 12:00 UTC","divs":["Sighting DetailsMy sister and I were driving home one night from Madras, Oregon, around 9:30 PM. We were driving south towards home and I looked over her side and out the window and noticed a large object with lights following us, just right about the power lines. The object was mostly these large lights and when it turned the lights seemed to reposistion themselves. Not like a plane where they would be in the same position even when turning. Then we slowed then turned west, off on a side road, because my lights had gone out on my car all of the sudden, and when I did that, the object then slowed and turned with us. I went ahead about 200 feet and came to a complete stop. I noticed the object had stopped as well. We rolled the windows down and noticed there was no sound what so ever. My sister and I were both saying that this was just strange because there should be some sound coming from something that large. The next thing I remember starting my car back up and driving ahead and then the object slowly moved over the top of us. then it slowly moved down the road and went straight up the side of a butte (pronounced bewt, this is a large hill) and shot straight up into the sky so fast it just dissappeared. My sister and I arrived home 2 hours later and my father was upset, asking why we got home so late, I was thinking it wasn't that late until I looked at the clock and noticed the time. What should've taken us 15 minutes, took us 2 hours to get home. My sister and I to this day only tell close friends and I have told work mates and only people I know that won't judge me. To this day I have woke up with marks on my body and even holes in my tongue that were bleeding with no pain present, all of which I cannot explain. My youngest sister lives in Arizona were there is no grass and has woke up with grass in her hand and strange bruises and marks on her body also that cannot be explained. We both have had dreams and been able to finish the others dream because we seem to have the same dreams. Not by coincidence."],"Region":"Oregon","Longitude":"-121.213097","Tags":"City","Latitude":"44.525675","trends":["There have been 2 other sightings in Culver","There were no other sightings in Culver on or around September 15th 1981"],"Case Number":"8680","Disposition":"Insufficient Data","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-12252007-0012","Summary":"A triangular shape with lights followed my sister and I a short distance from my car","map":"<A HREF = \"http://maps.google.com/maps?q=44.525675,+-121.213097(8680)&iwloc=A&hl=en\"> mufon case (8680) map </A>","City":"Culver","Date Submitted":"09/15/1981 12:00 UTC","Object Shape":"Triangle","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8680.html.txt","/var/www/straped/mufon/org/8680.html"]}