{"Tags":"City","Source":"MUFON","Object Flight Path":"Straight-line path","Log Number":"US-12252007-0015","Country":"United States","City":"Columbus","Object Shape":"Triangle","divs":["Sighting Detailswhen I was a young teenager my friend and I was riding our bicycles at the top of the lane where I had lived. we were on the road when something caught my eye I looked up and couldn't believe what I was seeing. I yelled to my friend to check it out it was a giant triangle shaped object with lights on it I'm guessing it was the size of three or four blimps put together at the largest end and maybe five or six hundred feet off the ground.it had no sound that I can recall and was moveing at a crawl.it went directly over top of us and was heading across a field my friend and I wanted to chase it so we started down the road to go around the block to the next street. that is all I can recall. through the years I allways remembered what I saw but not that my friend was with me.years later I was telling my friend about it and that some one was with me but couldnt remember who when he said it was him but he too couldnt remember who was with him . that is all either of us remember. I'm not suggesting that we were abducted or anything but it is quite strange. at the time I had seen the object I had always thought ufo's were supposed to be saucer shaped that just isn't true. I know I seen something that day and I do not believe it was of this earth!"],"Viewing Distance":"101-500 Feet","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=39.964576,+-82.990814(8683)&iwloc=A&hl=en\"> mufon case (8683) map </A>","Latitude":"39.964576","Object Features":"Undisclosed","Case Number":"8683","files":["/var/www/straped/mufon/html2text/8683.html.txt","/var/www/straped/mufon/org/8683.html"],"Date Submitted":"07/20/1978 07:04 UTC","Weather Factors":"Unknown","Date of the Event":"07/20/1978 07:04 UTC","Region":"Ohio","Longitude":"-82.990814","Summary":"two friends see strange object","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around July 20th 1978"],"Sighting Duration":"00:04:00"}