{"Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Cylinder, Sphere","Region":"Michigan","map":"<A HREF = \"http://maps.google.com/maps?q=42.221866,+-83.143484(8685)&iwloc=A&hl=en\"> mufon case (8685) map </A>","files":["/var/www/straped/mufon/html2text/8685.html.txt","/var/www/straped/mufon/org/8685.html"],"Viewing Distance":"101-500 Feet","trends":["There have been 4 other sightings in Wyandotte","There were no other sightings in Wyandotte on or around August 22nd 2000"],"Longitude":"-83.143484","Disposition":"Unknown","Latitude":"42.221866","Log Number":"US-12252007-0017","Case Number":"8685","Sighting Duration":"00:15:00","Date of the Event":"08/22/2000 02:30 UTC","Date Submitted":"08/22/2000 02:30 UTC","Summary":"rose from pond,hovered, and sped off super speed,no sound","Tags":"City","Object Features":"Undisclosed","City":"Wyandotte","divs":["Sighting DetailsFishing a qurter mile away from Fermi 2 Nuclear plant in Lake Erie at Point Mouliee and Corp of Engineers man made peninsula at end of Peninsula in the woods is a pond or small lake next to the big lake Erie. Me and my friend were catfishing when my friend needed light to put the night crawler on his hook. I went to light up my flashlight and then his hook and the bait suddenly lit up. He started baiting his hook and I knew it wasnt my flashlight because I did not turn it on. I looked over my shoulder and seen this cylindrical bright light rise from the pond and hover above us. I told Jimmy my friend to look and he got startled. I asked him what it was and he said he didnt know. Then it sped off across Lake Erie at a tremendously fast rate. It had know sound at it was hovering about 250 ft. above us. Since that occurence I have returned to fish at the sight and they now have no trespassing signs saying its a bird sanctuary and they have security guards posted at entrance. I told my wife and children about this when I came home and they laughed at me and Jimmy. So I dont talk much about it. Funny thing is this is the second time I have had encounters of this type, I just dont want to get into the other encounter. If you want a place to investigate this is the place."],"Weather Factors":"Unknown","Country":"United States","Source":"MUFON"}