{"trends":["There have been 47 other sightings in Sedona","There were no other sightings in Sedona on or around October 21st 2007","This sighting has never been favorited.",""],"Weather Factors":"None","Date of the Event":"10/21/2007 06:00 UTC","Summary":"Unknown object on cables appeared out of nowhere","City":"Sedona","Disposition":"Unknown","Case Number":"8689","Date Submitted":"10/21/2007 06:00 UTC","Log Number":"US-12252007-0020","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8689.html.txt","/var/www/straped/mufon/more/8689_submitter_file1__IMG_0389.JPG","/var/www/straped/mufon/org/8689.html"],"Latitude":"34.87922","Region":"Arizona","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-111.75928","Country":"United States","Object Shape":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=34.87922,+-111.75928(8689)&iwloc=A&hl=en\"> mufon case (8689) map </A>","divs":["Sighting DetailsThis object Appeared off the East side of \"Bell Rock\" in Sedona Az about 1hr. before the sun went down. It appeared out of nowhere and remained in the exact same spot until dark, as if it were stuck. I was walking the dogs and turned around and saw it. From where I was at my house, it was about 1 mile away. It would be about the size of a small car. At first I thought it was a tour helicopter, but then noticed it wasn't moving. I did not see the cables attached to it until after I looked at the taken image. It looks like some kind of arial cable car. There were no rock-climbing activities going on. Most tourists would have been gone for the day. The local government or township was not doing anythig on the rock either. I cannot get an explanation from anyone in Sedona. I have never sen this before or since. It would look like some kind of mining car? something spilling out of it maybe? One set of cables would be attached to Bell Rock (to the left.) But the other set, I am unsure. Courthouse Butte, the closest object to the right, is a good distance away to have something quickly attached. No explanations have been found to date."],"Source":"MUFON","Tags":"City","Object Flight Path":"Stationary"}