{"City":"Omaha","Source":"MUFON","Case Number":"8693","Weather Factors":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.255673,+-95.993928(8693)&iwloc=A&hl=en\"> mufon case (8693) map </A>","Latitude":"41.255673","Country":"United States","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Date Submitted":"06/16/1964 12:00 UTC","Longitude":"-95.993928","Region":"Nebraska","Log Number":"US-12252007-0024","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8693.html.txt","/var/www/straped/mufon/org/8693.html"],"Date of the Event":"06/16/1964 12:00 UTC","Object Shape":"Unknown","Summary":"Bright white Light beamed down upon us, no sound, no wind","Sighting Duration":"Undisclosed","divs":["Sighting DetailsFive of us teens all friends in the Park by the Missouri River not far from the L St bridge that crosses into Iowa under street lamp on Picnic bench talking on this warm night, in 1964 all of a sudden this Bright white light appeared from above like a beam, a steady motionless brightness, covering about a 40 ft circle around us, no noise, no wind, couldn't see anything as we looked up into the light. We waited,listened, wondering what it was? then it just went straight up and angled about 45 degrees acelerating away fast, and then ultra fast and disapeard. The speed that it acelerated convinced us it was not a helicopter, but we thought Helicopters make noise? this did not! All of us were freaked out by the fact of no noise, no wind, the bright white beam of light was steady not moving. We looked at each other with awe wondering what had just happened? We all vowed not to tell anyone thinking that people would assume we had been drinking (we were not) and would not believe us. The speed of the object acelerating was phenominal We watched it until it disapeard. The time span was about 5 min we think. Nothing else seemed to had changed. We then went home."],"Tags":"City","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around June 16th 1964"]}