{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.605185,+-93.601816(8697)&iwloc=A&hl=en\"> mufon case (8697) map </A>","divs":["Sighting DetailsI can't remember the exact year or even time of the year, it was so long ago now. I was working as a city worker and had a partner with me. We took a break from driving and were sitting in a van beside the K-mart, across the street from Southridge Mall. There was construction going on the mall and I don't remember if Montgomery Ward was open or being built then. Would have been in the early 80's. We were sitting there and saw this UFO come down over the store and hover. We hadn't seen it coming, just dropped into sight from above. We were across the street, maybe 300 yards? No sound, just hovered. Was silver with a large dome on top. Had a circle of lights, I think blue around the widest rim of the body. Had a smaller dome on the bottom with a ring of lights, I think white, around it. It sat there for minutes, seemed a long time. We both seemed like we were in shock, didn't know what to do. As I look back, I don't remember any traffic at all and all the stores were closed so it was likely on a Sunday and late evening. I asked him if we should call in and he said he wasn't. It slowly raised and then went Westerly. It stayed south of Army Post Rd. and stayed low, just above the trees and disappeared over by Ft. Des Moines area. We attempted to follow it but never sight it again. I never heard any reports come over the police radio either."],"Viewing Distance":"501 Feet - 1 Mile","Region":"Iowa","Date of the Event":"11/30/1980 09:00 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8697.html.txt","/var/www/straped/mufon/org/8697.html"],"Case Number":"8697","Country":"United States","City":"Des Moines","Object Shape":"Disc","Date Submitted":"11/30/1980 09:00 UTC","Log Number":"US-12252007-0028","Latitude":"41.605185","Object Features":"Dome","trends":["There have been 42 other sightings in Des Moines","There were no other sightings in Des Moines on or around November 30th 1980"],"Summary":"Round craft with large dome on top and smaller one on bottom hovered above Montgomery Wards Store being built at Southridge Mall","Disposition":"Unknown","Weather Factors":"None","Longitude":"-93.601816","Tags":"City","Object Flight Path":"Hovering then path,Straight-line path"}