{"Region":"California","Object Flight Path":"Straight-line path","Log Number":"US-12262007-0007","files":["/var/www/straped/mufon/html2text/8707.html.txt","/var/www/straped/mufon/more/8707_submitter_file1__HollisterUFO.jpg","/var/www/straped/mufon/org/8707.html"],"Viewing Distance":"21-100 Feet","Tags":"City","Latitude":"36.852454","Object Features":"Other","Case Number":"8707","Sighting Duration":"00:15:00","Source":"MUFON","Summary":"silent illuminated dual segment craft less than 100 feet above ground","Date Submitted":"12/23/2007 07:45 UTC","Object Shape":"Other","City":"Hollister","Longitude":"-121.401602","Country":"United States","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.852454,+-121.401602(8707)&iwloc=A&hl=en\"> mufon case (8707) map </A>","trends":["There have been 4 other sightings in Hollister","There were no other sightings in Hollister on or around December 23rd 2007","This sighting has never been favorited.",""],"Date of the Event":"12/23/2007 07:45 UTC","Weather Factors":"Unknown","divs":["Sighting DetailsA Friend and I were having a discussion while I was having a cigarette, when he exclaimed \"What is that?\". I turned and looked to where he was pointing and there in the sky, low on the horizon, just above the tree line, was an illuminated object quietly moving through the air about a half a mile away. As we stood there in the back yard watching the object, I ran through all of the objects I had seen fly, and the object was unlike any of them. I worked for the Transportation Security Administration for over four years at the Sacramento international airport, until I was injured and could no longer work. But during that time I had seen many things fly, from a U2 Spy plane, to a 777, but nothing was like this. The craft was in two segments, an upper wing, much in the shape of a paraglider wing, and a boxy lower segment with an illuminated + sign on the lower portion facing the ground in strong amber lights. due to the illumination from the lower segment, the upper portion was lit from below, yet no tethers were visible, and even though there were wind gusts from 5-10 mph, no swinging motion was observed. We stood there transfixed by the sheer strangeness of the craft as it nearly came directly over us. It was only slightly to the west, by about half a block(100)feet away, and less than 100 feet up. I had turned off the small portable radio playing Christmas music shortly after we first spotted the craft, so as it was at its closest only ambient noise was about, and Hollister is a fairly quiet town. Still the craft made no sound, but it was passing us in a south to north direction at about 30 miles an hour in a steady straight path to the north. As it passed it continued north, but we could tell it was gaining in altitude. It continued to climb, and as it did, I ran in the house and asked my daughter to come outside. all three of us watched as it continued to climb until it appear as if it were nothing more than a amber star in the sky, so far away it must hav been over San Jose, or at least Morgan Hill. All this time the light never changed, and no other lights were visible. finally the craft reached an apex, blinked several times, and then went out. While at its lowest point one could see the upper portion was a light color, neither white, nor gray, nor silver, but perhaps having elements of all three. It had a rounded leading edge, and was roughly rectangular in shape, with a slight curvature in the center. The lower portion was dark and square, appeared to be metallic in construction. It had molding like features which housed the lights, and those were more rounded. The two rows of 13 lights which made the + sign were large round and bright, but with out having the nature of a spot light throwing a beam downward, but simply being illuminated. We three stood in the chill night air, knowing that what we had seen was not any conventional craft. Truly an unexpected Christmas Present."]}