{"files":["/var/www/straped/mufon/html2text/8708.html.txt","/var/www/straped/mufon/org/8708.html"],"Object Features":"None","Longitude":"-74.003753","Case Number":"8708","Date of the Event":"10/15/1997 12:00 UTC","Tags":"City","Region":"New York","Latitude":"40.719163","divs":["Sighting DetailsThis happened on my Birthday in 1997, that's why I know it was October 15. I had lived in the early 70's in a beautiful old house on a bluff overlooking the bay in St George, Staten Island. I was feeling nostalgic on my birthday and took a ferry ride out there to take a look at the area. The house, and most of the block, had been torn down in the late 70's by a developer who ran out of money and what was on the location at that point was an abandoned parking lot. However it still had a wonderful view of the Bay. When I got there I just sat on a log and took in the view. To my right I noticed a commercial jet heading up the harbor, which is normally the final approach to LaGuardia, so it couldn't have been at more than 4000 feet. To my left I caught sight of a flock of seagulls. HOWEVER right behind the seagulls was this thing that looked like a shiny pipe that seemed to be flying at the same height as the gulls. The sun was reflecting off it. I don't know how good I am with estimating size, but at the time I figured it was about 10 feet long and maybe one to 2 feet round. I do not remember seeing the \"front\", but the back of it was flat. I estimated it couldn't have been flying at more than 100 MPH. It was on a steady course from Bayonne across the Bay towards Brooklyn. It flew UNDER the commercial Jet. I watched it 'til it disappeared in the distance heading toward Coney Island. Could not have been more than 2 minutes, possibly less. At the time I remember my first reaction was that this is interesting. At first it seemed very \"normal\". THEN I realized this is NOT NORMAL. I wasn't afraid, just fascinated. I'd seen something 30 years earlier that I could not explain, but nothing in the intervening years and nothing since. I've carried this with me for the past 10 years and figured now was as good a time as any to try to find out what it was. All I can tell you is it SEEMED at first to be so everyday. I had a feeling at the time that it had a purpose and that it could have been something like a robotic carrier pidgeon? I know this is not one of those spectacular sightings but still, WHAT DID I SEE? Any ideas?"],"Country":"United States","Summary":"Over New York Bay","Log Number":"US-12262007-0008","Disposition":"Unresolved","Object Shape":"Cylinder","Weather Factors":"Unknown","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around October 15th 1997"],"Date Submitted":"10/15/1997 12:00 UTC","City":"New York","Source":"MUFON","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=40.719163,+-74.003753(8708)&iwloc=A&hl=en\"> mufon case (8708) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile"}