{"Disposition":"IFO","Case Number":"8709","Log Number":"US-12262007-0009","Summary":"star like, cigar shaped, balls of light, groups of star like light moving together","Tags":"City","City":"Medfield","Longitude":"-71.30646","map":"<A HREF = \"http://maps.google.com/maps?q=42.187583,+-71.30646(8709)&iwloc=A&hl=en\"> mufon case (8709) map </A>","Date of the Event":"Unknown","Object Shape":"Cigar, Circle, Flash, Sphere, Star-like","Weather Factors":"Unknown","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Date Submitted":"12/26/2007 04:40 UTC","divs":["Sighting DetailsHello. I used to be a member of MUFON back in the mid 80s. My contact at that time lived in Medfield, Ma. I don't remeber his name, but, I had spoken with Bud Hopkins by phone about my experiences at different times of my life and he put me in contact with someone first from North Reading, Ma. I didn't put any description of my event because I have had several though out my life and it would take a long time to give them in detail. However, back in the 80s when I was involved with MUFON, I had given detailed accounts of all my experiences to a member who interviewed me. I don't remeber the names of the people I talked with back then, but, if I heard their name I would probably remember. I would like to get involved again because I feel frustrated at the nonsense that I am hearing about what hundreds of people like myself have supposedly been seing is weather balloons, light house or swamp gas. I know beyond a doubt that I have deffinately seen some sort of space craft at least twice and there has been many other things that I have seen and experienced all my life. If you are interested in sharing my experiences, please contact me by phone or e-mail. I think that it is both frustrating and insulting to all of us who have seen things that are not natural to our world to have people who work for the government or are being paid by the government to excuse away all these sighting and encounters by saying that we were confused by what we saw. Sincerely, Ron Marcotti"],"Object Flight Path":"Undisclosed","Latitude":"42.187583","trends":["There have been 5 other sightings in Medfield","There were no other sightings in Medfield on or around"],"files":["/var/www/straped/mufon/html2text/8709.html.txt","/var/www/straped/mufon/org/8709.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Massachusetts"}