{"Source":"MUFON","Weather Factors":"None","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Latitude":"35.854721","Date Submitted":"09/22/2006 12:00 UTC","Country":"United States","Log Number":"US-12262007-0011","Disposition":"Unknown","Longitude":"-86.38358","Region":"Tennessee","map":"<A HREF = \"http://maps.google.com/maps?q=35.854721,+-86.38358(8711)&iwloc=A&hl=en\"> mufon case (8711) map </A>","Case Number":"8711","Summary":"Close encounter object stationary in my back yard (Follow UP Drawings)","divs":["Sighting DetailsSpecial thanks to Stanton Friedman as during my study after this event and until now, his publications and recordings made available on the web by him have really broadened my knowledge of a subject previous to the encounter I knew nothing about. When I first reported this, I thought there may be some added advantage to not sharing my drawings so special thanks to Kim Shaffer for honoring that request. I have decided to upload the pictures and incident recreation to share in hope this helps with an answer. It may not, but it's all I have, my word and the drawings, that's all I can provide you. These were created for my kids so that they would never forget. I know, and they know, its real. Attached recreation of the event, drawing of the craft we witnessed, and recently found, the only thing that has even come close to the craft we saw during my search for answers. Ironically, It's a sonar image of a USO and not a UFO from a soviet sub. Or are they the same? Pardon the X-files theme song but I just had to do that, ha...ha. I provide the attached as true. Good luck to all who have seen - as I know its easier not to have seen and to wonder as opposed to seeing and to wonder, as there are few to relate with in the later. Final from me, its not a military craft as I tried to originally convince myself, its either Alien or Time travel, or combination there of. I have new theories, but those and a cup of coffee would get me classified as a nut case. Below is a repeat of the original I posted ____________________________________________________________ Below are the original text of what happened in Murfreesboro some time in the fall of 2006 sent to Mr Kim Shaffer MUFON Tn State Director Hi Kim, I don't really know if you want to hear about this as I have no actual pictures of this incident. I still am kicking myself in the seat of the pants every time I think about the fact that I did not film this incident, when right inside the house not 75 feet away, a fully charged video camera was available. This happened in late 2006, had to be in the fall, as the temp was just perfect. I got home from work and as usual went to the TV to check out today's news. Shortly after that, I would say around 5:15 in the evening, I got up, went into the kitchen to just look out the window and check on both my sons age 10 years and nine years. I looked out the window both my boys were standing beside each other not even moving a muscle looking up in the air, they were both just standing there looking up. So I bent down lower so I could look out the window to see what they were looking at, wow, I thought to myself, what is that, a jump jet maybe, but hovering in our backyard, hold it, if that's a jump jet, where is the noise, there is no noise and this thing is hovering at or less than tree height. That was what was going through my mind, this house cannot possibly block the sound of a jump jet, so I immediately headed toward the back door and opened it, stepped out back, looked up, and at this point I will have to apologize to everyone in the world for not going and getting the video camera or any camera. I am so stupid for not getting a camera but you have to realize, I am looking up at something and my mind is moving a million calculations a second trying to figure out just how and what the hell is hovering over my back yard. My thoughts, were going crazy, looking over every square inch of this thing just amazed, amazing. I went on down the steps to where the kids were, watching this thing the whole time, its chrome color, definitely metallic, not a balloon or any lighter than aircraft, this thing was metal and large, this thing is not moving, not moving I mean not moving!!!. I was so amazed by this, I love technical things, I could not take my eyes off it. One reason I could not take my eyes off it is its close enough that I know this is metal, but incredible, well, how can explain it, lets say parked. But parked in the air, that's a better description than hovering, no sound at all, and I am watching this thing and looking as hard as can for any movement and I mean any movement, but there is no movement what so ever. So again I am still kicking myself for not going and getting a camera, but I guess I was so amazed by what I am seeing, a metal object, almost chrome in color, the shape like an oblong cylinder, size about the size of a greyhound bus, and it is parked in mid air. And I do not know how to get this across more clearly, this thing was parked. IN MID AIR!!! And again I think over and over and over again and apologize to everyone and anyone interested in stuff like this for not even once thinking about getting a camera while this was going on, but Kim, this thing was so perfectly parked in mid air, I was just in awe of how it could do it, and I think my mind was just trying to figure out, oh, who knows what my mind was trying to figure out, I was just standing there gazing in unbelief of what I was looking at. This was like this for I guess about 4 minutes from the time I first saw it out the window, from the time it started to move. Standing there so close looking at it parked in mid air, no sound, no wind, metal object not making, well, you could have heard a pin drop. No side vectoring from any secret military, this thing was right at or just below tree level and there was not a leaf one moving. Then the object just all the sudden started to move. Still no sound at all, this thing was just sliding along, I cannot explain how perfectly sliding through the air at a very low speed toward our back yard then at the back of the yard turned so cool, what I mean is it turned direction in such a cool way, I knew this thing was getting ready to leave here. So knowing it was getting ready to get out of here, I kept my eyes on it and started yelling for my wife to come out, the back door was open, I kept yelling at her to come out, she took her time, I still watched thing sliding through the air going toward Nashville super speedway. my wife finally got outside, I got her to go around to the front of the house with me, she saw this thing leaving but the object was so far off by this time, she said what was it a plane. So she really did not see what me and my sons saw. I guess what drives me crazy now, is I wonder, as I know, or I think I know we do not possess anti gravity technology. And all the stories of people I use to think were crazy, well, I don't know now, I have to revisit every story I ever heard, and some of the stories I use to think were nuts and no way, well, not so nuts or crazy anymore. I know what I saw, and both my sons saw it too, what we saw was defying gravity, there is no other way to explain it. And I do not meaning hovering or lighter than air, I am saying this object could not have been anything less than anti gravity. The way it turned when it started moving could not have turned that way by any other force than gravity, the turn was to smooth and swift non stop and this object was then going in another direction. I cannot say this thing was from a different world or planet, and I cannot say this thing is from a different time as in time travel, I cannot tell you this was a military secret aircraft. What I can tell you is this thing was Metal, chrome color, defied gravity and there is no doubt in my mind that this was anti gravity, and that this thing was under intelligent control, and me and my kids were so amazed watching it we could not blink, much less think about getting a camera. So, if your interested, I guess now I join the crazies, all the stories I use to hear and say man that guys lost it, well, I know I haven't lost it, and to others that think I am nuts with this story, all I can say is if you see one you will know. And if you have not seen one, yes, you will think this is nuts. Well, that's about all, If you would like to talk to me and my boys about this sometime, that's cool, guess we could have coffee sometime and you could kick my butt for not grabbing a camera. God, if I only would have got a camera, I would have had the best, closest, clearest pictures of this craft than anyone in the world has have ever seen. But I will have to live with my stupidity of not. I am a believer now, and so are my kids. There is some kind of Anti gravity craft here on this planet, not an illusion, a controlled craft, we have seen it. Who's it is, could not tell you. But it could only be anti gravity craft, there is just no other explanation, none you could convince me of that could have allowed this craft to do what we saw. Well, that's it, for what its worth, that's our story and I'm sticking to it. Have a good one Kim, Below is info for you only, please do not disclose my contact info below to anyone else. Thanks (After more email correspondence with Kim, I sent a follow up email with some details I left out of original) Quite different indeed, I am going on 47 years old, have seen UFO shows, clippings, etc.. always fascinated by these shows, but in reality, when watching, thought were just nutty people and or really good pranksters with digital media. Some did fascinate me, but still had nothing but doubt every time I watched one of those shows or specials. And some of the videos I have seen over my life, I would say, bull, that's not real, but is an excellent hoax. Now though, after seeing what I saw, what do I do now? I find myself revisiting some of those old stories and film clippings, some where the objects were just perfectly still in mid air and think, maybe not a hoax. Or what about the guy, can't think of his name, but said he was hired to reverse engineer alien craft at Roswell, I thought what a great made up story, that guys nuts, but a good cool geeky story. All those things looked and sounded like someone had lost there ever loving mind. But now after seeing what we saw, your mind starts to question, which of those many sighting, stories, pictures, are real. I know there is still allot of real nuts out there, but not all of them. As if I had grabbed a camera and actually shot video of it, it was so amazing that anyone watching would have said what I use to say, wow, that's really cool, pondered it, maybe even rewind it a few times and watch it again, but in the back of there mind they probably would have been saying how the hell did he pull off such a good video hoax. Ha....ha, reminds me of what my Dad use to say, what goes around comes around. Anyway, you are correct, if I have been on this earth for near 47 years, and this was first time to encounter such an amazing feet of technology that as most people know does not exist, I should just treasure the moment as if it took 47 years of my life to see it one time, odds are not very good at ever seeing something like this again in my life time. One very important thing I left out of original, as if I already in the nut club might as well tell you this part too. The object, when it was stationary, no lights nothing, but when it started to move and then made that fantastic turn at the back of the yard, just after it turned a light started flashing, now after it turned this craft was, I would say no more than 25 to 30 feet off the ground, now its going behind my trees at this altitude but while sliding along it is slowly climbing, the light was, how could I say, a real neat greenish yellow light. Remember, this is in bright daylight, this thing is flashing, flashing around the same tempo as any airplane strobe would flash. That part of it has me thinking that this is some kind of super high tech military aircraft of some sort. But that's my brain saying, why the hell would aliens have a strobe to warn other aircraft. (*** I remember what I told the kids when it was all over and we settled down from the experience, they asked, Dad, what was that. My reply was, son, I don't know, we do not have anything known, or that I know of, or heck anyone knows of that can perform what we just saw. I will say one thing, if it is some kind of secret military craft, I sure hope its ours.***) Well, You can keep me on record as reporting this, nothing else I can add, and I do not care if this info is read in discussion, radio, or net, but keep my name confidential, just replace my name with, (a man and his two sons from murfreesboro saw etc.... etc.... etc.. But for the record, wanted to go on record for whats its worth and report this for documenting. And if ever the need arise, I swear to you I could pass a polygraph on everything I have told you in this email and the prior email. Out of curiosity, if these things are able to move about and be stationary in mid air, just how often and how many are around not even being seen, what i mean is, after seeing this, for the last year since seeing this, now when I am outside, driving, going to and from here to there, I am always looking at tree top level now hoping to catch a show like that again, but then you start to realize, geesh, our line of site is not very far at all if the craft is flying at, just above and or below tree level. Just an amazing memory of a once in a lifetime event now? I sure hope not, but thats probably the fact Jack. Thats it this time, promise, from one Nut to anutter, later Nutty buddy. Below are some interesting facts of what we saw, not all sent to Kim in email. Object can remain parked in mid air with no sound at all no movement. When turning, the front of this object popped up slightly, I know this because the sun was behind me, and when it popped up slightly I was in a position that allowed me to see the sun reflect off the top front of this craft. Before the front of the craft popped up in the front, it had already stopped at the back of the yard, so popping up had nothing to do with it stopping, so not sure at all how it even stopped. The popping up of the front was more to do with the turn and at the same time it popped up in the front, the craft also tilted to the left, and started to slide into its new trajectory loosing altitude as it did this. After the turn and in new trajectory, a brilliant greenish yellow light started flashing located center top of the craft is the best I can remember location of light. This light and color is hard for me to explain as I have never seen anything in my life flash so bright and the color, well, greenish yellow does not give the color of the light or its intensity justice. Craft when on new trajectory is gaining altitude while maintaining level flight... Meaning,, the front of the craft not pitched up at all from what I could tell but craft still slowly gaining altitude while sliding along with absolutely no sound and absolutely no indication of any power source at all. At one point I was even wondering if it was going to clear the second set of trees it was headed toward because I could see no pith in the craft to indicate a climb, but it did clear them and continue on. Color of craft best I could descripe would be steel or stainless steel, somewhat same color as the old mig fighter jets steel. Dark color steel but very polished shiny. This was a very close encounter approximate distances while viewing, 125 feet from actual object at the most while stationary, 300 feet from object when it exited the other side of the wooded area behind my house. So anyone trying to debunk this, I ask, If you were standing 125 feet or less from a greyhound bus, could you tell if that bus had wings at this distance? I actually think at one time we, (we being both me and the boys), were less than 75 to 80 feet from this object. Sorry to the debunker's, but there is know way and I mean know way you can debunk what me and my kids saw. But I can understand why you do not believe, as before me and the kids saw this, I believed you, you being the debunker's. But after seeing this craft at a close distance, I am telling you your wrong. There is something going on, and even though some can be debunked, I am here to tell you that something is going on and you cannot debunk mine, never, sorry, I was to close to this, it is real. My regret is that I did not film this as this surely would have started a serious investigation if this craft is not military. I did finally take some time to draw a series of drawings of the craft so that my kids would never forget what we saw that day. Kim is holding, I asked Kim to keep these drawings private as while I have been doing my own investigation of this, have found no other craft or picture of craft of what we saw. My thinking on asking Kim not to show these pictures, as again, this is real, surely someone else will report this object, so told Kim if these drawings were made available to the public, how would we know if the next reporting of this craft would be real. So that is why I made decision to ask Kim to keep the drawings private for now. There are some other details that Kim has that I have decided not to add to this report for same reason. When other people come forward and describe this object, it will not be because they have seen this craft posted somewhere else. Kim has honored this request. And may I add it was a pleasure speaking with Kim who takes this matter serious."],"Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/8711.html.txt","/var/www/straped/mufon/org/8711.html"],"trends":["There have been 18 other sightings in Murfreesboro","There were no other sightings in Murfreesboro on or around September 22nd 2006","This sighting has never been favorited.",""],"Date of the Event":"09/22/2006 12:00 UTC","Object Shape":"Bullet, Missile, Cigar, Cylinder","Tags":"City","City":"Murfreesboro","Object Features":"Undisclosed"}