{"Object Features":"Unknown","Longitude":"-116.995315","Viewing Distance":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"11/13/2005 06:30 UTC","Tags":"City","Region":"Idaho","map":"<A HREF = \"http://maps.google.com/maps?q=46.735088,+-116.995315(8712)&iwloc=A&hl=en\"> mufon case (8712) map </A>","files":["/var/www/straped/mufon/html2text/8712.html.txt","/var/www/straped/mufon/org/8712.html"],"trends":["There have been 3 other sightings in Moscow","There were no other sightings in Moscow on or around November 13th 2005"],"Object Shape":"Disc, Other","Latitude":"46.735088","Weather Factors":"Unknown","Summary":"Two shafts of light, aproximately 5 feet apart came down on the hood of the car and a ring of orange lights was observed in distance","City":"Moscow","divs":["Sighting DetailsI was riding with a friend, Southbound on a major highway between C'ourdelaine and Moscow Idaho. It was very dark (after 5 in the evening) and we were in intense storm conditions. Thick sheets of rain and standing water were blowing across the road way and the winds were very high. We saw a semi tipped over by the wind further down the road. We were between towns and we saw very few other cars on this stretch of road. Suddenly, out of the sky, two parallel beams of light came down directly in front of the hood of the car. They were about the same distance apart as the headlights, so the driver flipped her headlights off, then back on to make sure it wasn't the source of the odd light. The light remained constant. I peered up through the sunroof, trying to make out a source for the light in the dark, rainy sky above. I could barely make out two dimly glowing cat-eye shapes above us that the white light seemed to be emenating from. They were somewhere in or above the cloud cover and could not be clearly distinguished, but they were visable. Then, just as suddenly as they had appeared, the lights vanished. They had come on and switched off, similar to how you would experience a flashlight being switched on and off. We continued to drive the whole time(about 5 minutes, maybe less). The darkness of the highway and extreme weather made it unsafe to pull off to the side or stop. Just after the lights switched off, I noticed ahead and to the right of the car, a semicircle of orange lights in the sky, close to the horizon. Distance was impossible to judge in the dark and rain. But the middle light was the largest and they decreased slightly in size and radiated out in a slight bend upward in both directions from the center light, as though they were lights ringing the edge of a large disk. It stayed in sight, not moving for several seconds, then just faded out. I scanned the landscape as we drove past the area where I had seen the ring of lights to see if maybe there was a home or grain tower that they could have been ringing, but saw nothing but empty landscape."],"Country":"United States","Disposition":"Unknown","Date of the Event":"11/13/2005 06:30 UTC","Object Flight Path":"Stationary","Log Number":"US-12262007-0012","Case Number":"8712"}