{"Sighting Duration":"00:02:30","Latitude":"48.42697","map":"<A HREF = \"http://maps.google.com/maps?q=48.42697,+-101.33916(8717)&iwloc=A&hl=en\"> mufon case (8717) map </A>","Object Features":"Patterned Surface","Log Number":"US-12272007-0002","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8717.html.txt","/var/www/straped/mufon/org/8717.html"],"Weather Factors":"Does Not Apply","Object Flight Path":"Straight-line path","Case Number":"8717","City":"Minot","Summary":"Silently Spinning Metallic Triangle","Country":"United States","Region":"North Dakota","Disposition":"Unknown","Object Shape":"Triangle","divs":["Sighting DetailsThese are the details as clearly as I can remember them. It was a warm summer day in Minot, with an especially clear sky. My younger sister and I were out in the back yard swimming in a small pool and playing games in the water. Something reflected off the surface of the water and cought my attention. I looked up to see where the light had come from and to my surprise I saw a craft in the sky. I grew up military and was accostomed to seeing aircraft in the sky but this looked different from anything I had ever seen, before or since. I was amazed at its odd appearance. It appeared metallic but not a smoothe metallic like an unpainted metal jetliner. The craft made no sound that I can remember. That surprised me and I immidiately thought the vehicle was going to crash or was in trouble because it was spinning; maybe one revoulution every two seconds. As it spun the sunlight reflected off the bottom of the craft. It was triangular in shape but the bottom wasn't completely flat. It was somewhat sloped. The edges didn't come to a point either. I can't describe how thick it was due to distance and foggy memory. I don't recall any windows, smoke, sounds or great detail to the craft other than what I have described. My sister asked me what it was we were seeing and I said that I wasn't sure but maybe it was some secret U.S. aircraft and that it looked like it was in trouble. I told her to get our mother so she could see this and tell the Security Police about it while I watched and saw where it was going. My sister went inside and the craft continued across the sky and began to go off in the distance and I worried that my mother wouldn't see it in time. Finally after a minute or two my sister came back with our mom and at this point all that we could see was the glint of the sun off the side of the craft as it spun in the distance. I never heard anything more of the incident after that and assumed that we were the only two whitnesses and that the military had not picked up any information on it or that it had not crashed as we expected since we never saw the news report on it that night like we had expected to. Over the years I waited to see on television and later the internet, something similar to what I had seen that day. Something that was manmade that I could say \"okay, that's what we saw!\" I never did. Even when I joined the Air Force I expected one day I would recieve a call to refuel an aircraft that I was not to ever speak of and when I arrived at the location would say \"Finally! Here it is!\" Still nothing. The other day I was watching a documentary where they talked about strange craft and MUFON. They illuded to an incident in Minot but didn't say what it was, only that it had happend in the 60's or some such. I decided to find your website and report what I had seen as best I possibly could. My sister and I talk about this once in a great while just to assure ourselves that we hadn't dreamed the incident or made it up in our own minds. For years after I have scanned the sky, waiting for another sighting to occur. I watched television waiting for some military secrets show to put this aircraft out there for me to see. So I would know that what I saw was of this earth. I wish I had more details about the craft and that I could have reported it that day when the information was still fresh in my mind."],"Date Submitted":"07/20/1991 10:00 UTC","Longitude":"-101.33916","Tags":"City","Viewing Distance":"101-500 Feet","Date of the Event":"07/20/1991 10:00 UTC","trends":["There have been 11 other sightings in Minot","There were no other sightings in Minot on or around July 20th 1991"]}