{"Longitude":"-84.5093","Source":"MUFON","Object Shape":"Oval","Region":"Ohio","Viewing Distance":"21-100 Feet","Sighting Duration":"Undisclosed","Object Features":"Dome","Tags":"City","Summary":"Communion","divs":["Sighting DetailsHi, I remember an event when I was a kid. I recall waking up in my mom's room and seeing two- what I called big guys kneeling at the foot of the bed- they grabbed my heels and began to pull me. However, they were not pulling my body but like- my soul- was being pulled from my body. (that's what I thought as a kid. Shortly after that event, I began to bleed when I had a bowel movement. My mom took me to our family doctor and he asked me \"have you been putting things in there?\" I was floored by this question, of course. My mom asked him why and he said it looked liked something had torn my colon. I thought I dreamed of being probed by these doctors with hoods on. Anyway, years later, I saw the movie \"Communion\" and I almost began to hyperventilate when I saw the \"creatures\" in that movie. The \"doctors\"who came to get him, were the exact guys I thought were kneeling at the foot of my bed. They were, in fact, not kneeling but very short with regular sized upper torsos. At about 16 or 17 two of my friends and I saw, what we believed was a UFO in an area called Mt. Airy forest, in Cincinnati. We were all in art classes at our high school and we were talking about what we had seen. Our art teacher seperated us and had us draw what we each had seen. The pictures were different but, when we discussed the positions we were in we actually had a full view of what we had seen from 3 different angles. I now live on the top floor of a highrise with a view of 20 miles all around. I have seen strange thing in the sky lately but nothing compared to that event in the forest. -one last note- I remember waking up after the \"guys kneeling event\" and I was freezing cold and it was mid summer and we had no air-conditioning. My mom thought I had put my hands in the freezer to trick her. Have you heard of anything similar to this?"],"Object Flight Path":"Hovering then path","Latitude":"39.108828","Log Number":"US-12272007-0004","Date Submitted":"11/30/1966 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.108828,+-84.5093(8719)&iwloc=A&hl=en\"> mufon case (8719) map </A>","files":["/var/www/straped/mufon/html2text/8719.html.txt","/var/www/straped/mufon/org/8719.html"],"Date of the Event":"11/30/1966 12:00 UTC","Disposition":"Insufficient Data","Case Number":"8719","Country":"United States","City":"Cincinnati","trends":["There have been 82 other sightings in Cincinnati","There were no other sightings in Cincinnati on or around November 30th 1966"],"Weather Factors":"Unknown"}