{"Tags":"City","Date of the Event":"12/31/1986 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"40.059744","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8720.html.txt","/var/www/straped/mufon/org/8720.html"],"Weather Factors":"Unknown","Summary":"The object flew over my car . It was very low and huge. It made no sound and it just glided across the road I was traveling on.","Longitude":"-74.401011","Country":"United States","Log Number":"US-12272007-0005","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=40.059744,+-74.401011(8720)&iwloc=A&hl=en\"> mufon case (8720) map </A>","Object Flight Path":"Straight-line path","City":"Undisclosed","Region":"New Jersey","divs":["Sighting DetailsI was working part-time nights at a data entry company located off Route 46 in Little Falls, New Jersey. I had just finished for the night and was headed home. I use the back roads to get home, so I got off Route 46 onto a side street. This street usually the cars travel pretty fast on, but this night there was a lone car traveling really slow in front of me. I thought that was strange until I looked up and saw this HUGE object flying over this road it was flying really slow. It looked like it just came out of the woods on the left side of this road. I was a little scared because this thing made no noise at all and it just glided across so smoothly. I didn't want to get out of my car because I thought something else would happen (I've seen many documentaries on UFO abductions). This object was rectangular shape,metallic and had red bubble-like lights under the aircraft. I could not mistake this thing for nothing else. It was flying at the hight of a tree. This was really hard for me to tell anyone because there was nothing in the news about this object that flew over the road I was on to Route 46,a very busy highway. When I came home I called the police station and asked the police officer who answered the phone had they recieved any phone calls regarding anything strange happening over the area I just came from. This officer made me feel really stupid, he said,\"What a like a UFO\" he was being a real jerk about my question. Since then I really don't talk to anyone about this night."],"Object Shape":"Square, Rectagular, Triangle","trends":[],"Case Number":"8720","Object Features":"None","Date Submitted":"12/31/1986 12:00 UTC","Disposition":"Unknown"}