{"files":["/var/www/straped/mufon/html2text/8722.html.txt","/var/www/straped/mufon/org/8722.html"],"Longitude":"-112.458942","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unknown","trends":["There have been 25 other sightings in Prescott","There were no other sightings in Prescott on or around August 12th 2007"],"Date of the Event":"08/12/2007 09:05 UTC","Country":"United States","Region":"Arizona","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy elderly mother and I were sitting out infront of the garage one night talking. As I pointed to the \"Big Dipper\" and was explaining to her the star formations of it, I noticed what seemed like a light of a plane at a very low altitude coming from the direction of the \"Big Dipper\". As it drew nearer I began to notice there were no red or green blinking lights flashing on it as other planes have. In astonishment, as it came closer, I jumped out of my chair and said excitedly,\"Hey Mom! I don't hear any engine noise at all, do you?!\" In amazement herself, my mother stood up out of her chair quickly and exclaimed excitingly,\"No Billy, I don't hear any noise either!\" As it quietly passed right over us I observed that it was a white lighted glowing sphere. It had what seemed to be a long rectangular window at the base of it that did not glow at all. It passed over us at a very low altitude---say about 150 to 200 feet above us, not a sound! And was moving quite fast, about 2 or 300 m.p.h. and kept going in the same direction behind us as it vanished from our sight! My mother and I were so excited exclaiming to one another in high tones of puzzlement,\"Did you see that!\" \"What was that!\" WE talked about it for days to our friends and family, and are still talking and remembering it down to this day. My mother said,\"I beleive now!\" This white glowing sphere was about the size of a small two story house in my estimation."],"Weather Factors":"Unknown","Latitude":"34.548094","map":"<A HREF = \"http://maps.google.com/maps?q=34.548094,+-112.458942(8722)&iwloc=A&hl=en\"> mufon case (8722) map </A>","Object Shape":"Sphere","City":"Prescott","Tags":"City","Object Features":"Window(s)","Case Number":"8722","Log Number":"US-12282007-0001","Sighting Duration":"00:05:00","Summary":"What looked like a plane light headed coming toward us, turned out to be a white glowing sphere passing over us.","Date Submitted":"08/12/2007 09:05 UTC"}