{"Object Flight Path":"Straight-line path","Latitude":"40.526214","Object Shape":"Sphere","Date Submitted":"12/25/2007 12:20 UTC","Region":"New Jersey","Date of the Event":"12/25/2007 12:20 UTC","Case Number":"8723","Sighting Duration":"00:00:04","Object Features":"None, Unknown","Tags":"City","files":["/var/www/straped/mufon/html2text/8723.html.txt","/var/www/straped/mufon/org/8723.html"],"Country":"United States","Longitude":"-75.06156","City":"Frenchtown","Summary":"Chritmas morning my wife and I saw a very bright and etremely large sphereof light over Delaware River valley.","Viewing Distance":"Unknown","Log Number":"US-12282007-0002","Weather Factors":"None","Source":"MUFON","divs":["sighting detailson december 25,2007, my wife, 2 sleeping daughters and i were driving home fom a christmas eve dinner, i was driving and my wife was awake in passenger seat. it was 12:20 am and we were driving north on state highway 29 which runs north and south along the delaware river. it is a dark, somewhat isolated road and at this hour we were the only car on the road. about 4 miles south of frenchtown. we were travelling at about 55 miles an hour and we came around a slight curve to the right, directly in front of us high in the sky, moving fom sky to land was an enormous globe(sphere) of perfectly round shape, very,very bright with no discernable other color. the object was moving at an extreme speed toward the tree line on our right or across from the bank of the delaware river. the sighting lasted 3 or 4 seconds. there was no impact, explosion or any other sign of disruption on the ground. my wife and i both saw the same thing. i have never seen such a sight before. neither of us had been drinking. i contacted the local police and nobody had repoted seeing this object.there are no airports, military bases, industrial sites or power plants in the area. the area is rural farm and\\or wooded. this sighting was extremely unusual.the sighting was at first somewhat frightening because it was so unexpected but now we are just simply intrigued. i do not know what it was but i know some things it was not; it was not a commercial aircraft,helicopter, search light, reflection, swamp gas, reflection of my vehicle, fireworks or anything vaguely resembling \"normal\"."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.526214,+-75.06156(8723)&iwloc=A&hl=en\"> mufon case (8723) map </A>","trends":["There has been one other sighting in Frenchtown","There were no other sightings in Frenchtown on or around December 25th 2007"]}