{"Date Submitted":"08/31/1971 12:00 UTC","files":["/var/www/straped/mufon/html2text/8724.html.txt","/var/www/straped/mufon/org/8724.html"],"divs":["Sighting DetailsFour of us were filling the 1st silo. They were; Martin L. Tschantz, deceased, and my sons, Rick and Ron Tschantz. Rick saw a light that appeared stationary over the woods, and asked me to look at it. I told him that it was an airplane turning and that is why it appeared stationary. We finished unloading the last load, and pulled the tractors into the barn. We began to walk up around the barn, and Rick said \"Dad, you were right because here it comes!\" The saucer pulled up about 80 to 100 feet away, and stopped. It was approximately 200 to 300 feet up. It had a light gray body which appeared very smooth. On the upper portion there was a small round plexiglass(?) cabin, which was obviously lighted, but was opaque from the outside. I asked Ron to run into the house and get my binoculars, which he did. Ron viewed it with the binoculars, and finally I got them and focused on the saucer. I would guess that the saucer bottom was approximately 30 to 40 feet long. the cabin was not more than 5 foot in diameter. There was a most peculiar piece sticking up on the right side of the cabin. It looked like the light off of a WW2 truck. Similarly, on the bottom of the saucer was a circular flange, perpendicular to the saucer body, which extended down. The flange seemed to be the axis of the propellant, and with the binoculars I could see a flickering light reflected on the flange. It looked like the arc of a DC welder. The bottom, inside the flange was open. The saucer gave a very soft hum, and I could not see any screw heads or any method of joining the dished part of the structure. From this, I assumed that the grey saucers were turning. The structure remained in place, not wobbling or moving, until it began to move very slowly toward the West, where the sun had just set, but the sky was still light. It gained speed like a mathematical progression, and disappeared into the sunset."],"Disposition":"Unknown","City":"Hanoverton","Object Shape":"Cone, Circle","Weather Factors":"None","Source":"MUFON","Country":"United States","Date of the Event":"08/31/1971 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.75117,+-80.937032(8724)&iwloc=A&hl=en\"> mufon case (8724) map </A>","Latitude":"40.75117","Log Number":"US-12282007-0003","Tags":"City","Region":"Ohio","Case Number":"8724","Object Features":"Dome, Other","Viewing Distance":"21-100 Feet","trends":["There have been no other sightings in Hanoverton","This sighting has never been favorited."],"Longitude":"-80.937032","Summary":"Appeared over woods, then came to us, stopped, and then left going west.","Object Flight Path":"Straight-line path"}