{"Region":"Colorado","Weather Factors":"Light","Date of the Event":"12/12/2007 12:00 UTC","City":"Loveland","trends":["There have been 18 other sightings in Loveland","There were no other sightings in Loveland on or around December 12th 2007"],"Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-105.0702","Date Submitted":"12/12/2007 12:00 UTC","Latitude":"40.400361","divs":["Sighting DetailsMy friend and I were both very tired driving back from a concert in Denver to Greeley. She was driving North on I-25 and I was in the passenger seat. When we saw the object, we were between Longmont and Loveland. I noticed the object at about midnight because of its brightness, it was on my side of vision, on the east side of the highway. It was very fast and low on the horizon and had a bright green trail with an orange center. The trail was about a mile wide and a couple of miles long. I lost sight of the object when it appeared to crash. My first reaction was shock and I shouted an expletive. The object caught my friend's eye out of her peripheral vision and she was surprised as well I checked to see what time it was to see if there was any substantial time loss, but I couldn't really tell if there was any since I was unsure of the exact time of the event. It was very unusual and unlike any meteor I've seen while viewing meteor showers. I thought it was either space junk or a UFO because the trail was thicker and it was lower than a normal meteorite. My friend and I both believe that it seemed out of the ordinary. I was slightly scared, but more excited. Now I fear that if an object did crash it has already been recovered."],"Case Number":"8727","map":"<A HREF = \"http://maps.google.com/maps?q=40.400361,+-105.0702(8727)&iwloc=A&hl=en\"> mufon case (8727) map </A>","Object Features":"Undisclosed","Object Shape":"Fireball","Disposition":"Insufficient Data","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8727.html.txt","/var/www/straped/mufon/org/8727.html"],"Source":"MUFON","Object Flight Path":"Undisclosed","Country":"United States","Log Number":"US-12282007-0006","Summary":"Fireball with bright green trail, about a mile wide, appeared to crash"}