{"Object Features":"None","Viewing Distance":"Over One Mile","Country":"United States","Object Flight Path":"Straight-line path","Date of the Event":"12/28/2007 06:13 UTC","Case Number":"8729","Disposition":"Unknown","divs":["Sighting Detailsi live in port st.lucie florida this morning december 28th at bout 6:13 a.m. i witnessed a craft that went from east as far as you could see to the west in about 3 to 5 seconds it appeared to have a largewhite or clear light on the front of the craft and on the back it had a large red light.there were airplanes you could see in the distance with there lights flashing and this object appeared to be as big as about 5 of them long. after it was in the west it stopped for a split second then it disappeared the whole time the lights were on nothing flashing and this object was about have the distance as normal plane flying from earth was. i then got my wife and told her to come watch and didnt see anything so she left for work.Still amazed by what i saw i stould there for another 10 minutes or so and another object appeared from the north this time it as bright as a star and looked to be as far away as the stars were it was very clear this morning so you could see far.I then called my wife and told her where ever she was at pull the car over and get out and look towards the moon by this time the object was close to the moon going from north to south across the sky she told me she did see the same object as i did and it continued across the sky and out of sight.This object the whole time it was visible appeared to be as bright as a star while moving this could not have been a plane as there were many this morning in the air and you could definately tell the difference.This object appeared to be as high as the stars as it past through the sky you could tell it was considerably much higher above the planes and didnt change the tone of light the whole time telling me it could have possibly been in space and reflecting of the sun.Thank you for your time i hope other people possibly has seen the same thing."],"Longitude":"-80.3455","Summary":"Craft as large a 5 airplanes","City":"Port St Lucie","Source":"MUFON","Date Submitted":"12/28/2007 06:13 UTC","Region":"Florida","Latitude":"27.277633","trends":["There have been 15 other sightings in Port St Lucie","There were no other sightings in Port St Lucie on or around December 28th 2007"],"Object Shape":"Unknown","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=27.277633,+-80.3455(8729)&iwloc=A&hl=en\"> mufon case (8729) map </A>","files":["/var/www/straped/mufon/html2text/8729.html.txt","/var/www/straped/mufon/org/8729.html"],"Tags":"City","Log Number":"US-12292007-0002"}