{"files":["/var/www/straped/mufon/html2text/8730.html.txt","/var/www/straped/mufon/org/8730.html"],"Source":"MUFON","Country":"United States","Date Submitted":"09/01/1979 12:00 UTC","divs":["Sighting DetailsI was outside in my front yard late in the evening in Mineral County, WV,just looking at the view. The date is just an estimate could have been a 1979 or 1980, I was on top of mountain that overlooked a long valley that ends in Grant County, WV. I looked up and saw a dark object in sky, at first I thought it was a cloud like the other clouds which were dark as the sun was setting and illuminating the bottoms of the clouds. But I kept looking at it, it was disc shaped with a dome on bottom or top, unable to tell which it was. I thought it might be a helocopter but there was no sound. I was thinking of what it might be, I felt some growing fear because I thought it might be a UFO and I was there alone and far from neighbors. Just as I thought about going into the house to get a camera, it began to fly away, VERY fast down through the valley to the south, Grant County or Hardy County, and was out of sight in less than 30 seconds (atleast 20 miles away). I checked the newspapers the next day and there as a story of another sighting. I called that person but their sighting was of lights, not a disc shaped object like I saw."],"Case Number":"8730","Summary":"Disc shaped object with dome on top or bottom was motionless in sky about 500 feet up then flew off very fast to south with no sound","Object Features":"Dome","Weather Factors":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.337921,+-78.916771(8730)&iwloc=A&hl=en\"> mufon case (8730) map </A>","Date of the Event":"09/01/1979 12:00 UTC","Object Shape":"Disc","City":"Burlington","Region":"West Virginia","Longitude":"-78.916771","Log Number":"US-12292007-0003","trends":["There have been no other sightings in Burlington","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Latitude":"39.337921","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Straight-line path","Viewing Distance":"101-500 Feet"}