{"Country":"United States","Tags":"City","Longitude":"-117.968676","Summary":"4 lights running counter clockwise, then crossing to the middle and then out again","divs":["Sighting DetailsI had taken my dogs out to do their business when I looked up to see four lights revolving in a counter clockwise direction and then they all crossed to the middle of the circle, spinned a bit, then they moved outward and revolved again. These lights were behind a cloud cover. I watched for several minutes then I called my sister and observed for several more minutes while describing to her what I was seeing. At first I thought it might be lights for a grand opening but I know the light display would not be moving as this one did. I came back into my home and several minutes later, I went out again and the lights were still there. I reported this sighting to NUFORC and told them it was ongoing. Around 11:00 p.m., I took the dogs out again before bedtime but the lights were not present. Today, in the daytime, I see those same clouds. If they return tonight, I am calling the police to witness or i'm calling a local news channel. I was afraid to take a photo for fear that I would be beamed up but tonight I will prepare my camera. This sighting seemed very close to Earth and if I were to describe its size, I would say football field size. I find it hard to believe no one around here has made the same report - at least I don't think they have."],"Disposition":"IFO","Object Shape":"Circle","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"8734","City":"Hacienda Heights","Latitude":"33.993068","Date Submitted":"12/28/2007 07:45 UTC","trends":["There have been 4 other sightings in Hacienda Heights","There were no other sightings in Hacienda Heights on or around December 28th 2007"],"Weather Factors":"Unknown","Region":"California","Log Number":"US-12292007-0007","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.993068,+-117.968676(8734)&iwloc=A&hl=en\"> mufon case (8734) map </A>","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8734.html.txt","/var/www/straped/mufon/org/8734.html"],"Source":"MUFON","Date of the Event":"12/28/2007 07:45 UTC"}