{"Case Number":"8738","Object Shape":"Unknown","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","City":"Portland","Region":"Tennessee","Longitude":"-86.508483","Date Submitted":"12/29/2007 07:10 UTC","Viewing Distance":"Over One Mile","trends":["There has been one other sighting in Portland","There were no other sightings in Portland on or around December 29th 2007"],"files":["/var/www/straped/mufon/html2text/8738.html.txt","/var/www/straped/mufon/org/8738.html"],"Disposition":"Insufficient Data","Tags":"City","Summary":"very slow moving light in the sky.","Latitude":"36.591029","divs":["Sighting Details I was at home and stepped out on my porch for a breath of fresh air at about 7pm. I enjoy looking at the the stars but am by no means an atronomer so this very well could have been a comet or meteor. It was a clear night and the stars were all very clear. When I first looked up I could see many stars. I at first thout this light was a planet or star because it was very bright and did not seem to be in motion. I sat down on the porch for a few miniuts just thinking and looking at the stars. As the miniuts passed the object I thought was a star almost imperceptively moved and continued moving west north west. It began to grow dimmer and appeared further away though if anyone had looked up they would never have been suspicious becaus it moved so slowly you would have taken it for a star.I judged its movement by powerlines and a telephone pole. The object had moved from one side of the pole to the other and no matter how I tilted my head I could not see it from the side of the pole it had been on.It had been on the left side of the pole and finally reached the right side after ten to fifteen miniuts. Also it gradually grew dimmer and went out of sight. As I have already stated it moved very slowly possibly over toward whitehouse tn. It took about 20 miniuts for it to be out of sight completely. I wish I had caught it sooner I might of had a better veiw. Do heavenly bodies such as comets or meteors move that slowly? Probably, however I saw no tail. I am completely sober and as far as I am aware, I am of sound mind. Just thought it was worth mentioning. Thankyou for all you do."],"Log Number":"US-12292007-0011","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=36.591029,+-86.508483(8738)&iwloc=A&hl=en\"> mufon case (8738) map </A>","Date of the Event":"12/29/2007 07:10 UTC","Object Features":"Undisclosed"}