{"Country":"United States","trends":["There have been 579 other sightings in New York","There was one other sighting in New York on or around November 15th 2007"],"Viewing Distance":"Unknown","Case Number":"8739","divs":["Sighting DetailsEvery evening after Sunset untill Sunrise about 30 degrees elevation due east a bright light could be seen from approximately November 15th 2007 thru December 20th 2008 as seen from the East Coast over Brooklyn New York City as seen by several witiness including the Oilers and Engineer's at the Owls Head Water Pollution Control Plant 6700 Shore Road Brooklyn New York 11220 ,telephone number 1718-477-0105. I personally witiness the event at least 4 or five times. A bright white steady light, did not flutter like a star or other object like a star,which is why I filed this report. Because it was a steady light and others I worked with noticed and eventually, that is what attracted my attention. Their appeard to be a press release,circa December in the local papers including the T.V. Some research needs to be done in this area. Speculation: Base on my cursory investigation, my preliminarily opinion is that this object appeared to be a satellite or other man made object. I due not believe at this time that the object was a natural or celestial event. If so, possibly a exercise of-a-kind."],"Log Number":"US-12292007-0012","Summary":"Brighest light in the sky, due east, 30 degree's elevation, approximately as seen from the Owls Head Water Pollution Control Plant 6700 Shore Road Brooklyn New York telephone number 1718-748-3177.","Object Features":"Undisclosed","Date of the Event":"11/15/2007 07:00 UTC","Object Shape":"Circle, Unknown","Tags":"City","Sighting Duration":"10:30:00","Source":"MUFON","Region":"New York","files":["/var/www/straped/mufon/html2text/8739.html.txt","/var/www/straped/mufon/org/8739.html"],"Longitude":"-73.94178","Disposition":"Unresolved","Date Submitted":"11/15/2007 07:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.65668,+-73.94178(8739)&iwloc=A&hl=en\"> mufon case (8739) map </A>","Object Flight Path":"Undisclosed","Latitude":"40.65668","Weather Factors":"Unknown","City":"New York"}