{"Object Shape":"Unknown","trends":["There have been no other sightings in Chiang Mai","This sighting has never been favorited."],"Date of the Event":"10/12/2000 06:36 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"Thailand","Summary":"At 6:36 PM on October 12 in Chiang Mai Thailand, I","divs":["Sighting Details (you can type over theseinstructions.)Please limit your narrative to 500 words (equivalent to 1 typedpage). I was standing on the fifth floor balcony of my apartment in Chaiang maiThailand in Nortern Thailand nerar the Laos Burma border.I observed three brightlight s moving acroos the sky one behind the other.They were large ,bright redand teardrop shaped. At first I thought they were helicopters but the lightemmitted was too bright and constant --very unlike a plane or helicopter. I wasastonished! I stepped inside my door and brought out two cameras, I took severalshots with each camera.7BI have not had the film developed this happened a few hours ago.5D I walked to my left to see if they would pass through the sky on the otherside of the balcony.I saw nothing . When I returned to my original vantage pointI saw two more objects coming from the same direction . I took several morephotops,I then noticed that all five were framed in the sky.--stopped. I checkedmy watch and observed them for three minutes. I wrote a diagram on a notepad andnoted times. At the end of three minutes one object disappeared. Gradually theyall disappeared. I now think they were not hovering in the sky but rather movingaway and as they got further away they became dimmer.My reaction was one of calmamazement, I thougt over and over this is some very wierd s----."],"Log Number":"","Case Number":"874","Disposition":"Unresolved","Tags":"City","files":["/var/www/straped/mufon/html2text/874.html.txt","/var/www/straped/mufon/org/874.html"],"Date Submitted":"10/12/2000 06:36 UTC","City":"Chiang Mai","Object Flight Path":"Unknown","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=18.796464,+98.660059(874)&iwloc=A&hl=en\"> mufon case (874) map </A>","Sighting Duration":"00:05:00","Source":"MUFON","Weather Factors":"Unknown","Latitude":"18.796464","Region":"Chiang Mai","Longitude":"98.660059"}