{"City":"Roswell","trends":["There have been 38 other sightings in Roswell","There were no other sightings in Roswell on or around March 1st 1969"],"divs":["Sighting Details I will be as detailed as I can, but this event happened about 40 years ago. Me, mom and dad, and my two brothers were driving from Lovington, NM to Roswell, NM to visit our grandparents. The entire drive would take about an hour and a half. It was dusk on the lonely road and there was very little or no traffic. At about an hour into the drive I noticed a bright object to the right of the car and mentioned it. Immediately, this object was directly above the car. At the same time, the radio went to static and we heard the speedometer cable break, and it actually felt like the hair on my head was standing up. There was no sound, but there was light everywhere. The object, above, was so large that I could see it from the back seat as I looked straight ahead. Besides the extremely bright light above, I could see colored lights at the peremeter, also it seemed as though the light was coming from inside the car. I had never been so terrified in my life and I just \"froze\" where I was. My middle brother was climbing between the front and back seats, and my youngest brother was only three, so he didn't seem to react. The scariest part, to me, was that I saw a huge black eye staring directly at me from the window beside me. It seems that the eye was more in my \"minds eye\" than an actual eye. The shape was typical of many reports. It was a translucent black teardrop shape. I can feel my heart beating rapidly as I recall this event, even though it has been 40 years ago. The next time I remembered anything our car was heading toward a ditch alongside the road. Dad quickly turned the stearing wheel and kept the car on the road. We were all so terrified that all of us were completely silent. We soon pulled into our grandparents driveway to see the frantic looks on their faces. My grandfather said, \"what happened I was just about to call the State Police to look for you\". My grandfather asked what took us so long. A one and a half trip took three hours. I don't remember almost anything of what was said, but I remember the feeling of terror that gripped us all. I am 54 years old now and one brother is 51 and the other 44. My father is 75 years old and my mother, 72. I have had nightmeres throughout the years although they have lessened with time. I am still very afraid of being abducted, and my heart races everytime I think about it. Recently my youngest brother and I were looking for Apache Tears near Gabbs, Nevada and it was beginning to turn dark. We were in the middle of nowhere and were headed toward Fallon, Nevade. As we were heading back I noticed a light near the sky's horizon and I was instantly \"at the Caprock again\". I didn't say anything about it, and I prayed that it wasn't what I feared. This time the light that looked like a star or planet was a star or planet. I have told a few people about this event, but probably no more than 20. Strangely, almost everyone seems to believe me. I would like to know what happened but at the same time I am too terrified to know any more."],"Sighting Duration":"01:15:00","Weather Factors":"Unknown","Case Number":"8741","Date of the Event":"03/01/1969 08:00 UTC","files":["/var/www/straped/mufon/html2text/8741.html.txt","/var/www/straped/mufon/org/8741.html"],"Longitude":"-104.513704","Tags":"City","Latitude":"33.397126","Region":"New Mexico","Object Shape":"Cigar","Disposition":"Unknown","Object Features":"Unknown","Date Submitted":"03/01/1969 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.397126,+-104.513704(8741)&iwloc=A&hl=en\"> mufon case (8741) map </A>","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Country":"United States","Source":"MUFON","Summary":"Missing time at the Caprock 35 miles East of Roswell NM","Log Number":"US-12302007-0001","Viewing Distance":"20 Feet or Less"}