{"Country":"United States","files":["/var/www/straped/mufon/html2text/8744.html.txt","/var/www/straped/mufon/org/8744.html"],"Source":"MUFON","Summary":"A blue sphere with a white tail moving east to west parallel to the ground.","Disposition":"IFO","divs":["Sighting DetailsI was at Six Flags over Texas in Arlington assisting a man with his camera. As we were looking at the camera we noticed a white flash like a camera flash. Like a light or something. Then we looked up and saw the blue ball with a green glow around it with a white tail. It was moving across the sky from the southeast around Duncanville and moved north of me and wrapped around to the west toward Fort Worth. I was looking north and it pretty much moved east to west. I thought it was a comet because when it went by I was waiting for more. The ball was about the size of a marble in the sky and seemed to be as high as an airplane. It took about 5 or 10 seconds to go across the sky. I did'nt see where it finished because there as a roller coaster ride blocking by view. It was a blue ball that glowed green and the tail close to the ball was green but it tapered off to white. The tail was about 5 times the length of the ball. It did not make a sound. The guy next to me saw it and said \"you don't see those everyday. That was pretty awesome\". There was about 100 to 200 people in the area around me and I did'nt see anyone else point up to the sky or even pay attention to me. Another guy I know saw it too but he was at a different part of the park. He said it looked just like what I saw except he said it looked more like a big green comet. I mentioned that I say a blue comet and he said that he saw it too except it looked more green to him."],"trends":["There have been 43 other sightings in Arlington","There were no other sightings in Arlington on or around December 29th 2007"],"Region":"Texas","Sighting Duration":"Undisclosed","Latitude":"32.740407","Longitude":"-97.098436","Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.740407,+-97.098436(8744)&iwloc=A&hl=en\"> mufon case (8744) map </A>","Log Number":"US-12302007-0004","Object Shape":"Sphere","Viewing Distance":"Unknown","Object Features":"None","Case Number":"8744","Date Submitted":"12/29/2007 07:45 UTC","Date of the Event":"12/29/2007 07:45 UTC","City":"Arlington"}