{"Object Features":"Unknown","Viewing Distance":"Over One Mile","City":"Warner Robins","Longitude":"-83.638056","Date of the Event":"12/26/2007 08:17 UTC","Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/8747.html.txt","/var/www/straped/mufon/org/8747.html"],"Log Number":"US-12302007-0007","Source":"MUFON","Weather Factors":"None, Does Not Apply","Summary":"Very fast and large star-like object took off from horizon and flew across interstate","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.608611,+-83.638056(8747)&iwloc=A&hl=en\"> mufon case (8747) map </A>","Region":"Georgia","Tags":"City","Case Number":"8747","Country":"United States","Sighting Duration":"00:00:02","divs":["Sighting DetailsI was driving north on I-75 near exit 142, which is close to Warner Robbins, GA on December 26th at approximately 8:15 pm. I was with my mother (passenger seat, not paying attention), brother (back right seat, asleep), and father (back left seat, asleep) and we were on our way home to the Atlanta area from Miami, FL. At the point where I saw the object, the interstate was on a downward slope and my car was at the top of a hill so that I could see down pretty far. The highway dipped down and a mile or so down the road it sloped back upward. There were lots of trees and billboards, etc., on each side of the highway, but there were no overpasses for about 3-4 miles north from where I was. It was a cloudy night and I could see no stars. I wasn't able to see any airplanes that night until about 9 pm. While driving I was very alert, wide awake, and concentrating on the road ahead of me. All of a sudden, from behind the tree-line on my left (west), a very bright, large, and extremely fast-moving star-like object appeared to come off the horizon and shoot across the interstate at approximately a 30 degree angle. It proceeded to move at this very rapid rate until it was past the tree line on my right (east) and was out of sight. It seemed to disappear behind the clouds, but I can't be sure. The object looked to be about 2-3 miles down the road from me. The diameter of the bright area was about twice as big as the diameter of the bright area of a headlight from a very close oncoming truck, except it was much farther. The object's size and brightness remained constant throughout the entire time (about 1.5-2 seconds). My first reaction to seeing this was complete shock. The object's size and intensity, and the fact that it came without warning, really took me by surprise. I immediately tried to see where it went and I slowed down to see if I could get a glimpse of it or anything unusual to the east of my location. My brother and father were asleep in the backseat and my mother was not paying attention to anything, but I started asking, \"Wow did you see that?!\" She had her eyes closed and I was upset because I wanted someone to explain it to me. Once I realize I was alone in seeing it (in my car at least), I went back to driving. However, I spent the rest of the drive home analyzing the situation in my mind, as the images of the event were burned into my brain. I ruled out a car due to size, speed, point of origin, and angle. An airplane was also ruled out for the same reasons, plus the fact that I had been unable to see any at that point due to cloud cover. I ruled out a meteor due to size (I've never seen a shooting star anywhere near this size), point of origin (it started from ground level and ascended), angle (meteors seem to go across the sky, this went from ground up), and the fact that the object's size and brightness remained constant throughout (meteors burn up completely or hit the earth at a smaller size than when they start out). The cloud cover would also rule out the ability to see a shooting star. As soon as I got home (around 10 pm), I drew a rough sketch of what I saw (what I have attached is an updated, cleaner version made in MS Paint). I actually was a little frightened by the sighting for the rest of the night, and I could not stop thinking about it. Although I am a believer, I had never seen a UFO, and even when I saw this I remained skeptical. I have waited a few days to report it because I wanted to be completely sure that I could not find an explanation of what it was in the sky that night."],"Disposition":"IFO","Latitude":"32.608611","trends":["There have been 4 other sightings in Warner Robins","There were no other sightings in Warner Robins on or around December 26th 2007","This sighting has never been favorited.",""],"Date Submitted":"12/26/2007 08:17 UTC"}