{"City":"Springfield","Date Submitted":"12/30/2007 09:10 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.786341,+-89.644588(8749)&iwloc=A&hl=en\"> mufon case (8749) map </A>","divs":["Sighting DetailsAt approximately 9:06 PM I stepped out my back door. I looked up at the sky because it was a cold crisp night very clear and the stars were very bright. As I looked at Mars and the three stars that make up the belt of Orion I saw a formation of pinpoints of light that were of the magnitude of dim stars, moving in a south southeasterly direction in a straight line, amber in color. I think there was three to five of them flying in exact formation. They traversed the sky in only seconds. They were silent. They were not aircraft with strobelights, as there were a some of these in the sky. I cannot be sure if it was a single object or 3 to five objects. I cannot say definitively the altitude of this object(s), it could have been 3 to five objects fairly close into the earth in space or could have been a craft flying at high altitude within the atmosphere. I feel like it was a craft of some sort, but since the sighting lasted only one or two seconds I cannot be sure, but let me assure you this was not a natural phenomena. I have seen meteors, this was not a meteor, because there was no streak or trail of debri following after them. This sighting is something unlike anything I have seen before, I was stunned. I am stunned."],"Longitude":"-89.644588","Object Flight Path":"Straight-line path","Object Shape":"Triangle","Disposition":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/8749.html.txt","/var/www/straped/mufon/org/8749.html"],"Region":"Illinois","Date of the Event":"12/30/2007 09:10 UTC","Summary":"Triangular formation of amber lights sighted moving in southeatserly direction at a high rate of speed","Case Number":"8749","Object Features":"None","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around December 30th 2007"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"39.786341","Viewing Distance":"Unknown","Log Number":"US-12312007-0001","Tags":"City"}