{"Object Flight Path":"Other","files":["/var/www/straped/mufon/html2text/8751.html.txt","/var/www/straped/mufon/org/8751.html"],"Summary":"I saw an oval UFO about 100 ft long and 30 ft in diameter at its' center exit the ocean at a steep angle.","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.522291,+-80.034222(8751)&iwloc=A&hl=en\"> mufon case (8751) map </A>","Object Shape":"Oval","Log Number":"US-12312007-0003","Disposition":"Unknown","trends":["There have been no other sightings in West View","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Region":"Pennsylvania","Source":"MUFON","divs":["Sighting DetailsWhile working as a Start-up Field Engineer on the old Gulf of Canada big refinery at the front ocean side of the Canso Straight -- I used to drive up to the highest point reachable by road at the time ( within 5 miles of the refinery complex, again facing the Ocean )usually after midnite to get good radio reception from Boston to listen to the Baseball scores as I was a big Pirates fan at the time. 99 % of the time one or more of my associates came with me,but on this particular night I was by myself. I was half asleep playing with the car radio to get the station's reception --- when no more than 200 to 300 yards in front of me out from the ocean shoots at a very steep angle a bright reddish - orange glowing oval like object about 100 ft long and say 20-30 ft in diameter at its' center. When it got up in the air a couple hundred ft,I swear it shook itself to shed all of the sea water. Then it came toward me on the shore and hovered right above me,I was scared and dove to the floor of my car so it looked like no one was in the car,I hoped. After a lifetime to me,it finally shot away up into the night sky at a high rate of speed with a combination high shrill whizzing with a loud lower tone buzzing sound. Needles to say I quickly drove back to the Motel near Port Hastings on the Trans Canada Highway where I was staying. I never went back to that spot again,even after not finding another good radio reception spot. I had to read the ball scores 2 weeks late when the Boston Sunday Edition newspaper got up to us."],"Date of the Event":"07/17/1970 12:00 UTC","Case Number":"8751","City":"West View","Latitude":"40.522291","Date Submitted":"07/17/1970 12:00 UTC","Longitude":"-80.034222"}