{"Disposition":"Unknown","Summary":"Hovering saucer shaped object observed outside of Monahans, TX in the late 1930's or early 1940's","Sighting Duration":"Undisclosed","Object Shape":"Disc","Log Number":"US-12312007-0004","Longitude":"-102.892654","Date Submitted":"12/31/2007 11:01 UTC","Case Number":"8752","map":"<A HREF = \"http://maps.google.com/maps?q=31.594299,+-102.892654(8752)&iwloc=A&hl=en\"> mufon case (8752) map </A>","Date of the Event":"Unknown","Region":"Texas","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","divs":["Sighting DetailsTHIS ACCOUNT IS A SECOND HAND ACCOUNT - THIS DESCRIPTION WAS FROM MY UNCLE AND HIS WIFE WHO WERE LIVING JUST OUTSIDE OF MONAHANS, TEXAS DURING THE 1930'S AND 1940'S: Monahans, Texas was an area in West Texas that was desolute and sparsely populated back in the 1930's and 1940's. My uncle was a very intelligent person who possessed remarkable abilities to memorize and recite with great ease long works of poetry lasting 30 to 45 minutes. He was a mentally stable, normal person who always told the truth and would never fabricate or exaggerate. He also possessed a high degree of extra sensory perception which was evidenced on several occasions. One summer evening around 9 or 10 PM in the late 1930's or early 1940's, my uncle and his wife were in their house located just outside of Monahans, Texas when they noticed some bright lights outside. They went outside to investigate and saw a saucer shaped object hovering overhead. The object was very low and they could see a portion of the object revolving while the remainder of the object was stationery. It also had pulsating lights. My uncle said that he and his wife were so scared that they just dropped to their knees and looked upward. Neither one could say a word because they were so scared and shaking. After a short period of time (my uncle was too scared to determine the length of time) the object zoomed off at an incredible rate of speed and went out of sight in a few seconds. He said that he had never seen anything like it. It was not until the early 1950's that my uncle told my mother about this incident. Both he and his wife were afraid that people would think that they were crazy. I wish that I could be more specific and more detailed, but my uncle passed away suddenly with a heart attack in 1953 at the age of 51 and this is all of the information that I have."],"Object Features":"Dome","Latitude":"31.594299","Tags":"City","trends":["There have been 2 other sightings in Monahans","There were no other sightings in Monahans on or around"],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/8752.html.txt","/var/www/straped/mufon/org/8752.html"],"City":"Monahans","Country":"United States"}