{"trends":["There have been 24 other sightings in Oakland","There were no other sightings in Oakland on or around December 9th 2007"],"Disposition":"Unknown","City":"Oakland","Region":"California","Object Flight Path":"Straight-line path","Country":"United States","Case Number":"8756","divs":["Sighting DetailsI was coming in to San Francisco Airport on Dec. 9th, 2007, at 7 PM, on Continental Airlines flight CO41, from Newark, New Jersey, to visit my family after my first semester away at College. I had a window seat on the left side of the plane, so I was looking at the East coast of San Francisco Bay. We were between 1-3 thousand feet high, so individual streetlights were becoming easier to make out. While I was looking out the window, I saw it. It appeared to me to be a pulsing white light a few feet under the surface of the water, moving slower than the plane, but still moving. It was perhaps between 10 and 30 feet across (Size was constant; I'm just not that good at judging sizes from a plane). It would pulse a white light, with a slow frequency (i.e. it took about 10 seconds to cycle from bright light to pitch black to bright light again, with both dark and light times being the same length). It also gave off some kind of (for lack of a better word) whispy tail into the air that was roughly twice the width of the object in height. This \"tail\" would only appear when the light was on. I watched the object for about 5 minutes, at which time I lost sight of it because we moved beyond it. At the time I lost sight of it, though, it seemed to be doing the same thing it had been doing when I first saw it: moving slowly south along the coast and pulsing under the water. When I first saw it, it was interesting to me. I hadn't seen any airplane or helicopter that looked like that, or any boat or sub that acted in that way, so that was the reason I watched it. I used to live on an island, so I know what boats look like, and my Parents house is 5 minutes away from our county airport, so I know the patterns of lights produced by Airplanes because they fly over the house all the time. This was one big pulsing white light that was under the surface, and unlike anything I'd ever seen before. It is a USO in the sense that it was submerged and I was unable to identify it. During the sighting, I was at first curious as I was expecting, like all the other times I've seen something strange in the sky or on the ocean, to identify this object within a few seconds as a plane or boat or something else mundane. My curiosity was noticeably piqued as a result of this encounter, so I watched it intently, and after I had watched it long enough to know that it was unlike anything I had ever seen (I spent a minute or two of the sighting trying to identify it and failing), I switched into \"this is something I can't explain\" mode and started observing just as a scientist would observe an experiment; Not applying any bias, or judgement; just watching. After I lost sight of it I immediately thought of how awesome it was that I'd finally seen a UFO (well, USO, but I'm not picky), and I couldn't wait to report it to MUFON. That's about the gist of my report. I know I'm not a trained observer, but I like to consider myself an Amateur Armchair Ufologist, and this has reaffirmed my notion that there is something going on that isn't being adressed by the world at large. I hope my report helps MUFON in convincing people that something is happening."],"Latitude":"37.805484","Source":"MUFON","Object Features":"Other, Unknown","Tags":"City","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.805484,+-122.268304(8756)&iwloc=A&hl=en\"> mufon case (8756) map </A>","Longitude":"-122.268304","Date Submitted":"12/09/2007 07:04 UTC","files":["/var/www/straped/mufon/html2text/8756.html.txt","/var/www/straped/mufon/org/8756.html"],"Summary":"Whispy object emitting light under the surface of the water travelling along the eastern cost of San Francisco Bay","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"Unknown","Log Number":"US-12312007-0008","Object Shape":"Flash, Other","Date of the Event":"12/09/2007 07:04 UTC"}