{"Tags":"City","Summary":"Black triangular ship passed directly overhead, very low altitude ( approx.200-300 ft. )","Object Flight Path":"Straight-line path","Viewing Distance":"101-500 Feet","City":"Industry","Country":"United States","divs":["Sighting Details Until recently I just assumed that this object was a stealthy American military craft, but now I'm not so sure, this is why I am so long to announce it. On approx. date given I was at a neighbors ( inlaws ) house outside. This was a nice , sunny summer day. There were 4-5 people that witnessed this. Two are deceased now. We were just standing outside talking by the vehicles when suddenly the area got almost completely dark. I looked up to see where the sun went and there was the biggest black triangular thing I have ever seen almost directly overhead at this point. It was so low and so large that I could barely see the edges of it. I did not see any markings or lights. It's been so long that I sort of forget any other outstanding characteristics about it, except that it was almost silent. I did hear something, almost like it was the sound of what the air would have sounded like with something this large passing through it. It was not an engine sound, just a whirring sound kink of. My first thought was that this was a stealth military jet that was gliding with engines off, but it occurred to me that maybe it was in trouble and was looking for a place to land. This being a foothills, mountainous area there were not many places something like this could land nearby, except there was a hay field a few miles away. My almost immediate reaction was to jump in the car and drive fast to this field to see it land. A few of us jumped in the car and got there in about 5 minutes. There was nothing there when we got there. I did not see this again or hear anything about it ever.....This object was going so slow I couldn't understand how it could stay in the air. All of my actions took place from the time I saw the craft to about the time it was done passing overhead. Until now this has just been a good campfire story other than I did also about 6 months ago reported the same story to the Brian Vike UFO research web site. I have for just a few years now gained more interest in the UFO phenomena so I have been reading several books and looking online and have found several reports from other people that seem to be nearly identical to what I have seen. I wish I could remember the exact date so this could be traced back to the time to see if it truly was one of ours.... That's my story and I'm sticking to it. I hope no men in black will come to visit me now."],"Region":"Maine","Latitude":"44.749722","Case Number":"8757","trends":["There have been no other sightings in Industry","This sighting has never been favorited."],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=44.749722,+-70.074722(8757)&iwloc=A&hl=en\"> mufon case (8757) map </A>","Object Shape":"Triangle","Sighting Duration":"Undisclosed","Log Number":"US-12312007-0009","Longitude":"-70.074722","files":["/var/www/straped/mufon/html2text/8757.html.txt","/var/www/straped/mufon/org/8757.html"],"Weather Factors":"Unknown","Date Submitted":"07/15/1989 12:00 UTC","Object Features":"Wings, Other","Date of the Event":"07/15/1989 12:00 UTC","Source":"MUFON"}