{"trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around December 31st 2007"],"Longitude":"-112.064787","map":"<A HREF = \"http://maps.google.com/maps?q=33.457397,+-112.064787(8758)&iwloc=A&hl=en\"> mufon case (8758) map </A>","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Log Number":"US-12312007-0010","City":"Phoenix","Summary":"lights in northern sky going from one bright blinking to many in a row.","Date of the Event":"12/31/2007 12:00 UTC","Latitude":"33.457397","Disposition":"Hoax","Country":"United States","Case Number":"8758","Object Flight Path":"Undisclosed","Source":"MUFON","divs":["sighting detailsmy son and i just purchased a pizza and we were returning home when when my son yelled out \"look!\" \"over there\" ....\"its the phoenix lights\". we were going east on cactus about to hit 35th ave. he is really into ufos and the like so i'm always debunking his sightings. this one was a cluster of lights though and caught my attention. so i began to pay closer attention. the lights in the sky were stationary for a while. there was one light in the middle that blinked like a plane's, but then a row of 4-5 lights on both sides of the blinking one would light up. then they would one by one go off meanwhile the blinking one would stay lit. there was no particular pattern either. they would sometimes go in a series ,1,2,3,4,5, on both sides and then all off. i thought it might have been a blimp, but then it started to move to the east rather rapidly much faster than any blimp. i gave him credit for actually being right this time. we watched it for a few minutes and went and purchased his sparkling cider and went home to watch a movie.after we purchased the cider we could no longer see the lights so we went home. 3rd event i've witnessed since living in phoenix. the other two were with numerous people too. crazy place\\time to live."],"Date Submitted":"12/31/2007 12:00 UTC","Tags":"City","Object Features":"Undisclosed","Region":"Arizona","files":["/var/www/straped/mufon/html2text/8758.html.txt","/var/www/straped/mufon/org/8758.html"],"Weather Factors":"Unknown","Object Shape":"Other"}