{"Country":"United States","divs":["Sighting DetailsI was'nt but ten going on eleven years old when I wen't outside on our front porch after my grandpa and I came in from picking watermelons in our watermelon field! We did not get newspapers for we lived in the country. Closest big town was Searcy, Ark. 32 miles away. Anyway, I was standing on our front porch looking at our cows in the pasture, when out of nowhere, I heard a whirring sound. I looked and seen nothing but heard the wirring sound, all of a sudden the rotating disk silver in color landed in the pasture in front of me (no more than 60-70 feet), so as young as I was I saw it very clearly and will never forget it! I had never heard of a ufo in my life nor did I know what one was. All I know is that I had seen what I saw and never saw one before, nor have I seen one since! Back to what I saw, after the disk landed in our pasture, a ladder came down from inside the craft and I watched in shock and curiosity. Before I knew it,(Iwas seeing who or what was going to come down the ladder) but instantly the ladder went back up, the whinning got loud and the disk shot up and disappered! Never seen it again1 i WISH i COULD HAVE THE OPPURTUNITY TO GO ABOARD ONE OF THEIR CRAFTS! i WOULD NOT BE AFRAID OF THEM. fOR i FIGURE THAT THEY LET ME GET A GLIMPSE OF THEM FOR A REASON, WHAT, i DO NOT KNOW!I wish I could go aboard one their crafts and maybe live amoung them! I am 53 years old now and will never forget what I saw and still would like to join them wherever they are from!"],"Latitude":"35.123698","files":["/var/www/straped/mufon/html2text/8759.html.txt","/var/www/straped/mufon/org/8759.html"],"Log Number":"US-01012008-0001","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-91.645135","City":"Griffithville","Tags":"City","Object Shape":"Disc","trends":["There has been one other sighting in Griffithville","There were no other sightings in Griffithville on or around November 30th 1964"],"Case Number":"8759","Date of the Event":"11/30/1964 12:00 UTC","Date Submitted":"11/30/1964 12:00 UTC","Viewing Distance":"21-100 Feet","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Summary":"round with lights flashing at bottom going around and round, silverish color disk.I","Object Features":"Dome","map":"<A HREF = \"http://maps.google.com/maps?q=35.123698,+-91.645135(8759)&iwloc=A&hl=en\"> mufon case (8759) map </A>","Region":"Arkansas"}