{"Weather Factors":"Unknown","Date of the Event":"01/01/2008 01:00 UTC","Country":"United States","Viewing Distance":"Unknown","Latitude":"37.986188","map":"<A HREF = \"http://maps.google.com/maps?q=37.986188,+-122.030033(8760)&iwloc=A&hl=en\"> mufon case (8760) map </A>","Disposition":"Unknown","Case Number":"8760","trends":["There have been 20 other sightings in Concord","There were no other sightings in Concord on or around January 1st 2008","This sighting has never been favorited.",""],"Tags":"City","Object Flight Path":"Undisclosed","Sighting Duration":"00:01:10","Date Submitted":"01/01/2008 01:00 UTC","Longitude":"-122.030033","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/8760.html.txt","/var/www/straped/mufon/more/8760_submitter_file1__TedHeffel-01-01-08.jpg","/var/www/straped/mufon/org/8760.html"],"divs":["Sighting DetailsShortly after my neighborhood finished with new years fire works I went out front of my house and looked toward the west, south west where orion was and mars north of orion. Where then I and several other witnesses saw a low moving object which was glowing a bright orange. It was traveling due west at a low altitude. There were no blinking lights only a orange glow which seemed to surround the object which was moving at a slow speed compared to most planes I see from the airport which is in Concord CA. This was absolutely not an airplane or helicopter as I see them every day and night due to airport activity! My guess is that this object or craft was observing the activity of fireworks going off all around my city and the surrounding areas!! If you receive any information on this sighting I would like to be informed. Thank You, Ted H. P.S. The object made no sound. Traveled in a straight line and went out of sight behind my house as i was standing in the middle of my street out front."],"Region":"California","City":"Concord","Log Number":"US-01012008-0002","Source":"MUFON","Summary":"Orange glowing object moving due west at about 1000-1500 feet.","Object Shape":"Cylinder"}