{"Date of the Event":"12/31/2007 11:10 UTC","Source":"MUFON","City":"King's Lynn","Sighting Duration":"Undisclosed","Case Number":"8761","Viewing Distance":"Unknown","divs":["Sighting DetailsWhilst setting off fireworks to welcome in the New Year (this actually happened on the 1st of January 0:10 hours - sort the site out). We observed several orange lights rising in the sky in a westerly direction. They tracked overhead, not losing altitude and not fading. They eventually dwindled upwards. We observed several lights, some in a formation. There were no white, green and red lights, no jet or piston engined noise! Also the final two, one rose vertically, one tracked horzontally, heading northwards from the point of origin. Once again no lights were visible or engine noise heard. They were the wrong colour for distress flares, no accompanying explosions were heard which would suggest fireworks. Just these lights. I am a keen aircraft spotter. So can discount known aircraft. Also I have seen the ISS, this was NOT that. At one point there were more than 10 of these light sources in the sky. I had been drinking, but not enough so that my comprehesions was affected. The travelling lights did not appear to be flares or fireworks. They were not aircraft. It was a swarm. They faded, travelling upwards! I want to know what the hell these were! Unfortunately none of us had a camera on us, I wish I did!"],"Log Number":"GB-01012008-0003","map":"<A HREF = \"http://maps.google.com/maps?q=52.75649,+0.400174(8761)&iwloc=A&hl=en\"> mufon case (8761) map </A>","Date Submitted":"12/31/2007 11:10 UTC","Region":"England","trends":["There have been 3 other sightings in King's Lynn","There were no other sightings in King's Lynn on or around December 31st 2007"],"Summary":"Light Sources","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Country":"United Kingdom","Tags":"City","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/8761.html.txt","/var/www/straped/mufon/org/8761.html"],"Latitude":"52.75649","Weather Factors":"Unknown","Object Shape":"Unknown","Longitude":"0.400174"}