{"Region":"New Hampshire","Object Features":"Undisclosed","Case Number":"8763","map":"<A HREF = \"http://maps.google.com/maps?q=43.202792,+-70.86725(8763)&iwloc=A&hl=en\"> mufon case (8763) map </A>","Sighting Duration":"Undisclosed","City":"Dover","Longitude":"-70.86725","files":["/var/www/straped/mufon/html2text/8763.html.txt","/var/www/straped/mufon/org/8763.html"],"trends":["There have been 3 other sightings in Dover","There were no other sightings in Dover on or around December 29th 2007"],"Log Number":"US-01012008-0005","Date of the Event":"12/29/2007 09:45 UTC","Object Shape":"Other","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Country":"United States","Date Submitted":"12/29/2007 09:45 UTC","Disposition":"IFO","Tags":"City","Summary":"Light like a headlight of a car shining across sky","divs":["sighting detailsa witness (wishes to remain anonymus) was going into home when he got out of his car and walking down his driveway when he saw a light coming from an unseen object(no red or green lights) fly from n.e to south east about horizontal(about 60 degrees from the horizon) to orions belt go into cloud cover. the object was flying over 25,000 feet.that is where the cloud cover was according to uswx.com given to me by the pease international airport operation center. the sky cover(clouds) were broken @ 25,00 feet. they had no aircraft on their radar and no aircraft in the air. the objects light when last seen was turning to the south east and was about the size of a pea at arms length. the azimuth reading at last sight was about 160 degrees and heading directly over the line of sight where the airbase was located. it should be noted that the airbase is about 3\\4 mile form the pisacataqua river. the observer states that the light looked like a car head light shining into a cloud and was some what cone shaped > pattern. no noise or landing lights or red or green lights or sound was heard at any time. it just disappeared in the light cloud cover. when he walked into the house he stated that he never had seen anything like it in his over 35 years on the nh seacoast. submitted by art champoux mufon investigator"],"Latitude":"43.202792"}