{"Log Number":"US-01012008-0006","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=60.538716,+-145.700553(8764)&iwloc=A&hl=en\"> mufon case (8764) map </A>","Date of the Event":"12/28/2007 05:33 UTC","trends":["There have been no other sightings in Cordova","This sighting has never been favorited."],"Object Flight Path":"Straight-line path","divs":["Sighting DetailsI was driving home from work on December 28th, 2007 at approximately 5:30 pm, when I noticed a bright orange colored light slowly moving toward me, coming in from over the lake and almost paralleling the highway. At first I thought it may be a jet, but then realized that it had no blinking lights, and it was not traveling on the typical jet route. Seeing as I was only four blocks from home, I pulled into my driveway and continued staring at the object. As soon as I jumped out of my truck, I heard someone say, \"I am glad that I am not the only one seeing this.\" I don't think I even replied, as I was too intense, analyzing what I was seeing. The object was flying fairly low, just above a low layer of clouds, which distorted the image from time to time. I could not see the stars. The object was about as big as a pencil eraser held out at arms length. As the object passed overhead, it was difficult to tell if what I was seeing was a ball of fire, or possibly it was crescent shaped. The clouds diffused the light it was emitting. The color was a rich orange, the color of fire, but probably even more of a dark orange-ish red. It took about two minutes for the object to fly overhead, and then another two minutes before it quickly disappeared. There was no sound from a plane, helicopter or jet. I called a relative on my cell and told him to look up as it approached his home, which was about a half mile away. He saw the same thing I saw. But when he finally saw it, from where he was, it appeared to go straight up and out of sight. From where I was it appeared to disappear going away from me and slightly up to the left into the atmosphere. I raced into my house to try to find a digital camera. When I finally returned, the object was quite a distance away, still orange, but now appearing only as large as a planet. I took a photo of the object in the dark night sky. What I captured only appears like a speck of light, and that is only after I enhanced the photo to lighten the image substantially. From where I first saw the object, it was probably two miles away, and that is being generous, from my home. I took about two minutes to fly overhead. It was not directly overhead. It was probably moving at 60 miles per hour or less. The neighbor, who I still have not identified yet, tried shooting fireworks at the object, probably to get its attention. It continued on at this slow rate of speed,until it went another two miles, when it went out of sight. During the sighting, I pretty much just concentrated on staring at the object, looking for any thing that could help describe it. From the onset, I had thought about running in to find a camera, but I did not want to miss visualizing any of the sighting. This was my first. If I am ever fortunate enough to witness another sighting, I will definitely attempt to capture the sighting on camera at the soonest possible moment. After the object disappeared, I called the relative and re-played the sighting with him. He had seen something similar about 10 years ago, and said that the color was exactly the same, the rich orange fire-like color. It was a brief incident."],"Case Number":"8764","Date Submitted":"12/28/2007 05:33 UTC","Summary":"Slow moving ufo, the color of fire, passes over Cordova Alaska","Latitude":"60.538716","Country":"United States","Region":"Alaska","files":["/var/www/straped/mufon/html2text/8764.html.txt","/var/www/straped/mufon/org/8764.html"],"Weather Factors":"Unknown","City":"Cordova","Object Features":"Unknown","Object Shape":"Boomerang, Fireball","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-145.700553","Tags":"City","Disposition":"Unknown","Sighting Duration":"Undisclosed"}