{"Object Features":"Undisclosed","Summary":"Star like object with pendulum","Viewing Distance":"Unknown","Case Number":"8766","Latitude":"32.731809","Object Flight Path":"Undisclosed","Longitude":"-97.31157","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=32.731809,+-97.31157(8766)&iwloc=A&hl=en\"> mufon case (8766) map </A>","divs":["sighting detailsa star like object was observed in the north east, at about 60 to 70 degrees above the horizon. the attached video was taken using a max 10x optical zoom minidv camera. the object was also observed using a telescope, 10x binoculars (hand held and shaky), and photos taken using 3x max optical zoom camera. through the telescope, the object appears as a silver ball, but with a pendulum with a silver chord attached to a small ball at the end. the pendulum moved back and forth and around the object. the attached video was cut from the original size (12 minutes). the object moved slowly during filming, and was stopped shortly due to interference from a tree. the similar object was observed two days before, but it abruptly exploded. the explosion resembled fireworks. no video was taken, but a video of a similar explosion can be viewed on youtube (http:\\\\www.youtube.com\\watch?v=-cewh99f0k0). the pendulum is hard to see on the youtube video, but it is there. the object was seen again on dec. 4, but as only a beautiful silver ball, with no pendulum."],"City":"Fort Worth","Weather Factors":"Unknown","Object Shape":"Star-like","Country":"United States","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around September 24th 2007","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/8766.html.txt","/var/www/straped/mufon/more/8766_submitter_file1__ufoedit.WMV","/var/www/straped/mufon/org/8766.html"],"Log Number":"US-01022008-0001","Date of the Event":"09/24/2007 07:45 UTC","Region":"Texas","Disposition":"IFO","Sighting Duration":"Undisclosed","Date Submitted":"09/24/2007 07:45 UTC","Source":"MUFON"}