{"Sighting Duration":"Undisclosed","Country":"Chile","Longitude":"-70.54893","Date Submitted":"12/31/2007 01:20 UTC","Object Features":"Undisclosed","Date of the Event":"12/31/2007 01:20 UTC","divs":["sighting detailsat around 12:20 am local time (3:20 gmt) 1\\1\\2008. my wife an i saw a read light, like a star but changing brightness from very dim to very bright, even brighter that sirius. the color changed from very dip red to orange\\yellow. a few minutes after i went into the house to see if someone reported an astronomic event to explain this phenomenon. this light show up bellow the taurus constellation (north-east), at around 20-30 digress above the horizon. during my laptop booting process i went out to verify the object, but for my surprise i found another light with the same characteristics at our north around 30 digress above horizon. then my wife show me another abject with the same characteristics moving from south to north that pass just above zenith to about the same location that the other lights were. we also notice that the north and the north-east lights were moving slowly. the north-east light was moving west. after 1am i went out several times and didn't see anything else. no noise during this events. many years as an amateur astronomer and artificial satellite viewer and never saw something like this. any explanation?"],"Summary":"Chile - 3 red-yellow bright moving lights close to Orion/Taurus","Disposition":"Unresolved","Case Number":"8768","Region":"Santiago Metropolitan Region","Object Shape":"Star-like","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=-33.412557,+-70.54893(8768)&iwloc=A&hl=en\"> mufon case (8768) map </A>","trends":["There have been 12 other sightings in Santiago","There were no other sightings in Santiago on or around December 31st 2007"],"files":["/var/www/straped/mufon/html2text/8768.html.txt","/var/www/straped/mufon/org/8768.html"],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Latitude":"-33.412557","City":"Santiago","Source":"MUFON","Log Number":"CL-01022008-0003"}