{"Viewing Distance":"Over One Mile","Object Features":"None","Source":"MUFON","Sighting Duration":"00:10:00","Latitude":"27.816415","trends":["There have been 8 other sightings in Sebastian","There were no other sightings in Sebastian on or around December 18th 2007"],"Summary":"A floating, soundless star-like object that changed colors and changed opposite directions with ease","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/8770.html.txt","/var/www/straped/mufon/org/8770.html"],"Date Submitted":"12/18/2007 09:30 UTC","Case Number":"8770","map":"<A HREF = \"http://maps.google.com/maps?q=27.816415,+-80.470608(8770)&iwloc=A&hl=en\"> mufon case (8770) map </A>","City":"Sebastian","divs":["Sighting DetailsOn the evening of Dec. 18, 2007, standing on a waterfront front porch of a rented cottage at the Pelican Landing Resort on the Indian River in Sabastian, Fl., I saw what first appeared to be a small, private airplane, in the sky directly to the east moving to the right or south. I watched the object for a moment or two, then the small light went in the opposite direction to the left or north. I was astonished. I kept watching while the light again changed directions six more times, back and forth. Then the light instantly grew into a larger appearing bright white light for three seconds or so. Then it seamed to impode and it went dark, only to reappear again a short distance to the south. The light traved a much longer distance south, down the coast until it almost could not be seen. Then it changed direction again to the north and it appeard to come closer to me. At about the same spot where it turned bright, the light changed to a deep red color while continuing slowly to the north. The light then kept moving north, and away from me, becoming dimmer and dimmer until it could no longer be seen. At no time did the light make any noise. I felt an intelligence connected to the light due to instantly changing directions numerous times and changing colors. I could not tell how faw away the object was nor could I see any shape. At the time of this sighting, my girlfriend Beth was taking a shower. When she got out I told her of seeing a UFO. We both looked for awhile but it did not reappear. I was the only witness without any form of camera or video. Sincerely, Britt Nelson."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Tags":"City","Object Shape":"Star-like","Country":"United States","Date of the Event":"12/18/2007 09:30 UTC","Disposition":"Unknown","Region":"Florida","Log Number":"US-01022008-0005","Longitude":"-80.470608"}