{"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.039831,+-77.055256(8771)&iwloc=A&hl=en\"> mufon case (8771) map </A>","Viewing Distance":"20 Feet or Less","Sighting Duration":"Undisclosed","Case Number":"8771","Date of the Event":"12/28/2007 03:00 UTC","Object Shape":"Flash, Sphere","Region":"Maryland","Tags":"City","Longitude":"-77.055256","Weather Factors":"None","Date Submitted":"12/28/2007 03:00 UTC","Object Features":"Dome","Latitude":"39.039831","Source":"MUFON","Object Flight Path":"Path with directional change","Summary":"white bright light was coming in thru the window giving a paralytic effect..once able to move saw a bright ball of light about the size of a car floating outside of window","divs":["Sighting DetailsThis happened to my little sister who is 20 years old and has always thought my mom and I are weird for beleiving we wer getting visited every six months at this house. This is her account of what happened: \"I opened my eyes and saw nothing but a bright, white light coming in thru the window, it encompassed my whole room. I was paralyzed,stuck to the bed!! All I could move was my eyes!! I looked at the clock and it was exactly 3am. I was very scared, I couldn't speak. Suddenly I felt a release & the light was gone from da room so I looked out the window and there was a huge ball of light floating outside my window!! just a sphere, no windows, no sound, about the size of a car but it was moving around,then it dissapeared!!\"....this is when she called me and was very afraid and panicky!!! When I lived with my mom in that house more than ten years ago, I used to have the same thing happen exactly every six months!!! My mom and I wer the only ones to experience it and no1 beleived us..until one day my aunt came in as the light was coming in2 the room and interrupted, I was able to stand up and run outside..on top of our house was a HUGE black triangle with 3circular lights, 1 in each angle. the lights turned off & the craft drifted away without making any sound. It NEVER returned..This is the 1st time anything like that has happened in a decade!!! I don't have any memories of being \"abducted\", but the lights and the being stuck 2da bed sure are things I'll never forget"],"Log Number":"US-01022008-0006","files":["/var/www/straped/mufon/html2text/8771.html.txt","/var/www/straped/mufon/org/8771.html"],"City":"Wheaton","Country":"United States","trends":["There have been 3 other sightings in Wheaton","There were no other sightings in Wheaton on or around December 28th 2007"]}