{"Source":"MUFON","Viewing Distance":"Unknown","Longitude":"-117.152215","Weather Factors":"Unknown","Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","Region":"California","Date Submitted":"01/01/2008 12:05 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.720909,+-117.152215(8776)&iwloc=A&hl=en\"> mufon case (8776) map </A>","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"8776","Object Features":"Undisclosed","Latitude":"32.720909","Log Number":"US-01032008-0005","Disposition":"Hoax","Date of the Event":"01/01/2008 12:05 UTC","Country":"United States","Summary":"Bright Red lights hovering in San Diego area south of el cajon blvd near SDSU","City":"San Diego","files":["/var/www/straped/mufon/html2text/8776.html.txt","/var/www/straped/mufon/org/8776.html"],"trends":["There have been 151 other sightings in San Diego","There were 2 other sightings in San Diego on or around January 1st 2008"],"divs":["Sighting DetailsI was standing on the roof of my house with my boyfriend right after midnight when I saw this bright red light appear out of nowhere. It was southwest of us (which is south of el cajon blvd approx). It was not too high off the ground above the houses and then a second one appeared after the first one disappeared to the left of it. At first I thought maybe it was a firecracker because at the time fireworks were going on around the county which we could see from our roof deck. These lights seemed different though because they were SO bright and literally hovered in the air. I knew something was odd about them but I didn't take a picture. Now I wish I had. It didn't move with the wind which I found odd as well because there was a decent breeze that night. The balls of light simply disappeared and reappeared. I went inside though after about 15 minutes after midnight so I do not know where the lights went from here. The distance of the lights from above the houses were about the height a helicopter would travel if it was looking for someone."]}