{"Sighting Duration":"Undisclosed","Object Shape":"Sphere","Source":"MUFON","Object Flight Path":"Unknown","Object Features":"Dome","Case Number":"8780","Date of the Event":"01/04/2008 04:30 UTC","Tags":"City","Summary":"ball of light w/red irredescent glow around it in Wheaton, Maryland","Region":"Maryland","Disposition":"IFO","Viewing Distance":"Unknown","divs":["sighting detailswas driving w\\my daugter near wheaton, maryland & she pointed out how the clouds looked very weird & wer forming the shape of a star around the sun. it was an eerie look. we couldn't stop staring, we both felt there was something there, i pulled over and took pics from outside the car. once reviewing the pics, in 2 of them there is a ball of light w\\ red glow. one pic there's an orb. they were all taken from the same spot and in the picture w\\ the orb there's no red glow anywhere. all three pics taken seconds from each other. i don't think this is an effect from the sun because the sphere of light in the center is obvious and looks solid, also, the red glow takes different shapes in both pics and is in a slightly different position than the first. also, i first tried to take a pic w\\ my cell phone but it was acting up and started blinking like the battery wore off."],"Log Number":"US-01042008-0002","files":["/var/www/straped/mufon/html2text/8780.html.txt","/var/www/straped/mufon/more/8780_submitter_file1__circleobjectwredlight.JPG","/var/www/straped/mufon/more/8780_submitter_file2__orbs.JPG","/var/www/straped/mufon/more/8780_submitter_file3__ufojan042008.JPG","/var/www/straped/mufon/org/8780.html"],"City":"Wheaton","trends":["There have been 3 other sightings in Wheaton","There were no other sightings in Wheaton on or around January 4th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=39.047611,+-77.049546(8780)&iwloc=A&hl=en\"> mufon case (8780) map </A>","Longitude":"-77.049546","Weather Factors":"None","Latitude":"39.047611","Date Submitted":"01/04/2008 04:30 UTC","Country":"United States"}