{"Date Submitted":"11/30/1968 12:00 UTC","Object Flight Path":"Stationary","trends":["There have been 18 other sightings in Novato","There were no other sightings in Novato on or around November 30th 1968"],"Date of the Event":"11/30/1968 12:00 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/8788.html.txt","/var/www/straped/mufon/org/8788.html"],"Longitude":"-122.561803","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"California","City":"Novato","Summary":"About 1969 driving south on 101 towards marin county civic center a large ufo hovered over the morning traffic at an altitude of 10 feet thousands saw it yet not on news","Object Shape":"Disc","Latitude":"38.11313","Tags":"City","Disposition":"Insufficient Data","divs":["Sighting Detailsdriving to college of marin on hwy 101 in morning as i crested the hill where I could see the maring county civic center I thought that the Highway ahead looked odd, not right as I continued to drive a bright sky blue color repalced the road ahead which changed to Prussian blue and then silver as I approached the civic center. then Irealized that a large object was spanning the width of the highway which was at the time four lanes wide. traffic was balled up at the object where the cars were passing under it Itw as about 10 ft above the highway and at first I thought that it was a bridge put up over night some how. as i got to the object Irealized that iyt had a screen on arms in front of it that projected an image of the ascene behind it in effcet hiding it form view until you were riught on top of it. the bottm of the craft was very irregular and probably the screen was pull up under the craft in flight It was very effective in hiding the craft. people were all looking up and I had to drive carefull not thave an accident and did not get to loo all I wanted to look this wa during the morning rush hour traffic and thousnads saw the Ufo yet nothing was in the news any where I was in a daze and continued to drive on and wish now I had gone back to look more in detail. Years later My sister and her children saw a ufo of the same size in the same place doing the same thing and no one on the highway noticed it at all. my sister was on a SIDE ROAD and she was stopped and got out and could have bounced a ball off the thing. military helicopters showed up and chased the thing around the area and then they took off north chasing the ufo. this was at low altitude and in clear daylight . nothing was in the news. A family friend who lived in the immediate area as a child said that at times in the night goblins would take her out of the window of her bedroom and they would dance in the moon light. she was serious about it. one could ask what they wanted so badly a the civic center. Picking up or dropping off someone?"],"Log Number":"US-01052008-0005","Weather Factors":"Unknown","Case Number":"8788","Viewing Distance":"20 Feet or Less","Object Features":"Dome, Patterned Surface, Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=38.11313,+-122.561803(8788)&iwloc=A&hl=en\"> mufon case (8788) map </A>"}