{"Object Flight Path":"Undisclosed","Summary":"I don't know if dreams count but I know that I could not think of these things because I am not a scientist. I will describe what I saw in my dream in the following block.","Region":"Texas","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","City":"San Antonio","divs":["Sighting DetailsJanuary 5th 2008 I awoke at 06:00a.m. because I had to be at my son's house at 07:00 to take his dogs to the vet. I remember feeling a little shaken about what I had just dreamed because I've never experienced it before. I dreamt that I was standing on the bottom of the ocean with 2 men who looked like normal human men. I could'nt figure out why I could still breath air normally as if I were on land. The men also breathed normally. I did'nt feel the water or any pressure surrounding my body and was somewhat afraid because I know that we all need scuba gear to go into the ocean. The man made me feel safe. He told me with his mind that we were 4700 ft below the ocean on the floor. It was dark except for the light that came from the immediate area where these men and myself were. The one man handed me an almost perfect circle that was light green with an indention in the center. It had a blue ring that hugged the circle or almost circle because it had a straight end to it. Picture the round weights used on a benchpress bar. The weight is round but sliced off on one end. He said to me \"This is argon. Take this to your scientist. It will provide energy to light cities for 1000 years. The use of argon for energy will save the planets resources\". I took the circle in my hands and began to go up but became afraid and let it go saying to the man, \"if I go up to fast I'll get the bends\". He said to me \"Don't be afraid, you will go to the surface slowly\". When I surfaced I was I say a city with alot of industrial buildings. I don't know how to decribe it because I felt displaced. The surface water was dark. I saw myself taking this object to a scientist who asked me \"Where did you get this\"? I woke up at that point. When I got to my sons house I asked him, \"What is argon\"? He said, \"that's a gas, why\"? I told him about my dream and that's what he dismissed it as, a dream. I'm not a scientist but my interest was peaked so I looked in the internet wanting to know what argon is and how it's used. This is why I'm writing to you because there is no way I could invent this. I'm 52 years old and this is the first time a dream has made me feel like there's hope for our planet. Thank you."],"Weather Factors":"Unknown","Tags":"City","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/8791.html.txt","/var/www/straped/mufon/org/8791.html"],"Date Submitted":"01/05/2008 12:00 UTC","Case Number":"8791","Date of the Event":"01/05/2008 12:00 UTC","Disposition":"Unknown","trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around January 5th 2008"],"Country":"United States","Log Number":"US-01062008-0002","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.433222,+-98.485048(8791)&iwloc=A&hl=en\"> mufon case (8791) map </A>","Object Shape":"Other","Latitude":"29.433222","Longitude":"-98.485048"}