{"divs":["Sighting Detailsi'm sorry but i can't remember exact date. butin summer of 1993 i came home from work around 9pm. a little while later approx. 10-11pm i went outside on back steps and smoked a cigarette. as i looked to the sky i noticed it was very starry night, more than normal due to city lights comming from downtown cincinnati. i looked to the northwest towards covington ky, southern downtown cincy. and this object very wide at about the 2 o'clock position in the sky, was slowly heading towards me. when i first spotted it i thought it was a giant glidder, but as it was moving closer, the size was huge! not just wing to wing, but also front to back. as the ufo nearly directly over me, little did i know this moment would haunt me the rest of my life. due to i've never told my family or friends about this night, and i'v got to relive this sighting without being able to talk to somebody who doesn't think i'm going nut's. ok so the object is directly over approx 750-1000 ft. above me moving no more than 30-40 mph.it made zero sounds! the object size was sorta arrowhead shaped and thin built roughly 300 ft. wide slightly smaller maybe 200-250 ft.long. thickness was approx.50 ft. thick.it has a white light on bottom of each wing, and 1 near front. light's were very dim. as i watched ojbect it continued to slowly cruise overhead until if finally went beyond horizen. my final thought's, if somebody had expierienced that same event or knows someone that does, please contact me"],"Tags":"City","Sighting Duration":"Undisclosed","Longitude":"-84.495776","Weather Factors":"None","City":"Newport","Date of the Event":"06/30/1993 11:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Log Number":"US-01062008-0003","Date Submitted":"06/30/1993 11:00 UTC","Case Number":"8792","Summary":"giant low flying arrowhead shape object summer of 93 near downtown cincinnati","Object Features":"Other","Source":"MUFON","trends":["There has been one other sighting in Newport","There were no other sightings in Newport on or around June 30th 1993"],"Latitude":"39.091449","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=39.091449,+-84.495776(8792)&iwloc=A&hl=en\"> mufon case (8792) map </A>","files":["/var/www/straped/mufon/html2text/8792.html.txt","/var/www/straped/mufon/org/8792.html"],"Country":"United States","Object Shape":"Boomerang, Chevron, Triangle","Disposition":"Unknown"}