{"Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Wings","divs":["Sighting DetailsBeen working in law enforcement field for 15 years. Currently employed as a Campus safety Officer for a prominent University and was walking a beat on the far north end of the campus. Near a scenic overlook you can look across the city and view the sky from the west(mountain range) and as far east as Brighton, Co. I'm currently a student pilot and aviation buff most of my life and pride myself in identifying aircraft. This airship was like nothing I had ever seen or could have ever imagined. It moved across the sky from west to northeast in a consistant, silent and extremely smooth flight path. I estimate its altitude at just below 7000 feet, and I know this because I checked the current ceiling after the event with a online Aviation weather site immediately after the sighting, and it showed a ceiling of 7031 ft. The object appeared to be be skimming just underneath the ceiling. Again this object was totally silent and displayed no evidence of lights or propulsion thrust what so ever. I estimated its size to be larger then a C-5A Galaxy at 7000 ft. Which is a extremely large Military aircraft. The skin of the aircraft was a high sheen chrome which reflected the ground lights of the city as it passed over lighted landmarks. I first noticed the object somewhere near Rocky flats goverment facility just south of Jeffco airport. It seemed to appear out of the haze very slowly I estimate around 70 knots and as it dropped below the reported ceiling it appeared to have a very distinct dark black wing shaped outline against the haze now just above it. As it cleared the coud cover it assumed the crystal clear reflection of the early morning lighted city terrain, and only the wing portion of the object displayed this reflective ability and the rest of the object appeared to be a flat black ,non-reflective similar to our current day stealth aircraft. The design and shape of this object was very aerodynamic with no defined edges and very sleek.It remained at this altitude and never changed course through the entire 10-15 minute observation and disappeared in the haze again I estimate somewhere over Brighton Colorado. A about a week later I had told my brother about the sighting and he advised me he had seen a object around the same time of morning only a week later traveling in the same direction ,silent and his description was very similar. The most consistant was the reflective ability of the wing portion of the object. I thought at first it was a stealth bomber but quickly found that not to be possible it was not like any aircraft I had ever seen before and flew and moved with silent motion. I found myself very curious after the sighting and found myself trying to justify what it was.I would be able to provide a drawing upon request"],"Object Flight Path":"Straight-line path","Longitude":"-105.084884","Case Number":"8794","map":"<A HREF = \"http://maps.google.com/maps?q=39.803864,+-105.084884(8794)&iwloc=A&hl=en\"> mufon case (8794) map </A>","Latitude":"39.803864","files":["/var/www/straped/mufon/html2text/8794.html.txt","/var/www/straped/mufon/more/8794_submitter_file1__UFOdrawing-01.jpg","/var/www/straped/mufon/more/8794_submitter_file2__UFOdrawing-02.jpg","/var/www/straped/mufon/org/8794.html"],"Log Number":"US-01062008-0005","Summary":"Hazzy overcast morning (7000 ft ceiling) abnormally calm, no sound, wing shaped object metalliac chrome and black moved across sky from southwest to northeast at approx.7000 ft.","trends":["There have been 28 other sightings in Arvada","There were no other sightings in Arvada on or around August 10th 2007","This sighting has never been favorited.",""],"Weather Factors":"Unknown","Region":"Colorado","City":"Arvada","Object Shape":"Other","Date Submitted":"08/10/2007 12:00 UTC","Date of the Event":"08/10/2007 12:00 UTC","Source":"MUFON"}