{"Region":"South Carolina","City":"Wahalla,","Log Number":"US-01072008-0004","Object Flight Path":"Straight-line path,Path with directional change","divs":["Sighting DetailsAfter breakfast with my wife, I left the house to start my car and allow it to warm up. As I was approaching my car lights in the sky caught my attention. At first I thought it may be a airplane, but something about the way its was moving did not seem normal. I was a aircraft mechanic in the airforce for 10 years, and have observed most all military and civilian aircraft in flight during all times of the day and night, but this object was moving slow and made a 90 degree right angle turn to the north, as it was moving westward away from me. Its horizontal pitch did not change as would a aircraft, during a banking motion with its wings. I then observed it make another 90 degree turn back in the westward direction , to again move directly away from me as i was facing west. I noticed that due to the trees, land grade west of my home I would not be able to observe it much longer, so I re-entered my home in hope that my wife would have a chance to observe it as well. I said to her as i walked in, honey come to the window, I looked out of a westward facing window of the house and could not observe it, my wife was now standing with me, I thought that the lights of the kitchen may be preventing us from observing it, so as she stood there looking , I took approximately 3 steps and turned off the light switch. I heard her say oh my god, and turned back to the window, but what she observed was already gone. She stated that what she saw was a small round ball of white light traveling at an amazing speed apearing from over our house heading westward, I asked her where did she last see it and she pointed directly in the direction of where i last observed the large oval shaped object earlier before re-entering my home. She said it did not appear to be a meteor, I did not see what she described, but it appears that the object she saw was not the same object i had observed. I do not know what we saw , She had no idea as well, but we both know that we have never before observed anything like this. When I arrived at work, this morning I asked some employees who live near me if they noticed anything, unusual while they were traveling to work and no one said they noted anything unusual."],"Case Number":"8802","Source":"MUFON","Viewing Distance":"21-100 Feet, 501 Feet - 1 Mile","Latitude":"34.815553","Date of the Event":"01/08/2008 04:45 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.815553,+-83.113627(8802)&iwloc=A&hl=en\"> mufon case (8802) map </A>","Date Submitted":"01/08/2008 04:45 UTC","Sighting Duration":"Undisclosed","Longitude":"-83.113627","Weather Factors":"None","Object Shape":"Oval, Sphere","Disposition":"Unknown","Object Features":"Unknown","trends":["There have been no other sightings in Wahalla,","This sighting has never been favorited."],"Tags":"City","files":["/var/www/straped/mufon/html2text/8802.html.txt","/var/www/straped/mufon/org/8802.html"],"Summary":"oval composure of different colored lights, yellowish to amber horizontally and surronded by white lights in a oval patter."}