{"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=48.946504,+-122.452107(8804)&iwloc=A&hl=en\"> mufon case (8804) map </A>","Source":"MUFON","Date of the Event":"11/30/1987 12:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Object Flight Path":"Other","Case Number":"8804","City":"Lynden","Region":"Washington","divs":["Sighting DetailsI was very young at the time about 8 or 9 years old. It was 1988 or 1989 and in the summer. I woke up at around 10 or 11 p.m. to a flash of light moving past my window every few seconds. My first thought was that it was a cars' headlights flashing past my window, but it kept repeating so I got out of bed to look. Outside my window, my neighbors house is about 25 or 30 feet away, I saw what at first I thought was a ball of fire much like a comet but with a very short tail. It was blue and reddish-orange at the same time and quite bright. It was about the size of a VW bug. There was no noticeable aircraft shape to it. I remember thinking it was beautiful and watched it for at least 20 minutes. The whole time I watched it just did the same thing, circled. I would guess it was 30 to 40 feet off the ground. It followed the same path, I would now say, exactly every time. The diameter of it's orbit was about 60 to 70 feet. I was absolutely silent. After I watched it for some time I decided to go wake up my parents. I woke them up and told them what I saw but they told me to go back to bed. I then woke up my two sisters whose room is next to mine and told them. We watched it from their window for a few minutes and they wanted to go back to sleep so i went back to my room. I watched it for a few minutes more in my room then I got sleepy so I went back to bed. I had pretty much forgotten about it until recently,(2007) on a family vacation, I asked my sisters if it really happened. They totally agreed it happened and described it exactly as I had without me saying anything descriptive. My parents don't remember me waking them up but in a strange twist they told me that the neighbor lady, whose house the object circled, told them that her husband was a high ranking military officer who disappeared in the(60's or 70's?) with no explanation from the government."],"trends":["There have been 2 other sightings in Lynden","There were no other sightings in Lynden on or around November 30th 1987"],"Disposition":"Unknown","Longitude":"-122.452107","Object Features":"Undisclosed","Summary":"Fireball like UFO circles neighbors house for about 2 hours","Weather Factors":"Unknown","Tags":"City","Log Number":"US-01072008-0006","Latitude":"48.946504","files":["/var/www/straped/mufon/html2text/8804.html.txt","/var/www/straped/mufon/org/8804.html"],"Date Submitted":"11/30/1987 12:00 UTC","Object Shape":"Fireball, Sphere"}