{"files":["/var/www/straped/mufon/html2text/8805.html.txt","/var/www/straped/mufon/org/8805.html"],"Country":"United States","City":"Titusville","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around January 8th 2008"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=28.617719,+-80.804674(8805)&iwloc=A&hl=en\"> mufon case (8805) map </A>","Region":"Florida","Latitude":"28.617719","Object Flight Path":"Straight-line path","Longitude":"-80.804674","Object Shape":"Boomerang, Disc","Log Number":"US-01082008-0001","Sighting Duration":"Undisclosed","Source":"MUFON","Object Features":"Unknown","Case Number":"8805","Summary":"UFO Traveled NorthWest across the Indian River","Viewing Distance":"Unknown","Date of the Event":"01/08/2008 06:45 UTC","Tags":"City","Weather Factors":"Light","Date Submitted":"01/08/2008 06:45 UTC","divs":["Sighting DetailsI had just dropped my roomate off at work, turned left (going west) onto Garden St in Titusville. It was approximately 6:45AM. The sun was just rising. Skies were clear over the Ocean, the Rivers, The Cape, and The Wildlife Refuge. Skies over Titusville were dark and heavy. In the clear part of the sky I noticed a black object which at first I thought was a Pelican or some local bird, suddenly I noticed the craft moving very fast, maintaining altitude (?, I'm not even gonna take a guess) going straight across the sky in a Northwest direction into the clouds. The only way I can describe the speed is to say \"It was moving about 4 or 5 times faster than an airliner appears to move in the sky. It was fast. It wasn't a bird! The Craft flew Northwest from the clear skies, into the dark clouds over Titusville. That was it. It was very quick, and if I hadn't been telling myself to look up more often I would have missed it. Living here at the Space Coast I watch every launch, Shuttles and Rockets, from my front yard. I also witness air traffic from several airports including Cape Canaveral Air Force Base, Patrick Air Force Base, The NASA airstrips, Melbourne International, and depending on weather, sometimes OIA. IVe never seen anything like this. If anyone else saw this thing, feel free to contact me."]}