{"Weather Factors":"Does Not Apply","Source":"MUFON","Viewing Distance":"Over One Mile","Longitude":"-85.644744","Summary":"A redish, orange sphere that looked metallic with no blinking lights was dodging around some storm clouds east of Wayland. It zoomed off and disappeared.","Case Number":"8807","Date Submitted":"05/15/2007 08:15 UTC","Object Flight Path":"Path with directional change","Log Number":"US-01082008-0003","files":["/var/www/straped/mufon/html2text/8807.html.txt","/var/www/straped/mufon/org/8807.html"],"Region":"Michigan","Object Features":"None","Latitude":"42.673921","trends":["There has been one other sighting in Wayland","There were no other sightings in Wayland on or around May 15th 2007"],"Sighting Duration":"00:07:00","Country":"United States","City":"Wayland","map":"<A HREF = \"http://maps.google.com/maps?q=42.673921,+-85.644744(8807)&iwloc=A&hl=en\"> mufon case (8807) map </A>","Object Shape":"Sphere","Tags":"City","Disposition":"Unknown","Date of the Event":"05/15/2007 08:15 UTC","divs":["Sighting DetailsI was riding on Patterson Road with my mom in her car. We were coming back from shopping and we were almost to our house. We were listening to the radio and I was sitting in the passenger's seat looking out the window. The sun was setting in the west, and there were storm clouds to the east. I was watching the beautiful clouds when I noticed that on the corner of the highest cloud there was a round object just sitting there. I had no idea what it was, so I watched it for a while more. The clouds kept shifting and growing larger. The object darted around inside the clouds and around the clouds, as though it was trying to hide inside the clouds. It looked orange and red, and looked metallic. It didn't have any lights on it. I told my mom to turn off the radio and look out the window at the sky. She spotted the object too and slowed down the car, but we didn't get out. It was very high up and didn't attempt to come any farther down, it just kept darting around. One second it would be on one side of the storm system, and then it would dart and disappear. Then, it would reappear on the other side of the storm system. My mom and I watched until the ball zoomed off into a cloud and didn't reappear. It was very weird and we were shaken when we got home. Odd."]}