{"Source":"MUFON","Summary":"9 Objects hovering in the sky and speeding off with incredible speed","divs":["sighting detailsi 'd like to start off by saying i'm very disapointed with mufon and george knapp the famous ufo investigator. i reported the following on 12\\13\\07 and have yet to hear anything on was i believe was the most incredible sighting i've ever heard. to think it happened to me boggles my mind. here we go again. i was leaving for an appointment when the sound of an aircraft caught my attention. i looked up at the aircraft and as i saw the aircraft it was headed west but had already started to make a turn north behind the aircraft were four objects which i could only describe as balloons, they were gray in color and sphere shaped. in looking back at this event i recall around the the gray area was what appeared to be a very thin black circle and then a circle of incadescent light. the sun was behind me and i'm guessing the sun was reflecting off the objects. as the aircraft continued to make its turn they stopped which really made me believe they were balloons when from above my head way up high i saw 5 more objects same grey color with the black circle around it with a sunset color surrounding it. i assumed it was reflecting the sunset from 3 hours out further west. all of a sudden the first four objects broke off into two pair and shot off at high speed catching up to the aircraft which had made its full turn north and was at least two miles ahead of these objects. they were 100-200 feetoff the wingtips in less than two seconds.then the remaining five objects appeared to form a semi circle in the air and created a straight line next to each other and with incredible speed flew side by side to the rear of the aircraft forming a v formation.perhap a few hundred feet behind the aircraft. i believe this aircraft had taken off from nellis airforce base perhaps at 1:58 i saw the event at 2:04.i am a veteran and have seen many aircraft these objects had no noise,no vapor trails.no emissions. no wings .just grey circular sphere type objects .thanks for letting me report this again.after digesting what i saw this report is in mucher greater detail"],"Sighting Duration":"00:04:00","Log Number":"US-01092008-0002","Object Shape":"Sphere","Object Features":"Undisclosed","Region":"Nevada","Viewing Distance":"Over One Mile","City":"Las Vegas","trends":["There have been 229 other sightings in Las Vegas","There was one other sighting in Las Vegas on or around December 13th 2007","This sighting has never been favorited.",""],"Longitude":"-115.164546","Date Submitted":"12/13/2007 02:04 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8809.html.txt","/var/www/straped/mufon/more/8809_submitter_file1__HerlihySketch001.jpg","/var/www/straped/mufon/org/8809.html"],"Date of the Event":"12/13/2007 02:04 UTC","Case Number":"8809","Country":"United States","Tags":"City","Weather Factors":"Unknown","Object Flight Path":"Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=36.121286,+-115.164546(8809)&iwloc=A&hl=en\"> mufon case (8809) map </A>","Latitude":"36.121286"}