{"Country":"United States","Weather Factors":"Unknown","Longitude":"-93.996278","Summary":"Object glowing in and out of sight suddenly shoots laser or other ship out from its side which is then gone in a flash while glowing object keeps flying its path.","Date Submitted":"01/10/2008 08:30 UTC","Object Shape":"Unknown","Object Features":"Undisclosed","Tags":"City","Viewing Distance":"Unknown","Case Number":"8818","Date of the Event":"01/10/2008 08:30 UTC","trends":["There has been one other sighting in Logansport","There were no other sightings in Logansport on or around January 10th 2008"],"Region":"Louisiana","map":"<A HREF = \"http://maps.google.com/maps?q=31.980355,+-93.996278(8818)&iwloc=A&hl=en\"> mufon case (8818) map </A>","Object Flight Path":"Undisclosed","divs":["sighting detailsi was outside feeding my cat when i decided to look at the stars. i notice an object in the sky glowing in an out of sight flying a steady course south along the louisiana\\texas border. i ran in the house to get my husban because this was just to odd for me to see alone. he came running out of the house with me to see it. we watched for about 40 seconds when all of a sudden a laser or other ship shot out from its side and flew out like a shooting star and then vanished. the glowing object kept it's steady course and finally we could no longer see it. we stayed for a moment wondering if the shot out thing was a laser or a ship and if its a ship then is it hovering watching us without us watching it. don't know what it was but i am glad my hubby saw it too. it was freaky to see this long slender thing shoot out from it. it looked kinda like a shooting star but was 20 times faster and more contained particles is the best way i can describe it. i originially thought the craft was a plane but showed no charactoristics of any plane we have ever seen. i would be bright and then glow would fade out and then fade back in bright and so on."],"Sighting Duration":"00:06:00","Source":"MUFON","Log Number":"US-01102008-0008","files":["/var/www/straped/mufon/html2text/8818.html.txt","/var/www/straped/mufon/org/8818.html"],"Latitude":"31.980355","Disposition":"Unknown","City":"Logansport"}