{"Date Submitted":"04/30/1992 12:00 UTC","divs":["Sighting DetailsI was walking the dogs with two companions (who didn't see the event) during twilight on a warm May evening. As we walked west along the main road of a major subdivision, I watched the dogs and looked around. From the corner of my eye I saw a bright, white, shining thing up in the sky. Presuming it was just the moon, I looked directly up at it, then saw it was perfectly white, and a perfect half-circle. Imagine the moon when it's only half lit. It was already in motion when it caught my eye, and it was arcing upward, lightning-quick, from south up to west. And before I could open my mouth to announce it, it disappeared. I kept watch of that section of sky, trying to find it again, but it was gone. Unfortunately, both my companions had been engaged in conversation and so, missed what I saw. Sizewise, to the naked eye, it appeared about the same size as the full moon, except that this was a perfect half-circle, with the left half lit brightly and the right half empty. It was featureless, no details of any kind were seen in the quick burst that I saw it. Immediately, I deduced I must have just glanced very quickly at the moon and blurred it by looking away quickly. Wrong. I found it nowhere near where I saw the white half-circle, and it was just a faint, tiny sliver of a crescent moon. I was excited to see it; I just wish it hadn't disappeared so quickly. I would have liked to see its details."],"Tags":"City","City":"San Antonio","Country":"United States","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.425352,+-98.485568(8824)&iwloc=A&hl=en\"> mufon case (8824) map </A>","Object Shape":"Boomerang","Date of the Event":"04/30/1992 12:00 UTC","Sighting Duration":"Undisclosed","Disposition":"Unknown","Source":"MUFON","Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"White, shining Half-Circle arcing from S to W","files":["/var/www/straped/mufon/html2text/8824.html.txt","/var/www/straped/mufon/org/8824.html"],"Log Number":"US-01112008-0005","Latitude":"29.425352","Longitude":"-98.485568","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around April 30th 1992"],"Case Number":"8824","Object Flight Path":"Path with directional change","Region":"Texas"}