{"Viewing Distance":"Unknown","Sighting Duration":"00:04:00","divs":["Sighting DetailsExtremely slow from a distance away in a sorta straight line glowing then fading in and out of faze. Then kept emitting a odd colorization of very bright in the sky moving accross very slowww.... Only after aprox. 4 minutes it faded to an invisible look to it knowing its still there but in a instance glowed to a ultra bright light of some sort then poof GONE! Just like that completely gone it was a wonderfull experience if you asked me. A Pulsating light circular in nature. the direction is East of Pikes Peak Mountains in broad daylight. Point 1. At work patrolling the parking lots. Point 2. I have a bad habbit of always looking up always noticing weird and strange things in the sky ever since my first experience years ago never stopped looking up. Point 3. At first like anything else I always assume its a plane of some kind since its happening here in the Springs Area of Colorado naturally there would be alot of numbered jetliners. But thats not always the case especially this one. Point 4. Moving left to right in a very odd circular object moving at veryy slow movements accross the skies for only about 4 minutes then only fading into nothingness or at least out of the range of my visual abilities. Point 5. Very good feeling not threatened in anyway just a pleaseant feeling. :) Point 6. Simply disapeared right before my own eyes it gave off a 1 last ultra bright illuminating pulse and and POOF gone and kept looking for the object for another 15 minutes but I never did see this strange object again but i keep a close eye in the sky whenever i can."],"Country":"United States","Weather Factors":"None","Disposition":"Unknown","Object Features":"Unknown","City":"Colorado Springs","Region":"Colorado","Summary":"very small very very slow flashing","Tags":"City","Longitude":"-104.817563","Date of the Event":"01/12/2008 11:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.837502,+-104.817563(8830)&iwloc=A&hl=en\"> mufon case (8830) map </A>","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/8830.html.txt","/var/www/straped/mufon/org/8830.html"],"Log Number":"US-01122008-0003","Case Number":"8830","Latitude":"38.837502","Source":"MUFON","Object Shape":"Cylinder, Disc, Flash, Star-like, Unknown","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around January 12th 2008"],"Date Submitted":"01/12/2008 11:30 UTC"}