{"Log Number":"US-01132008-0001","files":["/var/www/straped/mufon/html2text/8832.html.txt","/var/www/straped/mufon/org/8832.html"],"Region":"New Mexico","map":"<A HREF = \"http://maps.google.com/maps?q=34.97905,+-105.030584(8832)&iwloc=A&hl=en\"> mufon case (8832) map </A>","Date Submitted":"01/12/2008 10:15 UTC","Country":"United States","Object Features":"Dome","Object Flight Path":"Hovering then path","divs":["Sighting DetailsI live in Southeast New Mexico. On my South-facing patio, looking into the night sky (which I've always done) I saw a two-colored flashing object. Field glasses revealed a disk with red light on top, with bars separating sections, seeming to revolve counter-clockwise. And a brilliant silver-blue base which gave a sense of movement (activity), in the same way lightning does, almost like a silver fire. It was tilted. After staying in the same area (due South of my house in SE NM), it went South and disappeared within about 15 seconds. I've seen others before, the first, about 4 to 5 months ago in the South West sky and, yesterday, also due South. The UFO in the South West sky was much closer; with the naked eye, I saw bright multi-colored lights. With field glasses, individual lights could be observed on the object. It was half-way between round and eliptical-shaped, more vertical than horizontal. When I noticed the first UFO, I wondered if it was a plane or satellite, but it remained stationary in the sky, peaking my curiosity. I felt excited and, at first, a bit anxious it wouldn't be something different than a plane or satallite. In the first instance and also this evening, I woke my sleeping husband and he joined me on the patio, observing the UFO, first with the naked eye and, next, with field glasses. Although many people have shared frightening experiences with extra-terrestrials, I feel comfort from seeing these UFO's. I've had a bit more \"up-close-and-personal\" and also difficult to describe experiences that are not easy and in fact quite excruciating to attempt explaining to others."],"Object Shape":"Disc, Oval","Date of the Event":"01/12/2008 10:15 UTC","Tags":"City","Summary":"UFO in SE NM","Weather Factors":"None","Latitude":"34.97905","City":"Undisclosed","Disposition":"Unknown","Viewing Distance":"Over One Mile","Longitude":"-105.030584","Source":"MUFON","Sighting Duration":"Undisclosed","trends":[],"Case Number":"8832"}