{"files":["/var/www/straped/mufon/html2text/8833.html.txt","/var/www/straped/mufon/org/8833.html"],"Object Shape":"Disc","Source":"MUFON","City":"Bremerton","Country":"United States","Viewing Distance":"Unknown","divs":["Sighting Detailsmy wife stopped at the store and left the kids inside the car. While she was inside my girls were looking up at the sky. something caught my 7 year olds eye, she told her older sister to look up and they saw the ufo. The ufo was not moving very fast. it stopped and stood still for a little bit, turned to a vertical position for 10 - 15 sec. did 3 loops slowed down and almost stopped, then it picked up speed and shot off, and disappeared. It left a vapor trail in its wake. When it stopped and turned vertical they were able to see some detail. It was disc shaped and the color was white. they were also able to see a clear dome like structure on the top of it. they thought it was a plane or rocket at first, until it stopped and turned. As soon as my wife got back to the car the girls told her they saw a ufo. This all happened in bremerton, washington around 230 pm saturday january 12, 2008. they say that they were scared and amazed at the same time. Then they were excited to explain what they saw. a little information about our location, they were approx. 20 miles away from Sub base bangor washington, and 5 miles away from PSNS shipyard, where there is 4 aircraft carriers docked."],"Sighting Duration":"00:05:00","Date of the Event":"01/12/2008 02:30 UTC","Tags":"City","Disposition":"Unknown","Log Number":"US-01132008-0002","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Date Submitted":"01/12/2008 02:30 UTC","Object Features":"Dome","Latitude":"47.57985","Region":"Washington","Longitude":"-122.64805","map":"<A HREF = \"http://maps.google.com/maps?q=47.57985,+-122.64805(8833)&iwloc=A&hl=en\"> mufon case (8833) map </A>","Weather Factors":"Unknown","Case Number":"8833","trends":["There have been 19 other sightings in Bremerton","There were no other sightings in Bremerton on or around January 12th 2008"],"Summary":"my kids saw a disc shaped ufo w/ a clear dome on the top while my wife ran into the store"}