{"Disposition":"Unknown","Case Number":"8834","City":"Ukiah","files":["/var/www/straped/mufon/html2text/8834.html.txt","/var/www/straped/mufon/org/8834.html"],"Longitude":"-123.204623","Region":"California","Object Flight Path":"Stationary,Path then hovering,Unknown","Summary":"My 4 yr old son and I were sleeping and a rap on the window awoke us","Country":"United States","Latitude":"39.158131","Date of the Event":"11/30/1964 12:00 UTC","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","Log Number":"US-01132008-0003","Object Shape":"Cigar, Disc, Unknown","Viewing Distance":"101-500 Feet, Unknown","Object Features":"Unknown","Date Submitted":"11/30/1964 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.158131,+-123.204623(8834)&iwloc=A&hl=en\"> mufon case (8834) map </A>","Source":"MUFON","trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around November 30th 1964"],"divs":["Sighting DetailsI was living at the time in Ukiah California in Mendocino county around 1965. My four year old son had crawled into my bed and sometime during the night there was a knocking on the window, which was directly behind the headboard of my bed. Both my son and I got upon our knees and I opened the shade. There was a being looking in at us. I could see only the head which came level with the bottom of the window. It was the typical large head and large eyes. But I've wondered all these years our reaction, we both imediately lay down and went to sleep. The next day in our back yard was a round brown area in the lawn. My lawn was very small and I couldn't imagine how anything could fit, the yard was 50' X 30'. I don't even know if it was connected to the sighting. The brown dried grass stayed for a very long time until we installed a pool on the spot. What happened to us? I've always wondered if that were the end of the experiance or more as over the years I've seen numerous sightings. The last being while I lived in Challis Idaho. Around 2004 my 23 year old grandson, with his male friend, late at night were sitting out on the back patio. My home at that time was in a canyon next to the Salmon river. A huge round object passed overhead, covering almost the entire sky. He said it took around 20 minutes for it to move across the canyon and out of sight behind the mountain as it was moving so slowly. His girl friend also saw it as she was driving home from work. The next night I awoke and notice in the sky this object hovering over the mountain across the river. There was also a smaller object just below the larger one. I watched them for several minutes and fell asleep. I awoke numerous times during the night and they was still in the same place. When morning arrived they were gone. There are other instances of family members and myself having sightings. My brother in law, who at the time was a Mendocino county deputy sheriff, while out on patrol late one night saw a large cigar shaped object hovering over Lake Mendocino, a large pipe or beam came out of the bottom of the craft down into the lake. He assumed it was taking water from the lake. He then chased it on hwy 20 and then into PotterValley where he lost it."]}