{"Weather Factors":"Unknown","Tags":"City","Log Number":"CA-01132008-0005","trends":["There have been no other sightings in Ottawa - South Keys Distr","This sighting has never been favorited."],"Viewing Distance":"101-500 Feet","Summary":"Lights, did not have my glasses, friends report green light(s) also.","Date Submitted":"01/12/2008 12:00 UTC","Date of the Event":"01/12/2008 12:00 UTC","divs":["Sighting DetailsJanuary 12th 2008, aprox 11pm, Ottawa, South Keys neighborhood, Bank street, near airport. These were the exact same lights as seen on december 23rd 2007, in the exact same place, over my house. Lights never disperse, solid object that cannot be seen at night, but has lights on it. object flying very low at about 9 to 15 stories of an apartment building. This time I viewed the flying thing from about 2 football fields east. Object moving north slowly at approx 40 miles an hour, wich is already too slow for an airplane to stay in flight, and then stops, then hovers backwards and forwards then stops (going north, stops , goes south, then north, then stops). Object then hovers in place, or possibly heads west-north-west(wich means norht-west, but more west then north) wich would be directly away from us wich may be what happened. At the time we concluded that it was not a helicopter, shape of lights aswell as the absense of a helicopters noise wich would be heard from our distance, and that it was an airplane that turns over my house. but today day I've concluded, that no airplane could be going at 40 miles an hour that low, stop, and hover back and forth within 6 seconds. Even if it was an airplane that was turning around in a circle, or doing a zigzag, no airplane could turn that sharp, going that slow, at that altitude, without staling. and it wouldnt be doing it at 9 stories or 100-300 feet. For an airplane to do what i saw is either extremely dangerous or impossible, MOST likely impossible. I did not have my glasses to see the lights in detail but the 4 others with me all saw it, and were all confused by it. One of them made a theory, wich i think is whats going on, that it is an advanced secret UFO, whatever it is, probably not extra terrestrial, flying around with airplane lights, to give the impression of an airplane. The most confusing part is that it has gone by that exact same path twice in the past 2 months. And I WILL be updating you on any further sightings of it."],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Region":"Ontario","Sighting Duration":"00:10:00","City":"Ottawa - South Keys Distr","Object Shape":"Unknown","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/8836.html.txt","/var/www/straped/mufon/org/8836.html"],"Latitude":"51.259685","Case Number":"8836","Longitude":"-85.321954","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.259685,+-85.321954(8836)&iwloc=A&hl=en\"> mufon case (8836) map </A>","Country":"Canada"}