{"Object Flight Path":"Path with directional change","Object Features":"Unknown","Tags":"City","Longitude":"-120.987188","map":"<A HREF = \"http://maps.google.com/maps?q=37.648927,+-120.987188(8842)&iwloc=A&hl=en\"> mufon case (8842) map </A>","City":"Modesto","Latitude":"37.648927","Source":"MUFON","Log Number":"US-01142008-0005","Weather Factors":"None","Disposition":"IFO","Country":"United States","Object Shape":"Triangle","divs":["Sighting DetailsIt was a clear summer evening. My boyfriend and I were laying on our backs on a blanket in the backyard just talking and looking up at the stars when something in the sky caught our vision coming from the south heading north. We both seen it at the same time. He sat up not taking his eye's off this object. I kept my sight on it but turned around onto my knees. We both were silent. The night was silent. This \"thing\" was shaped like a stealth which would be shaped like a triangle I suppose, and it was (here's the tricky part) invisible. The only way I can discribe it is by saying if you had ever seen the movie the Fantastic Four and the girl in the movie how she can turn invisible but you can still see her because the outline of her is wavy well that's what this was. You could see the stars straight through it but you knew there was something there because of the distortion around it that made up the shape. Well as I said it came in from the south and was heading north when all of a sudden it banked to the west and it was gone. When we could no longer see it I hurried into the house and started crying because it had scared me so bad. I was afraid to go back outside. We both were shocked on what we seen and both startled on what it was. I now am always looking up at the sky in hopes that I will see this again because it has drove me crazy not knowing what it was. I wish I could tell you how high it was only to say that it wasn't as high as a plane would fly but not as low as just over the tree tops. I haven't told to many people about this for fear they would not understand, and I just heard about this site is why I am now just writing about it. I do hope you can maybe tell me what this may have been. Thank you."],"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date of the Event":"07/31/2005 10:30 UTC","Case Number":"8842","trends":["There have been 48 other sightings in Modesto","There were no other sightings in Modesto on or around July 31st 2005"],"Summary":"More of a shape of a stealth bomber, but see through.","files":["/var/www/straped/mufon/html2text/8842.html.txt","/var/www/straped/mufon/org/8842.html"],"Date Submitted":"07/31/2005 10:30 UTC","Region":"California"}