{"divs":["Sighting DetailsI was about 15 or so when I was outside playing basketball by myself. It was right before dusk. I had this odd feeling like i was being watched. It was strong it wouldn't go away. So I kept looking around. Then I saw these human shaped things in silver suits. But I knew right away they weren't human because they could be there one second and then on the other corner of the house the next. Humans can't move like that. It was like they transferred themselves. I was scared, but it was weird, i was not scared of them. Normally I would be a chicken, because i am a scaredy cat. But I wasn't scared of them. I was scared of what or who they were, not knowing. Its hard to explain. I went in the house and was a little freaked out at the unknown so I deadbolted the front door and locked it. It was still pretty light outside. Then I went upstairs and my family (mom dad brothers and sisters) were watching t.v. I said nothing, because I felt stupid and like nobody would believe me, but I did go to the patio door also and locked it and put the dead bolt on it. Then I went to take a shower. As I was in the shower there came this loud noise and the house started to shake. I got really scared and hurried out of the shower and got dressed and ran into the living room. My dad was the only one still there. I said where is everyone and he said they were outside watching a UFO that had just come out of our pasture and went into the sky. I went running outside and by then all i saw was the speck. They said that was what made the noise and that it came out of the woods and shot to the sky. I told my mom what happened to me, and the reason she believed me is because when they went to run outside, the door was deadbolted. She knew I was telling the truth. The wierd thing is, we never talked about it, EVER, its like it was forgotten. Two weeks later it came back when my mom and dad were home alone. The same noise, the house started to shake (we were on a cliff with the creek below) and all the electricity went out and a light was shown down on our big back porch which overlooked the creek. They thought it had to be the same thing. Anyways we never talked about it again. Until about 20 years later. My mon actually said something to someone and I was like, my god mom you remember that. Why did we neveer talk about it, that was odd. Its hard to explain."],"Tags":"City","Viewing Distance":"101-500 Feet","Latitude":"45.686944","Case Number":"8843","Summary":"Seen beings first, went inside, house shook, family seen UFO come out of our pasture","Date Submitted":"09/07/1979 06:00 UTC","Object Flight Path":"Other","Object Shape":"Other","Log Number":"US-01142008-0006","Weather Factors":"Does Not Apply","Longitude":"-92.964167","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8843.html.txt","/var/www/straped/mufon/org/8843.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=45.686944,+-92.964167(8843)&iwloc=A&hl=en\"> mufon case (8843) map </A>","Date of the Event":"09/07/1979 06:00 UTC","City":"Rush City","Region":"Minnesota","Object Features":"Unknown","trends":["There have been no other sightings in Rush City","This sighting has never been favorited."],"Source":"MUFON","Sighting Duration":"Undisclosed"}