{"Summary":"Fire orange Orbs, triangular formations...","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=47.198402,+-88.400509(8850)&iwloc=A&hl=en\"> mufon case (8850) map </A>","files":["/var/www/straped/mufon/html2text/8850.html.txt","/var/www/straped/mufon/more/8850_submitter_file1__OrangeOrbs.jpg","/var/www/straped/mufon/more/8850_submitter_file2__UFOformation.jpg","/var/www/straped/mufon/more/8850_submitter_file3__Moonlights.jpg","/var/www/straped/mufon/org/8850.html"],"Weather Factors":"Unknown","Case Number":"8850","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Region":"Michigan","Date of the Event":"06/14/1992 12:00 UTC","Latitude":"47.198402","Viewing Distance":"Unknown","Longitude":"-88.400509","Log Number":"US-01142008-0013","Sighting Duration":"Undisclosed","Disposition":"Unknown","divs":["Sighting DetailsMy experiences took place in Upper Michigan between the years, 1991 to 1995 time frame. I do not know exact times and dates. The locations were: Green, Michigan near Lake Superior and one sighting in the Keweenaw near Lake Linden. As a teenager I frequently would go outside and explore the night sky with my Meade telescope. Sometimes, I would just get a gut feeling to go outside and I'd automatically look up at the night sky. I would get a butterfly feeling in my stomach sometimes. Most of the time I never noticed or seen anything unsual. I was walking outside one quiet, very dark night in Green, Michigan(the type of night where all light seems to get absorbed like being in a black hole). I was behind my house and just happened to look straight up and seen two 'orbs' that looked like our sun only very far away(eyes looking down at me). They were perfectly still and hovering at a very high altitude(possibly in space). I could have dismissed one alone as being Mars easily. I stared for a couple minutes and my eyes felt like they were burning a little bit(odd). All of a sudden one of them instantaneous accelerated(like a brake let go). Then a few seconds later the second one did the same thing and followed in a parallel line lagging behind. The motion was instantaneous, smoooth, uniform and and like the speed of a satelite flying over Earth. I watched both of them fade and disappear into the atmospheric distance. I had a second account in 1995 when I was outside walking on the road shortly after the sun went down. I looked over the tree line above my house and seen a fiery colored orb similiar to what I seen a couple years before, but much brighter and lower(1,500ft?) looking this time. The Orb went in a perfect arc circle from behind the treeline, over it and then behind within a couple minutes time. In 1993, I was with two friends in the Lake Linden, Upper Michigan area with a telescope. All of a sudden I seen what looked like a classical UFO triangular, star formation. I couldn't believe what I was seeing and thought am I seeing ground lights? I looked hard at it and said, no way that looks bright, solid and three dimensional. I called attention to it nearly immediately to my friends cousins. We both jumped up and down proclaiming it was a UFO formation and told my friend to get his dad to witness it. His was not excited, did not come out to look and later proclaimed it was just a star constellation! I was in disbelief saying, NO, a star formation does not move across the entire sky within 5 minutes! In 1994 I was observing the moon when I seen a light 'come on' as I later called it. I thought it was just a jet that turn on the lights until I quickly realized it wasn't moving. Then within a few more second another light comes on then another until six total white lights(brightness and size of jupiter) strung down from the moon in a parabola(they were perfectly still). Then within a minute or two they all began to go off in the reverse sequence. The night sky was black and very clear, I did not see anything else. I remain skeptical to what I have seen to this day. I have served six honorable years in the USAF to including working around the F-117a stealth fight. I would love to see these things again as an adult!"],"Object Shape":"Fireball, Sphere, Star-like","Country":"United States","City":"Lake Linden","Date Submitted":"06/14/1992 12:00 UTC","Source":"MUFON","trends":["There have been 2 other sightings in Lake Linden","There were no other sightings in Lake Linden on or around June 14th 1992","This sighting has never been favorited.",""]}