{"Object Features":"Unknown","Date Submitted":"09/30/1992 09:30 UTC","Disposition":"Unknown","Summary":"Could not see the shape of the craft. There was NO sound but an awesome light display hovering about a tree","Sighting Duration":"Undisclosed","Weather Factors":"None","Date of the Event":"09/30/1992 09:30 UTC","City":"Stephenville","map":"<A HREF = \"http://maps.google.com/maps?q=32.223266,+-98.197103(8851)&iwloc=A&hl=en\"> mufon case (8851) map </A>","Viewing Distance":"21-100 Feet","Region":"Texas","divs":["Sighting DetailsIt was the fall of 1992. I had been staying with my sister and then brother in law as I was trying to go to school. My parents had moved to Big Lake and I couldn't go because I was in college. My sister and brother in law lived approximately 14 miles outside of a small Texas town called Gorman. You had to travel down a lot of long, secluded dirt roads just to find their house! There were a lot of fields around as it was a farming community. My sister and brother in law had been telling me for a few years that they would see UFO's out there all the time. I thought they were just pulling my leg. So, one night I was sitting at the dining room table doing homework and my brother in law was outside working on the car while my sister was in the house folding laundry in her bedroom. I heard my brother in law holler something at my sister, but I couldnt' tell what it was. Then my sister hollers at me, \"Cheryl, UFO!\" I thought, \"yeah, right!\" So, I get up, walk out onto the front porch and see my brother in law looking up at the sky. I walked down off the porch onto the grass and looked up at what he was looking up at. The sky was pitch black, no stars were out at all. I looked up to see something above the tree that scared the daylights out of me! I could not make out a shape to it at all, it seemed to blend in to the dark night. But it put on the most awesome light display I have ever seen! Several lights lit up in some sort of sequence. The far left light first, the middle light second, then the far right light light up. As soon as they went out, all of these lights just started flashing all over the craft! It was almost like watching a sign on the strip in Vegas, how they have all of these bulbs that light up in sequence and make designs and patterns. That's what this seemed to do. Whatever this was was close, hovering just above the tree some 30 feet off the ground. I just couldn't stop staring at it! I really wasn't scared at all, just perplexed by what I was seeing. It was amazing! There was absolutely NO SOUND whatsoever! After the lights flashed for a few minutes, probably more like a few seconds, it was gone, disappearing into the night as quickly and as quietly as it appeared. I just stood there in awe of what I had just seen. I knew I wasn't crazy because my brother in law was standing there watching it too. But from that night on, I would see orange lights in the sky flying around in patterns that airplanes could not make. There was never any sound to any of them. I would watch them hover over fields and then slowly lower themselves to the ground until I would lose sight of it. I would watch them fly in the sky and make a sharp 90 degree turn to head in another direction. Two of these orange lights followed me home from work one night. I hit the turn-off to begin the drive down the long and winding dirt roads that led to our house. Every turn I made, they made with me. I was so scared that I drove as fast as I could to get home. I finally pulled into our driveway and jumped out of the car to run inside. At that time, these orange lights passed right over the house, beside each other, one slightly ahead of the other, and again there was no sound. Helicopters and airplanes you can hear as they pass overhead, especially when they are as low to the ground as these objects were. But there was nothing. To this day I am convinced of what I saw. I am convinced they were all UFO's. I'm willing to bet that they can still be seen out there. But I will never, ever forget that awesome light display of that UFO hovering 30 above my house that night in October 1992."],"Country":"United States","Case Number":"8851","Source":"MUFON","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/8851.html.txt","/var/www/straped/mufon/org/8851.html"],"Log Number":"US-01142008-0014","Object Shape":"Unknown","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around September 30th 1992"],"Latitude":"32.223266","Tags":"City","Longitude":"-98.197103"}