{"Source":"MUFON","Disposition":"Unknown","Summary":"Object shot through cloud causing it to implode","Country":"United States","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=29.585736,+-95.132783(8852)&iwloc=A&hl=en\"> mufon case (8852) map </A>","files":["/var/www/straped/mufon/html2text/8852.html.txt","/var/www/straped/mufon/org/8852.html"],"divs":["Sighting DetailsHeaded east on Bay Area Blvd. west of I45. came to stop light. weather was partly cloudy and breezy. noticed clouds moving rapidly across sky. looked up and notice what i thought was a small cloud that was not moving. struck me as unusual. watched it for a minute or so. looked at the clock on the dash of truck and looked back up. noticed object was gone but the cloud that was apparantly above it was imploded and spiked up into the atmosphere. the spike could have been thousands of feet in elevation. after noticing the cloud also noticed the location that the object could have been over was Ellington Airforce base which is east of I45 towards the direction i was headed. After noticing the cloud considered the velocity it would take to cause a cloud to create such a form. Airliners travel at 400+mph and don't even phase a cloud. fighter jets move at several 1000 mph and don't change cloud forms when they pass through them. the object could have been moving a 10's of 1000's of mph or more. really unbelievable sight. i've told several people but for the most part kept the sighting to myself."],"Weather Factors":"Unknown","City":"Houston","Tags":"City","Case Number":"8852","Date of the Event":"07/14/2001 03:30 UTC","Object Shape":"Unknown","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around July 14th 2001"],"Longitude":"-95.132783","Sighting Duration":"00:04:00","Date Submitted":"07/14/2001 03:30 UTC","Viewing Distance":"Unknown","Region":"Texas","Object Features":"Unknown","Latitude":"29.585736","Log Number":"US-01142008-0015"}