{"Source":"MUFON","Date Submitted":"02/28/1998 06:00 UTC","Disposition":"Unknown","Summary":"TOS SEPERATE BRIGHT LIGHTS LIKE A MIRROR FLASHING IN THE SUNLIGHT","Weather Factors":"Unknown","trends":["There have been 27 other sightings in West Palm Beach","There were no other sightings in West Palm Beach on or around February 28th 1998"],"City":"West Palm Beach","Log Number":"US-01142008-0016","Object Shape":"Other","Object Features":"Unknown","Object Flight Path":"Stationary,Path with directional change,Path then hovering","divs":["Sighting DetailsWEST PALM BEACH, FLORIDA 1998 I WAS ON MY BACK PATIO BEFORE DUSK AS MY CHILDREN WERE PLAYING IN THE BACK YARD AND MY NEW BABY WAS ON THE PATIO WITH ME, THIS SIGHTING WAS IN MARCH OR APRIL OF 1998. THIS AMAZING BRIGHT LIGHT LIKE A MIRROR IN THE SUN SHOWED UP IN THE SKY GOING FASTER THAN IMAGINABLE AND STOPPED AND STAYED STILL, I WENT INSIDE AND GOT MY HUSBAND TO LOOK AT IT AND ANOTHER LIGHT WAS COMMING TO IT, THEY BOTH STAYED SILL FOR ABOUT 30 SEC TO ONE MINUTE. INITALY THE FIRST LIGHT WAS OVER THE ATLANTIC OCEAN AND MOVING TOWARD LAND IN WEST PALM BEACH. FL.(MOVING FROM 12 TO 6 OCLOCK), SO IT WAS MOVING IN A STRIGHT LINE TOWARD OUR DIRECTION THEN STOPPED IN MID AIR AND DID NOT MOVE. THE OTHER LIGHT CAME FROM THE RIGHT MOVING LEFT TOWARDS THE LIGHT OBJECT(MOVING FROM 3 TO 9 OCLOCK). BOTH WERE VERY CLOSE AND JUST STAYED THERE. THEN ALL OF A SUDDEN THEY BOTH ZIPPED OFF GOING TOWARDS A 2 OCLOCK EXIT. THE FIRST OBJECT MOVED IN A CHECK MOVEMENT, THE SECOND FORTH AND BACK. WHEN THESE TWO LIGHTS TOOK OFF TOGETHER THEY WENT SO FAST AS TO LITTERELY DISSAPEAR INTO NOTHING FAIRLY QUICKLEY LIKE THEY WENT OUTSIDE OF OUR ATMOSPHERE. NO TRAILING ACROSS THE SKY UNTIL THEY FADED FROM VIEW. THESE OBJECTS MOVED FASTER THAN ANYTHING WE HAVE EVER SEEN AND LEFT US STANDING THERE WITH OUR MOUTH AGAPE. THREE THINGS 1. THEY MOVED FASTER THAN ANYTHING WE HAVE EVER SEEN 2. THEY JUST STOPPED IN THE SKY AND WENT NOWHERE 3. THESE OBJECT WERE HEADING IN ONE DIRECTION AND JUST HEADED IN A TOTALLY DIFFERENT DIRECTION, NO EVENTUAL TURN IN THE SKY JUST POOF OFF IN A DIFFERENT DIRECTION. WE HAD NO DOUBT WE HAD SEEN UFO'S. SO NOW THE FUN BEGINS! ON THE 10 OCLOCK NEWS THERE WAS FOOTAGE OF UFO'S OVER THE WEST COAST DIRECTLY ACROSS THE STATE FROM US, MAYBE AROUND FORT MEYERS OVER THE OCEAN. THESE WERE THE SAME TYPE OBJECTS WE SAW HERE ON THE EAST COAST AT THE SAME TIME. THE TV STATION MENTIONED MUFON TO FIND OUT MORE INFO ON UFOS SO I WENT ON AND FOLLOWED THE STORYS FOR QUITE SOME TIME. OTHERS HAD REPORTED THEIR SIGTEING ON THE WEST COAST. THERE WAS ALSO SOMEONE REPUTABLE WHO SAW THE SAME THING OVER OKEECHOBEE LAKE IN THE MIDDLE OF THE STATE AT THE SAME TIME AS THE OTHER TWO SITEINGS. SO TO SUM IT UP THERE WERE IDENTICAL SIGTEINGS AT ABOUT THE SAME TIME ALL THE WAY ACROSS THE STATE OVER WATER! I WOULD LOVE TO SEE THAT FOOTAGE AGEAN. YOU CANT IMMIGANE HOW WE FELT TO SEE SOMEONE HAD CAPTURED ON FILM THE EXACT SAME THING WE HAD EXPERENCED HERE ACROSS THE STATE AT THE SAME TIME. IT MENT WE WERE NOT NUTS. MUFON IF YOU GO BACK THROUGH YOU FILES FOR THAT TIME YOU WILL FIND WHAT I AM REFERING TO. BEST WISHES TO ALL OF YOU WHO CANT EXPLAINE WHAT YOU SAW."],"Longitude":"-80.048535","Region":"Florida","files":["/var/www/straped/mufon/html2text/8853.html.txt","/var/www/straped/mufon/org/8853.html"],"Case Number":"8853","Sighting Duration":"00:01:30","map":"<A HREF = \"http://maps.google.com/maps?q=26.724792,+-80.048535(8853)&iwloc=A&hl=en\"> mufon case (8853) map </A>","Tags":"City","Date of the Event":"02/28/1998 06:00 UTC","Latitude":"26.724792","Country":"United States","Viewing Distance":"Unknown"}