{"Tags":"City","Disposition":"Unknown","divs":["Sighting DetailsMy cousin and I were walking in my uncle's hay field in Colvile, WA. He was walking about 5-10 feet in front of me. Out of no where I saw a ring of light on the ground around him flash three times. I told him about it, he didn't see it. He told me to not joke about something about that. I told I swear I saw it and wasn't messing around. Again he said don't joke about that. And again I told him I saw it. We got scared and decided to go back to the tent we were sleeping in. We talked for about thirty minutes and then decided to call it a night. I went to close up the tent (flap) door. As I was doing so, I was looking outside. Above the tree line, I saw an oval ball of light appear out t of the blue, fly horizontal for about three seconds and then completely disappear as fast as it appeared. I closed up the flap and told my cousin what I just saw, and we both were freaked out and tried to sleep as fast as possible. Nobody believes me when I tell this story since it was on the 4th of July, but I swear on anything that it happened, no firework could have caused this. I just read a story about a bunch of Texas residents recently saw UFO sightings, didn't know a site like this existed. And thought, even with this happening so long ago, had to at least share my story. I have another I will submit as well."],"Sighting Duration":"00:00:10","Latitude":"48.544997","Source":"MUFON","Longitude":"-117.900954","Summary":"Circluar flash of light (ring) on ground Oval light, sky","Date of the Event":"07/04/2006 12:00 UTC","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=48.544997,+-117.900954(8863)&iwloc=A&hl=en\"> mufon case (8863) map </A>","Object Flight Path":"Straight-line path","Object Features":"Unknown","Country":"United States","Date Submitted":"07/04/2006 12:00 UTC","trends":["There have been no other sightings in Colville","This sighting has never been favorited."],"City":"Colville","files":["/var/www/straped/mufon/html2text/8863.html.txt","/var/www/straped/mufon/org/8863.html"],"Case Number":"8863","Object Shape":"Circle, Flash, Oval","Log Number":"US-01152008-0008","Region":"Washington","Weather Factors":"None"}