{"Disposition":"Unknown","Date of the Event":"01/10/2008 09:45 UTC","City":"Clairton","Sighting Duration":"00:03:00","Summary":"Triangular shaped object in sky with multi-colored lights that would fade in and out - not like that of an airplane. Traveling north and low.","Latitude":"40.292292","files":["/var/www/straped/mufon/html2text/8868.html.txt","/var/www/straped/mufon/org/8868.html"],"Longitude":"-79.881715","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.292292,+-79.881715(8868)&iwloc=A&hl=en\"> mufon case (8868) map </A>","trends":["There has been one other sighting in Clairton","There were no other sightings in Clairton on or around January 10th 2008"],"Date Submitted":"01/10/2008 09:45 UTC","Object Shape":"Triangle","Case Number":"8868","Country":"United States","Log Number":"US-01152008-0013","Source":"MUFON","Weather Factors":"Windy, Fog, Rain, Light","divs":["sighting detailsmy husband and i were traveling in a vehicle south along route 837 in allegheny county, just passed the clairton steel mill works. we were talking about the terrible rain coming down and i noticed then by looking upwards and south that a huge triangular object was traveling north steadily. at first, i thought, oh - it must be an airplane. but, as it approached and got closer, we both realized that there is no plane that we have ever seen with lights like this one. the body of the object appeared to be almost beveled. i don't know how else to describe it. as much as the rain was coming down, the lights on this object were bright and very attractive. the colors we noted were red and white and some green (very little). the white lights were the most interesting as they seemed to pulsate. while the red lights were constant and the green made circular movements. it move steadily (slowly moving\\hovering) in the sky above us and we actually had come to almost a stop in the road to watch it go above us and out of our sight. we lost track of it when it passed over a hillside that obscured our sight. we still have not been able to find an airplane online by using search engines that match this object. we were not frightened by this object, but more inquisitive to what it truly was. to be honest, this was not our first time seeing such objects. infact we've both been able to account for different sightings of different shaped\\colored objects in our lifetime. but, this was one we both saw together and there is no question that we were both sane,sober and healthy at the time."],"Object Flight Path":"Hovering then path,Straight-line path","Region":"Pennsylvania","Object Features":"Other"}