{"Date Submitted":"12/11/2007 06:05 UTC","Region":"Florida","files":["/var/www/straped/mufon/html2text/8869.html.txt","/var/www/straped/mufon/org/8869.html"],"Date of the Event":"12/11/2007 06:05 UTC","Latitude":"26.645928","Viewing Distance":"Over One Mile","Object Features":"Undisclosed","trends":["There have been 41 other sightings in Fort Myers","There was one other sighting in Fort Myers on or around December 11th 2007"],"Object Flight Path":"Other","Tags":"City","Case Number":"8869","divs":["Sighting DetailsGot home from work at 6:30 p.m. When I got out of my vehicle, looking west, I looked at the house and seen something above the house in the sky. It looked just like a comet, but was moving quicker then a comet, but still moving very slow. (Comets appear to stand still to the naked eye)This thing was moving ever so slowly from west to east. When I first noticed it, it was at around the 11 o'clock position above my head. I ran into the house and got My wife, 2 daughters and 1 son. 2 different neighbors around us seen this thing in the sky and was trying to snap pictures of it. I have a 3.5\" reflecting telescope so I decided to pull it out and take a look at it. When I finally got it focused in my sites I could not believe what I was looking at. The \"core\" of the comet looking thing was actually some sort of craft, I could not make out shape, size or anything with the exception that it had a white light that flashed every 10.4 seconds and the craft also blocked out background light from stars. The light was not visible with just our eyes at all and was not very bright even in the telescope. I also has a couple of my kids and wife look at it to verify what I was seeing. At about 7:30p.m. the craft took a turn and appeared to slow down. It turned from west to east to a more south to north movement, but much slower. Possibly moving away from me? The craft was surrounded by a mist with this mist stretching away from it further on one side then the other, and it wasn't longer behind it, as if a contrail, it was beside it relative to its direction of movement. A couple hours later it was just about out of eye view and getting harder to track with the telescope. The mist either disappeared altogether or just not being reflected as much in my direction. I have yet to find an explanation for this thing and that is really strange. I can usually explain pretty quick what things are in the sky, but not this thing. I have looked in all the normal directions for an explanation but come up empty."],"Longitude":"-81.870898","City":"Fort Myers","Disposition":"Unknown","Source":"MUFON","Weather Factors":"None","Log Number":"US-01152008-0014","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=26.645928,+-81.870898(8869)&iwloc=A&hl=en\"> mufon case (8869) map </A>","Summary":"Strange comet looking thing in the sky overhead"}