{"Date Submitted":"07/14/2004 02:30 UTC","Log Number":"US-01152008-0025","Latitude":"38.896565","Country":"United States","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/8880.html.txt","/var/www/straped/mufon/org/8880.html"],"Object Flight Path":"Stationary","Sighting Duration":"02:30:22","Viewing Distance":"Over One Mile","Case Number":"8880","Source":"MUFON","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=38.896565,+-121.07689(8880)&iwloc=A&hl=en\"> mufon case (8880) map </A>","City":"Auburn","Tags":"City","divs":["Sighting DetailsMy wife and I are of a quite normal people. I have a 135 IQ I was mostly straight A's in school even in college. I was not on any drugs or alcohol. I am very street wise as well. We were driving down a straight road hill across our town. We looked off in the distance about 25 miles and seen a huge and when I say huge it was beyond anything we have ever seen in the air. For as far away as it was it was so big that no man made object would appear that large at that distance if that makes sense to you. I asked my wife, \"What is that?\" She saw it too. She said, \" I don't know but its big!\" We were on our way to the auto parts store and the left turn was coming up. We looked left for what seemed like a second and looked back as the light was red. The object was gone. Im talking a flash. We did clearly see it and we didnt tell anyone given in to We didn't want to look like idiots. I saw where Sylvia Brown World reknown psychic on Montel say, \" We will be visited by aliens again and they will reveal how the Egyption Pyramids were built. I have watched Sylvia for ten years and she has clearly predicted many things right, as well as Chandra Levy's body 1 year before they found it exactly where they say it was going to be. Now Im sure someone of another interest might not believe in psychics but if you believe in UFO's you believe in them. I didn't want to say anything until I saw a report regarding a UFO sighting in Texas (2008) which makes me come forward because it sounded like the same thing I saw. The orb was oval shaped not disporportioned at all. It was silver and very much larger for the distance away and I do mean way larger. It was around 2:30 pm. The skys were very clear and bright.It was more football shaped.We said to each other that it was a UFO. I was totally shocked and dumbfounded like I was in a different world. My wife was in awe as well. The object didn't really move It was suspended in air for at least 4 seconds that we noticed. We turn away and turned back and it was gone. Nowhere in sight and we could see a section of sky 100 miles deep by 30 miles wide. I can guarentee this was NO AIRCRAFT. This object must have been 5 football field wide and 2 football fields tall. My wife and I were left wanting to see it more We wanted to know. We wondered if anyone else had seen it as there were cars behind us and in front of us but not many. I can not attach a photo as that was not our mission so No Carmera. I can draw it if someone actually comes talk to me but its a lot of trouble to try and do this on the computer as Im not much of a computer person. I hope someone comes asks us something or interviews us because we feel like we have unfinished business and its always in the back of our minds. Our beleifs were changed for ever on that day. I cant tell you how much I want to talk to others who have seen something the same as us. We need this to put and end to this."],"Longitude":"-121.07689","Object Shape":"Blimp, Bullet, Missile, Cigar, Egg, Saturn-like","trends":["There have been 7 other sightings in Auburn","There were no other sightings in Auburn on or around July 14th 2004"],"Summary":"There and gone in a micros second Larger than Physics demands","Date of the Event":"07/14/2004 02:30 UTC","Weather Factors":"Unknown","Object Features":"Other"}