{"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Object Features":"None","Region":"California","Date Submitted":"01/14/2008 12:00 UTC","Weather Factors":"Unknown","Date of the Event":"01/14/2008 12:00 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/8887.html.txt","/var/www/straped/mufon/org/8887.html"],"Object Shape":"Circle, Star-like","Latitude":"32.967743","trends":["There have been 7 other sightings in Poway","There were no other sightings in Poway on or around January 14th 2008"],"Tags":"City","Case Number":"8887","City":"Poway","Sighting Duration":"04:00:00","divs":["Sighting DetailsI went out for a smoke as I always do after dinner, when I looked up I saw an object in the night sky that seemed brighter than the stars around it, and began to watch it. It started to make sharp turns and would jump forward two to three times, then it would turn in a circle I then called my wife to show her and it kept on doing the same thing. We watch it together for at least ten minutes together as it kept on doing the same thing. I would go out every ten minutes to see where it was, and it kept on moving it that way toward the Western sky toward my house. I kept watching it over the next few hours checking on it every ten to fifteen minutes. When I looked out again at 11PM it was gone. During this time there was another bright object in the Southern sky that had bright pulsating lights that would or should I say seem to change size as its lights pulsed. Both objects disappeared when I went out to check on then at 11PM. Both my wife and I agreed that we are not alone, and I am certain that we do not have any kind of aircraft that can do what I say last night."],"Viewing Distance":"Unknown","Longitude":"-117.028755","Source":"MUFON","Summary":"Caught site of object in the Southestern sky","Log Number":"US-01152008-0032","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.967743,+-117.028755(8887)&iwloc=A&hl=en\"> mufon case (8887) map </A>"}