{"files":["/var/www/straped/mufon/html2text/8894.html.txt","/var/www/straped/mufon/org/8894.html"],"Source":"MUFON","Date of the Event":"10/16/1999 11:00 UTC","City":"Moab","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Summary":"Blue and green lights hovering above the sandstone cliffs.","Weather Factors":"Unknown","Region":"Utah","Longitude":"-109.54029","Country":"United States","trends":["There have been 13 other sightings in Moab","There were no other sightings in Moab on or around October 16th 1999"],"Case Number":"8894","Latitude":"38.578696","Log Number":"US-01152008-0037","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI had just spent some time on the Colorado river and got back in my truck to head back to town. As I was driving I turned a around a bend and in front of me about quarter mile above a high red cliff were these very big and bright blue and green lights. I thought at first people must be up there. Then I realized they were above the cliff and way too big for any humans to be setting up. The lights were too bright and not stationary for me to tell what was behind them. I got pretty excited and pulled my truck off the side of the road. I got out and watched. I stood there and the lights were kind of interweaving together but definately blue and green but not separate. I had a hard time with the perception to tell if it was right above the cliff or further away. If it was above the cliff then it would have been about 500 feet wide by 100 feet tall, the space the lights filled up. If it was further back it would have been massive. Then as I was watching about ten minutes after I first saw it, it just zoomed up and away from me and dissappeared in about 3 seconds. Completely gone . No sign of it. It looked like the lights just shrunk away into nothing. Well that's it .....I was amazed and bewildered and excited all at once and sorry that no one elsewas on the road and had seen it, that I know of. I just wandered onto your sight now and thought even though it was some years ago I would tell of it now. I told a few of my friends and they didn't know what to think , but I know what I saw and it was not rational flight as we know it or was it something you would see in the sky normally."],"Disposition":"Insufficient Data","Object Shape":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Object Features":"Unknown","Date Submitted":"10/16/1999 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.578696,+-109.54029(8894)&iwloc=A&hl=en\"> mufon case (8894) map </A>"}