{"Summary":"flash of lights high in sky over ski area , sphere shaped and fast.","Region":"Pennsylvania","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Unknown","Longitude":"-75.610187","Latitude":"40.801483","trends":["There have been 10 other sightings in Palmerton","There were no other sightings in Palmerton on or around November 15th 2007"],"Date of the Event":"11/15/2007 10:46 UTC","Log Number":"US-01152008-0040","Country":"United States","Tags":"City","Object Features":"Undisclosed","Sighting Duration":"00:01:22","map":"<A HREF = \"http://maps.google.com/maps?q=40.801483,+-75.610187(8897)&iwloc=A&hl=en\"> mufon case (8897) map </A>","City":"Palmerton","Date Submitted":"11/15/2007 10:46 UTC","Disposition":"IFO","divs":["Sighting DetailsI was heading to my girlfriends house on the evening in question from the Monroe County side of NEPA, I approached the ski area)BLue MTN.) from the main road leading towards the ski resort,( the access road goes over the Blue Mountain range and into the Lehigh Valley. I approached from the north facing the Mountain,I noticed the ski resort mtn. lights as I always do.I was about 2 miles away at this point. The area was just lit up to prepare for the upcoming ski season.At this time of the year though, their was still no snow , to the right of the mountain,I noticed a sphere,perhaps the size of a car hovering over the entire mountain, it had lots of unusual lights and appeared to be floating very still. as I approached and closed in to 1 mile it darted into the mountain range and disappeared. I finally headed up the road a bit cautious and confused. I stopped the car to see if their was any damage along the road or if any of the lights I had seen leading up to the road were still in the area. NOTHING...I cleared the top of the mountain and noticed nothing at all.I was a bit hesitant to disclose this , but recent reports I have read have made me change my mind. I do not know aht to believe. I think if something was out there , it will be a matter of time before it makes another appearance."],"files":["/var/www/straped/mufon/html2text/8897.html.txt","/var/www/straped/mufon/org/8897.html"],"Object Shape":"Bullet, Missile, Fireball, Sphere, Star-like, Teardrop","Case Number":"8897","Object Flight Path":"Undisclosed"}