{"Case Number":"8901","files":["/var/www/straped/mufon/html2text/8901.html.txt","/var/www/straped/mufon/org/8901.html"],"Region":"Vermont","Longitude":"-73.209582","Date Submitted":"12/18/2007 04:45 UTC","Object Features":"Unknown","Source":"MUFON","Country":"United States","Log Number":"US-01152008-0044","Weather Factors":"None","Object Shape":"Circle, Disc, Sphere","Disposition":"IFO","Latitude":"44.484932","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailswhen it began to pulse, i felt certain i was witnessing my second siting of a ufo and became very alert and interested. i continued to watch it fade and the pulse to brightness, then remain quiet. it never moved from its position about several hundred feet above lake champlaign across the water from oakledge park and its position between the two trees from where i was witnessing its activity. i am certain what i was seeing was a ufo. after watching for about 45 minutes, i became tired. i went and made some tea, and when i returned, the ufo was gone. the entire time i was standing in a living room-basement with a huge array of windows spanning about 30 feet near the banks of lake champlaign. i had been up for several hours listening to coast to coast(art bell). i first noticed the object as it was brighter and bigger than any star out over the lake, and it was a fairly clear night. my feelings: facination, wonderment, attempted to communicate esp\\mentally. wished contact. have always believed i am part of the et nations in some way......"],"Summary":"Thought it was a plane landing when first saw it. Then noticed \"landing lites\" flickered occasionally. Then noticed the object remained in same position between two trees- it did not move up nor down nor sideways. It remained stationery.","Object Flight Path":"Stationary","Date of the Event":"12/18/2007 04:45 UTC","City":"Burlington","Tags":"City","trends":["There have been 13 other sightings in Burlington","There were no other sightings in Burlington on or around December 18th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=44.484932,+-73.209582(8901)&iwloc=A&hl=en\"> mufon case (8901) map </A>"}