{"files":["/var/www/straped/mufon/html2text/8902.html.txt","/var/www/straped/mufon/org/8902.html"],"Disposition":"Unknown","Latitude":"32.673188","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","divs":["Sighting DetailsI was in bed asleep and was awakened about 245 AM, I am a light sleeper by the sound of a fast moving air craft flying over my house at a high rate of speed. The object was emitting a loud sound that wavered from a high to a low pitch. It was moving from the north to the south at a high rate of speed. It was strange because there was no sound of an internal combustion engine or a jet engine. Just the high pitched sound as it went overhead. This was followed by four or five jet aircraft that appeared to be chasing behind the object also going from north to south. I sleep with a bipap machine and and oxygen concentrator running in the room and both are fairly loud. I could hear the unknown object and the fighter jets easily above the machines. I live a few miles south of the joint reserve naval air station in Fort Worth and jets fly over the house all the time but seldom at this time of the morning. I blogged about my experience on New Years day and had written this off as a weird dream. At the time it was real enough I woke my wife up and told her about it. I would not have reported this but yesterday I saw the reports of the UFO seen down at Stphenville TX and some of the witnesses reported they saw fighter jets in pursuit. That is exactly what I thought I heard New Years morning and had told several people about and I feel this is an interesting coincidence?"],"Sighting Duration":"Undisclosed","Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.673188,+-97.460576(8902)&iwloc=A&hl=en\"> mufon case (8902) map </A>","Region":"Texas","Case Number":"8902","City":"Benbrook","Object Features":"Undisclosed","Viewing Distance":"Unknown","Longitude":"-97.460576","Object Shape":"Unknown","Summary":"I can only report what I heard as I did not see anything of note","trends":["There have been 4 other sightings in Benbrook","There were no other sightings in Benbrook on or around January 1st 2008"],"Date Submitted":"01/01/2008 02:45 UTC","Date of the Event":"01/01/2008 02:45 UTC","Log Number":"US-01152008-0045"}