{"Region":"Florida","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Date of the Event":"02/01/1968 12:00 UTC","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=30.341204,+-81.646381(8907)&iwloc=A&hl=en\"> mufon case (8907) map </A>","Date Submitted":"02/01/1968 12:00 UTC","Object Features":"Undisclosed","trends":["There have been 66 other sightings in Jacksonville","There were no other sightings in Jacksonville on or around February 1st 1968"],"Source":"MUFON","Log Number":"US-01152008-0050","Summary":"large ufo stationary 100 ft off ground directly overhead for15 to 18 min 6:00a","Weather Factors":"Unknown","divs":["Sighting DetailsI believe my conversations with a co worker the previous week to this event had something to do with what happened. I had stated to her that I WISH I could see a ufo. That was on Friday. The next Monday morning I prepared to leave for work and walked outside, down the steps and toward my car when I suddenly felt compelled to turn around and look up over my mothers house. This thing was sitting still, silent, and it had long bands of light sequincing on the bottom of its stainless appearing shape. As one light would brighten the previous would dim out (about the color of a welders arc only not so bright) It was football shaped looking at it from directly underneath but oval disc would describe it too. It was between 300'& 400' long I would say; half that wide. As soon as I saw it, I went inside and got my Mom and we watched it until our necks became sore. Finally, she went inside an said \"tell me what it does!\"(in her 60's) This thing was just above the pine trees on our block and was mostly covering our short city block, and I remember thinking others were seeing it too. It just kept sitting there. Finally, I recall saying out loud, \"What is holding it up\" \"What is powering it; that it can just sit suspended like that\" (with no noise) Instantly, a reply came, not out loud.... but just into my mind I guess like telepathy? \"Its like magnets you played with as a young person\" \"Remember how the wrong ends repeled?\" Yes, I answered out loud! \"It has a nuclear powered electromagnetic gyro\" came the next.... \"Oh\" Needless to say, I was dumfounded! Then the thought process continued\"You were talking about seeing a Ufo last week, remember?\" \"Yes\" ... I shot back \"Would you like to go with us?\" At that, I became somewhat frightened. I thought back that I would like to but I was frightened and was just beginning my life etc. Almost as soon as I replied in the negative, the light bands which had been slowly sequencing speeded up. After a minute the whole base began to glow and the individual bands were less decernable. It climbed higher (it was about 100 feet at first)..maybe it doubled its altitude and stopped again. The river is a block or two away and it probably was directly over it when it stopped. It wobbled a little on its first movement; black smoke wiffed from somewhere on top,(you couldn't see where) and came over the edge in a puff. Im still looking at the base. As it stopped, higher now, white smoke wiffed a little from somewhere on top too. Then, the whole bottom began to glow, brighter and brighter then superglow..... I began moving again just slow southeast; but then it accelerated so quickly you actually couldn't see where it went! I have seen Navy jets at airshows flying fast low........ the thing I saw went so quickly when in acelerated you actually couldn't follow it with your eyes. It like started southeast but then in just was gone. Almost like it disapeared? I raced back inside and my mother and I called the police and tv stations etc and asked if they had calls about something unusual and they had no idea what I was talking about. So, we just let it go. What do you do or who do you tell??? I got my wish though! I have sometime watched the ufo shows just to see if anyone would describe my ufo. Sometimes I would hear discussion about what powers ufo's. I just smile because I have known that since the spring of 1968. Last year or awhile back I heard someone say they are working with electromagnetics @ Oak Ridge. I guess you can imagine, that caught my ear! I also hope there might be someone out there who will read this and KNOW it is truthful! (smile) Thanks for the format!"],"Tags":"City","Latitude":"30.341204","Case Number":"8907","Country":"United States","Longitude":"-81.646381","Object Shape":"Disc, Oval","files":["/var/www/straped/mufon/html2text/8907.html.txt","/var/www/straped/mufon/org/8907.html"],"City":"Jacksonville"}