{"Weather Factors":"Medium, Light","Case Number":"8908","Date Submitted":"01/09/2008 12:00 UTC","Object Shape":"Circle, Unknown","Tags":"City","Country":"United States","City":"Seguin","Date of the Event":"01/09/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/8908.html.txt","/var/www/straped/mufon/more/8908_submitter_file1__no.1with3jets.jpg","/var/www/straped/mufon/more/8908_submitter_file2__no.2threejetsandablackspot.jpg","/var/www/straped/mufon/more/8908_submitter_file3__seriouslywhatjusthappened.jpg","/var/www/straped/mufon/org/8908.html"],"Source":"MUFON","Viewing Distance":"Over One Mile","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=29.568841,+-97.964727(8908)&iwloc=A&hl=en\"> mufon case (8908) map </A>","Latitude":"29.568841","Sighting Duration":"Undisclosed","Object Features":"Unknown","Disposition":"IFO","trends":["There have been 3 other sightings in Seguin","There were no other sightings in Seguin on or around January 9th 2008","This sighting has never been favorited.",""],"divs":["Sighting Detailsi was standing in my front yard taking pictures when i noticed that there were 3 jets flying close together. two were flying side by side up to the left. another jet flew close to them and then turned and flew straight up and then off to the right. one of the two flying together, quickly turned around and flew after him at a high rate of speed. the third jet appear to have turned, but stopped seemed to just disappeared. i took as many pictures as i could, but i think the best photo i have is the one that (when enlarged) shows a foreign object among the 3 jets. unfortunatly, this photo is blurry and detail is lost. but if you concentrate on the jet trails, it is clear that one seems to have just gone missing after the foreign object appears. i didn't notice the forgein object until i downloaded the film. i had originally thought the event was just test pilots. i have more photos of this event in case you would like to see them, but the first one attached is i believe the only one that includes a foreign object."],"Longitude":"-97.964727","Log Number":"US-01152008-0051","Summary":"3 jets flying....one jet disappeared in mid-flight, on the photo of that...there appears to be a dark forein object in line with jets.","Object Flight Path":"Unknown"}