{"Country":"United States","Object Features":"Unknown","Date Submitted":"01/12/2008 07:19 UTC","Latitude":"47.933397","Weather Factors":"Unknown","Object Flight Path":"Stationary,Hovering then path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=47.933397,+-97.029355(8909)&iwloc=A&hl=en\"> mufon case (8909) map </A>","Summary":"WOW","Sighting Duration":"Undisclosed","Tags":"City","Region":"North Dakota","Disposition":"Unknown","Date of the Event":"01/12/2008 07:19 UTC","Object Shape":"Cigar, Cross, Triangle","files":["/var/www/straped/mufon/html2text/8909.html.txt","/var/www/straped/mufon/org/8909.html"],"Longitude":"-97.029355","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Source":"MUFON","Log Number":"US-01152008-0052","Case Number":"8909","trends":["There have been 6 other sightings in Grand Forks","There were no other sightings in Grand Forks on or around January 12th 2008"],"City":"Grand Forks","divs":["Sighting DetailsI picked up my daughter from babysitting-we were talking in the vehical and I looked up seeing lights- resembling those of a helicopter.I took aviation courses and know what these look like- however-there was no sound and it turned suddenly and flew silently and quickly for 4 or 5 blocks (at about 100 feet up)then stopped when I could no longer follow it with the car because of a dead end. It hovered for a minute and quickly flew off toward the airbase-I snapped a picture with my cell phone cam only to reveal that There was another craft close by I did not see until I took the picture and then both crafts just \"disappeared\" it was a cloudy night and there were no other crafts or stars. The first object I followed did not have typical red or green aviation lights until it turned toward the second craft- this first object was shaped like a cross with only blue lights then turned in a way to reveal 2 red lights (no flashing) and the second craft appeared as a triangle and only had three lights that I can see. I have a picture on my phone if I could send it you could examine it. Please tell me it was a helicopter and small plane! Also last week my family and I were driving along highway 2 at night at midnight and saw a fast moving triangle craft we thought was a plane until it made a straight 75 degree turn and stopped then turned again to duck under low laying clouds-it was completely soundless and only about 250 feet above us. I thought it was the new \"aircraft\" the base has but I never have seen any aircraft move like this and I did not want to jump to conclusions so I say I did not know what it was-but my 4 kids totally freaked!"]}