{"Latitude":"35.617895","files":["/var/www/straped/mufon/html2text/8910.html.txt","/var/www/straped/mufon/org/8910.html"],"Tags":"City","Date of the Event":"12/18/2007 07:15 UTC","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=35.617895,+-82.32123(8910)&iwloc=A&hl=en\"> mufon case (8910) map </A>","Object Features":"Patterned Surface","Summary":"looked like a greenish blue beacon lite similiar to a boat beacon","Date Submitted":"12/18/2007 07:15 UTC","Log Number":"US-01152008-0053","Region":"North Carolina","Source":"MUFON","Case Number":"8910","divs":["Sighting DetailsI was going home from the convience store east on old Hwy 70 and out of the corner of my left eye sight I saw this unearthly object shoot through the lower horizon. It reminded me of a boat beacon in that is was cylinder shaped standing upright and glowing in two areas. It's movement was not something familiar as it flew at a quick angle almost parallel to the land but heading down. I felt a familiarity and I really had to search deep in my brain to remember that only 8 or so months prior I had viewed something similiar (but more in number) in the exact same area. Two other folks in my car that first night also viewed the display of objects in the sky. This area would be near or over the watershed for our region. I had to continue to search my brain, I mean harder than normal, and I remembered that the local news broadcast that night, the first time I saw it, had reported a story of several people seeing the same lights and that is was a \"meteor shower\". The second time I saw the object (singular the second time) I felt for sure it was an UFO especially as hard as I had to try to remember the first time I had seen the objects (plural for the first time). It was really weird how it seemed to try to be suppressed in my memory and how hard I had to try to pull it out! I shared my experience with a few of the locals in the next few days. No one else saw it the second time that I am aware of."],"Sighting Duration":"Undisclosed","City":"Black Mountain","Country":"United States","Disposition":"Unknown","Object Shape":"Cylinder","Weather Factors":"None","trends":["There have been no other sightings in Black Mountain","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.32123"}