{"Object Shape":"Egg","Disposition":"IFO","Region":"California","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/8912.html.txt","/var/www/straped/mufon/org/8912.html"],"Source":"MUFON","trends":["There have been 2 other sightings in Marina Del Rey","There were no other sightings in Marina Del Rey on or around January 10th 2008"],"Case Number":"8912","Latitude":"33.986279","Tags":"City","Object Flight Path":"Straight-line path,Other","map":"<A HREF = \"http://maps.google.com/maps?q=33.986279,+-118.450225(8912)&iwloc=A&hl=en\"> mufon case (8912) map </A>","Longitude":"-118.450225","Summary":"Following underneath an airplane that was flying southeast","Country":"United States","Object Features":"Unknown","Sighting Duration":"00:03:28","divs":["sighting detailsi was at work on the morning specified, and was talking to a co-worker. i was looking out our office attrium which is in the middle of our office with a full opening to a view of the sky above. i dont know the sq. ft. as i'm not good at estimating that but it's a large attrium. as my co-worker was talking my eyes wandered to the sky above and i noticed an airplane flying overhead which was not out of the ordinary since we see airplanes all the time being that lax is not far from marina del rey. most or all airplanes take off from lax going west and circle the ocean then turn to their destinations. as i was watching this large regular size airplane, (like a 747 or similar), i noticed a shiny silver, round looking object come up fast from behind it and it started following on the lower right side of the plane. i kept watching it as my co-worker was talking to me, as it was going faster then the plane now, and it was too high in the sky to be a helicopter, or small cessna, and traveling much to close. even so it was round shiny and silver. i stopped my co-worker from talking and pointed it out to him, and as i was trying to show it to him, the object sped past the airplane and took off. i'm not sure what it was,. but i know what it wasnt. my co-worker did not see it, as he was looking farther right of the airplane then the object was. now given the speed an airplane travels, for this to out run an airplane, was not something i've seen before. i was floored, surprised and excited at the same time. again the plane was too high for the object to be a helicopter following or a cessna, and too close even if it were, for safetey reasons. the speed in which it traveled, and took off was to say the least pretty damn fast and too fast for it to be another aircraft to out run an airplane at that speed, height, and size. i then lost sight of it, as it took off fast, going southeast ahead of the airplane, i realized i'd just seen something i'd never seen before. i know what helicopters look like, large passenger airplanes\\jets and cessnas, as i live between marina del rey and lax, and have lived in this surrounding area my entire life, so i see all aircraft flying reguarly every day all day, so this was most definately out of the ordinary. again it was small, silver shiny, round \\ egg shaped, and traveled at a high rate of speed. i dont know how long it was trailing the plane or if the plane even knew it was there. so that's my story. my first time seeing something in the skys that i was not sure what it was, but i know what it wasnt. thanx for reading, mdr, ca"],"Weather Factors":"None","Date Submitted":"01/10/2008 10:30 UTC","Date of the Event":"01/10/2008 10:30 UTC","Log Number":"US-01152008-0055","City":"Marina Del Rey"}