{"Object Features":"Unknown","Weather Factors":"Unknown","Summary":"Oject with 4 lights (white) of which 3 were bright and dimmed and 1 smaller light in boomerang like formation","map":"<A HREF = \"http://maps.google.com/maps?q=30.623048,+-87.745765(8913)&iwloc=A&hl=en\"> mufon case (8913) map </A>","Disposition":"Unknown","Longitude":"-87.745765","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Tags":"City","Region":"Alabama","City":"Loxley","Date Submitted":"01/15/2008 06:15 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Date of the Event":"01/15/2008 06:15 UTC","files":["/var/www/straped/mufon/html2text/8913.html.txt","/var/www/straped/mufon/more/8913_submitter_file1__UFO1-15-2008DAPHNEAL_001.JPG","/var/www/straped/mufon/org/8913.html"],"trends":["There has been one other sighting in Loxley","There were no other sightings in Loxley on or around January 15th 2008","This sighting has never been favorited.",""],"Log Number":"US-01152008-0056","Case Number":"8913","Viewing Distance":"Over One Mile","Latitude":"30.623048","Country":"United States","Object Shape":"Boomerang, Other","divs":["sighting detailsi saw a ufo (i think) tonight. i was going to kraver's seafood to pickup an order of fish for dinner. i was driving west on county road 64 in loxley, al and saw this bright light in the western sky toward daphne, al. the light was obstructed by some trees in a short time and as i approached the intersection of county road 66 and county road 64 i saw the light again in which is was much brighter and appeared to be a cluster of lights; so i pulled off the road and parked my car beside a cabbage patch and watched it for a minute or so. i remembered that i had my camera in the car so i took a couple of pictures of the image (the first picture did not show the object because i was aiming the camera with my arm ouside of the window without using my viewer.) the second picture was a little better because the image appears in the lower left. i have attached the picture taken from my car. it (ufo) is in the lower left corner of the picture. it stood still there for about a minute in air and the lights would dim and then get real bright. i used my canon powershot a620 640x480 resolution. it was dark and i was surprise that i was able to capture the image. it started toward me and i didn't hang around and left for the restaurant. if you enlarge the object you can clearly see 3 large lights and 1 smaller in the back\\rear?"]}