{"map":"<A HREF = \"http://maps.google.com/maps?q=32.226856,+-98.196443(8914)&iwloc=A&hl=en\"> mufon case (8914) map </A>","Object Features":"None","Tags":"City","Longitude":"-98.196443","City":"Stephenville","Region":"Texas","Source":"MUFON","Disposition":"Unknown","Country":"United States","Date of the Event":"12/07/2007 10:30 UTC","Log Number":"US-01152008-0057","Summary":"Small white circle expanding to very large dark red object and small red sphere shot off from larger object","Latitude":"32.226856","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Date Submitted":"12/07/2007 10:30 UTC","divs":["sighting detailsi was standing on my parents back porch at approximately 10:30 pm. it was a dark moonless night and we did not have any lights on as i was leaving their home at the time. i was looking back to the south over my mothers shoulder as we were talking and i saw a small white sphere above the horizon. at first i thought it was a landing light of a plane. its diameter grew and as it grew it turned dark red and then faded out and back in twice. this all happened in approximately 45 seconds. i called this to my mothers attention and she turned to watch it. i stood and described this unusual light to my mother for about 5 minutes when it suddenly reappered at a higher elevation. at this time the object had an orange hue to it. it stayed in the same position for about 15-20 seconds and then a smaller reddish orange spherical object shot out of it up and to the right. the larger object then went left across the horizon very rapidly and disappeared. we then had another encounter on 12\\22\\07 at about 11:00pm. i was with my sister coming down the hill from our parents home when i spotted another unusual object in the sky. it started out small and white and grew to a large lime green sphere. it flashed once and then shot off rapidly to the right and disappeared. my sister saw the end of it as it was shooting off. both of these events happened within 5 miles of each other in the sky."],"Object Shape":"Circle, Sphere","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around December 7th 2007"],"files":["/var/www/straped/mufon/html2text/8914.html.txt","/var/www/straped/mufon/org/8914.html"],"Case Number":"8914","Weather Factors":"None, Does Not Apply","Viewing Distance":"Over One Mile"}