{"Summary":"On balcony, facing N, stargazing. Large, black triangle appeared from S. Not an airplane. Big Fast & Silent. Disappeared in secs. No one else noticed it.","Tags":"City","Disposition":"Unknown","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around November 30th 2003"],"Longitude":"-122.416346","Object Shape":"Triangle","Log Number":"US-01162008-0001","Sighting Duration":"Undisclosed","Region":"California","Latitude":"37.78363","Case Number":"8915","Date of the Event":"11/30/2003 12:30 UTC","Viewing Distance":"Unknown","Date Submitted":"11/30/2003 12:30 UTC","divs":["sighting detailshello mufon: i am reporting a brief sighting that i experienced a few years ago. i would have emailed the details at that time, except that i only recently learned that people may report sightings to you here. i am not 100% sure about the date. these are the details of which i am sure: it was at night, around 12 or 12:30am. i was standing on a second floor balcony, stargazing. i was facing north and looking at the constellations and studying the perceived colors of distinctive stars and noting the usual visible satellites and their 'flash patterns'. i had binoculars hanging around my neck. there were constant passersby on the street below - individuals, couples and small groups of females, males and coed groups. it was a clear night with a clear sky. suddenly and unexpectedly - a large, dark, triangle-shaped object entered my field of vision from above and behind me (from the south). it was unexpected as there were no sounds projected ahead of it, nor any accompanying it. nor were there any lights or physical vibrations preceding or accompanying it. it traveled in a straight line, following a trajectory directly through where i had been looking. i instantly realized that this object was not any type of aircraft which i had ever seen - civilian, commercial or military. nor was it a helicopter or a dirigible\\balloon. it's lines were straight and corners sharp. i had never seen anything like it before this moment. it had no illuminated lights on it - a basic requirement of aircraft in flight. there were no signs of there being any sources of light on it. in fact, there was nothing visible on the large, dark shape that i was scrutinizing and a bit stunned by. it was \"rocketing\" across the night sky above me, heading north. i say \"rocketing\", because it was racing. not only was its speed unusual, but so was the fact that it never made a sound. nor did it, at any time, cause any vibrations. i thought this odd because it was flying lower than commercial aircraft and was moving much faster than they do... and those aircraft are always accompanied by audible rumbling and, occasionally, by vibrations as they pass over. these initial perceptions happened in seconds and i had instantly realized that what i was seeing was something unusual and unique. i immediately reached for the binoculars hanging around my neck. as i lifted them to my eyes, i quickly glanced to a point ahead of where i had just seen the object - above the street in front of me and not quite halfway across the sky - so i knew where to point the binoculars... and i was stunned to find that it was already gone. completely gone - no lights shrinking as it continued on its path - no vapor, smoke or exhaust trail left behind. nothing. i was amazed that it was gone - in less than 5 seconds, that there was no sign of it anywhere in the sky (it was a clear night) and that not one other person on the ground ever noticed it or looked up. i felt fortunate, like i had just seen something special. i make no assumptions about it. i don't know what it was. the 'most-logical'(and least imaginative) assumption might be that it's something being tested by the military. no surprise if it was. and it wouldn't be the first time a secret(why else fly at night with no lights on?), dark, silent, swift and (unsuccessfully)stealthy object flew over my head - i tend to notice such things, even if no one else does. i have read of a number of other sightings involving triangle-shaped objects in the sky, so i thought it might be worth adding my own amazing, albeit brief, sighting. thank you for the opportunity. i'll keep looking up. i'll definitely let mufon know if(when) i have any noteworthy observation. best regards."],"City":"San Francisco","Object Flight Path":"Straight-line path","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/8915.html.txt","/var/www/straped/mufon/org/8915.html"],"Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.78363,+-122.416346(8915)&iwloc=A&hl=en\"> mufon case (8915) map </A>","Country":"United States"}