{"Longitude":"-82.315366","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/8918.html.txt","/var/www/straped/mufon/org/8918.html"],"Object Features":"None","Region":"Florida","Tags":"City","Date of the Event":"07/15/1973 12:00 UTC","Date Submitted":"07/15/1973 12:00 UTC","trends":["There have been 27 other sightings in Gainesville","There were no other sightings in Gainesville on or around July 15th 1973"],"Weather Factors":"Unknown","Log Number":"US-01162008-0004","Latitude":"29.656404","City":"Gainesville","divs":["Sighting DetailsMy friend and I were both juniors attending U.of Fl. It was sometime during the summer. I was over at his off-campus apt., which was a large complex of 2 story apt. buildings. I was in the living room listening to an album, and he was standing outside on his 2nd floor balcony. He started laughing, and called for me to come look at something. When I when out on the balcony, he pointed up to a spot that was across the parking lot, to the edge of the property that was bordered with very tall trees (pine?), maybe 75 yards away, and hovering some seemingly close distance above these very tall trees was a bright ball of sparkly light, about the size (not shape) of a small car. What I have always remembered about that moment was that it reminded me of a hand held sparkler (like at a 4th of July celebration), that kind of bright, intense light. We were both in complete amazement. As we watched it for maybe 20-30 seconds, it seemed to remain stationary. On a side note, I rememberd how odd it was to see a guy walking across the parking lot in the distance, carrying a case of beer, and he had no idea about what was occuring above his head. So my friend and I decide to run down stairs, across the parking lot to get a closer look. Once we got downstairs and started running towards this object, it now seemed to be a little further away, and a little higher up, than it first appeared. So since his car was close by, we got in and headed off down the street to get a closer look. Well this turned out to be quite a ride. It was still light out when we first saw this object. As we left the street that the apt. was on, we headed onto a main highway, now heading south for a few miles. Then we headed west as the object seemed to be getting further and higher away with each passing minute. We continued west until we reached the outskirts of town, and now we had to go north to keep tracking it. I remember that it was now getting dark as we were heading north, leaving the city limits. By now this ball was starting to look more like the brightest star in what was a very clear, full moon (or close to it) night, becoming smaller as it got further away. Finally, we were a few miles beyond the city, out in a rural area, where we stopped on a two lane, just before this road crossed over Interstate 4. We got out and just stood quietly looking up at this incredible night sky, filled with stars, but the one we had been chasing was the brightest. It was up in the northwest sky, at about 10 o'clock. It seemed to be staionary, and so we both started just gazing around at all of the sky, and our surrondings. We were probably looking around for a few minutes when Nicky yelled to me, \"LOOK\"...I spun around and looked up to where this object had been, and it was now moving very fast across the sky,towards the east, (from a 10 o'clock position to a 2 o'clock position)where it suddenly stopped as it \"appeared\" to meet another star. After a few seconds, it took off again in the direction of the moon, and as it lined up between us and the moons brightness, it seemed to disappear. Although I have recounted this story over the past 34 years to probably a dozen people, I've always wanted to share it with someone who really understands this reality. And now that I've just shared this most personal and amazing experience with a complete stranger, I'm hoping that you will reply with maybe a confirmation of this sighting from your records, but more importantly, some general information regarding our experience, in terms of this type of UFO experience. Also, I really can't remember the exact month, but it was certainly summer. And it was at, or around, a full moon, and it was a Friday."],"Country":"United States","Source":"MUFON","Object Flight Path":"Hovering then path,Path with directional change","Viewing Distance":"101-500 Feet","Case Number":"8918","Object Shape":"Fireball, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=29.656404,+-82.315366(8918)&iwloc=A&hl=en\"> mufon case (8918) map </A>","Summary":"A ball of sparkling light that we followed for over 40 minutes."}