{"Summary":"huge multi-lighted craft followed-escorted by conventional aircraft","Object Flight Path":"Straight-line path","Case Number":"8924","Tags":"City","Object Shape":"Unknown","Sighting Duration":"Undisclosed","Date Submitted":"10/10/1998 12:00 UTC","files":["/var/www/straped/mufon/html2text/8924.html.txt","/var/www/straped/mufon/org/8924.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.275438,+-107.75679(8924)&iwloc=A&hl=en\"> mufon case (8924) map </A>","Country":"United States","Object Features":"Unknown","City":"Deming","Latitude":"32.275438","Longitude":"-107.75679","Disposition":"Unknown","Log Number":"US-01162008-0010","Weather Factors":"Unknown","Source":"MUFON","Region":"New Mexico","Viewing Distance":"501 Feet - 1 Mile, Unknown","trends":["There have been 17 other sightings in Deming","There were no other sightings in Deming on or around October 10th 1998"],"Date of the Event":"10/10/1998 12:00 UTC","divs":["Sighting DetailsMy wife and I were camping at \"rockhound state park\" in southern NM. At approximately 3am I awoke, not sure why, possibly \"had to go\", but at any rate the sky was spectacularly clear, and when I turned around to head back in to our tent, I then saw this \"thing\" appraoching from the NW heading towards the SE. By the lighting of it, it was apparent that it was unusual. Several multicolored beams of light shown out from it at various angles,including directly up from it, and judging by the point sources of these beams, it appeared to be massive. It made absolutely no sound of any kind. As it passed directly overhead, I noticed some obvious aircraft trailing behind it, unknown type but sounded like jets at slow speed. There were two of these. They were maybe within a mile of the mystery object. As I could not discern the altitude, it is hard to estimate the size, but based on the relative sizes of the conventional craft following it, I would guess it was maybe up to several hundred feet in volume. Again, no shape was discernable. The trailing aircraft had strobes and navigational lights, and were just audible at this distance. Some of the beams of light were a electric blue color, one was greenish and three were a magenta shade. The most astounding thing that struck me was the complete silence of it. The only sound was the trailing jets, that I could only hear just after they passed overhead.The object did eclipse background stars, so it did have a body of some kind. I would estimate the speed at around maybe 200mph. This takes into consideration the \"slow\" moving jets that trailed behind it.I was so dumbfounded that I forgot to wake my wife until it was well past over head, but woke her up immediatley to see it. Her comment was \"what the hell IS that\". Also the beams of light were non-diverging. More like thick laser beams that seemed to penetrate out indefinately. My feelings were simply one of awe. I am an amatuer astronomer and licsensed ham radio operator. My profession is a power engineer of 26 years. I am submitting this experience now because of the recent sighting in Tx that sounds almost identical to the one I witnessed. I have only mentioned this experience to a very few close friends that I know and trust. I have seen many different \"apperations\" in the night sky due to my experience as an amatuer astronomer, but I know I witnessed something truely spectacular and mind boggling that night and will never forget it. And no, I did not find any decent geodes at rockhound state park, but the camping fee was well worth it!"]}