{"Sighting Duration":"00:00:12","Date of the Event":"09/17/2007 05:45 UTC","Object Shape":"Other","Summary":"Cloud-like disc or oval shape (AOL, weeks later, showed an accurate photo of it)","City":"Naples","Source":"MUFON","Viewing Distance":"101-500 Feet","Log Number":"US-01162008-0011","map":"<A HREF = \"http://maps.google.com/maps?q=26.144886,+-81.78561(8925)&iwloc=A&hl=en\"> mufon case (8925) map </A>","Disposition":"Insufficient Data","Region":"Florida","divs":["Sighting DetailsI always walk my dogs between 5AM & 6AM. It was pitch-black except for street lights. That morning I was walking on a street that ended in front of my house. I was, as usual, walking thinking about somthing with my head down. I heard a car start up. As I looked up to see my neighbor's pickup truck I saw this white large object float very very fast over his house & mine and then behind some trees & gone. It was very low, just above my roof (not something way up in the sky). There were no lights, no sound at all, no exhaust trail. I live about 5 miles from the Naples airport and am used to seeing low-flying planes near my house. This object was definetly NOT a plane & flew much lower & faster than a plane. It flew west to east (like from the Gulf of Mexico toward the Everglades). I live about 5 miles west of the Gulf of Mexico & this object was flying east, away from the airport & the Gulf. I was about 200 feet from the front of my house. It all happened so suddenly that I tried to run toward my house to see it but it disappeared behind my neigbor's trees & when I got to where I could get a better view of the eastern sky it was gone. It's hard to tell how large it was. My property is 100' wide. It was larger than my property and so low that I thought it might have touched the trees. I only saw it on it's edge. I do not know how wide it was. I would say it was more disc-shaped because there was not too much height to it that I could see but I saw it at an angle, so close, that it was too hard to tell. It was a very calm night - not much of a wind at all. Although it may have looked cloud-like I have never seen a cloud soar by so very very fast and so low in the sky as this did. I am a sober, fairly intelligent, 66 year old man. College graduate. I am not given to fantacies. It was so low & so close to me I KNOW it was something I have never ever seen before. If it hadn't been for my neighbor starting up his truck I would never have seen it becaues it moved so fast and was totally silent. I contacted another UFO sight on the internet & reported it (I connot remember their name) but have never heard back from them. I have a feeling they are not in operation. When I saw a news story today On the TODAY SHOW about UFOs in Texas they gave your name. That is why I am contacting you. My friends, I know, are humoring me. I hope you will understand. It was a life-altering experience for me. Sincerely. Stephen R. Scrivani"],"Longitude":"-81.78561","Object Flight Path":"Straight-line path","Latitude":"26.144886","Country":"United States","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/8925.html.txt","/var/www/straped/mufon/org/8925.html"],"Tags":"City","Case Number":"8925","Date Submitted":"09/17/2007 05:45 UTC","trends":["There have been 34 other sightings in Naples","There were no other sightings in Naples on or around September 17th 2007"],"Object Features":"Undisclosed"}