{"Date Submitted":"05/31/1976 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.319291,+-94.916844(8928)&iwloc=A&hl=en\"> mufon case (8928) map </A>","Object Shape":"Disc","Object Flight Path":"Path with directional change","Region":"Kansas","Country":"United States","City":"Leavenworth","Latitude":"39.319291","Longitude":"-94.916844","Weather Factors":"Unknown","Tags":"City","Source":"MUFON","Object Features":"None","Viewing Distance":"101-500 Feet, Over 1 Mile","Summary":"It flew low - and slow- The 5 of us all saw it -200 ft above us about 5MPH.","Date of the Event":"05/31/1976 12:00 UTC","Log Number":"US-01162008-0014","divs":["Sighting DetailsThe exact date is unsure,but I believe it was June, 1976. I had just left from visiting my Great Uncles house, and while driven North on 4th Street, just past limit street, I noticed a bright low flying light to the east through the tree line. I thought is was too bright and too low, and too slow to be a Helicopter, and as I continued, I could still see it over the next several miles and I drove, tracking along the Missouri River, along the tree line. Long story short, I turned East On Cherokee and couldn't see it any more. I rush home, jumped out of the car and told my Mom and Dad about the strange lights. They kinda humored me. I went outside, climbed a tree just next to our house, and continued to watch out for the light in the East. After 15 minutes or so, I saw the light again, this time much higher, and the craft was a mile or more away - and made a big circle clockwise to the tree I was in -but still no closer than a mile. I watched it do this twice in a thirty minute time span as it disappeared in the East. The 3rd time it came around, I ran in the house and convinced my Mom and Dad to come out, and my sister and older brother did as well. And what a surprise we had in store. This time, as the craft made the same circular clockwise journey as it got directly to the north of us (and to the north standing on our doorstep, we can see the dome of the Federal Penitentiary so we had good lighting and a good reference point), the craft came directly toward us. It was low this time, about 200 feet in the air, flying at about 5 MPH, and the sound I'll never forget - hardly loud enough to be considered a whisper. While it was still less than a block away my mother ran into the house to grab a Polaroid camera (that was the best we had back them), and a bank of flash bulbs and came back outside. She was so nervous she couldn't manage to get the bulbs into the camera. It flew over our heads heading south very slow - 5mph. The sound was a soft \"swoosh\", and as it went past us and over the house, it banked to the southeast and we didn't see it anymore. The craft was about 20 ft in diameter, had white and green lights in the front and a red light on the back. My dad called in a police report, the police came about 20 minutes later. My Dad sat outside in the police car and filed the report. There were several reports in the paper (Leavenworth Times) the following day of UFO sightings , casually dismissed as likely being military related craft (but no craft were confirmed in the area and no comment from the military) since we are so close to Ft Leavenworth base. I'm an ex-Army Officer, and even to this day, I've never seen anything like what I saw then. My Father passed away several years ago, but even to this day, I ask my family if that really happened, and Mom, my brother and sister (and dad until he passed continually confirm it. I've often wanted to have the Leavenworth Police department provide me with a copy of the police report, but I just never did. Maybe MUFON will. I remember drawing what we saw several times, and I believe I gave a copy to the policeman as well after my father explained the story to the policeman, but I'm not really sure of that. I am sure that it no one in my family to this day believes we saw anything conventional. For credibility, purposes, I was a Captain in the Army before I got out, and both of my brothers recently retired from the army as Lieutenant Colonels. My mother still lives at the same house on the corner where all this happen (14th and Delaware). The tree I climbed was cut down a few years ago, but everything else is pretty much unchanged in the landscape."],"Case Number":"8928","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/8928.html.txt","/var/www/straped/mufon/org/8928.html"],"trends":["There have been 8 other sightings in Leavenworth","There were no other sightings in Leavenworth on or around May 31st 1976"],"Sighting Duration":"Undisclosed"}