{"Summary":"Saw a brightly shining object very high in the sky to the south west","files":["/var/www/straped/mufon/html2text/8929.html.txt","/var/www/straped/mufon/more/8929_submitter_file1__object.JPG","/var/www/straped/mufon/org/8929.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.726839,+-97.31958(8929)&iwloc=A&hl=en\"> mufon case (8929) map </A>","Case Number":"8929","Region":"Texas","Weather Factors":"Unknown","Log Number":"US-01162008-0015","divs":["Sighting DetailsAs I was driving home from work on Alliance parkway at sundown in north east Ft. Worth, the sun was almost on the horizon and I saw very high up in the sky and a good distance to the south west, a very brightly lit star like object in the sky that appeard to be moving slowly, the speed a distant aircraft would appear to be moving. I don't think it was a star because there were clouds behind it. And the sky was still too bright to see any stars and also it was moving. I thought it was strange but chalked it off to the sun probably reflecting off of a plane, even though the sun was behind the object. Then I saw the article about the sightings in Stephenville and I'm thinking maybe I saw the same thing. I don't know what it was but its possible that I saw the same phenomenon the people in Stephenville saw. I first noticed it as I crossed rt. 377 and was able to see it from there the rest of the way to my house which is off of Alta Vista. I didn't bother to linger outside looking at it when I got home because by that time I had convinced myself that it must be light reflecting off a plane. I've attached a rough sketch of what I saw. On the sketch the road I was driving on is the white rectangle, the black arrow shows the direction I was headed. The object is the small white spot at the top to the left, the grey represents clouds, the red arrow shows the direction the object was moving. The sun is in the approximate position it was in when I first spotted the object. I've filled in the sky with orange because with the sun setting that is pretty much how the sky looked at the time."],"Object Shape":"Star-like","Date Submitted":"01/08/2007 05:00 UTC","Latitude":"32.726839","Sighting Duration":"Undisclosed","Object Flight Path":"Straight-line path","Longitude":"-97.31958","Object Features":"None","Source":"MUFON","City":"Fort Worth","trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around January 8th 2007","This sighting has never been favorited.",""],"Date of the Event":"01/08/2007 05:00 UTC","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unknown","Tags":"City"}