{"Date Submitted":"08/31/1992 12:00 UTC","Region":"England","Viewing Distance":"Over One Mile","Summary":"Extremely large intense mass of heat rising above city. Airliners beneath shape.","Weather Factors":"Unknown","Case Number":"8930","Object Features":"Other","Object Flight Path":"Straight-line path","files":["/var/www/straped/mufon/html2text/8930.html.txt","/var/www/straped/mufon/org/8930.html"],"Date of the Event":"08/31/1992 12:00 UTC","Country":"United Kingdom","Disposition":"Unresolved","Longitude":"-0.122895","Latitude":"51.510269","City":"London","Object Shape":"Cigar, Circle, Disc, Egg, Fireball, Oval, Sphere","Source":"MUFON","divs":["sighting detailsi was walking across hyde park from an entrance near marble arch to bayswater. the event i describe occured whilst i had gone up from the path next to the serpentine onto the road bridge crossing it. the day was a very hot indian summer's afternoon with a mainly clear blue sky. i noticed the object climbing upwards at a sharp angle as if travelling from the earth into space. what was most astonishing a t first was that i noticed the airliners were placed beneath the object which already suggested by its form that it was large. if the planes were under and set against the ufo, then it must have been enormous. the question of its size actually made me question what i saw over and over again; and question less the apparent composition of the ufo. i had the distinct impression that i was watching something that was not a machine in ordinary terms, at least. the shape of the ufo seemed to be ovoid though i wondered if it might not be circular or even a sphere if looked at from another angle. around the edge of the ufo was what appeared to be dark red flame, a bit like rocket exhaust. the interior seemed very dark and very intense with energy. i felt that i was watching something organic with its own will reaching for space. during my sighting(i was leaning against the stonework of the bridge, with cars and pedestrians passing, it was a very fine afternoon) i happened to look down from the bridge atthe narrow pedestrian path which goes underneath it. a couple, who i ascertained to be francophone, were watching it as well. the man shouted up. he told me that he had seen something similar.....in switzerland...i seem to remember. also a woman who was passing with her family, and who had noticed me looking up had also noticed the ufo. she asked me what it was to which i replied that i didn't know. the ufo climbed the sky, its size diminishing as it gained height. i eventually left the bridge and continued to walk though i glanced up noticing the ufo was still present for a very long time though it was becoming very small in relation to the earth. later i looked up a ufo society based in the uk and sent a report. i did not hear anything back. this phenomenon has kept on recurring in my thoughts for years now, and i feel the need to report it again. i have already seen apparent ufos when i was a teenager stargazing in my back garden. small star shaped lights that would move at strange angles. stop. then move off at very sharp angles. recently an area near my childhood home (stirling, scotland) has become known for its sightings of ufos (bonnybridge (triangle)) i also know of sightings by family members. one of them lived in rhodesia\\zimbabwe in the 1950s. i should probably add that i have experienced parapsychological phenomena at certain moments in my life. what i found most incredible, in both senses of the word, about the ufo sighting was a) its apparent immensity b) the nature of its force. it gave me the impression being extrememly concentrated. c) about a year later i took a walk across hyde park following roughly the same route to bayswater obviously with the sighting in mind. what i remembered then was that the afternoon of sighting appeared to occur, in terms of motion and atmosphere, in slow motion. i had a definite sense of the dreamlike about the day though i testify that it did occur as i state it. coincidentally, i happened to flick my tv over one evening, about three months, to a programme i rarely watch, richard and judy, a popular early evening chat programme on channel 4. i was about to flick over again when i heard the word 'ufo' which immediately grabbed my attention. an airline pilot was being interviewed about his sighting from his plane of a huge ufo he reckoned to be about a mile long. the recent sighting in texas which, via the net, led me to your organisation, suggested a ufo a mile long. david menzies 16\\1\\08 london"],"map":"<A HREF = \"http://maps.google.com/maps?q=51.510269,+-0.122895(8930)&iwloc=A&hl=en\"> mufon case (8930) map </A>","Tags":"City","trends":["There have been 91 other sightings in London","There were no other sightings in London on or around August 31st 1992"],"Log Number":"GB-01162008-0016","Sighting Duration":"Undisclosed"}