{"Object Flight Path":"Undisclosed","City":"Lake Havasu City","Weather Factors":"Unknown","Summary":"appeared to be a large burning stone meteorite, about to fall to the earth","Latitude":"34.488311","files":["/var/www/straped/mufon/html2text/8932.html.txt","/var/www/straped/mufon/org/8932.html"],"Object Features":"Undisclosed","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"01/30/2007 12:00 UTC","Date Submitted":"01/30/2007 12:00 UTC","Tags":"City","divs":["Sighting Detailsi was a dealer at the city [every sunday] swapmeet + was getting my booth ready in early morning . just before daybreak, i noticed a yellow flickering & looked up + saw what ,at first impression, was a fireworks- roman candle- shooting from the northwest [ lake side], headed southwest towards the bill williams river. + i thought a boat on the lake fired it. then in a instant, i saw it was a BIG object, like a stone on fire, burning hot white + red + yellow, + traviling slow as a big millitary jetplane. there were chunks of red hot smaller pieces breaking off + flowing back along the tail of the main head body [ maybe i saw 3 of them] then as i watched in amazment as the thing just burned out! + stopped burning + for a moment i could see the glow of the head of the object as a light dull red pink. + then it dissapeared into the dark sky + was heading south west towards a mountian range over there. it looked exactly like all the pictures of \"a mereorite fireball\", that i ever saw! i listened real intently, to see if i could hear any swish or boom. + i NEVER heard a sound from it. other swapmeet dealers saw it too + described to me exactly what i saw., so im not crazy! i think it was a stone meteorite + it slowed down + quit burning + fell not far from havasu city in the hills- maybe 20 miles away??? it weighed maybe 100 lbs or more??? + was going at 500-1000 miles per hour + was a mile up in the air. this is only a guess? i called a guy in that town who hunts + sells meteorites, + he thought i was pulling his leg! he said that there would had been lots of booming as it broke the sound bearier. im confused, but that what i saw+heard, exactly!. joeadams, idaho. email me if you have anything to add to this story- speedysharp2@hotmail.com not sure of the date, but jan-feb on a sunday morning 600-700.,07 about one year ago. i was a AZ. winter visiter [snowbird]"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.488311,+-114.318575(8932)&iwloc=A&hl=en\"> mufon case (8932) map </A>","Longitude":"-114.318575","Country":"United States","Region":"Arizona","Object Shape":"Fireball","Viewing Distance":"Unknown","trends":["There have been 30 other sightings in Lake Havasu City","There were no other sightings in Lake Havasu City on or around January 30th 2007"],"Log Number":"US-01162008-0018","Case Number":"8932","Disposition":"Unknown"}