{"Region":"Rhode Island","map":"<A HREF = \"http://maps.google.com/maps?q=41.819712,+-71.366954(8935)&iwloc=A&hl=en\"> mufon case (8935) map </A>","trends":["There have been 11 other sightings in East Providence","There were no other sightings in East Providence on or around June 10th 1968"],"Object Shape":"Circle, Fireball","files":["/var/www/straped/mufon/html2text/8935.html.txt","/var/www/straped/mufon/org/8935.html"],"Date of the Event":"06/10/1968 07:00 UTC","Disposition":"IFO","Weather Factors":"None","Country":"United States","Log Number":"US-01162008-0021","Summary":"See below","Object Flight Path":"Stationary","Latitude":"41.819712","Case Number":"8935","Date Submitted":"06/10/1968 07:00 UTC","Tags":"City","Object Features":"None","Source":"MUFON","Viewing Distance":"Unknown","Sighting Duration":"00:15:00","Longitude":"-71.366954","divs":["Sighting DetailsI like to start by saying i don't believe in UFO's but i have to get this off my chest. Back in (approximately) 1968 when i was 10 yrs old two friends and i were returning from a walk, we took a left on brown street in East Providence heading home when all of a sudden i noticed what appeared to be two full moons. I remember pointing up and saying \"hey\" look! two moons and we all started laughing and kept walking, when all of sudden we looked up again and noticed that one of the full moon looking objects was hovering right above us so we screamed and ran home and told our parents. My neighbor heard all the excitment and came over to see what happend so we told her what we saw and she said it had to be a weather balloon so we blew it off even though i wasn't convinced. The object made no noise or wind and disappeared in seconds. It had this lite orange transparent glow to it that i'll never forget. If i remember clearly the other object was indeed the full moon. Can you check your files and see if there were any other similiar sighting around the area,year and time that i indicated,thanks."],"City":"East Providence"}