{"Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-01162008-0029","Country":"United States","Object Shape":"Triangle","Longitude":"-87.143885","trends":["There have been no other sightings in Island","This sighting has never been favorited."],"Object Flight Path":"Hovering then path","Date of the Event":"03/31/1994 08:00 UTC","Case Number":"8943","divs":["Sighting DetailsWife, myself and baby coming home from sister in-laws. Some of the details are faint seeing this was in 1994.(I just found this site today) At around 8:00 pm we had just passed through Island,Ky on hwy 431 south and was starting down a small hill onto about a mile long straight away with fields on each side when my wife and I noticed a very bright white light shining down from the sky at what looked to be at the end of the straight away we were on. This light was not moving just hovering above the ground at maybe 500 ft or less, which led us both to believe it was a helicopter.As we approached the end of the straightaway we were on the light was almost directly overhead and still glowing. We were both looking out into the field to see what was happening and trying to figure if this was a helicopter or not. I pulled the car off onto a gravel driveway and the light went out instantly, I got out of the car and could make out an object overhead. This is way out in the country and it is dark and quiet at this time of the night. The odject was very dark and only a outline could be made out. It appeared to be triangular in shape with the edges more rounded the squared and now that the bright light that was coming from the bottom was no longer on there were no lights at all that could be seen anywhere on this object. That was when I realized it was making no sound at all. I told my wife to turn the car off and listen, you could hear the insects and this object was 500' or so directly overhead. Then it started to move at a NNE direction across the road and the adjoining field. It did not just blast away but at a slow pace it just continued out of sight with no sound at all coming from it. This entire occurance lasted maybe 3 minutes at most from first seeing the light to it moving across the roadway and away.For a long time we just wrote it off as something military but the more I think about it maybe it could have been a UFO."],"Region":"Kentucky","Tags":"City","Viewing Distance":"101-500 Feet","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"37.445046","map":"<A HREF = \"http://maps.google.com/maps?q=37.445046,+-87.143885(8943)&iwloc=A&hl=en\"> mufon case (8943) map </A>","files":["/var/www/straped/mufon/html2text/8943.html.txt","/var/www/straped/mufon/org/8943.html"],"Weather Factors":"None","Summary":"Black or dark object , 500' above ground, no sound/silent, white light from bottom","Date Submitted":"03/31/1994 08:00 UTC","City":"Island"}