{"Country":"United States","Date Submitted":"01/08/2008 12:00 UTC","trends":["There have been 8 other sightings in Comanche","There was one other sighting in Comanche on or around January 8th 2008"],"Region":"Texas","Object Shape":"Fireball","Summary":"I was driving in my car and looked up into the sky to see a red light turn white and then zip off.","Case Number":"8945","Log Number":"US-01162008-0031","Longitude":"-98.603658","Weather Factors":"Unknown","Disposition":"Hoax","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/8945.html.txt","/var/www/straped/mufon/org/8945.html"],"Viewing Distance":"Unknown","City":"Comanche","Latitude":"31.897369","Sighting Duration":"Undisclosed","Tags":"City","divs":["Sighting DetailsMy husband and I were driving from Comanche, TX to Brownwood, TX South on Hwy 377 on January 8, 2008 when I saw a bright red light out of the corner of my eye up in the sky. I told my husband to look and asked him what he thought it was. I thought it was one of those towers that have 3 blinking red lights. I asked my husband what he thought it was. It then turned bright white. My husband commented that it could be a satellite . But then it faded out and appeared again just to the right of where it had originally been. Then all of the sudden there were two of them. Then, before we knew it they jetted off over the sky extremely fast. We just laughed it off, because we felt crazy for even thinking that it could be a UFO. Then we saw it on the news the other night. I couldn't believe other people had seen it too! Stephenville is getting all of the attention, but I believe that is was right over Comanche. I know it was directly over Comanche because I remember I was looking straight up out of my windshield to see it. I feel crazy for even reporting this, but I had to tell somebody!"],"Date of the Event":"01/08/2008 12:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=31.897369,+-98.603658(8945)&iwloc=A&hl=en\"> mufon case (8945) map </A>"}