{"Longitude":"-92.338163","Date Submitted":"04/30/1988 09:00 UTC","City":"Waterloo","Case Number":"8946","Summary":"Iowa UFO 1988","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/8946.html.txt","/var/www/straped/mufon/more/8946_submitter_file1__myufo.jpg","/var/www/straped/mufon/org/8946.html"],"Log Number":"US-01162008-0032","Date of the Event":"04/30/1988 09:00 UTC","Latitude":"42.501384","Region":"Iowa","map":"<A HREF = \"http://maps.google.com/maps?q=42.501384,+-92.338163(8946)&iwloc=A&hl=en\"> mufon case (8946) map </A>","Object Shape":"Disc","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Path then hovering","Weather Factors":"None","Source":"MUFON","Tags":"City","Object Features":"Dome","Country":"United States","Disposition":"Unknown","divs":["sighting detailsmy 3 friends and i were really bored one night, so we went for a drive and ended up on an out of town \\backroads adventure. we were in a mini van that had plenty of window space, and the night sky was clear, and i was enjoying the view...... ... when we saw a saucer shaped object-- in the middle of it was a row of lights that were flashing blue, red, and yellowish white. the whole row of lights appeared to be rotating - while the lights were flashing individually. we hurried up and pulled over and stopped to watch it. we just kept saying to each other, \"om my gosh! look at that!\" it was still just light enough outside to be able to see some details. and the lights were very bright colors. it hovered for a moment more and i got really afraid it was looking at us well all i remember after that was it darting to the side and in split second timing it raced away. i still have very strong emotions that surface when i think of it, even though it was many years ago--- and i have recently seen a photo that someone posted of a 1987 ufo that almost made me fall out of my chair! it was like a flash of emotional shock fear, and it took alot of courage to make this report. but i know someone who actually called to report the same sighting, and was told \"yes ,we are keeping an eye on it, thank for your concern \"...."],"trends":["There have been 7 other sightings in Waterloo","There were no other sightings in Waterloo on or around April 30th 1988","This sighting has never been favorited.",""]}