{"Date Submitted":"12/19/2007 09:20 UTC","Object Shape":"Circle","Object Flight Path":"Other","Date of the Event":"12/19/2007 09:20 UTC","Latitude":"32.088303","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=32.088303,+-98.334198(8949)&iwloc=A&hl=en\"> mufon case (8949) map </A>","Object Features":"Unknown","divs":["Sighting DetailsOn December 19th my kids and I were driving home from Dublin going south on 377 to Proctor. As we left Dublin I noticed very large orange \"circle\" just to the right of the road but WAY up in the sky. It was a bit cloudy that night so I thought nothing of it, I thought that it was probably the moon just trying to peak threw the clouds. But after we drove about 5 miles my son and I noticed that it was moving. Not moving fast but moving in differant directions. When I first noticed it, it was to the right of the road and by the time I got to the county line of Erath and Comanche it was slightly to my left. Now I know the road does curve just a tad at the county line but not that much. I called a friend that lives in Dublin to tell her to go look outside and see if she could see anything. She couldnt due to trees but she reminded me to take a picture. I grabbed my camera and took a couple of pictures but most of them didnt turn out ( blank pictures). As we drove on further, closer to home, we had to made a complete 90 degree turn in proctor, so the orange light was behind us.Note that my 9 year old was watching this light the whole time. He kept saying \"It's a UFO Mom!\" and I would just tell him its the moon. About 2 miles down that road the orange light was in front of us again just to our left! By the time I turned down our county road we had lost track of it due to tall trees. But after all this talk about seeing lights in the sky In Dublin and Stephenville, I honestly think this was something other than the moon. Oh and as for the pictures, about a week after this happened, I was going to through the pictures on my digital camera, and thought \"what do I need this for\" and deleted it. It wasn't a close up picture because of how high it was and because it was so cloudy, but it was have been interesting to share. Anyways, I was never the type to freak out or even believe in UFO's and I even feel silly telling everyone but it's ironic that other people have seen this same mysterious figure in the sky?!?"],"Tags":"City","Country":"United States","Summary":"My kids and I were traveling south on 377 when we noticed something orange in the sky....","Weather Factors":"Unknown","Log Number":"US-01162008-0035","Sighting Duration":"Undisclosed","City":"Dublin","Longitude":"-98.334198","Case Number":"8949","files":["/var/www/straped/mufon/html2text/8949.html.txt","/var/www/straped/mufon/org/8949.html"],"Source":"MUFON","Disposition":"Unknown","Region":"Texas","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around December 19th 2007"]}