{"Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8954.html.txt","/var/www/straped/mufon/org/8954.html"],"Country":"United States","City":"Cisco","Case Number":"8954","Date of the Event":"01/10/2005 12:00 UTC","Latitude":"32.388186","Object Features":"Unknown","Summary":"3 sets of 3 very bright lights. Center light much bigger than lights on each side. Then later 3 very large bright lights flashing on and off, darting, then fading.","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around January 10th 2005"],"Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Object Shape":"Flash, Other","Log Number":"US-01162008-0040","Disposition":"Unknown","Tags":"City","Longitude":"-98.979234","map":"<A HREF = \"http://maps.google.com/maps?q=32.388186,+-98.979234(8954)&iwloc=A&hl=en\"> mufon case (8954) map </A>","Date Submitted":"01/10/2005 12:00 UTC","Region":"Texas","divs":["Sighting DetailsWe were traveling from Archer City to Brownwood, Texas. Outside of Breckenridge, I told my husband to look at those bright lights in the sky. He also saw them. It almost looked liked car lights spread out with a very large light in the center (probably about 3-4 times bigger than outside lights. There were 3 sets of them in a straight line, really huge. Each light blinked off and on at different intervals, then the end lights faded out, followed by the first and second sets. Thinking this was really weird, (I figured maybe it was some kind of military pratice), I kept my eyes on the sky looking for other lights. About the time we were outside Cisco, I told my husband to look at the sky again. There were some more lights. This time there were just 3 huge bright lights in a line across the sky. They seemed to be darting back and forth. The only other way to explain it was maybe there were more lights and they flashed off and on and just looked to be darting.....Then all of them faded. I had never seen anything like this before and told my husband I figured if I ever had, I would have been scared, but I wasn't. Perhaps if I had been traveling alone, I might have been. It was a really neat and am very glad I got to experience it. By the way, when I heard others had seen them, I realized that these lights were probably over the Stephenville area. Also, I had a camera in the back of the car. I was really mad at myself when I realized I could have taken pictures. There was plenty of time to do so."]}