{"Latitude":"30.340763","map":"<A HREF = \"http://maps.google.com/maps?q=30.340763,+-97.556946(8959)&iwloc=A&hl=en\"> mufon case (8959) map </A>","Tags":"City","divs":["Sighting DetailsI was in my bedroom. I woke up at 5:10am to the sound of my alarm clock radio. I walked up to the clock and noticed that there was also a very weird creepy sound coming from outside. I turned off the alarm clock and heard the sound for about 2 minutes. The sound was a low and mid range hum that was also ocillating (going wow wow wow) but very fast. I have very good hearing I am also an audio engineer. I slowly walked to the window and peered outside. I thought I was about to see a UFO or something but I didn't see anything weird. I couldn't see my dogs because they were probably sleeping in their dog house. I could see the whole backyard and I saw nothing different. While I was looking for the source of the sound I could hear it. The sound sounded like it was right over my house. Just then my wife who was in deep sleep said sleepely \"Baby don't scare me\". She remembers hearing the sound too and said it didn't sound like anything she has ever heard before. I first thought the sound was a car or something. My brain could not identify this sound. I felt fear, curiosity, and concern. I should have grabbed my camera or my gun but I was drawn to the sound. Like myself we are both afraid of the greys and I do believe I have been abducted throughout my life. The sound lasted for a couple of minutes and then stopped. It didn't get quieter it just stopped. I had the creeps when walking out the front door."],"Object Flight Path":"Undisclosed","Source":"MUFON","Viewing Distance":"Unknown","Date of the Event":"01/15/2008 05:10 UTC","Weather Factors":"Unknown","Object Features":"Undisclosed","Case Number":"8959","Object Shape":"Unknown","Summary":"Unknown UFO sound above my house in Manor TX.","Longitude":"-97.556946","Date Submitted":"01/15/2008 05:10 UTC","files":["/var/www/straped/mufon/html2text/8959.html.txt","/var/www/straped/mufon/org/8959.html"],"Log Number":"US-01162008-0045","Disposition":"Unknown","trends":["There has been one other sighting in Manor","There were no other sightings in Manor on or around January 15th 2008"],"Region":"Texas","Sighting Duration":"Undisclosed","City":"Manor","Country":"United States"}