{"Summary":"Driving US380 East when light shined on road in front of vehicle.","Date Submitted":"12/26/2006 09:30 UTC","Tags":"City","Region":"New Mexico","Object Flight Path":"Undisclosed","Disposition":"Unknown","Case Number":"8961","Object Features":"Undisclosed","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/8961.html.txt","/var/www/straped/mufon/org/8961.html"],"Source":"MUFON","Country":"United States","Date of the Event":"12/26/2006 09:30 UTC","City":"Tatum","Longitude":"-103.317728","Weather Factors":"Unknown","Sighting Duration":"00:05:30","trends":["There have been no other sightings in Tatum","This sighting has never been favorited."],"divs":["Sighting DetailsI left Roswell, NM where I was visiting family for Christmas around 7:45pm. I was heading back to school in TX, so I drove west out of Roswell on US 380 towards Tatum, NM. The distance if my memory is right is about 72 miles. It was dark and a big storm was heading in from the north. It rained the entire trip home. I stopped in Tatum to get a bite to eat and use the restroom at the gas station there in town. On my way, out of the parking lot I was pulled over by the local police who sent me on my way. I proceeded on US 380 West, It was dark, and raining, there werent very many cars on the road at the time when I was about 10 miles Texas side of Tatum. I was listening to cds and smoking a cigarette, when a bright light shot down from the sky and proceeded to brighten the road in front of me for atleast 5 minutes. I pressed my face as far to the windshield as possible without loosing control of the car and looked up, and all I could see was a bright light, no fiqure, just a solid bright white light. It appeared to be possitioned directly above my car, though the light remained on the road ahead. The light vanished, and it was dark again till I passed the next car a couple miles down the road. My heart was racing the entire time, I couldnt believe what was happening, I had driven this road and many in the area at night before and never has this happened. I honestly cannot explain it."],"Log Number":"US-01172008-0001","map":"<A HREF = \"http://maps.google.com/maps?q=33.257057,+-103.317728(8961)&iwloc=A&hl=en\"> mufon case (8961) map </A>","Viewing Distance":"Unknown","Latitude":"33.257057"}