{"divs":["Sighting DetailsI don't know what this was, but it's pretty clear what it was not. I'm 46 years old and have been watching the sky when it's absolutely clear since I was a young kid. I was out walking my dog on the lake and the sky was completely clear. I looked up and started to catch a falling star out of the corner of my eye. It was the coolest falling star I'd ever seen because it didn't burn up within a nano second of my spotting it. After another second or two I started to realize what I was looking at wasn't typical at all. It was burning, but not burning up and it was getting bigger. Turns out it wasn't falling, but traversing the sky. I have no idea how big it was because I don't know how high it was in the sky. It traversed the sky to the point of disappearing in about 12-15 seconds. It normally takes a jet that is moving to the point of disappearing at least a couple of minutes if not more (I should point out that they are either landing at MSP or leaving MSP). I haven't told many people about this. It's pretty clear to me what it was not. What exactly it was, I don't know. It was moving very fast and on fire, like it had just broken into our atmosphere (the fire suggested that as well given it was more on the front). It was probably much higher than I estimated too, which means it was also large, possibly quite large, but that is speculation. After time, you start to brush it off, but after hearing about the Texas town seeing the UFO I had to write about it. I emailed the local tv station weather departments and the claimed to not hear anything about it from anyone else. I still haven't heard about anyone else seeing this, which is unlikely given how clear the sky was. If you're reading this and saw the same thing, feel free to contact me."],"Case Number":"8965","Date Submitted":"01/09/2008 12:00 UTC","Country":"United States","Log Number":"US-01172008-0005","Disposition":"IFO","Object Shape":"Fireball","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Minnesota","Summary":"Falling star that wasn't falling, not burning up either","files":["/var/www/straped/mufon/html2text/8965.html.txt","/var/www/straped/mufon/org/8965.html"],"Date of the Event":"01/09/2008 12:00 UTC","Latitude":"44.903296","Longitude":"-93.566346","Tags":"City","Object Features":"Undisclosed","trends":["There have been no other sightings in Excelsior","This sighting has never been favorited."],"City":"Excelsior","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=44.903296,+-93.566346(8965)&iwloc=A&hl=en\"> mufon case (8965) map </A>"}