{"Longitude":"-98.195093","trends":["There have been 74 other sightings in Stephenville","There were 2 other sightings in Stephenville on or around January 16th 2008"],"Weather Factors":"Unknown","Region":"Texas","Disposition":"Unknown","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsAround 10:40 pm, temperature around 40 degrees. Large bell shaped object moving around FM 205. Shortly after disappearance, another jet team flew by same as JAN. 8th sighting. They flew about a mile above the ground, less than half a mile apart going South- South West. I was sitting inside my house watching TV when I heard my Blue Heeler barking uncontrollably and heard my horse's galloping about the pasture. I went out on my back porch to see what was going on and saw the \"UFO\" hovering about half a mile above ground in the pasture next to our house. It had oval shaped bright white lights that danced about. Often making triangle shapes and then submerging into one bright light. I figured it had been there for quite some time seeing as for about an half hour my electronics in my house where making strange humming noises and having satellite disturbances with my Direct TV. I heard the jets from a distance, looked like they were coming from the Ft. Worth area. When I looked at the jets and looked back to the hovering UFO, its lights blinked 4 times, went black and quickly shot off to the south towards Hico. Also, in addition to the JAN 8th sightings. I remember heading back on 281 South bound when I spotted several us government issued cars- liscense plates stating so. I text my husband that I thought maybe the president was heading back to texas when I came to a stop at Rocky Point Baptist church when I saw strange lights. Followed by the two low flying jets. I'm trying to contact my wireless dealer so I can gain info on what times those texts were sent so I can give an exact time of which I saw the lights and jets fly over head."],"Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/8967.html.txt","/var/www/straped/mufon/org/8967.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Teardrop","Log Number":"US-01172008-0007","Date Submitted":"01/16/2008 10:39 UTC","Object Flight Path":"Hovering then path","Latitude":"32.223186","City":"Stephenville","Case Number":"8967","Tags":"City","Country":"United States","Summary":"Mile Long, bell shaped. Bright white lights","map":"<A HREF = \"http://maps.google.com/maps?q=32.223186,+-98.195093(8967)&iwloc=A&hl=en\"> mufon case (8967) map </A>","Date of the Event":"01/16/2008 10:39 UTC"}