{"Weather Factors":"None","divs":["Sighting DetailsI was in the country right outside fortworth near Benbrook Lake and I was at my friend's \"horse-back riding instructor getting ready to have a lesson and I went out of her house and went to go get her pony and I was just staring of into space looking for shooting stars like I had been the past few nights and I saw what I thought was just a regular airplane flying to Chigago or wherever and as I looked closer I didnt see the usual blinking red light I saw what looked to be like a an aircraft that was really high but seemed to be huge with a really big really bright light it seemed at times it went really fast and at other times it didnt seem to hardly move. I took the pony in the barn and walked to my friends house I was standing on the porch to take another look and as I concentrated on the aircraft I could hear a noise. I went inside and told them what i had seen my mom and her came outside and looked they told me it was probably military menuvers. As I stared at the aircrafts again the noise didnt sound like a jet and it didnt sound silent like an airplane that i would usually see going over. It sounded more like the ships from Independence Day and War of the Worlds. As I saw them go further in the distance I dismissed the whole convesation."],"trends":["There have been 3 other sightings in Crowley","There was one other sighting in Crowley on or around January 13th 2008"],"Tags":"City","Log Number":"US-01172008-0008","Latitude":"32.579025","Object Shape":"Unknown","Summary":"Airplane like aircraft making strange noise an bright light bigger than a star and brighter","Viewing Distance":"Over One Mile","Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/8968.html.txt","/var/www/straped/mufon/org/8968.html"],"Object Flight Path":"Path then hovering","Date Submitted":"01/13/2008 07:30 UTC","Date of the Event":"01/13/2008 07:30 UTC","Region":"Texas","Longitude":"-97.362517","City":"Crowley","map":"<A HREF = \"http://maps.google.com/maps?q=32.579025,+-97.362517(8968)&iwloc=A&hl=en\"> mufon case (8968) map </A>","Case Number":"8968","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"00:05:00"}