{"divs":["Sighting DetailsI noticed others at the beach looking up at something so out of curiosity I began to scan the sky to see what they were looking at. I could not at first see anything in the clear blue sky in the direction they were looking. It was maybe two thirds of the way from the horizon to direct overhead - approximately northwest of Vancouver city - I was at the University of British Columbia at Wreck Beach. I did not talk to them until I saw a very very small black dot against the otherwise clear blue sky. The dot did not seem to move or change in color or shape - it was static. I then asked them what they saw and they told me they didn't know but it was a small black circle. We looked at this dot for maybe one minute and more and more people saw it - perhaps six. Suddenly as I was looking at it it just seemed to vaanish into thin air without moving or changing in any way. I did not see it any longer and I asked others if they could see it and noone could see it again. I scanned the sky but could not find it or anything else unusual again. I thought the object could have been a distant black balloon or a very very distant hovering craft of some kind - perhaps an unconventional military aircraft as there is an air force base not far away on Vancouver Island."],"Source":"MUFON","Object Features":"Unknown","Disposition":"Unresolved","Summary":"I looked up in the clear blue sky and saw a very small or very distant black circle in the sky not moving","map":"<A HREF = \"http://maps.google.com/maps?q=49.269426,+-123.106937(8969)&iwloc=A&hl=en\"> mufon case (8969) map </A>","Log Number":"CA-01172008-0009","Country":"Canada","trends":["There have been 33 other sightings in Vancouver","There were no other sightings in Vancouver on or around August 9th 2000"],"files":["/var/www/straped/mufon/html2text/8969.html.txt","/var/www/straped/mufon/org/8969.html"],"Region":"British Columbia","Case Number":"8969","Date Submitted":"08/09/2000 12:00 UTC","Object Flight Path":"Stationary","Date of the Event":"08/09/2000 12:00 UTC","Object Shape":"Circle","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-123.106937","City":"Vancouver","Viewing Distance":"Unknown","Latitude":"49.269426","Weather Factors":"Unknown"}