{"Case Number":"8975","Log Number":"US-01172008-0015","trends":["There have been 11 other sightings in Granbury","There were no other sightings in Granbury on or around January 8th 2008"],"Sighting Duration":"Undisclosed","Object Shape":"Blimp","Date Submitted":"01/08/2008 08:50 UTC","Object Features":"Other","Weather Factors":"None","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/8975.html.txt","/var/www/straped/mufon/org/8975.html"],"Summary":"large, low flying, two blinking red lights, quiet, slow, two jet at the rear or turbinds,","Date of the Event":"01/08/2008 08:50 UTC","Longitude":"-97.787357","Object Flight Path":"Straight-line path","Disposition":"IFO","City":"Granbury","Region":"Texas","Source":"MUFON","Tags":"City","Country":"United States","Latitude":"32.445293","map":"<A HREF = \"http://maps.google.com/maps?q=32.445293,+-97.787357(8975)&iwloc=A&hl=en\"> mufon case (8975) map </A>","divs":["Sighting DetailsI was in my car to take back some DVD rentals, Around 0900 pm on Jan 8 2008. Heading southeast to Acton Tx. The blimp size craft fist came from over my left shoulder.I was at a the stop sign on Hideaway bay and Meander. I watched it and thought that it was too low for a commercial airline. So I thought it was Military and it was going to land in Fort Worth. The large craft was not to loud maybe a hum like a generator. It looked like there was to jets following it on both sides at the rear.I can not recall how may lights, but I belive there were a red lights rear and front. Not too bright but blinking. Then when I was on FM hwy 4 it was in front of me. Now the the jets that look like it was following the Large plane (about the size of a military bommer,I think from pictures I have seen ),look more like big turbines(jet engines) you see on planes. Only one on each side but large. It moved slow,low and steady , heading southeast from Granbury, TX. I just lost interest. Did not think anything about it. Till I heard there were other sightings. And the Military denies any activity that night. Please let me Know if there is an explaination to this."]}