{"Tags":"City","Summary":"I witnessed a bullet shape object","files":["/var/www/straped/mufon/html2text/8981.html.txt","/var/www/straped/mufon/org/8981.html"],"Source":"MUFON","Object Features":"None","Log Number":"US-01172008-0021","Longitude":"-82.351759","Case Number":"8981","trends":["There have been no other sightings in Greater Sun Center","This sighting has never been favorited."],"Object Shape":"Bullet, Missile","map":"<A HREF = \"http://maps.google.com/maps?q=27.718086,+-82.351759(8981)&iwloc=A&hl=en\"> mufon case (8981) map </A>","Date of the Event":"01/16/2008 06:01 UTC","Sighting Duration":"Undisclosed","divs":["Sighting DetailsI was on the back patio with a friend at 6:00 PM. I was placing steaks on the grill when my friend said look at that. He immediately said what is that? I looked up and spotted a small bullet shaped object traveling quite fast in a straight line to the West, Northwest. It was comletely quiet and traveling at about 1500 ft. elevation. It appeared to be moving in a level straight line. It was difficult to judge the speed but, it was moving under power and was out of sight in about six seconds max. It was not dark yet and the sky was overcast. The object was dark in color and did not have any lights on it. It was not raining but, there were some wind gusts so, I know the onject was not a balloon because the wind did not have any affect on it. It was definately moving under some kind of power. The object was not a small airplane because, it did not have any wings. There was no visable signs of propulsion. The object did not have any wings, propellers, engine flame, or smoke trail. I would estimate the object to be approximately 15-20 foot long and 6 to 8 foot wide."],"Date Submitted":"01/16/2008 06:01 UTC","City":"Greater Sun Center","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None, Does Not Apply","Latitude":"27.718086","Object Flight Path":"Straight-line path","Disposition":"Insufficient Data","Region":"Florida","Country":"United States"}