{"Object Features":"Unknown","Date Submitted":"01/16/2008 08:30 UTC","City":"Caseyville","Source":"MUFON","Summary":"Triangle like object with 2 white lights and a flashing red one zoomed high and low in a cornfield off of Collinsville Road.","map":"<A HREF = \"http://maps.google.com/maps?q=38.636716,+-90.025661(8984)&iwloc=A&hl=en\"> mufon case (8984) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Object Shape":"Triangle","Country":"United States","Region":"Illinois","Disposition":"Unknown","Viewing Distance":"21-100 Feet, 101-500 Feet","Longitude":"-90.025661","divs":["Sighting DetailsAt approximately 8pm CST on January 16, 2008 I took my dog out for a walk. It was a relatively clear night. We walked to the end of our neighborhood (The Landings at Far Oaks) and stood in an empty lot. Directly across from our neighborhood is a large cornfield. The cross street is Old Collinsville Road. My dog likes this empty lot and while she was sniffing around I glanced up and thought I saw an airplane flying low to the ground. The plane appeared to behave strangely--- suddenly zooming up and then going low. I kept watching and then it started coming towards me and I could not believe what I saw! I am not 100% certain but I think it was gray and had 2 bright white lights in front. On the side there was a red flashing light. I think triangle shaped is the best description, but it was dark and I was freaked out and can't be 100% sure. Also, it was silent. I panicked and ran home as it appeared to hover behind me. While I was running I was too afraid to look back. There were lots of lights on in several homes and one house seemed to be having a party (5-7 cars parked on the street). However, I don't know these people and was too embarrassed to knock on the door about a UFO. I also did not know who to call. Maybe I should have called the police. I then watched the UFO from my driveway. It continued to go high and low and I couldn't find binoculars and didn't have a camera. However, within about 30 minutes there were several airplanes in the sky and a large, very loud craft that I suspect was a military helicopter. This craft was definetly chasing the UFO and stayed in the area back tracking for at least 40 minutes. There were 2 small planes from a distance that seemed to be flying too close together, but I'm pretty sure they were small personal aircraft and probably were looking for the UFO. There seemed to be an unusual number of airplanes in the sky last night. I lost sight of the object because I was too afraid to get in my car and follow it. Today, I very much regret that I did not do exactly that, but I was alone and don't know my neighbors. I wish that my name does not appear on the internet. However, if you want to ask me any additional questions please feel free to call me on my cell phone listed above. Although I'm not sure if I would be able to provide any more relevant information. Today I am really wondering if anyone else witnessed this event. For the record, I have always believed in the existence of UFO's. However, I NEVER expected to see one up close!! I don't read about UFOs or watch tv specials about them. However, I did watch a special called UFO in Illinois on the Travel Channel about 6 months - 1 year ago. I was just flipping the channel and the show caught my attention because I had just moved here; the show was a detailed account over several hours about a flying object that police chased for several hours in the surrounding communities where I live. I now wonder how many UFO sightings occur in this area (I am a city girl from Atlanta, Washington D.C., Philadelphia and Chicago-- this is all quite unbelieveable to me!!!!!)"],"Case Number":"8984","Date of the Event":"01/16/2008 08:30 UTC","Log Number":"US-01172008-0024","Latitude":"38.636716","trends":["There have been 4 other sightings in Caseyville","There were no other sightings in Caseyville on or around January 16th 2008"],"files":["/var/www/straped/mufon/html2text/8984.html.txt","/var/www/straped/mufon/org/8984.html"],"Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}