{"Sighting Duration":"Undisclosed","Object Features":"Dome","Date Submitted":"04/11/2001 12:00 UTC","divs":["Sighting DetailsUFO appeared moving thousands of miles an hour. The UFO slowed and turned and went into the foggy translucent brownish cloud and disappeared as a another craft shot out and shot off in the same direction the 1st craft appeared from the west. I believe my brother and I witnessed a portal, WHICH APPEARED BEFORE THE UFO ARRIEVED. It happened so fast the speeds were incredible as the craft looked like a time laped film, where the shutter is opening and closing. It was silver as was the second craft that appeared when the 1st entered the portal. We were sitting in the front yard which we did every morning in good weather, my mother,sister, brother and I. My brother and I were so excited we were asking the others, ``did you see that`` although I knew Dave had because he commented at the same as we spotted the UFO,look at that!! I didnt realize til later what we had actually witness, was a portal which the UFO`s entered and left our world. I want emphasize the portal (Ive given it the name of portal to refer to a doorway) appeared before the UFO arrived!! It occurred about 200ft up just above the telephone wires and about 300ft from where we were standing. We saw the whole incident clearly. I have seem many UFOs in my life, their visit to my family started when I was 3 months old 1948. Although I believe for my mother their visits started in her childhood. I was hypnotized by Steve Fox in Portland in an attempt to retrieve those memories,but we werent able too. So we aren`t strangers to the UFO phenomenon and recognize when we see some thing unusual but this time I didnt recognize the significance of what we witnessed until much later. Linda McCraney"],"Log Number":"US-01172008-0025","map":"<A HREF = \"http://maps.google.com/maps?q=38.348802,+-120.774102(8985)&iwloc=A&hl=en\"> mufon case (8985) map </A>","Summary":"As I was gazing out accross the distance a hazy brownish translucent cloud appeared about 200 ft off the ground appeared in a cloudless clear blue sunny sky. As I was puzzling ouver the strange spot in the sky ,suddenly a movement to my left in the sky a","trends":["There have been no other sightings in Jackson","This sighting has never been favorited."],"Country":"United States","Date of the Event":"04/11/2001 12:00 UTC","files":["/var/www/straped/mufon/html2text/8985.html.txt","/var/www/straped/mufon/org/8985.html"],"Latitude":"38.348802","Disposition":"Unknown","Region":"California","Source":"MUFON","Object Shape":"Oval","Tags":"City","Longitude":"-120.774102","Object Flight Path":"Straight-line path","City":"Jackson","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Case Number":"8985"}