{"Log Number":"US-01172008-0028","map":"<A HREF = \"http://maps.google.com/maps?q=31.76733,+-106.478531(8988)&iwloc=A&hl=en\"> mufon case (8988) map </A>","Tags":"City","Summary":"approx. 5 ft. long rectangular object, with each end jetting upwards an addntl foot,","Disposition":"IFO","Case Number":"8988","Date of the Event":"08/16/2007 12:00 UTC","Object Flight Path":"Straight-line path","divs":["Sighting Details We were cruising through the Texas desert outside of El Paso, visiting family in the area, and through the windshield a movement caught my eye. It was bearly visible at first because the construction was similar to that of something you would make with an erector set, and you could see right through the metal frame work to the sky behind it. It's body was rectangular, maybe 2feet tall, and 5 feet long, and on each end it went up about a foot higher, with what I supposed was maybe a propeller on each end potentially, since it had a \"huey\" helicopter look to it and it looked like it had some little landing legs underneath it. I know for a fact that we were crossing some military base at the time, but there was not a building or offramp for many miles, and this little thing seemed to be too far in the middle of nowhere to be radio controlled. It slowly crossed the windshield from far right to left, about 200 ft. up, perpindicular to the freeway. I remember thinking it was so strange to see this intelligently made small pseudo-helicopter in 120 degree heat, and as I looked out my driver window as we crossed paths, this little machine was moving perfectly on some straight pathway towards the desolate rock landscape. I could only theorize that it was some military secret large radio controlled device, but miles from anything in sight seemed just too hard to believe, but if we did make it, very impressive."],"Object Features":"Appendage(s)","files":["/var/www/straped/mufon/html2text/8988.html.txt","/var/www/straped/mufon/org/8988.html"],"Sighting Duration":"Undisclosed","Latitude":"31.76733","trends":["There have been 39 other sightings in El Paso","There were no other sightings in El Paso on or around August 16th 2007"],"Weather Factors":"Windy","Viewing Distance":"101-500 Feet","Longitude":"-106.478531","Object Shape":"Square, Rectagular","Source":"MUFON","Country":"United States","City":"El Paso","Date Submitted":"08/16/2007 12:00 UTC","Region":"Texas"}