{"Weather Factors":"Does Not Apply","divs":["Sighting DetailsMy son was coming home from the store around 9Pm. As approaching our house, from the road, he could see an object hovering over our home. As he was turning into our driveway, he was flashing his car lights at the object and it appeared to turn and acknowledge that it saw him. It then flew over to the neighbors barn. My son ran inside to get us and me and my two daughters and daughter in law all went onto the front porch and saw the object. It hovered and then would fly different places. We observed other airplanes coming into our area around this time and circling above us as if they were looking for the object. This went on for like 30 minutes. Most of our neighbors and (as we found out the next day) many people in the county and neighboring towns also observed it. My home was the home that Gene Winters lived in and reported a UFO sighting in April of 2004. Needless to say, we are a bit concerned that yet another UFO has come here and our government obviously knows about this. No one reported this to the newspapers? There was nothing in today's papers or on the news despite hundreds of witnesses! Melissa Bex"],"Region":"Indiana","Date Submitted":"01/16/2008 09:00 UTC","Disposition":"Unknown","Sighting Duration":"00:45:00","Object Features":"Window(s)","Case Number":"8989","Date of the Event":"01/16/2008 09:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.866153,+-86.077494(8989)&iwloc=A&hl=en\"> mufon case (8989) map </A>","Latitude":"40.866153","Summary":"Different colored lights, could change shapes, made no noise, hovered","Object Shape":"Triangle, Other","Longitude":"-86.077494","Log Number":"US-01172008-0029","City":"Denver","trends":["There has been one other sighting in Denver","There were no other sightings in Denver on or around January 16th 2008"],"Tags":"City","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/8989.html.txt","/var/www/straped/mufon/org/8989.html"]}