{"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/8990.html.txt","/var/www/straped/mufon/org/8990.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.670257,+-117.325562(8990)&iwloc=A&hl=en\"> mufon case (8990) map </A>","Sighting Duration":"Undisclosed","Disposition":"IFO","Latitude":"33.670257","Object Flight Path":"Hovering then path,Path with directional change","divs":["Sighting Details I'm not to good with compass directions or longitude and latitude but I will try my best. My daughter and I were on our way to pick up my 9 year old son from school. It was approximately 2:05pm we were on the 15fwy headed west from Temecula to Murrieta and merging right onto the 215fwy to go north, when a bright shiny light in the sky caught my attention. I looked up and saw 4 or 5 bright metallic shiny lights out in the distance above the hills of what seemed to be the Lake Elsinore area. I screamed at my daughter, \" Oh my god, what is that?\" she looked up and as she did the lights seemed to have moved slightly and now looked to be 7 or 8 lights that were in some sort of formation or could possibly be part of a single disc shaped object. Within seconds it went behind the hills and disappeared. The sighting lasted about 20 seconds. As I drove I tried to watch for it again but it never reappeared. We spent the rest of the day trying to figure out what it might have been. I've never seen a plane just sit in the sky and not move. Nor have I ever seen a plane or anything else for that matter change shapes or formation like that. I was very excited and my heart was racing. It gave us something to ponder for a while."],"trends":["There have been 12 other sightings in Lake Elsinore","There were no other sightings in Lake Elsinore on or around January 17th 2008"],"Case Number":"8990","Region":"California","Longitude":"-117.325562","Log Number":"US-01172008-0030","Weather Factors":"Windy, Medium","City":"Lake Elsinore","Object Features":"Unknown","Object Shape":"Circle, Oval","Date of the Event":"01/17/2008 02:05 UTC","Country":"United States","Tags":"City","Source":"MUFON","Date Submitted":"01/17/2008 02:05 UTC","Summary":"4 or 5 metallic bright shiny ball shaped objects in the sky above the hills that changed positions then appeared to be at least 7 lights in a circular shape."}