{"Summary":"lights in a triangle that did patterns and then moved away and disappered","divs":["Sighting DetailsI was leaving my mom and dads house and we were out in the front by my car and these really bright lights happened to be on top of us. We all looked up and watched a very calculated light dance (that's what I call it) and from a triangle the lights met each other in any direction that the others were coming from. They did that for about fifteen to twenty min. and them they all met at the middle and took on another shade of light and stayed there for awhile and then all of a sudden it looked like one light and it disappered and we were all standing there like we were really scared because it felt like if we were there but really not. Pretty powerful to explain. I also saw something in the sky when I was moving from Gorman to Cisco. I saw somthing in the sky that made me pull off the side of the road because there was a very large cigar shaped something in front of me and I really could not move or take a breath so I had to pull over and my mom was behind me and came up to my car to see what was the matter and I told her and she said she say it also. We were driving in the middle of the day and I am still freaked about that one. I will never forget."],"Viewing Distance":"Unknown","City":"De Leon","Date Submitted":"05/12/1989 12:00 UTC","Object Features":"Undisclosed","Longitude":"-98.526182","Latitude":"32.117754","Sighting Duration":"Undisclosed","Date of the Event":"05/12/1989 12:00 UTC","Object Flight Path":"Undisclosed","Tags":"City","Log Number":"US-01172008-0032","files":["/var/www/straped/mufon/html2text/8992.html.txt","/var/www/straped/mufon/org/8992.html"],"Country":"United States","Region":"Texas","Object Shape":"Other","Case Number":"8992","Disposition":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.117754,+-98.526182(8992)&iwloc=A&hl=en\"> mufon case (8992) map </A>","trends":["There have been 13 other sightings in De Leon","There were no other sightings in De Leon on or around May 12th 1989"],"Weather Factors":"Unknown"}