{"Source":"MUFON","Log Number":"US-01182008-0001","Date Submitted":"11/07/2007 02:00 UTC","Date of the Event":"11/07/2007 02:00 UTC","City":"Joyce","Weather Factors":"Rain, Unknown","Summary":"While observing a jet contrail (chemtrail) I saw a bright stationary sphere that eventually moved slowly","Tags":"City","divs":["Sighting DetailsI had been observing jet trails more closely in this area of Puget Sound for the past few months while outside working or walking since hearing about \"chemtrails\" reported by someone I met in Port Angeles. Sometimes the trails disappeared relatively quickly like normal jet contrails but some days there were trails laid down in hooked patterns, crisscross patterns or lines that stayed for hours spreading and changing into cloud formations. I have taken photographs and shared them with others. Most days the trails can be seen being laid down west of where we live and then they blew over our area with the normal westerly winds on the Strait of Juan de Fuca. I have seen them laid down during the day and at night with moonlight. I was out walking on a cloudy day when I heard an airplane and looked up to see a circular patch of blue sky with a thick jet trail being laid down behind a plane overhead heading in a northwestly direction towards Vancouver Island, Canada. I then saw a bright sphere east of the trail that was not moving. Initially I thought I was viewing a planet or star in broad daylight, but after a while it moved slowly at a perpendicular angle over the top of the chemtrail in a westerly direction until it slowly disappeared behind cloud cover. In reading about chemtrails I had seen other reports of these bright spheres or silver orbs, but they typically moved quickly in the reports. I thought if they were some known type of aircraft or weather balloon maybe they would be identified by now since they have been reported before. The movement suggests this would have been moving against the wind that day if it was a balloon and it would have to be fairly large in proportion to an airplane since it was above the plane's trail. I looked closely for evidence of wings thinking the reflection might be hiding wings, but I only saw a sphere. I did not have a camera that day."],"Region":"Washington","Country":"United States","Latitude":"48.136477","Viewing Distance":"Unknown","Object Features":"None","Longitude":"-123.734086","Object Shape":"Sphere","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Flight Path":"Hovering then path","files":["/var/www/straped/mufon/html2text/8993.html.txt","/var/www/straped/mufon/org/8993.html"],"Case Number":"8993","trends":["There has been one other sighting in Joyce","There were no other sightings in Joyce on or around November 7th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.136477,+-123.734086(8993)&iwloc=A&hl=en\"> mufon case (8993) map </A>"}