{"Longitude":"-96.908337","Viewing Distance":"Unknown","divs":["Sighting DetailsI am a school teacher, have been for over eight years. I live in Fort Worth, but last year I taught in Duncanville. To avoid morning traffic, I leave my house early every morning. On my commute to school is when I witnessed the UFO. I was heading east, to Dallas on I-20 from Fort Worth. Being very dark still on account of the sun not coming up yet, I clearly saw the object. I was approaching, and going under, some very high overpass bridges, I don't know where those are exactly, but I know it wasn't overhead street lights or me being sleepy that caused any illusions. The object appeared to my left, drivers side, it was moving very fast, totally silent, low; about thirty feet in the air and displayed an orange-yellowish color on the bottom. The shape was more saucer-oval shape; similar to a disk used to slide on snow for fun. The colors seemed darker on the outer edge and more yellow towards the center. The object was in view for about three seconds, but it was toatlly clear to me. I didn't see any other marking, lights or features, just the bottom view. It never stopped, but just flew on and disappeared from my site. It must have flown under the bridge(s) as it never appeared to change course. Let me state clearly, that in no way was it glare from an over-head street light. No way was I sleepy, groggy or distracted. No way was it reflections from any car's headlights. It was in the air, moving and I had no idea what it was."],"City":"Duncanville","Latitude":"32.6518","Date Submitted":"02/28/2007 06:30 UTC","Summary":"UFO in Dallas, Texas","Object Shape":"Disc","Object Flight Path":"Straight-line path","Object Features":"Undisclosed","Case Number":"8994","Sighting Duration":"00:00:03","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.6518,+-96.908337(8994)&iwloc=A&hl=en\"> mufon case (8994) map </A>","Disposition":"Unknown","Source":"MUFON","Date of the Event":"02/28/2007 06:30 UTC","Region":"Texas","trends":["There have been 2 other sightings in Duncanville","There were no other sightings in Duncanville on or around February 28th 2007"],"Log Number":"US-01182008-0002","files":["/var/www/straped/mufon/html2text/8994.html.txt","/var/www/straped/mufon/org/8994.html"],"Tags":"City"}