{"Sighting Duration":"00:10:00","Region":"Texas","Disposition":"IFO","Latitude":"32.902902","Object Shape":"Blimp, Cigar","Country":"United States","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.902902,+-96.56388(8998)&iwloc=A&hl=en\"> mufon case (8998) map </A>","Date Submitted":"01/12/2008 06:30 UTC","Weather Factors":"Unknown","Summary":"metallic object stationary in sky with slight drift to my right. About 5-10 degrees above the horizon line.","City":"Rowlett","Case Number":"8998","Source":"MUFON","Date of the Event":"01/12/2008 06:30 UTC","Longitude":"-96.56388","trends":["There have been 4 other sightings in Rowlett","There were no other sightings in Rowlett on or around January 12th 2008"],"files":["/var/www/straped/mufon/html2text/8998.html.txt","/var/www/straped/mufon/org/8998.html"],"Object Features":"Patterned Surface","divs":["Sighting DetailsIn light of the sightings in Stephenville, TX, I wanted to share this with you. There is a big field and wildlife preserve just down the road from my house that I take my 4x4 truck to play (and relax). The field also has a good amount of wildlife that I will sometimes just park and watch for. It is sloped somewhat and the east side has a good view of the field and a pretty wide view of the skyline. I had played in the field for most of the day-nobody else down there at that time-and decided to park up on the east edge and just watch for the hawks and other wildlife. As I was looking out across the field, I noticed what I thought was a blimp off to the west(ish). It had a metallic cast to it, meaning I could see that the surface was reflective. It had a texture in the reflection which made me feel like there were uneven surfaces reflecting light differently. I assumed it was a blimp and went back to watching the field. I glanced back at it several moments later and noticed that it wasn't moving, relative to my position-which I thought was strange. Usually, a blimp is going somewhere. I figured the blimp to be about 2 or so miles from me, based on the size that I assumed a blimp would be. It appeared to be about 300 or so feet above the ground, based on its size, its angle to the horizon, and how far away I thought it was. There were several power lines across the field, a mile or so away, and I moved my position slightly in the front seat of my truck to align the object over one of the poles so I could see if it was moving. It appeared to be drifting slightly to my right. It didn't appear to get bigger or smaller so I assumed it was moving left to right very slowly. I called my wife on my cell phone and said \"I'm watching something very interesting in the sky\" and went on to tell her what I was seeing. She made a joke about it being a UFO. I spoke with her for a moment or so, during which time the object had moved only slightly. I thought, since it wasn't really moving, I'd drive down to Centerville Rd. (which is around where I thought it would be) and see what it was doing. I left my location and lost sight of the object at that point. When I got to where I thought it would be, it wasn't there. I did not go back to the field to see if I could still see it because I still believed it was a blimp. I heard on the news reports the next day about the sightings in Stephenville and figured this may be related...or it may just be a blimp. One thing I thought of in retrospect (other than kicking myself for NOT taking a picture of it with my cell phone camera) is the fact that I was able to align it with one of the power pole with only a slight shift of my position in my truck leads me to believe the object was much further away than I originally thought."],"Log Number":"US-01182008-0006","Object Flight Path":"Stationary,Hovering then path"}