{"Viewing Distance":"Unknown","Latitude":"33.014833","divs":["Sighting DetailsMe and my girlfriend were at the farm, just finished hunting. We were up by the camper cleaning a pig that we had shot. A bright flash lit up the sky like lightning, only without the thunder, which got our attention considering clear skies and no bad weather. We both looked up and saw 2 green objects soaring across the dark sky. They seemed pretty low and a lot larger in size compared to a shooting star but moving equally as fast. We only saw the objects for 2 or 3 seconds before they dissapeared in the western sky. I can't imagine how fast the objects were moving but they semmed to accelerate until they dissapeared. We looked at each other not really knowing what it was, but went on with what we were doing. 2 to 3 minutes later we heard this \"BOOOOMMMMM\" sound off in the faint distance. It sounded like a bomb had gone off, way off in the distance. It wasn't loud but it seemed so far off that if anyone had been outside within 100 miles that they should have heard it. I thought that maybe a meteor or something had come into the atmosphere and broken the sound barrier causing the sonic boom or maybe it had hit the earth. Havn't hearing anything on the news until now, from the Stephenville sightings, I didn't figure anything hit the earth. I don't know what it was but that is the best I can explain it."],"City":"Woodson","Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"Unknown","Summary":"2 objects in sky followed by loud boom!","Object Shape":"Unknown","Disposition":"Unknown","Longitude":"-99.054239","files":["/var/www/straped/mufon/html2text/9000.html.txt","/var/www/straped/mufon/org/9000.html"],"Log Number":"US-01182008-0008","Region":"Texas","Case Number":"9000","Country":"United States","Date of the Event":"12/28/2007 07:00 UTC","Object Features":"Undisclosed","Date Submitted":"12/28/2007 07:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.014833,+-99.054239(9000)&iwloc=A&hl=en\"> mufon case (9000) map </A>","Object Flight Path":"Undisclosed","trends":["There have been no other sightings in Woodson","This sighting has never been favorited."]}