{"divs":["Sighting DetailsIt was a clear winters day, one of those days without a cloud in the sky and as clear as clear gets.I was staying on a Greek island in the Ioian Sea . I was busy preparing lunch for my faimly in the kitchen when I hear my husband screaming to come and take a look outside on the balcony at something in the sky. Well being on the second floor didn't help, I couldn't see a full view of the harbour. He kept screaming you got to see it , its right there hovering right over the small island in the middle of the harbour. The view was being blocked by the neighbors home and it was to low for me to view it. It must of come really close to the water, maybe 60 feet or so for me not to beable to view it. I waited another minute and it finally raised it self above the house and there it was this huge sphere. Now it can be discribed as a dance hall sphere that sparkles but the triangles that it was made of were much bigger. I got real close look at this thing for about 4 to five minutes. I noticed that it didn't reflect the surroundings but yet you got the idea it was a mirror, glassy look but metal. I have worked in metals my whole life and never have come accross anything like this. IT made no sound what so ever. No humming no buzzing no anything.The trees didn't sway from air currents are anything. It just slid thru the air like a hot knife thru butter. My husband first saw it while called to the town square to work on a taxi that wouldn't start. While opening the hood of the car and placing the hood stick, that is when he caught site of it.There was several people with him at the time. The local telephone company workers had noticed it and called the air force to come and check out this huge object just sitting over the middle of the harbour.Others have seen it, but like most, where frightened, even more afraid of what others would say like they are crazy. Anyway, we continued to watch this thing. I was never afraid, but for some strange reason, I thought it to be something from the future. I could only pray that they were not time travelers coming to see a huge earth quake or other event about to happen. Off into the distance , we could hear the fighter jets that were called out by the air force to come and see what people were calling in about. That is when the object began to move higher up. Then it stopped and started to move slowly and straight toward the west. When the air force fighter jets became close, it simply took off at such speed that it almost seemed to just disappear in a flash. The size of this thing was the size of a average two story 3 bedroom home.It was controlled movement and not on wind currents. It has been 38 years since I saw this object. It changed my life and opened my mind. I am happy my husband took the time to tell me to come see. Our goverments know, they just don't want us to know and many people are afraid to know. .I haven't seen anything like it since. What a great exsperience. ITs ashame so many never get the chance and if they do are afraid to talk. After 38 years, I just haven't found any other sighting that discribes what I saw. At least none I could find anywhere that tells of the same shaped object."],"City":"Ithaca","Summary":"Sphere shaped UFO hovers over harbour at noon time many see.","map":"<A HREF = \"http://maps.google.com/maps?q=42.443961,+-76.501881(9004)&iwloc=A&hl=en\"> mufon case (9004) map </A>","Log Number":"GR-01182008-0012","Case Number":"9004","Region":"New York","Sighting Duration":"Undisclosed","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Longitude":"-76.501881","Object Features":"Patterned Surface","Disposition":"Unresolved","Date of the Event":"01/14/1980 12:00 UTC","Date Submitted":"01/14/1980 12:00 UTC","Tags":"City","Weather Factors":"Unknown","trends":["There have been 7 other sightings in Ithaca","There were no other sightings in Ithaca on or around January 14th 1980"],"Object Shape":"Sphere","Country":"United States","Viewing Distance":"21-100 Feet, 101-500 Feet","Latitude":"42.443961","files":["/var/www/straped/mufon/html2text/9004.html.txt","/var/www/straped/mufon/org/9004.html"]}