{"Weather Factors":"Unknown","Object Features":"Undisclosed","Date of the Event":"05/10/1992 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.49182,+-80.855648(9007)&iwloc=A&hl=en\"> mufon case (9007) map </A>","Disposition":"Unresolved","Source":"MUFON","Longitude":"-80.855648","files":["/var/www/straped/mufon/html2text/9007.html.txt","/var/www/straped/mufon/org/9007.html"],"Object Flight Path":"Undisclosed","Date Submitted":"05/10/1992 12:00 UTC","Region":"South Carolina","Log Number":"US-01182008-0015","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 2 other sightings in Orangeburg","There was one other sighting in Orangeburg on or around May 10th 1992"],"Case Number":"9007","Latitude":"33.49182","Object Shape":"Circle, Disc","Summary":"round disc with lights floating about 65 feet in the air seen from about 70 feet away metal object making no noise.","Sighting Duration":"Undisclosed","Tags":"City","City":"Orangeburg","divs":["Sighting DetailsDriving east on I-26 from Columbia, SC to Charleston, about 35 miles west of the intersection of I-26 and I-95 I notices lights in the sky. It was just becoming dusk. I thought it was a plane. But the ligthts went around in a circle, and changed colors. Blue, orange, white yellow. They kept on in the exact same position, not going higher or lower, not moving left or right, or towards me or away. By the time I got to the intersection of I-26 and I-85 and crossed just under I-85 (it ws dark enough now to require headlights) on the left side of the highway, over a field I still look at to this day with nothing but grass and a few pine trees, about 65 feet in the air, a metal disc was floating with the lights now stopped. I was in the Eastbound land, so including the width of that lane, the median, and the west bound lanes and the distance from the edge of that to a spot directly below the object was 200 to 300 feet. I slowed down to 20 Miles per hour, opened my window, and there was no sound. I wanted to stop badly, but my wife was pregnant with our first child, and I was not sure what would happen. The only reason I am writing is right behind me was an 18 wheeler, he too slowed down to about 20 MPH and I presume looking at the object. Traffic at that moment was light, and there were no cars at that spot at that moment heading westbound, nor anyone close behind the truck. I wanted to stop and talk to the truck driver, but what awe struck and simply kept driving. I am in hopes he has filled out a report, and it could be a kind of coroboration to match our reports up."]}