{"Disposition":"Unknown","Log Number":"US-01182008-0019","Date Submitted":"01/16/2008 05:25 UTC","Viewing Distance":"Unknown","Object Shape":"Flash, Star-like","Region":"Massachusetts","files":["/var/www/straped/mufon/html2text/9011.html.txt","/var/www/straped/mufon/org/9011.html"],"trends":["There have been 5 other sightings in Wareham","There were no other sightings in Wareham on or around January 16th 2008"],"Object Flight Path":"Undisclosed","divs":["sighting detailsmy husband and i were on the way to the gym at about 5:20 am., 16 jan 2008. it was still very dark out. we drive in seperate cars since i head directly to work after working out. the gym is about 2.5 miles down the street from my home. my husband left about a minute before me. as i was driving and crossing over the highway a flash of light caught me eye above the trees, to my left. i looked up and saw lots of flashes, all over the sky. i was driving and was going to stop and watch, but then decided i wanted my husband to see this too. i quickly drove to the gym, parked and got out of the car as quickly as i could. my husband met me in the parking lot and i told him to \"look at the sky.\" he just stopped and said, \"wow.\" there were hundreds of flashing white\\yellowish round lights. it looked like a swarm. it didn't look like a meteor shower at all. the lights were all strobing on and off. they were in the eastern part of the sky. there was no sound coming from them. it was so bright and so amazing. we watched for about 5 minutes until they faded away. i don't know how we could be the only ones that saw it. i have never seen anything like it before. i don't know what we were looking at. it definitely was not helicopters or a military craft."],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.765551,+-70.710074(9011)&iwloc=A&hl=en\"> mufon case (9011) map </A>","Longitude":"-70.710074","Source":"MUFON","City":"Wareham","Tags":"City","Weather Factors":"Unknown","Summary":"Hundreds of UFOs?","Case Number":"9011","Latitude":"41.765551","Country":"United States","Date of the Event":"01/16/2008 05:25 UTC"}