{"Log Number":"US-01182008-0020","Summary":"lights in a triangle formation when i noticed they were not lights a pop sound was heard and it dropped down and went behind the car and positioned itself so that i could still see it","trends":["There have been 7 other sightings in Kettering","There were 2 other sightings in Kettering on or around March 16th 1990"],"files":["/var/www/straped/mufon/html2text/9012.html.txt","/var/www/straped/mufon/org/9012.html"],"Longitude":"-84.168827","divs":["Sighting DetailsAfter the craft went behind the car i looked back in front of the car becouse we were still driving towards the intersection i looked to see were the other two went thats when i seen airplane or jet they had regular strobes. The craft then flew next to the car, right next to me I was the passenger in the car, ther was no doubt about it was a flying thing it made no noise it darted away from me and back so fast it looked like it would get smaller as it went away and when it came back within range i swear i could of reached out the window and touched it.By this time we were approaching the traffic light it then flew in front of the car and was close to traffic light it started changing colors but not like it had lights on it but like the air around it was changing colors. We had the red light and ther was another car at the cross street their light was green but they did not move they had to be seeing what i was seeing, When i ask my wife are you seeing this she acted as though she was in a trance and said with out looking that it was a jet.Her son was sitting on my lap as it flew next to the car he was five at the time and he was stairing at it the whole time, so i know i seen what i seen,and that was weird to becouse we have always strapped our kids into the car seat.After the light changed we turned left the craft then went from right above us to a small white light it stayed visible only getting smaller the closer we got to home, we lived next to the defense electronics supply command. That was it for that night on the following day i took my wife back to work we took the same way on turning on to the road i noticed some men by the area were the craft was zooming away from the car and back again they were as intereated in me as much as i was of them, they were in unmarked trucks they did not have kettering or beavercreek logos. When inoticed them like i said they looked real hard at me creepy. That night i was kind of scared to go pick ruth up from work for one i was alone little ronnie was at his dads for the weekend anyway as i turned the corner to go past that field up in sky was one single amber colored light like the night before as soon as i seen it i thout to my self oh man i dont need this and it disappeared.Alot of other things happened after that for years some things im scared to mention on the internet plus as you can see im not much of a typist. i HAVE HAD TWO SONS OF MY OWN since then and here lately they have been seeing lights flying funny zig zag paterns around in the mornings on thier way to bus stop. i know what i saw and so does the goverment like i said weird things like helicoptors flying up from behind buildings follwing me my boy when he was two drew stange alien faces and craft i was scared for my kids as im starting to again. ihave seen cigar shaped craft in 1998 with a coworker and again it responded when i thought to my self if you can hear me stop and go in reverse and it did and the coworker seenit do this we both got scared and left in a hurry he was so scared he didnt want to talk about it.After the sightings in texas and what my boys have seen lately i am scared to."],"Case Number":"9012","Latitude":"39.689504","Date Submitted":"03/16/1990 11:05 UTC","Region":"Ohio","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.689504,+-84.168827(9012)&iwloc=A&hl=en\"> mufon case (9012) map </A>","Disposition":"Insufficient Data","Object Flight Path":"Undisclosed","Source":"MUFON","Sighting Duration":"00:30:00","Object Shape":"Egg","Country":"United States","Viewing Distance":"Unknown","Object Features":"Undisclosed","Date of the Event":"03/16/1990 11:05 UTC","Weather Factors":"Unknown","City":"Kettering"}