{"Longitude":"-98.211739","Source":"MUFON","Country":"United States","City":"Santo","Summary":"Green light moving across sky","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/9013.html.txt","/var/www/straped/mufon/org/9013.html"],"divs":["Sighting DetailsI was traveling home from work. going West on Interstate 20, a short distance from the Hwy 281 intersection. Through my windshield I saw a bright light moving across the sky on my left. The light moved from East to West and was South of the Interstate, appearing to be approximately over the Stephenville area. My first thought was that it might be a meteor shower. I immediately dismissed that idea, as it was too large and bright, was moving too slowly, and it was the only one. I then thought it was an airplane, and for a moment I was afraid that it might be a plane going down, but again it just didn't fit and there wasn't a crash. It was too low to the ground and moving too slow. It was green, not white or red like airline lights. It appeared as a single light, not multiple lights as on a plane, and it wasn't blinking. If it was an airplane the lights would have been much smaller. It did not ascend and only descended slightly and then just disappeared. It did not fade away. I immediately looked at the clock and it was 7:52 p.m. It had only lasted a matter of minutes. I knew it was something very strange and extraordinary and wanted to know the time so that I could investigate the next day. The next morning, for the first time, I heard about the other sitings in the area and knew that was what I had seen. I was, and still am, excited. It was a very unique experience, and I am glad that I saw it, whatever it was."],"Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.611839,+-98.211739(9013)&iwloc=A&hl=en\"> mufon case (9013) map </A>","Tags":"City","Date of the Event":"01/14/2008 07:49 UTC","Sighting Duration":"Undisclosed","Log Number":"US-01182008-0021","Case Number":"9013","Latitude":"32.611839","trends":["There have been no other sightings in Santo","This sighting has never been favorited."],"Object Features":"Unknown","Disposition":"IFO","Region":"Texas","Object Shape":"Unknown","Date Submitted":"01/14/2008 07:49 UTC"}