{"City":"Cisco","Summary":"UFO seen in Cisco. Flying object looked very different than any seen.","map":"<A HREF = \"http://maps.google.com/maps?q=32.390266,+-98.973634(9016)&iwloc=A&hl=en\"> mufon case (9016) map </A>","Date of the Event":"01/12/2008 07:30 UTC","Case Number":"9016","Object Features":"Undisclosed","Object Shape":"Circle","Longitude":"-98.973634","trends":["There have been 10 other sightings in Cisco","There were no other sightings in Cisco on or around January 12th 2008"],"Tags":"City","Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9016.html.txt","/var/www/straped/mufon/org/9016.html"],"divs":["Sighting DetailsI was outside of my house after sunset with my dog. I always look at the stars while waiting. I saw something flying in the sky very low. At first I thought it was a helicopter but then I decided it was too big for a helicopter. What made me decide it wasn't a helicopter first was it was flying very slow. At that point, I thought UFO. It was irratic, it was just flying slow and straight. It was very quiet, almost a hum sound and I only heard that after it had passed my house. So, I knew it wasn't an airplane. As I watched the object, it has several lights which were very bright. There were red lights that were blinking and one side it had very bright lights which reminded me of head lights and as it passed it had the same bright lights which would make me think of the back. I don't remember any green lights like airplanes have that also made me think it wasn't an airplane. The object flew very close to the ground. I waited and watched wondering if the craft was going to crash because it was so low to the ground. Looking at the lights, the object looked very big and maybe round could be round and long but I do know it was very big, much too big for an airplane. As I stood there, I remember thinking if it was an UFO, they could have taken me at anytime. I remember just standing there glued to the sight feeling like I had my mouth just gapped open. I lost sight of the object as it flew past my house to the point I couldn't see it anymore. I just stood there wondering what I just saw. I didn't say anything at first because I didn't know what I had just seen in the sky. My best friend called me from Arizona and asked if I had heard about the UFO sightings in Stephenville, Texas where I had attended Tarleton a few years ago and is located about an hour away. I said no, so I looked up the article from their local paper and the descriptions given sounded just like the same object I saw, that's when I really began to think about what I saw. My friend called and told me about the trucker who saw something over Cisco and said I needed to report my sighting. I believe without a doubt what I saw is an UFO. Not an airplane, not a helicopter, not a commercial plane. If a commercial plane was flying this low, they need to rethink their flying. Thank you for your time."],"Latitude":"32.390266","Log Number":"US-01182008-0024","Region":"Texas","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile, Unknown","Date Submitted":"01/12/2008 07:30 UTC","Source":"MUFON","Country":"United States"}