{"Weather Factors":"Unknown","Latitude":"36.121386","Summary":"The object came alongside window of airplane remained there for 30 minutes. Passengers, stewardess and pilot saw the object.","trends":["There have been 229 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around August 15th 1980"],"Date Submitted":"08/15/1980 08:30 UTC","Object Features":"Dome","files":["/var/www/straped/mufon/html2text/9022.html.txt","/var/www/straped/mufon/org/9022.html"],"Tags":"City","Country":"United States","Log Number":"US-01182008-0030","Viewing Distance":"20 Feet or Less","Object Shape":"Disc","Longitude":"-115.167496","Date of the Event":"08/15/1980 08:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.121386,+-115.167496(9022)&iwloc=A&hl=en\"> mufon case (9022) map </A>","Case Number":"9022","Sighting Duration":"Undisclosed","Source":"MUFON","Region":"Nevada","divs":["Sighting DetailsThe sighting I saw was witnessed by a vast number of people on a PSA Airline flight in 1980. The stewardess was totally freaked out. I was with two friends Bill Barth and Randy Kuolt. Randy Kuolt's father founded Horizon Airlines and Thousand Trails Campgrounds. When we deplaned, the pilot stepped up to me and said \"If you report what you saw, I will see that you ride AmTrack the rest of your life.\" I reported that pilot to PSA Airlines, in San Diego,California, by the way that airline went out of business. The pilot had no idea he was addressing a pr man, the last person in the world, you should ever try to shut up. In 1978, I did a UFO Survey to promote a disc like toy. The late J. Allen Hynek, listened to my recordings and wanted to know, if I believed in UFO's? At that time, the event in the air, aboard the PSA flight had not happened. I told J. Allen Hynek at the time, I did not know. Today I am not ashamed to proudly state \"I saw a UFO, outside the window of an airplane, traveling from Las Vegas to Los Angeles. I watched for several minutes as the object with green and red light stayed right outside that window. For years I kept the sighting quiet, the airplane pilot was very intimidating, however I know what I saw, and none who can ever change my mind, not even that idiot,James McGaha, who appears to be a man, like many of the people, in the public eye, who say and do things without any reason or truth, they just want attention. Mr. McGaha is a disgrace to the intelligent and truthful people in this country who have witnessed sightings. He makes things up as he goes along, Larry king should have better sense to have him on his show,but having placed people of the Larry King Show, he is after rating not truth or fact. One way to eliminate MaGaha is to ignore him, when that happens the luster for that idiot, will disappear. Our government knows what's up, they just can't deal with life out there, when they can't solve the problems in our own country. Can you imagine, ailen life lands in south central Los Angeles, during a gang war, cops have sealed off neighborhood. A space craft lands, ailens step out and ask the gang members, and the police, why are they are fighting each other.That is why the United States government does not want to address flying objects and a higher life form. Chris Harris Harris-DeLorean Special Events International"],"City":"Las Vegas","Object Flight Path":"Stationary","Disposition":"Unknown"}