{"Weather Factors":"None","Latitude":"31.906169","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.906169,+-98.599558(9023)&iwloc=A&hl=en\"> mufon case (9023) map </A>","trends":["There have been 8 other sightings in Comanche","There were no other sightings in Comanche on or around May 31st 1978"],"Object Shape":"Oval","Longitude":"-98.599558","Country":"United States","divs":["Sighting Details We; my two oldest boys and I , had been to Brownwood and were on our way home to Comanche. We were somewhere between Blanket and Comanche when it appeared in the sky. We pulled over to the side of the highway, along with a dozen or so other cars. I don't remember anyone getting out of their cars....the object looked huge, pulsing like a heart, and very bright, lighting up the sky. We all just sat and watched, for probably thirty minutes or so;finally the object seemed to rock backwards and then forward a time or two and then just zipped off to our left. One minute it was there, the next second it was out of sight, like a comet or shooting star, it moved faster than I thought anything could and with no effort or sound that I could hear. We all started our cars and continued on our way. I still wonder to this day, why none of us in the cars didn't get out and ask each other what had just happened. We were scared, not knowing what to expect, but I felt sure that it was a space craft. My boys and I still talk about the experience...was there a time lapse,were we contacted by the ship....who knows, we have no memory of anything like that."],"Case Number":"9023","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9023.html.txt","/var/www/straped/mufon/org/9023.html"],"Date of the Event":"05/31/1978 08:30 UTC","Tags":"City","Summary":"Awe inspiring, to see the large pulsing bright object hoovering in the night sky.","Object Flight Path":"Stationary","Disposition":"Unknown","City":"Comanche","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Region":"Texas","Date Submitted":"05/31/1978 08:30 UTC","Log Number":"US-01182008-0031"}