{"trends":["There have been 96 other sightings in Wilmington","There were no other sightings in Wilmington on or around January 18th 2008"],"Latitude":"34.226806","Disposition":"IFO","Case Number":"9024","Summary":"Variable white Bright light Coming toward us then Red & orange pulsing light as it passed us","Tags":"City","Date of the Event":"01/18/2008 09:26 UTC","Object Features":"None","Viewing Distance":"Over One Mile","Longitude":"-77.93773","divs":["Sighting DetailsAt almost exactly 9:26 P.M. My wife and I just finished watching a TV show and went outside to smoke a cigarette, At the same time I also took my dogs out. I noticed A bright light in the sky. It was wierd because it was cloudy and also fog was starting to roll in. I went over to my neighbors yard to see it clearer. ( no trees). At first the light did not move. It changed in brightness from what Mars would look like on a clear evening to what would be an aircraft with its lights on coming directly at us. It was very bright. I went in to the house to get my Binoculars. I asked my wife to get the camera. It has video capability. When I came back out it started to move just North of us heading West. I went back over to my neighbors yard to view this thing with them. All I could see was a bright light. No visible structure. As it came to be just north of us, My wife noticed that it was pulsing red NOT LIKE A STROBE LIGHT. but a slow red pulse. Each pulse would last about a second and a half. It wasn'nt exactly red either it had an orangish glow to it. My wife tried to get a video of it but as of right now, We have not looked at it. We did not see any green with it as an aircraft would. Regular aircraft Have strobes of red and green. THERE WAS NO GREEN. There was no sound at all. The light seemed to be about maybe three to four miles away. It was low in the sky because I could see the clouds above it. If you check the Cloud ceiling for this night at that time, it couldn't have been more than 7000 ft. Also the fog was just starting to roll in but hadn't arrived at my house. The object headed west slowly until we lost sight of it going behind the trees in our back yard. My wife and I discussed what we saw. I was dumbfounded at what I saw."],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=34.226806,+-77.93773(9024)&iwloc=A&hl=en\"> mufon case (9024) map </A>","Sighting Duration":"Undisclosed","Region":"North Carolina","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/9024.html.txt","/var/www/straped/mufon/org/9024.html"],"Weather Factors":"Unknown","City":"Wilmington","Date Submitted":"01/18/2008 09:26 UTC","Log Number":"US-01182008-0032","Source":"MUFON","Object Shape":"Star-like"}