{"map":"<A HREF = \"http://maps.google.com/maps?q=51.260385,+-85.316054(9028)&iwloc=A&hl=en\"> mufon case (9028) map </A>","Date Submitted":"11/30/1985 04:00 UTC","Summary":"Very Large about 3 or 4 city blocks","trends":[],"files":["/var/www/straped/mufon/html2text/9028.html.txt","/var/www/straped/mufon/org/9028.html"],"Latitude":"51.260385","Date of the Event":"11/30/1985 04:00 UTC","Country":"Canada","City":"Undisclosed","Case Number":"9028","divs":["Sighting Details The event took place roughly 20 years ago, I was a child at the time maybe ten years of age. Now what am saying here makes no sense and seems completeley impossible but I believe it to be true. I lived in a small city in Ontario Canada with approx. 20000 people. My older sister which was with me during the sighting. It was the middle of the afternoon, sunny and warm. The two of us were standing in our neighbours backyard staring up at a huge ufo, had to be the size of 3 or 4 city blocks, it was a saucer shape and hovered above a large pine tree very low to the ground and made no sound at all. Now this was the middle of the day remember with 20000 people that should have seen this enormous craft. I remember staring at it not scared, excited or anything, it was just there. We stood there staring as it hovered over our heads, next thing I knew it was getting dark we were walking home. My sister and I didn't discuss it, we were very calm, as if nothing happened at all. We talk about it from time to time now and how we should have had some type of emotion, we should have been scared, excited or something but it didn't matter it was as if it was normal. \"20000 people\" \"middle of the day\"\"enormous craft\" but not one report the next day, nobody saw a thing just my sister and I. The weird thing was the time we missed it had to be a few hours just gone. I am only putting this up here for research how can two people see this enormous thing and not one other person see it, it was so low to the ground. Use this info the way you want, I am a simple person, quiet and don't wish to be contacted, I would like to be left alone! But nobody has an account like this one and thought maybe it could open the researchers eyes."],"Object Features":"Undisclosed","Source":"MUFON","Object Shape":"Circle, Disc, Sphere","Longitude":"-85.316054","Disposition":"Unresolved","Region":"Ontario","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Tags":"City","Weather Factors":"None","Object Flight Path":"Stationary","Log Number":"CA-01182008-0036"}