{"files":["/var/www/straped/mufon/html2text/9029.html.txt","/var/www/straped/mufon/org/9029.html"],"Object Features":"Undisclosed","City":"Naubinway","map":"<A HREF = \"http://maps.google.com/maps?q=46.092496,+-85.447597(9029)&iwloc=A&hl=en\"> mufon case (9029) map </A>","Country":"United States","divs":["Sighting DetailsMackinac55 County, MI. June 1988. Weather conditions: clear, calm, twilight(dusk).Resided, hunted and fished in the exact area for 20 years(know the spot well (cut firewood and picked berries at the exact spot(I spent 9 years in the USAF as a aircraft mechanic worked many night outside sunset to sunrise and never guestioned any thing I saw.. We were riding on a two track in the deep woods looking for wildlife and talking like usual. The woods in this area are old growth forest.The 2 track we were on is like a tunnel of trees for about half mile in length. From the air Im sure you cannot see the road. I was driving slow around 3 to 5 mph.(looking for wildlife and enjoying time with my sister). We were most of the way through the tunnel of trees. I knew exackly where I was. There is a slite gradual up grade for a little bit and then you see the exit from the tunnel of trees.Up to that point the exit is not visible.( I think we surprised our UFO). Anyway as we crested the slight grade I was looking towards and talking to my sister.She said there is a truck coming( with one headlight not bright but soft white light-at this instance things faded fast, quickly. The first thing I remember- we were hunched over facing each other blinking at each other like we were just waking-up.We looked out the windshield and going across the glass( within feet-not yards), red lights (not bright) moved from front to back. The red lights were 1-2 feet long 5-6 inches wide covering the windshield, not rotating just going front to back.The wierd thing was is the craft looked translusant.Within seconds my sister starts freekingout( losing it- yelling \"Oh my #&&% what was that, lets get out of here before it come after us\". My reaction was different. First I told my sister to calm down. Then I told her I was getting out of the truck to look.She thought I was nuts.Once in a life time chance I thought to maybe see something out of this world.I got out of the truck guick enough I thought, looked all around, up down, in and out,saw nothing, no leaves moving just feet above us. What was the object?One other thing,there is a highline at the exit of the tree tunnel."],"Date Submitted":"06/15/1988 10:30 UTC","Latitude":"46.092496","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Unknown","Date of the Event":"06/15/1988 10:30 UTC","Sighting Duration":"Undisclosed","Tags":"City","Disposition":"Insufficient Data","Source":"MUFON","Longitude":"-85.447597","Region":"Michigan","Case Number":"9029","Viewing Distance":"Unknown","Summary":"guarter mile soft white light, two track, put us to sleep, slumped over, waking up within feet red lights crossed windshield slowly.","trends":["There have been no other sightings in Naubinway","This sighting has never been favorited."],"Log Number":"US-01182008-0037"}