{"Weather Factors":"Unknown","Disposition":"Unresolved","Object Shape":"Triangle","divs":["sighting detailsthree girls on a sleepover were awakened at 3 am by a bright light shining inthe bedroom window. they then observed a smallish triangular object descenedfrom 300 feet into the side yard of the home. they heard beeping, whirring andthumping sounds which they associated with its landing, but the landing spot wasout of their view.at about 3:30 the host-witness saw what she took to be a blue-hued entity (morelikely blue garmented) standing outside the glass patio door to her mothersbedroom. later all three saw this being looking in through the kitchen window.the being was described as over 4 feet tall, with large green eyes, a widemouth, and no nose, ears or hair. later all three girls saw this being.a second being, 2 1\\2 tall, appeared similar to the first one except for itsshorter height, white skin (or, again, tight-fitting apparel) and red eyes. thisone stood outside a glass door making facial gestures to the girls and a bowingtype motion.a third being was seen only fleetingly, was thought to be of a height betweenthose of the first two, and was described only as purple.at one point, while standing in the livingroom, the girls saw the doorknob to aninfants bedroom turn. they were too frightened to approach.all three screamed repeatedly for the mother of the host-witness to wake up, butshe heard nothing. apparently no definitive conclusion to the incident wasoffered. the following morning the girl took her mother outside and discoveredapproximately 15 two-inch circular depressions in the ground that formed anoverall triangular pattern. samples of the grass and soil were taken andsubmitted for testing."],"Log Number":"000219-01","Viewing Distance":"21-100 Feet","Object Features":"Undisclosed","Case Number":"903","Date Submitted":"02/19/2000 03:00 UTC","Source":"MUFON","Tags":"City","Sighting Duration":"01:59:00","files":["/var/www/straped/mufon/html2text/903.html.txt","/var/www/straped/mufon/org/903.html"],"City":"Chapel Hill","map":"<A HREF = \"http://maps.google.com/maps?q=35.91642,+-79.052094(903)&iwloc=A&hl=en\"> mufon case (903) map </A>","Object Flight Path":"Stationary","Region":"North Carolina","Country":"United States","Longitude":"-79.052094","Date of the Event":"02/19/2000 03:00 UTC","trends":["There have been 4 other sightings in Chapel Hill","There were no other sightings in Chapel Hill on or around February 19th 2000"],"Summary":"Small triangular vehicle and home intrusion in NC.","Latitude":"35.91642"}