{"Weather Factors":"None","Log Number":"US-01192008-0002","map":"<A HREF = \"http://maps.google.com/maps?q=27.673947,+-81.510174(9032)&iwloc=A&hl=en\"> mufon case (9032) map </A>","Latitude":"27.673947","Viewing Distance":"Unknown","Object Shape":"Circle, Disc","Summary":"I saw a circle shaped flying object that appeared to be rotating slowly","Country":"United States","trends":[],"Disposition":"Unknown","Source":"MUFON","divs":["Sighting Details I am 66 years old. This story happened when I was about 16 years old. After watching the UFO program on Larry King Live, it made me think of this incident. After watching the program on TV and visiting Stanton Friedman's web site, I feel inclined to tell my story. I have kept it to myself all these years, because when I tried to share it, most people thought I was crazy. Also, I had some fear of becoming a target for someone or something, I didn't know what. Since I am 66, I feel that I don't really have that much to loose. So I have decided to share it with the world. I was coming home with a friend to study for a test one night. We had been at her house studying after school, and we were coming to my house for supper and then study afterward at my house. As we were walking up the steps to my porch, I heard something that sounded like bird wings fluttering, but much louder. As I swatted my ears I turned to see a circular object hovering over me. It appeared to be rotating slowly and had flashing red, white, and blue lights all the way around its perimeter. I first thought that it was small and within arms reach. Then after about five seconds it began to move and I could see that it was much bigger and at a greater distance from me. It moved slowly at first then zoomed off straight away from me and was completely out of sight in about two seconds. It made very little sound in its flight. My friend and I ran inside and began to share our story with my parents and my sisters. We immediately realized that we had lost about two hours. We completely missed supper and the clean up following supper. My family did not believe us. They thought we were making up the story to excuse ourselves for being late. I also discovered that if I tried to tell the story to anyone, they would think I was crazy. My plans were to attend University of Florida and live at home. Someone recommended me to the U S Naval School of Music in Washington DC. And I ended up living in Washington, DC for about six years. I began to feel paranoid about that and developed a fear that some power greater that I, had planned my life to include Washington, DC. I've have never really thought that much about for many years, but this story and the experience remains vivid in my mind. I hope someone can benefit from my decision to make it public. Paul Young"],"Region":"Florida","files":["/var/www/straped/mufon/html2text/9032.html.txt","/var/www/straped/mufon/org/9032.html"],"Object Flight Path":"Hovering then path","City":"Undisclosed","Tags":"City","Case Number":"9032","Sighting Duration":"00:00:10","Object Features":"Unknown","Longitude":"-81.510174","Date of the Event":"01/19/1958 06:00 UTC","Date Submitted":"01/19/1958 06:00 UTC"}