{"Tags":"City","Date of the Event":"01/09/2008 10:00 UTC","City":"cms/tg n/a","files":["/var/www/straped/mufon/html2text/9033.html.txt","/var/www/straped/mufon/org/9033.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.971889,+-99.893873(9033)&iwloc=A&hl=en\"> mufon case (9033) map </A>","Latitude":"31.971889","Object Features":"Unknown","divs":["Sighting DetailsI have seen these strobbing lights three differant times now. The first time was approx. one month ago.Iwas coming from eastland headed to Cisco on I twenty. It was about 11:30 pm. and from out of nowhere i noticed a bright light to my left wich is south. As i looked one light was shinning then suddenly another and so on and so on until the fourth or fifth liht came on and at that time the first would go out and it just kept strobbing in that manner without gaining or loseing elevation or with no lateral movement. this only lasted for about 20 seconds then in an instant it was gone. as i drove to cisco i kept watching the skies to try to explain to myself what i had just seen.I STOPPED IN CISCO FOR SOME DEISEL AND THEN HEADED SOUTH ON HWY. 183 TOWARDS RISING STAR.i was about five miles out of Cisco when the same set of lights appeared in front of me at a distance of what appeared to be about two miles.They were approximately 1000 feet or so high.Again this only lasted a very short time but i spent the next twenty five miles to may tx.starring at the sky and seeing nothing but darkness.Then last week i was again coming from Cisco on highway 183 and it was a very clear night at about eight o clock and out of nowhere these huge bright lights appeard in the same manner as before.The lights were big and round and as they would each light up they started out dim and instantly got brighter almost like those huge spotlihts used by car dealers and stores in the big cities when they are having a grand openning or sale.I was a us. marine infantry rifleman trained in nuclear security and later worked security in D.C.and Maryland at a very secured military camp.The Marine Corps trained me for attention to detail and to always observe your surroundings.That was a must and it is something to this day that I still practice.As the saying goes once a marine always a marine."],"trends":["there have been 18 other sightings in cms\\tg n\\a","there was one other sighting in cms\\tg n\\a on or around january 9th 2008"],"Sighting Duration":"Undisclosed","Weather Factors":"None","Object Flight Path":"Stationary","Source":"MUFON","Region":"Texas","Log Number":"US-01192008-0003","Object Shape":"Unknown","Country":"United States","Summary":"BIG BRIGHT STROBING LIGHTS","Date Submitted":"01/09/2008 10:00 UTC","Longitude":"-99.893873","Disposition":"Unknown","Case Number":"9033","Viewing Distance":"Over One Mile"}