{"Object Features":"None","Summary":"Flew over US HWY 101 from east to west","Region":"California","Date of the Event":"11/26/1999 03:00 UTC","Tags":"City","Object Flight Path":"Straight-line path","Disposition":"Unknown","Country":"United States","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/9034.html.txt","/var/www/straped/mufon/org/9034.html"],"Log Number":"US-01192008-0004","trends":["There have been 8 other sightings in Ukiah","There were no other sightings in Ukiah on or around November 26th 1999"],"divs":["Sighting DetailsMy wife, who is now deceased, and I were driving out of Laytonville, California, headed north to Leggett, where there is a drive through Redwood tree. It was the Saturday after Thanksgiving 1999, around 3 in the afternoon. It was a beautiful, sunny afternoon. About 6 miles north of Laytonville, a silver disc flew over the highway ahead of us. It was very low over the highway, no more than 50 feet altitude. It was no more than 200 - 300 feet ahead of us. At that point on the highway, there is a hill going up to the right and down to the left. This silver disc came down from the hill on the right, crossed over the highway, and then went down on the left. As it went down on the left, it seemed to take a dive. It was going very fast. If it had been an airplane and there had been an airport there, this plane would have crashed. I was stunned. It took quite a few seconds and I said to my wife \"What the FUCK was that???!!!!!\" She said \"you saw that too? I didn't want to say anything because I thought you'd say I was crazy\". I said \"Oh, no, you're not crazy, we just saw a UFO!\" My wife's sister lived in Laytonville. When we got back to their house I asked them if there is an airport anywhere west of highway 101 on that stretch of road. They said no. We told them what we saw. They said that we were crazy. The next day we left Laytonville to go home to San Francisco. The following year we went back to Laytonville for Thanksgiving again. About 5 miles before we got to town, I said to my wife \"We saw a UFO up here a year ago\". What was strange about that was that for that year neither had once thought about it. It was as if it had been erased from our memories. It wasn't just like forgetting something. It was strange, like something had affected our brains. Anyway, that weekend we spoke to people about what we saw the year before. People told us that people who live there see them all the time. One lady told us that they go up this hill and park and watch them fly over. Since then, they put up a billboard north of Laytonville that says \"Welcome to Area 101\" and a big flying saucer on it. They are up there. There is a question here that asks \"what did you think the object was when you first noticed it?\" We both thought it was a UFO right away."],"Latitude":"39.157011","map":"<A HREF = \"http://maps.google.com/maps?q=39.157011,+-123.199663(9034)&iwloc=A&hl=en\"> mufon case (9034) map </A>","Viewing Distance":"101-500 Feet","Weather Factors":"None","Longitude":"-123.199663","Case Number":"9034","Date Submitted":"11/26/1999 03:00 UTC","Source":"MUFON","Sighting Duration":"00:00:05","City":"Ukiah"}