{"Object Features":"Dome, Wings","Tags":"City","Longitude":"-122.591479","Source":"MUFON","City":"Maple Ridge","Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9035.html.txt","/var/www/straped/mufon/org/9035.html"],"trends":["There have been 6 other sightings in Maple Ridge","There were no other sightings in Maple Ridge on or around May 16th 2006"],"Date of the Event":"05/16/2006 08:30 UTC","Region":"British Columbia","Country":"Canada","Disposition":"Unresolved","Log Number":"CA-01192008-0004","Weather Factors":"Unknown","divs":["Sighting DetailsI got out of my girlfriends truck in her parents house driveway date maybe around May 2007- it was dark so 8 or 9pm , and was looking up at the stars, when I noticed a spot with no stars, which was odd. Then I realized I was looking at an object very large, and dark, very camoflauged, kinda glistened, once your eye caught it you could totally see it. It was somewhat like a triangle boomarang shape with long wings kinda of with a large head compartment. Oddly it reminded me of a stingray or a dragon,I know weird. After a few minutes I paniced an begged my girlfriend to look up, and she started to freak out as well. Then her boyfriend pulled up and we tried to point it out to him, but by then it was moving away very fast. It looked like nothing I have ever seen, fast, moved in any directions nothing like a plane. Literally the wings did flapping motions but very graceful like a stingray in water, It was like a rolling flap motion. It was so silent, and moved so fast, then it was gone. One thing I noticed it had no bright lights, it was so cameoflauged, and silent. As soon as we started to panic and point at it, that is when it finally moved and left. It was hard to tell how high above it was, maybe 200ft-400ft or so.. Far Above the house, but not as high as an airplane would fly."],"Object Shape":"Boomerang, Triangle","Case Number":"9035","Date Submitted":"05/16/2006 08:30 UTC","Latitude":"49.22897","map":"<A HREF = \"http://maps.google.com/maps?q=49.22897,+-122.591479(9035)&iwloc=A&hl=en\"> mufon case (9035) map </A>","Summary":"Litterally like a sting ray in the sky, dark, moved silently quickly,","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile"}