{"Tags":"City","Latitude":"31.435164","City":"Gatesville","Case Number":"9037","Disposition":"Unknown","Date of the Event":"12/21/2007 06:15 UTC","files":["/var/www/straped/mufon/html2text/9037.html.txt","/var/www/straped/mufon/org/9037.html"],"Object Shape":"Oval","Region":"Texas","Weather Factors":"None","divs":["Sighting DetailsAt approximately 6:15 p.m. in the evening on 21 December 2007,my wife and I were traveling east between Jonesboro and Gatesville, Coryell County, Texas, through sparsely settled open ranch country, on Hwy 36 in our Dodge Ram 3500 truck to meet some friends for dinner when my wife, who was looking out the right hand window saw an extremely bright object coming from the west which she initially thought might be a falling star, as it was streaking somewhat like ones she had seen. When she realized it was larger than any shooting star she had ever seen, getting brighter, and much lower in the sky she called out for me to slow down and take a look at this thing, which I did. I first saw it as it passed by her passenger window on our south side and then got a good look at it through our front window. What I saw was an extremely large, bright white lighted object streaking through the sky at a rapid rate of speed faster than any plane I have ever seen, and I fly a lot, making no sound or sonic wave. Not only was it very, very bright, but it's extreme speed seemed to make light bend around it and stream from it so as to make it's actual shape hard to make out. I saw what I thought were small specks of blueish light, which were fast and blurred also embedded in and streaking along the side of this thing as it passed in front of us. When we first saw it this object was coming across the sky at a slight angle but then it appeared to level off a bit and disappeared suddenly as it neared some hills east of Gatesville, just like a shooting star does when it flares out. When we arrived at our destination dinner party we were quite excited at what we had seen, never having seen anything like it before, and told some folks about it, none of whom appeared much interested. About that time a couple who had arrived a couple of minutes ahead of us spoke up and said they, too, had seen this thing from another angle at the same time as they were coming into Gatesville on a parallel route, Hwy 84, from out towards Evant, Texas. Again, however, no one seemed too much interested and the group moved on to dinner. Although we will probably never know exactly what we saw, we saw what we saw, it was what it was, and we enjoyed the show, however short, while it lasted."],"Summary":"very large, very fast, low flying, extremely bright glowing meteor like object descending from the west leveling off and disappearing in the east past gatesville","Sighting Duration":"00:00:10","trends":["There have been 2 other sightings in Gatesville","There were no other sightings in Gatesville on or around December 21st 2007"],"Object Features":"Unknown","Longitude":"-97.743911","Country":"United States","Date Submitted":"12/21/2007 06:15 UTC","Object Flight Path":"Path with directional change","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=31.435164,+-97.743911(9037)&iwloc=A&hl=en\"> mufon case (9037) map </A>","Log Number":"US-01192008-0006","Source":"MUFON"}