{"Tags":"City","Latitude":"32.213748","Date Submitted":"08/10/2007 05:30 UTC","Date of the Event":"08/10/2007 05:30 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.213748,+-98.670611(9039)&iwloc=A&hl=en\"> mufon case (9039) map </A>","Disposition":"Unknown","Object Features":"Unknown","Longitude":"-98.670611","Object Shape":"Square, Rectagular","Sighting Duration":"Undisclosed","Case Number":"9039","Log Number":"US-01192008-0008","files":["/var/www/straped/mufon/html2text/9039.html.txt","/var/www/straped/mufon/org/9039.html"],"Region":"Texas","City":"Gorman","Object Flight Path":"Stationary,Path then hovering","divs":["Sighting DetailsIt was around 5-5:30 in the afternoon. I was driving back from Stephenville, Texas in a rural area between DeLeon and Gorman, Texas and I looked toward the east field as i was headed north i came upon a bend in the road on Hwy. 6. It was a clear day and I saw a black object in the sky and it seemed like it was barly moving and I thought my eyes were playng tricks on me. It was black in color, long and rectagular in shape and appeared to have no wings. I slowed down and rolled down the window and the sound was extremly high idle but a smooth hum. I thought maybe it was a blimp but the shape was wrong. It seemed to be barly moving. It wasn't low to the ground but not as high as an airplane would be flying. I hurried home and told my wife and thought nothing more about it until the Stephenville incident came up. I was freaked out over the whole thing and I felt very erry. I have never seen a weather balloon but i'm sure it wasn't a weather balloon or blimp because of the shape. It stayed visible in my rear view mirror for the next five miles."],"Summary":"Witness saw a long rectagular very black object stationary in the sky","trends":["There has been one other sighting in Gorman","There were no other sightings in Gorman on or around August 10th 2007"],"Source":"MUFON","Viewing Distance":"Over One Mile","Weather Factors":"None"}