{"Date Submitted":"05/31/1986 12:00 UTC","Tags":"City","Object Flight Path":"Straight-line path","Latitude":"37.843003","Weather Factors":"Unknown","Country":"United States","Disposition":"Insufficient Data","divs":["Sighting Details In 1986 on a beautiful clear night in June, I was traveling home after a church service. I was listening to the radio and traveling around 45 mph. As I rounded a sharp curve, I happened to look to my left across a small river, about five hundred feet away, and above a small mountain. There, just above the tree tops about fifty feet I saw a huge object floating along almost motionless. I immediately stopped my vehicle in the middle of the road, turned off my radio and rolled down my window. It was at least as large as a football field.(I was in the coal trucking business in those days and I noticed the lights first looked like marker lights on an eighteen wheeler which marked the whole outline.) It had one flashing, rotating light on the bottom which was changing from amber to a pale white light. I then looked above the object and there was another one about two hundred feet. The one which was closer to the ground was just slightly moving about half its size in front of the other. My first thought was, \"Man, what two big helicopters.\" All of a sudden I realized..there was no sound at all! I turned off my engine to be sure and listened and there was no sound. I even looked at the trees below the object and they were still. I suddenly thought about other traffic rounding the curve and crashing into me, so I quickly started my vehicle and drove about three hundred feet to a wide place where I could get out of way of traffic. I again turned off my vehicle, lights and all, opened the drivers door and stepped out with one leg in the car and one on the ground. I watched the two object for about a minute as they slowly moved silently above the trees. I knew by the way they were going they would soon pass directly over a coal strip mining job in a couple of minutes. The road went up a hill just a couple of miles down the road and I thought if I can get there, I will be a lot higher and able to see even better. I drove very fast for about three minutes and arrived at the intersection at the top of the hill. I spun around, and the objects were gone. I turned on my CB radio and listened to the night shift at the mine and they were talking about normal things. I was not scared as much as I was interested in the objects. As I laid in my bed that night I realized I had truly seen UFOs. I didn't believe, but I do now."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.843003,+-84.261708(9043)&iwloc=A&hl=en\"> mufon case (9043) map </A>","trends":[],"Case Number":"9043","Summary":"Two large rectangular objects outlined with multicolored lights and bigger than a football field. There was no sound at all.","Object Shape":"Square, Rectagular","Log Number":"US-01192008-0012","Sighting Duration":"Undisclosed","Longitude":"-84.261708","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9043.html.txt","/var/www/straped/mufon/org/9043.html"],"Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"05/31/1986 12:00 UTC","Region":"Kentucky","City":"Undisclosed","Object Features":"Unknown"}