{"divs":["Sighting DetailsI'm at work again looking up towards the sky as I typically do I see something that looked oddly shaped along that the fact it didn't move just hovered. East of the Mountains heading South or at least thats how it apeared. But I must emphasize it never moved just hovered. For only about 4 minutes did this thing last its would glow a great deal then appear to have disappeared then reappear strange if you ask me considering that no known object such as a jet or choper has any of these characteristics. After awhile performing the same way as my first report stated it just then Poof gone without a trace staring at the skies for a time to have never see this strange object again. To see this happen once is one thing but to have seen it again within days apart in the same area makes me wonder what was it doing and why in the same direction. Pretty unblieveable if you ask me and sorry to say I'm the only witness and thats the way it happens I'm always alone when I discover these sorta of strange anomilies. Point #5 I make a point because this time I didn't feel excited like the first time. As it seems this time experience was normal I had already been immune by the first appearance so this time it wasn't a big deal and I believe it knew I was watching it and it was watching me but simply did what it was what ever doing and then just left. Me personally believes the reason why it returned or assuming it never left it wanted me to see it and wanted me to tell someone about it why what is still the question who knows at this point why it did what it did there must be a reason and if infact there is one I will find it one way or another."],"Source":"MUFON","Date of the Event":"01/14/2008 08:31 UTC","Object Shape":"Circle, Sphere, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=38.836752,+-104.816113(9048)&iwloc=A&hl=en\"> mufon case (9048) map </A>","Longitude":"-104.816113","Log Number":"US-01192008-0017","Sighting Duration":"00:05:00","Date Submitted":"01/14/2008 08:31 UTC","trends":["There have been 106 other sightings in Colorado Springs","There was one other sighting in Colorado Springs on or around January 14th 2008"],"Country":"United States","Viewing Distance":"Over One Mile","Object Flight Path":"Stationary","Object Features":"None","Disposition":"Unknown","Latitude":"38.836752","Case Number":"9048","Tags":"City","City":"Colorado Springs","files":["/var/www/straped/mufon/html2text/9048.html.txt","/var/www/straped/mufon/org/9048.html"],"Weather Factors":"Does Not Apply","Summary":"Never moved, Pulsating Glow and faded","Region":"Colorado"}