{"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around January 4th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Region":"Texas","Disposition":"Unknown","divs":["Sighting DetailsMy husband, Daughter and I were > driving home from dinner, and I had already seen what looked like a plane > outside my window. We are in the IAH far NW corridor. My husband > slowed down and said do y'all see that? What is that? It's not moving. I > thought he was kidding, and waited for him to start laughing,and tell me he was kidding. Needless to say, we all started to look at it and we slowed down > and the object was not moving. We were just frozen! It was just hovering over a neighborhood, > kinda high, but close enough to somewhat tell what it was. It had 3 white > lights,in the shape of triangle- 2 red lights, one would blink constantly and the other one would blink every now and then. So we kept going and stopped at the stop sign to > make sure it wasn't moving, so I rolled down my window to listen for > plane or helicopter sounds. (I've been a reporter and have been in many helicopters before) But it was quiet and just there hovering.. So we kept going and I made > my husband turn around, but as i turned around in my seat I saw it Dart- to the left then up a bit took off -and it was gone! When we turned back round and it wasn't there anymore. As we drove closer to the area, we saw what looked to be another one. The second one was higher up, had a light that looked like a flashlight and grew brighter and brighter as it was going up and down and the light went straight up into the clouds and reached what seemed like miles. The sky was bright due to the moon and we could see the clouds very well. As if it was looking for something. Then all of a sudden it started to move slowly horizontally. Then husband wouldn't follow it anymore,(think he was spooked) so we came home. A bit later we heard several helicopters in the area. I reported this sighting to another website and found out another one had been sighted in Houston two days prior. You can find these reports at HBCC UFO Research. I saw the Larry King show and thought you might be interested in this as well. Although my report and the other one are no where near as amazing as those in Stephenville, but all are in Texas and close in date."],"Longitude":"-95.36074","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"01/04/2008 10:10 UTC","Sighting Duration":"Undisclosed","Latitude":"29.767163","Log Number":"US-01192008-0019","City":"Houston","Object Shape":"Boomerang, Triangle","Summary":"We saw an object hovering over a neighborhood adjacent to ours, with three lights and another one as the other disapperarr","Tags":"City","Date Submitted":"01/04/2008 10:10 UTC","files":["/var/www/straped/mufon/html2text/9050.html.txt","/var/www/straped/mufon/org/9050.html"],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=29.767163,+-95.36074(9050)&iwloc=A&hl=en\"> mufon case (9050) map </A>","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Case Number":"9050","Object Features":"None"}