{"Longitude":"-119.804033","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.538933,+-119.804033(9051)&iwloc=A&hl=en\"> mufon case (9051) map </A>","Disposition":"Insufficient Data","Latitude":"39.538933","Sighting Duration":"Undisclosed","Log Number":"US-01192008-0021","City":"Reno","Date of the Event":"10/20/2003 12:00 UTC","Region":"Nevada","Weather Factors":"Unknown","Date Submitted":"10/20/2003 12:00 UTC","Tags":"City","Country":"United States","Object Flight Path":"Hovering then path","Summary":"Large, dark, some lights","Case Number":"9051","trends":["There have been 65 other sightings in Reno","There were no other sightings in Reno on or around October 20th 2003"],"files":["/var/www/straped/mufon/html2text/9051.html.txt","/var/www/straped/mufon/org/9051.html"],"Object Features":"Undisclosed","Object Shape":"Teardrop, Triangle","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMy friends and I went camping and motorcycle riding in an area North of Reno called the \"moon rocks\" when in the middle of the night we noticed a large teardrop shaped object with a couple lights hovering silently above the mountain. My friend and his wife noticed it first and said \"do you think we should wake Chris and show him.\" I told them that I was awake and looked out the window of the trailer. As soon as I looked out I immediately jumped up, grabbed my digital camera, and ran outside. I knew that what ever it was, it wasnt something usual and the first thing that impressed me was how large it was, then I thought how still it was hovering over the mountain. I remember it was dark out and the UFO was dark but there were a couple lights and after about 30 seconds it started to move. It came towards us to the right and started to climb in altitude, moved very quickly and made no sounds. As it started to move I tried to take a picture but out of excitement, instead of pressing the button to take a picture I kept turning the camera off, then back on, then off again. By that time the UFO was to far away. I believe that alien life must exist but I dont know if I believe that we have ever been visited by aliens. I can understand it if they might be reluctant to show themselves just yet because of the impact it might have on our culture, religion, etc but I dont think they would appear in sighting and taunt us. I also assumed that if they had this kind of technology why would they have lights? I assume that it must have been something the military has been testing seeing how I had heard that Area 51 testing moved from South Nevada to North Nevada at the Falien Airforce base, about 45 minutes from the 'moon rocks' where we were camping. That being said, extraterrestrial or not, what I am certain of is that three adults witnessed something so amazing that it caused us to run out of a warm trailer into the freezing night and stand there shaking while admiring a piece of technology so advanced that it left us in awe. As I said, it was a very large, as wide as a jumbo jet from wing to wing, smooth, dark, had the ability to hover and fly silently and accelerate at high speeds. Without a doubt in my mind I know that what we saw was real and not any kind of optical illusion or anything of that sort. Either it was extraterrestrial or the US military has technology more advanced then we could ever imagine. I speculate its the later. Its not much of a story and I have never written about it until now, four years later, but I am clear on what I saw even though sometimes I think it was to unbelievable myself. for people who are pessimistic, UFOs exists from one origin or another and I would be happy to clearly and as detailed as I can explain my store even under the scrutiny of a lie detector or anything else. I wish I had more to tell but it was as simple as this and although the three of us know we just witnesses something incredible, later we just went back into the trailer, laughed at what we saw, and went to sleep knowing that we will probably never see anything like it again and that no one would believe our store."]}