{"files":["/var/www/straped/mufon/html2text/9052.html.txt","/var/www/straped/mufon/org/9052.html"],"trends":["There has been one other sighting in Green Lake","There were no other sightings in Green Lake on or around July 12th 2005"],"Weather Factors":"None","Viewing Distance":"Unknown","Country":"United States","City":"Green Lake","Log Number":"US-01192008-0021","Object Flight Path":"Stationary,Path with directional change,Path then hovering,Other","Sighting Duration":"Undisclosed","Case Number":"9052","divs":["Sighting DetailsI was working at a summer camp on Green Lake when other staff members and myself we sitting at the waterfront talking. We normally see strange things that occur late at night and at the time were going to the if there were any northern lights that appeared like it did the other nights. There were abotu 10 other staff members total. What we saw and though at first were 3 lights moving across the sky in the shape of a triangle and thought they were satellites. But, the lights were going very quickly and then stopped. The triangle got bigger (the lights spreading out) and so it was a much larger triangle. Then the triangle moved across teh sky again and dissapeared. About 5 seconds passed and the lights appeared into their original shape and size om a different part of teh sky. The lights then completely split and went into different directions in the sky, stopped then all at one moved from the left part of the sky to the right. They disappeared and reappeared in the triangle and the shot off extremely fast. Not but 1 minute later we saw planes coming in from the going to the rights and making passes where the lights were originally. They kept going back and forth search the sky. We assumed that they were military planes and were searching for these lights and were goign very fast. But, not nearly as fast as these lights were going."],"Latitude":"43.844148","Disposition":"Insufficient Data","Object Features":"Unknown","Date of the Event":"07/12/2005 12:00 UTC","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.844148,+-88.960113(9052)&iwloc=A&hl=en\"> mufon case (9052) map </A>","Longitude":"-88.960113","Region":"Wisconsin","Summary":"Three lights in the shape of a triangle move across sky and then split rapidly to different directions, dissapear and reapear in diffirent areas","Object Shape":"Star-like, Triangle","Date Submitted":"07/12/2005 12:00 UTC"}