{"trends":["There has been one other sighting in Haskell","There were no other sightings in Haskell on or around January 17th 2008"],"Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Longitude":"-99.733701","Disposition":"Unknown","Source":"MUFON","Object Features":"Unknown","Country":"United States","Latitude":"33.157603","Log Number":"US-01192008-0022","map":"<A HREF = \"http://maps.google.com/maps?q=33.157603,+-99.733701(9053)&iwloc=A&hl=en\"> mufon case (9053) map </A>","Viewing Distance":"Over One Mile","divs":["sighting detailsi was driving northbound on us 277 through haskell, tx at about 5:45 p.m. on 1\\17\\08. an oncoming, southbound haskell p.d. cruiser pulled over and stopped, causing me to look westward at him, and i then saw the object in the western sky. i believe the haskell pd officer had pulled over in order to observe this. i continued driving north and had to alternate my focus on the road to the north, but i mostly continued monitoring the object off to the west. i briefly took my eyes off it about 5 times to check the road north of me, but the object was continually there in about the same position in the sky each time i resumed monitoring it. the final time i took my eyes off it to check the road, it had completely vanished when i looked back at it. the event totaled about 20 seconds. the sky was mostly clear, and the object was very metallic and bright, apparently from the setting sun shining off it. it may have been moving the whole time but seemeed stationary until suddenly vanishing. it could not possibly have been an airliner, a weather balloon, etc. i'm very skeptical of ufo sightings, so my very first thought was that even though it certainly seemed like a \"flying saucer,\" it surely must be something else, like a weather balloon. i literally was trying to identify it as something else the whole time, but this was not possible. it wasn't scary ... just awesome and very curious. i hope to hear a reasonable explanantion but simply can't imagine what that may be. very interested to know if the haskell pd officer saw it too."],"Date Submitted":"01/17/2008 05:45 UTC","files":["/var/www/straped/mufon/html2text/9053.html.txt","/var/www/straped/mufon/org/9053.html"],"City":"Haskell","Object Shape":"Saturn-like","Object Flight Path":"Stationary","Case Number":"9053","Date of the Event":"01/17/2008 05:45 UTC","Summary":"hovering/stationary, 5000 ft? off to west; suddenly vanished; witnessed by PD?","Region":"Texas","Tags":"City"}