{"trends":["There has been one other sighting in Secaucus","There were no other sightings in Secaucus on or around November 30th 1979"],"divs":["Sighting DetailsMy friend and I were driving towards my house, after Christmas shopping, on Paterson Plank Road in Secaucus. We look over to our left, and both of us,at the same time, were in utter amazement at what we saw. It was a huge UFO...the same size as the ranch style home it hovered over. It was stainless steel in color, oval shaped, and there was a large white light..like a search light looking for something, going over the entire roof. There were a couple of colored lights on the back end of the craft... that were part of the craft...I remember green ones. We pulled over, we were right across the street from it. I was driving, so I got out and my friend came to my side of the car. I know it sounds weird but I wanted to get closer. It made no sound at all. Paterson Plank Road is a main road and, yet, no one was around. As we started to move across. we got to the double yellow lines and it was gone in a flash. Of course we stood and stared at each other like \"What the heck?\" Thank God we were both there, otherwise we might have thought we were nuts!! There was no doubt what it was...we were way too close to second quess it. I wish there were cell cameras around then. I always wondered about the people who lived in that house and if they were ever abducted. We never reported it but talk about every time we see each other."],"Weather Factors":"Unknown","Log Number":"US-01192008-0025","Tags":"City","City":"Secaucus","Longitude":"-74.05653","Source":"MUFON","Date of the Event":"11/30/1979 12:00 UTC","Object Flight Path":"Stationary","Case Number":"9056","Sighting Duration":"Undisclosed","Summary":"The UFO was hovering over a home..20ft away from us","Object Shape":"Oval","map":"<A HREF = \"http://maps.google.com/maps?q=40.789545,+-74.05653(9056)&iwloc=A&hl=en\"> mufon case (9056) map </A>","Disposition":"Unknown","Object Features":"None","Country":"United States","Date Submitted":"11/30/1979 12:00 UTC","Viewing Distance":"20 Feet or Less","files":["/var/www/straped/mufon/html2text/9056.html.txt","/var/www/straped/mufon/org/9056.html"],"Region":"New Jersey","Latitude":"40.789545"}