{"files":["/var/www/straped/mufon/html2text/9057.html.txt","/var/www/straped/mufon/org/9057.html"],"divs":["sighting detailswhile deer hunting at my camp in mason county texas, we had just stepped out on the porch for a smoke after dinner when we noticed an extremely bright object just above the tree line to the north east of the camp house. thinking it was mars as it had a definate reddish tinge we soon realized it was in the wrong position to be mars or some other star. the time was approximately 9:30pm . being familiar with the night sky in this area, it was easy to rule out any form of aircraft as it is normal to see commercial jet traffic at high altitudes traversing from east to west or vise versa. i went inside and got a pair of nikon 10x30 binoculars which we used to observe the object. the object\\objects has no disernable movement so i thought they might be a heliocopter, but i did not see any nav lights . i also noticed one dimmer light directly obove the light and 4 more strung out horizontally to the left of the bright light. the lights were equidistant apart, a very strange configuration for possible stars i thought. again this object was very low to the horizon and in an area where no starts or such are normally observed and was the britest visable object in the sky. after five minutes or so the lights dimmed to the point that they were not visible. they then came back on. this occured several times over the next 20 minutes until the light abruptly shut of not to be seen again. ther was no disernable movement of the lights. the night sky was partly cloudy with stars and commercial jet traffic visable but ther were no clouds to the north that could account for the dimming and blocking the lights. i do not know what it was but this event occured the saturday night before and to the southwest of the stephensville event. this more tha anything convinced me to report this. i have never seen anything quite like this."],"Summary":"Observe d bright light in Sky that was not aircraft or any known star","Object Shape":"Star-like","Viewing Distance":"Over One Mile","Weather Factors":"None","Log Number":"US-01192008-0026","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=30.748788,+-99.230611(9057)&iwloc=A&hl=en\"> mufon case (9057) map </A>","Date of the Event":"01/05/2008 09:30 UTC","Date Submitted":"01/05/2008 09:30 UTC","Latitude":"30.748788","Source":"MUFON","Object Features":"Unknown","Tags":"City","Longitude":"-99.230611","Region":"Texas","Sighting Duration":"Undisclosed","Country":"United States","City":"Mason","trends":["There has been one other sighting in Mason","There were no other sightings in Mason on or around January 5th 2008"],"Case Number":"9057","Disposition":"Unknown"}