{"Region":"Texas","Longitude":"-98.90229","Object Shape":"Fireball, Other, Unknown","Date Submitted":"01/03/2008 07:15 UTC","trends":["There have been 16 other sightings in Breckenridge","There were no other sightings in Breckenridge on or around January 3rd 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.755677,+-98.90229(9058)&iwloc=A&hl=en\"> mufon case (9058) map </A>","Log Number":"US-01192008-0027","Source":"MUFON","Weather Factors":"Unknown","Object Features":"None","Summary":"Bright light of changing intensity in distant sky","Disposition":"Unknown","Case Number":"9058","Country":"United States","Object Flight Path":"Stationary","Sighting Duration":"Undisclosed","Date of the Event":"01/03/2008 07:15 UTC","Tags":"City","Latitude":"32.755677","Viewing Distance":"Over 1 Mile, Unknown","City":"Breckenridge","divs":["Sighting DetailsThe only reason I am concerned about this experience is the fact that it happened in close proximity (in distance and time) to the Stephenville, Texas, sightings. I was driving east on the main street in Breckenridge with a clear view to the eastern sky. I noticed a 'reddish star' that was much brighter than the others nearby--I first thought to myself, \"Wow! Mars is bright tonight!\" As I was looking at the light, it intensified to become even brighter. I then thought that I was looking at the landing lights of an airplane that had turned towards me, thus causing the intensification. However, there were no other signal lights which would have been easily visible from an airplane. Also, there was no motion to the light over time that I was observing it; it was stationary in the sky, even as I moved east. After a short time, the light returned to the previous intensity---still standing out among the stars. As I continued home, I turned on a residential street to the south. When I went through the next three intersections, I used the lack of obstructions to look back east and confirm that the light was still present, bright, and motionless. I turned again to the east, then back to the south through a tree-filled residential neighborhood before turning back east on my street where I would again have a view after about a minute without being able to see the light. It was then that I noticed that the light was either gone or the light had diminished to a point where it no longer stood out in the sky. I stood outside for a few minutes, trying to understand what I had seen. I am a stargazer; I took astronomy classes in college and have always had an affinity for the sky. I am also trained as a meteorologist and have studied aviation. I scanned my brain to find some atmospheric or astronomic explanation to no avail. I am also a skeptic about UFOs. I do believe that other civilizations exist in the Universe, but I doubt they are visiting us. So I remained dumbfounded. I came inside and promptly described the event to my wife. I was confused and wanted to let her know what happened \"just in case something like a supernova made it on the news\" and she would know that I saw it, too. While I never saw any news of strange astronomical phenomena, soon afterwards the news was filled with Stephenville residents' sightings of UFOs. Stephenville is located about 65 miles southeast of Breckenridge, so hearing of the sightings there excited my curiosity. And, thus I found my way to MUFON to make a report."],"files":["/var/www/straped/mufon/html2text/9058.html.txt","/var/www/straped/mufon/org/9058.html"]}