{"Viewing Distance":"Unknown","Weather Factors":"None","Disposition":"Unknown","divs":["Sighting DetailsI went in to make coffee and noticed what I thought was a police helicopter spotlight, stationary. Let my dog out, made coffee and woke up enough to realize something wasn't right. Kept glancing at the light which had not moved. Let my dog in and walked to the edge of the patio to see the light. It blinked off and right back on one time. There was no sound. As I stood and watched it I wondered how a light so strong and bright wasn't lighting up the whole neighborhood. Went inside, got my coat and camera and took several pictures, (which was useless because they looked like a distant street light, as was described by the truck driver that also took pictures). Went back inside, got my coffee and sat down to transfer them to my computer. I estimate it was there between 30 and 45 mins from the time I first saw it. Last time I looked, it was gone... I did not get upset because I have seen UFO's since childhood (although I didn't know what they were at the time). I am 72 yrs of age. I hesitate to tell you this because it is so unbelievible: I (and neighbors)watched a total of 6 UFO not more than a 10th of a mile away and 2-300ft above the ground in Lancaster, TX during the summer of '61 or '62. I believe there was something in the paper or on the news at the time about jets going up to look for them. Shortly after the Az. 'flap' I (and other hwy traffic)saw a UFO lift off a bluff which I had just passed by, West of Needles Ca. My husband and I are retired truck drivers and the thing that amazed me the most was that not a single driver or 4 wheeler said a word on the CB radio. It was as though the radio had went dead. By the way, underneath it, there were 6 bright white lights as it lifted off. I believe it lifted off because a trucker had just parked beneath it on the hwy sholder. So ok, call me a kook... I've seen what I have seen and more!"],"Country":"United States","Date Submitted":"01/14/2008 05:10 UTC","Object Flight Path":"Undisclosed","Latitude":"33.069383","Source":"MUFON","Log Number":"US-01192008-0028","Case Number":"9059","files":["/var/www/straped/mufon/html2text/9059.html.txt","/var/www/straped/mufon/org/9059.html"],"Sighting Duration":"00:37:00","trends":["There has been one other sighting in Caddo Mills","There were no other sightings in Caddo Mills on or around January 14th 2008"],"Object Shape":"Star-like","Region":"Texas","Date of the Event":"01/14/2008 05:10 UTC","Tags":"City","Longitude":"-96.226423","City":"Caddo Mills","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.069383,+-96.226423(9059)&iwloc=A&hl=en\"> mufon case (9059) map </A>","Summary":"Extremely bright light that blinked off and back on instantly, only once."}