{"Summary":"Triangular object passes above police officer in I","Log Number":"000105-02","trends":["There have been no other sightings in Summerfield","This sighting has never been favorited."],"Date Submitted":"01/05/2000 04:10 UTC","Object Flight Path":"Unknown","Sighting Duration":"00:10:00","Weather Factors":"Unknown","divs":["Sighting DetailsA Lebanon, IL police officer received a call from the St. Clair County SheriffDept that a citizen had reported a UFO. Minutes later the officer spottedintense white lights approaching. As the object passed almost directly overheadat an estimated 1000-foot altitude, it pivoted without banking and so changedfrom a S to a SW course. The object was described as a black isosceles triangle (conservatively estimatedas 75 ft in length by 40 ft in width). Large, bright unwavering white lightswere near each axex, seemingly pointing down, while a small, pulsing red lightwas centered near the rear of the underside. No sound was heard.The officer followed the object in his cruiser at approximately the objectsspeed to a nearby town, then parked to observe further. As the object continuedinto the distance, he detected the rear as appearing rectangular, illuminated bywhite mixed with a multi-colored band of light. The object suddenly acceleratedto a great speed. The officer radioed the sheriff dept as to the objects direction. A momentlater, an officer from the Shiloh PD radioed that he had the object in sight.Duration of the Lebanon PD officers observation was 10 minutes."],"Date of the Event":"01/05/2000 04:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.59727,+-89.751762(906)&iwloc=A&hl=en\"> mufon case (906) map </A>","Region":"Illinois","files":["/var/www/straped/mufon/html2text/906.html.txt","/var/www/straped/mufon/org/906.html"],"City":"Summerfield","Object Features":"Undisclosed","Disposition":"Unknown","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.59727","Country":"United States","Longitude":"-89.751762","Object Shape":"Triangle","Case Number":"906","Source":"MUFON"}