{"Log Number":"US-01192008-0030","Date Submitted":"06/18/1993 04:30 UTC","Case Number":"9061","Tags":"City","Sighting Duration":"Undisclosed","Summary":"looked out back window saw 2 objects shaped like long floresence tubes flashing lights to each other like SOS","map":"<A HREF = \"http://maps.google.com/maps?q=42.569214,+-83.382149(9061)&iwloc=A&hl=en\"> mufon case (9061) map </A>","Object Shape":"Other","trends":["There have been 3 other sightings in West Bloomfield Township","There were no other sightings in West Bloomfield Township on or around June 18th 1993"],"City":"West Bloomfield Township","Country":"United States","Date of the Event":"06/18/1993 04:30 UTC","Object Flight Path":"Stationary,Hovering then path,Path with directional change","Source":"MUFON","Weather Factors":"Unknown","Region":"Michigan","Longitude":"-83.382149","Viewing Distance":"20 Feet or Less","divs":["Sighting DetailsWatched while these two florecence tubes seemed to be comunicating with each other. The lights were flashing on and off. They hovered off the ground maybe a foot high. One was behind my house and the other behind my neighbors. The one behind my neighbor went around their house and dissappeared. The one behind mine went the opposite way up past the trees and away into the sky. I called Joe ? @ city desk of newspaper (probably Detroit News) at 222-6400, but he was very dissinterested. He told me to take a movie. Next day I borrowed my sons camera and set it up but whatever I saw did not come back. I am writing this to you because I will be 84 years old this coming May and wanted to tell someone before I leave this world. I did make calls to tv stations when there was a program on UFO's but could never get through. I have never heard of anyone seeing what I saw and would like to know if anyone else has ever reported something similiar?????????????????????????? The next day whenI went out on my back porch there was a peculiar print which looked like it was made with freash white paint. It was like a huge foot print shaped like a V with a line in the middle of the V. I did take a picture of that and have it somewhere in my collection but I cannot believe it would be connected even though I don't know how that got there. I did have 2 other weird experiences. One was about 45 years ago. I lived in Detroit Michigan at that time. It was summer and our windows were open . I woke up at approximately l:00 AM to a frequency of noise I had never heard before, nor since!!!!! I looked out the window to see where the noise was coming from and I saw a lot of green florecence lights climing up my bushes. As I was watching, a police car drove by and all the lights turned off at once as if someone had turned the switch off. The third time I just spotted something that looked like a flying saucer. I was in Florida and the next day the newspaper reported that they got numerous calls from people who thought they saw a flying saucer. I was not one of the callers. In as much as nobody has ever bothered to acknowledge and of the few communications I have made on the internet I would be pleased to know if anyone reads this. All you have to write is Yes or No. Thank You PS: I just noticed your questions. I went to get a drink of water from my kitchen and passed the window wall that looked over the back of my house which sat on a swamppy bit of water and as I passed I noticed some flashes of light and went to see what they were."],"Latitude":"42.569214","Object Features":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9061.html.txt","/var/www/straped/mufon/org/9061.html"]}