{"Viewing Distance":"Over One Mile","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Date of the Event":"04/30/2007 10:20 UTC","Country":"United States","Disposition":"Unknown","Log Number":"US-01192008-0033","Object Shape":"Unknown","Weather Factors":"None","Region":"Texas","City":"Denton, then toward Nocon","Latitude":"31.974919","Object Features":"Unknown","Date Submitted":"04/30/2007 10:20 UTC","Summary":"very bright light flashes, moving northwest","trends":["There have been no other sightings in Denton, then toward Nocon","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=31.974919,+-99.895443(9064)&iwloc=A&hl=en\"> mufon case (9064) map </A>","Longitude":"-99.895443","Source":"MUFON","Case Number":"9064","files":["/var/www/straped/mufon/html2text/9064.html.txt","/var/www/straped/mufon/org/9064.html"],"divs":["Sighting DetailsI am sorry I am not certain of the exact date, however therewere several others who worked for the same company, in different locations, who also saw the lights. One night last spring, at exactly (I looked at my watch) 10:20pm, I was driving south on U.S. 287 just south of Alvord, Texas when out of the corner of my left eye I saw a flash due east and assumed it was lightning. After radioing the dispatch and being told that there were no storms on radar in that area, I figured it was a small thunderhead and continued to drive. The flashes continued, but became even brighter, too bright for lightning, and after the second flash, another driver closer to the area also radioed that he had also been seeing the lights for some time, but there were no clouds in the area and he didnt want to say anything about the lights. He then became very shaken as he described the lights as being multi-colored and couldnt even describe the shades of the colors. He also said he thought it was a UFO, though he (nor any of us) actually saw any type of craft, structure or anything else other than the flashes. The flashes continued as I was now driving east on Highway 380 from Decatur toward Denton, and I could now see that the lights were actually coming from the ground, so I now assumed it might be an oilfield crew's lights flickering, or someone welding. But they were so very bright now and seemed to be moving northwest. While the other drivers in different areas all had different views and we all disagreed even on the exact location of the lights. The flashes would last in sporatic sessions from between 45 seconds to over a minute, and then at times for only 3-6 seconds at a time, with unusual and irregular pauses in between. It really did resemble an arc welder's flash. These lights continued to move northwest until disappearing into a REAL thunderhead over Oklahoma due north of the Forestburg Texas area. Now, the only reason I am reporting this now is because one witness to the Stephenville sighting had described the lights as resembling 'welder's torch' and I remembered stating how they looked like an arc welder reflecting light in the air, but maybe 100 times brighter. I only saw the lights as a light blue tint, though, but the other drivers seemed to see different colors. We all agreed to watch the news and see if there was some simple explanation the next day, but there was never any mention. This continued until around 2:45am. I also saw them again in the same area the following night, but only for a period of about 90 minutes that time. I wanted to report this as it might be helpful information in the ongoing Stephenville sighting, and thank you for your work also."]}