{"Log Number":"US-01202008-0004","Object Features":"Unknown","Tags":"City","Country":"United States","divs":["Sighting DetailsAround October 1, 2004, I was walking at the Dublin High School track. I was looking up at the sky when I noticed a series of round, reddish-orange lights that were too big to be from an airplane. It started out as one light, then two, then three, then four, then five. When all five lights were on, the fifth went out, then the fourth, the third, and so on. The lights were in a horizontal row, and this pattern repeated itself several times over the course of 2-5 minutes before disappearing. I could not see the actual object because it was dark and the lights were very bright. I continued to look for the object that night and many nights afterward, but I never saw it again. I have never seen anything like this object before or since. I could not tell exactly how far away it was, but I could tell that it was extremely large and moving very quickly. The object seemed to be quite far away, but was certainly flying lower than an airplane would be. I knew immediately that this was something unusual. My father is a pilot, and I have seen many different types of aircraft, and nothing I've seen remotely matches the description of this object. I never reported this incident, but after the recent sightings in Erath county, I wanted to share my experience."],"files":["/var/www/straped/mufon/html2text/9070.html.txt","/var/www/straped/mufon/org/9070.html"],"Weather Factors":"None","Viewing Distance":"Over One Mile","Case Number":"9070","Sighting Duration":"00:05:00","trends":["There have been 40 other sightings in Dublin","There were no other sightings in Dublin on or around October 1st 2004"],"Source":"MUFON","Longitude":"-98.337088","Date of the Event":"10/01/2004 08:00 UTC","Object Flight Path":"Stationary,Unknown","Date Submitted":"10/01/2004 08:00 UTC","Latitude":"32.087383","Disposition":"Unknown","Summary":"Row of 5 lights going off and on","Region":"Texas","City":"Dublin","Object Shape":"Circle, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.087383,+-98.337088(9070)&iwloc=A&hl=en\"> mufon case (9070) map </A>"}