{"Tags":"City","Object Features":"Unknown","Object Flight Path":"Path with directional change","Disposition":"Unresolved","divs":["sighting detailswhile on a cigarette break, i looked at the moon and the layout of the stars in the sky. i do this often as that i try to remember things from astronomy class. a co-worker called to me and said goodnight. we chatted for a moment, and he went on his way. i turned back to where i was looking and noticed that something was different about the stars. however, for a few seconds i couldn't see the difference for it was minute. once those few seconds passed, i could see what was different. it was a circle that appeared the size of one of the smaller stars in my field of vision, and it was moving in a northeast direction by a few degrees. my first thought was, \"oh my, a u.f.o., or, a spy-plane.\" however i \"recovered\" and decided to observe for as long as possible. this \"dot in the sky\" was so small that i didn't feel my celphone cam would pic it up on the partly cloudy night. it appeared to continue its northeast trajectory, then that trajectory gradually changed. after about twenty seconds, its trajectory changed about fifteen degrees to the east until i lost it in the clouds. it was as luminous as the stars\\planets. i have decided to report this because the next day someone else told me they also observed it."],"Case Number":"9071","Country":"United States","City":"White Plains","Object Shape":"Circle","Sighting Duration":"Undisclosed","trends":["There have been 4 other sightings in White Plains","There were no other sightings in White Plains on or around January 18th 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.033986,+-73.76291(9071)&iwloc=A&hl=en\"> mufon case (9071) map </A>","Latitude":"41.033986","Log Number":"US-01202008-0005","Source":"MUFON","Date of the Event":"01/18/2008 06:16 UTC","Summary":"While looking at the moon and stars, I saw a circle move against the sky.","Region":"New York","files":["/var/www/straped/mufon/html2text/9071.html.txt","/var/www/straped/mufon/org/9071.html"],"Weather Factors":"Light","Date Submitted":"01/18/2008 06:16 UTC","Viewing Distance":"Over One Mile","Longitude":"-73.76291"}