{"Summary":"Sky Yacht sighted abt 100 miles SE of Area 51","Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=36.809331,+-114.05968(9073)&iwloc=A&hl=en\"> mufon case (9073) map </A>","Sighting Duration":"Undisclosed","Object Features":"None","divs":["sighting detailswednesday, nov 21, i was in the parking lot of mesquite college with a friend. time was 5:20 to 5:35 pm. the sun was just over the horizon. i observed what was first thought to be a strange exhaust pattern of a jet. however, there was no sound and it was moving slow. i told my friend to look where i was pointing. this flying\\floating barge was an elongated triangle shape, color was dark gray and huge! perhaps 250 - 300 feet long and the butt end was about 150' - 200' wide. no running lights except for a single strobe which was emitted once from the snout (that i witnessed). it was southwest of my position about 2 - 3 miles (i guess over the river area) at an elevation of 2,400' to 3,000' moving south then turned southwest. a small plane with running lights crossed over it going west to east (i wonder what they were thinking?). the damn thing went out of range and it got too dark to see it. had to get into class anyways. after class when i returned home, i looked on the net to find what i could about it. the following site was the closest to it, also describing \"large slow crafts\" (back in ww2 the term referred to ships. . . of a different type!). this was totally cool, as i'd love to have one of these \"sky yachts\"!!! http:\\\\www.space.com\\businesstechnology\\flying_triangle_040902.html the last time i saw a flying triangle thing it was only about 4' long and 2' wide and flew right over our heads, along the phone lines on a busy street next to csun in la about mid 1980's. me and an engineering student watched it for a few blocks. . . i need a new mufon investigator card (my last one from 1978 is trashed, as was my nicap card)"],"Weather Factors":"Unknown","Object Shape":"Triangle","Source":"MUFON","Country":"United States","Latitude":"36.809331","trends":["There have been 4 other sightings in Mesquite","There were no other sightings in Mesquite on or around November 21st 2007"],"files":["/var/www/straped/mufon/html2text/9073.html.txt","/var/www/straped/mufon/org/9073.html"],"Longitude":"-114.05968","Log Number":"US-01202008-0007","Case Number":"9073","Date of the Event":"11/21/2007 05:45 UTC","City":"Mesquite","Date Submitted":"11/21/2007 05:45 UTC","Region":"Nevada","Tags":"City"}