{"Summary":"Successive red lights appearing then fading in vertical pattern/line.","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/9077.html.txt","/var/www/straped/mufon/org/9077.html"],"divs":["Sighting DetailsDriving north on Carlisle Pike somewhere in Silver Springs Twsp. About 5-6 pm. Dark. Plenty of rush hour traffic. In north- west sky first noticed a series of red lights in a vertical line appear one by one then dissapear. Thought it was automobile red brake lights reflecting off window glass. Daughter saw it first as a passenger while I drove. \"Daddy, did you see that?\" Rolled down drivers side window to see more clearly as lights reappeared again in a top to bottom verticaly spaced line, then dissappear one by one top to bottom then reappear slightly further north again as a single light. Lights did not seem to be part of one single object.Distance from us to lights about less than a mile. Repeated about 7 times during 15 to 20 minute period.This top to bottom vertical pattern was unlike any airplane witnessed at night by us in 7 years of residence.The impression we had was that the lights came from nowhere and then vanished. No horizontal motion line like an airplane. Lights moved from the northwest to the northeast. At no time did it appear to be an object, just lights. This general direction is often used by approaching aircraft to HBG. Itl. Airport but these lights did not appear like any previous airplane or helicopter lights at night. Approaching airplanes come from the nw to the se for airport. At one point we pulled into a school parking lot to get a clear and stationary view.Turned off engine. Could not hear the sound of a plane or helicopter engine. Not knowing the objects size can not say how far away it was by this time.It appeared to be moving somewhere to the north of us along Susquehanna River.Upon arriving at home the lights either stopped or were out of our view.How did we feel? \"Spooked and a feeling of being watched\".My daughter wished she had not witnessed this event."],"Date of the Event":"12/12/2007 12:00 UTC","Disposition":"Unknown","Object Shape":"Circle, Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=40.2827,+-76.875948(9077)&iwloc=A&hl=en\"> mufon case (9077) map </A>","Region":"Pennsylvania","Date Submitted":"12/12/2007 12:00 UTC","Log Number":"US-01202008-0011","Source":"MUFON","City":"Harrisburg","Object Flight Path":"Hovering then path","Country":"United States","trends":["There have been 26 other sightings in Harrisburg","There were no other sightings in Harrisburg on or around December 12th 2007"],"Case Number":"9077","Viewing Distance":"501 Feet - 1 Mile","Weather Factors":"None","Object Features":"None","Longitude":"-76.875948","Latitude":"40.2827"}