{"divs":["Sighting DetailsI was visiting my mother in Oklahoma City the weekend of January 5. It was about 11:30 p.m. and it was hot in her home and so I cracked open a window above the bed I was sleeping in. I was alone in the bedroom. I had dozed off when as clear as day I heard someone tell me \"Hello.\" But the voice did not come from outside, it came from within my head. It's so hard to describe. I know it wasn't a dream. At first, I thought someone had broken into the house and was in my room. So, I laid very still waiting to hear some kind of noise - nothing. Then I remembered I had cracked open the window and thought that the person was outside the window. Without looking out the window, I reached up and closed the window. The voice didn't return but as I laid there trying to hear anymore sounds that might indicate there was an intruder around the house, I noticed the neighborhood dogs were barking in a crazy way that I've never heard before. It almost sounded like a panic. After a few minutes, I fell asleep and woke up in another hour when my daughter returned from a date. I live in Dallas and with the news of the sightings in Stephenville, I was curious if anyone had come forward with any reports of being contacted. I know reporting this is a lot riskier than reporting a sighting but it's very unnerving when something like this happens - especially when you feel like you've been mentally violated or penetrated, for lack of a better description. At any rate, it has not happened again to my recollection."],"Case Number":"9078","Weather Factors":"Unknown","Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.47173,+-97.509948(9078)&iwloc=A&hl=en\"> mufon case (9078) map </A>","Date Submitted":"01/05/2008 11:30 UTC","files":["/var/www/straped/mufon/html2text/9078.html.txt","/var/www/straped/mufon/org/9078.html"],"Longitude":"-97.509948","Object Flight Path":"Undisclosed","Tags":"City","City":"Oklahoma City","Latitude":"35.47173","Object Features":"Undisclosed","Source":"MUFON","Object Shape":"Undisclosed","trends":["There have been 78 other sightings in Oklahoma City","There were no other sightings in Oklahoma City on or around January 5th 2008"],"Viewing Distance":"Unknown","Date of the Event":"01/05/2008 11:30 UTC","Log Number":"US-01202008-0012","Sighting Duration":"Undisclosed","Region":"Oklahoma","Country":"United States","Summary":"No sighting"}