{"divs":["Sighting DetailsFor the Labor Day weekend the family was gathering on the folks ranch located about 5 mile ESE from Valley Mills, and about 20 miles WNW from Waco. It being warmer in the ranch house than in the yard, the adults were sitting in the yard visiting and waiting on my brother and his family to arrive. The group consisted of my mother, step-father, sister and her husband and my wife and myself. Suddenly, someone noticed this large object hovering, slowly rotating above us at an altitude of about 1000 ft. It was shaped like a toy spinning-top, had lighted ports about its perimeter and appeared to be some 200-to-300 feet in diameter. As we were marveling and commenting, an airplane began approaching from a southerly direction and made a turn toward the object. Quickly, the object departed easterly at a very high speed and disappeared over the horizon in less than 10 seconds. When my brother arrived, he laughed heartily at our description. As an aeronautical engineer for General Dynamics in Ft. Worth, he did not believe in Flying Saucers. About ten days later, I received from him a copy of the GD internal newspaper. It turned out that the airplane we had seen was a GD plane flying from San Antonio to Ft. Worth, and the description from the pilots matched exactly our own observations. I am a Mechanical Engineering graduate from Texas A&M and a retired cororate officer. I can see the events of that night of more than 50 years ago almost as clearly as I did then. There is no doubt in my mind that we saw a very real UFO in the form of a \"Flying Saucer.\" None of the persons who winessed this occurrence with me are still alive, unless it be the pilots or a pilot of the GD airplane. While I have described this even to numerous people over the years, I did not know until recently about your organization."],"Object Shape":"Circle","Sighting Duration":"Undisclosed","Date of the Event":"09/01/1958 08:30 UTC","Summary":"UFO hovered overhead for about ten minutes, then disappeared at an extremely high speed.","Source":"MUFON","Weather Factors":"Does Not Apply","Object Flight Path":"Hovering then path,Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=31.659328,+-97.472238(9082)&iwloc=A&hl=en\"> mufon case (9082) map </A>","Object Features":"Window(s)","Country":"United States","Date Submitted":"09/01/1958 08:30 UTC","Tags":"City","Disposition":"Unknown","Longitude":"-97.472238","Case Number":"9082","Latitude":"31.659328","trends":["There has been one other sighting in Valley Mills","There were no other sightings in Valley Mills on or around September 1st 1958"],"Region":"Texas","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/9082.html.txt","/var/www/straped/mufon/org/9082.html"],"City":"Valley Mills","Log Number":"US-01202008-0016"}