{"Log Number":"US-01202008-0017","Longitude":"-84.543823","files":["/var/www/straped/mufon/html2text/9083.html.txt","/var/www/straped/mufon/org/9083.html"],"Date of the Event":"04/24/2004 04:30 UTC","Case Number":"9083","Weather Factors":"Unknown","Region":"Georgia","divs":["sighting detailsit was a beautiful, sunny, saturday afternoon at 4:30pm on 4\\24\\04. i was lying on my bed looking up at the sky through my window, when i noticed two pink triangular shaped objects way up in the clouds. i often see jets flying in the sky where these two pink triangles were, but these were obviously not jets. i stood up, went to the window, and observed the two pink triangles for a few minutes, trying to figure out what they could be. i quickly dismissed them as kites, balloons, or planes, as they were stationary and did not move, nor were they helicopters. after a few minutes, they moved in unison...first to the left...then up a bit. they hovered and then disappeared in the sky. i immediately phoned my husband who was unavailable, and then my cousin and a friend to tell them of the event. a few minutes later, the two pink triangles reappeared in a different part of the sky, but not too far away from my original sighting. again, they were stationary, then moved in unison, then eventually disappeared into the clouds. it was an amazing experience, and unfortunately, i was not able to photograph them as my camera was broken."],"Object Flight Path":"Undisclosed","City":"Marietta","Disposition":"IFO","Object Shape":"Triangle","Source":"MUFON","Tags":"City","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Date Submitted":"04/24/2004 04:30 UTC","trends":["There have been 21 other sightings in Marietta","There were no other sightings in Marietta on or around April 24th 2004"],"Viewing Distance":"Unknown","Summary":"Two Pink Triangles Hovered in Sky, moved in unison, then went into clouds","Country":"United States","Latitude":"33.960322","map":"<A HREF = \"http://maps.google.com/maps?q=33.960322,+-84.543823(9083)&iwloc=A&hl=en\"> mufon case (9083) map </A>"}