{"divs":["sighting detailsi went to bed around 8:oo p.m. and was awakened by something touching my right hand.i raised my head up to see what awakened me and i saw a small creature standing at my right foot area,it was short and gray in color. i then realized i was not in my bed at all,i was on a sort of table, the creature didn't say anything to me but i could feel it wanted to show me something. it stepped to it's left,my right,and i noticed that the wall behind it had symbles on it. two of the symbles were illuminated in a foggy green glow,they were about shin height to the creature.one of the symbles was shaped like a pyramid and had depth to it'with kind of an orb center. the other symble was shaped like the creatures hand with three fingers on top a palm and a fourth finger in the center of the lowest part of the palm. it was also illuminated green with dark lines where the palm and fingers bent at the joints.after i looked at the symbles the creature stepped forward and touched my right hand with it's middle finger and i went back to sleep.iawoke later and my right hand hurt 'i had a rash between my right index finger and middle finger for several weeks. also the area over the center\\middle of my eyes is still more pronounced.where the third eye is supposed to be located.imade drawings of what i saw ,but not of the crewature ,i still have them."],"Object Features":"Undisclosed","Tags":"City","Date of the Event":"09/20/2006 12:17 UTC","Summary":"there was no exterior view by me .","Region":"Texas","Object Shape":"Unknown","City":"Rhome","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"09/20/2006 12:17 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"33.053456","Case Number":"9086","Country":"United States","files":["/var/www/straped/mufon/html2text/9086.html.txt","/var/www/straped/mufon/org/9086.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.053456,+-97.471966(9086)&iwloc=A&hl=en\"> mufon case (9086) map </A>","Longitude":"-97.471966","trends":["There have been 3 other sightings in Rhome","There were no other sightings in Rhome on or around September 20th 2006"],"Disposition":"Unknown","Log Number":"US-01202008-0020"}