{"Summary":"White Golf ball shaped bright object in unbelievably fast zig zag motion sends down beam of light.","Tags":"City","City":"Tiffin","Sighting Duration":"Undisclosed","Log Number":"US-01202008-0023","Object Flight Path":"Other","Object Features":"Unknown","Date of the Event":"06/01/1973 12:00 UTC","Case Number":"9089","Weather Factors":"Unknown","Source":"MUFON","Region":"Ohio","Country":"United States","Longitude":"-83.172485","Date Submitted":"06/01/1973 12:00 UTC","files":["/var/www/straped/mufon/html2text/9089.html.txt","/var/www/straped/mufon/org/9089.html"],"Latitude":"41.123189","Object Shape":"Other","Viewing Distance":"501 Feet - 1 Mile","trends":["There has been one other sighting in Tiffin","There were no other sightings in Tiffin on or around June 1st 1973"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.123189,+-83.172485(9089)&iwloc=A&hl=en\"> mufon case (9089) map </A>","divs":["Sighting DetailsWife and I returned from a movie about 10pm in the evening, took our large dog out to our back yard, as we always had done, prior to retiring for the evening. Behind our home was several acres of cornfield. We both noticed a golf ball shaped light...first thought it was a star or planet as it wasn't twinkling, as a star appears to do. Whlile we were both looking at it, since it was motionless, but very bright, all of a sudden it starting making extremely fast zig zag movements, stop, make zig zag movements again. We simultaneously looked at each other and at the same time said \"did you see that!\". As we continued to watch these eratic movements, a beam of light shot out from this object, about 20' from where we were standing on our lawn and we both ran to the back porch door to get in the house, since it frightened us. Beam of light covered about 10' in a concentrated area. As we were running to the house, I looked back and it shot straight up and out of sight at incredible speed sending off what appeared to be a mixture of a short but slightly red, orange and blue trail. No sounds were made at any time of this sighting."]}