{"Case Number":"9092","divs":["Sighting DetailsVanatage point: Car window at ground level. Car was parked and not in motion. Witnesses location: Corner of Himes and Columbus. Viewed two fireballs with long tails flying in a horizontal formation one on top of the other moving in a westerly direction south of our position. After about 15 to 20 seconds of flight in a constant direction with the top fireball varying in distance only slightly from the bottom fireball (by separating in distance vertically), the fireballs made a manuever that seemingly defied the laws of physics. They both executed a 120 to 140 degree turn towards the earth and seemed to spiral around each other in an arc before they were no longer in our view. At first I thought I was seeing a blimp, which are common around Raymond James Stadium (which was north of our position) until the two balls of fire separated and distance from each other and made the turn downward. From my estimates, depending on how large the objects were, they were between 1 and 5 miles south of our position. Unfortunately it is diffcult to discern their distance when there is no reference for how large the object or objects are. We could no longer track the objects as they lowered in decent as they became obscured by trees and buildings. The objects were not seen by us again."],"Disposition":"IFO","Date Submitted":"01/20/2008 06:15 UTC","trends":["There have been 105 other sightings in Tampa","There were 2 other sightings in Tampa on or around January 20th 2008"],"Latitude":"27.954235","Sighting Duration":"00:01:00","Viewing Distance":"Unknown","Log Number":"US-01202008-0026","map":"<A HREF = \"http://maps.google.com/maps?q=27.954235,+-82.449598(9092)&iwloc=A&hl=en\"> mufon case (9092) map </A>","Region":"Florida","Object Features":"Undisclosed","Summary":"2 fireballs following simular western paths then taking sharp turn downwards towards the earth","Source":"MUFON","Object Shape":"Fireball","Date of the Event":"01/20/2008 06:15 UTC","Longitude":"-82.449598","files":["/var/www/straped/mufon/html2text/9092.html.txt","/var/www/straped/mufon/org/9092.html"],"Tags":"City","Weather Factors":"Unknown","Country":"United States","City":"Tampa","Object Flight Path":"Undisclosed"}