{"Latitude":"26.648748","Object Shape":"Triangle","Summary":"Triangle shape,with about 10 to 12 lights under it, body looked shinney silver.","Region":"Florida","divs":["Sighting DetailsI was taking my two children and my cousins son to a fair that came to town.I was driving on Everest Pkwy towards Del Prado Blvd., I believe that we were heading west on Everest Pkwy. My cousin Tim was in the passenger seat, my two son's and my cousins son were in the back seat. As I was driving I looked up and saw bright lights and said \"what the hell is that\" and stopped the car. Besides the lights It was how low it was and slowing down to a stop over a field were a fire department once was, next to water plant that got my attention.I asked everybody in the car again \"what the hell is that\", everyone was getting excited.The object was still, I can see about 10 to 12 lights under it, with the light of the moon the body of it looked like a shinny silver color beyond the lights. The object started to move in the direction that we came, I turned the car around and the object moved faster as some of the lights went off. My cousin was saying what I was seeing \" Some of the lights went off and it is flying sideways \" I could not keep up with the object it was going fast and flying sideways up high till it was out of view.Everyone in the car was excited and all seen the same thing. If someone contacts me I would be glad to give a sketch of what the object looked like. I am happy that someone else seen what I have seen, I have seen other things in the past but never reported it because I did not want people to think I was crazy. But I have 4 others know that have seen."],"Viewing Distance":"101-500 Feet","Tags":"City","files":["/var/www/straped/mufon/html2text/9095.html.txt","/var/www/straped/mufon/org/9095.html"],"Date Submitted":"01/18/2008 07:45 UTC","Log Number":"US-01202008-0029","trends":["There have been 41 other sightings in Fort Myers","There were no other sightings in Fort Myers on or around January 18th 2008"],"Object Features":"Other","Date of the Event":"01/18/2008 07:45 UTC","Weather Factors":"Unknown","Country":"United States","Case Number":"9095","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=26.648748,+-81.863228(9095)&iwloc=A&hl=en\"> mufon case (9095) map </A>","Longitude":"-81.863228","City":"Fort Myers"}