{"Country":"United States","Source":"MUFON","Longitude":"-110.005667","Weather Factors":"Unknown","Region":"Arizona","Object Flight Path":"Stationary,Path with directional change","Case Number":"9097","Date of the Event":"01/18/2008 05:15 UTC","Object Shape":"Flash, Square, Rectagular","Summary":"entered, round blue light blinked, exited upward then dissappeared","Disposition":"Unknown","Object Features":"Dome","Viewing Distance":"501 Feet - 1 Mile","trends":["There have been 2 other sightings in Show Low","There were no other sightings in Show Low on or around January 18th 2008"],"Date Submitted":"01/18/2008 05:15 UTC","Log Number":"US-01202008-0031","City":"Show Low","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=34.265472,+-110.005667(9097)&iwloc=A&hl=en\"> mufon case (9097) map </A>","files":["/var/www/straped/mufon/html2text/9097.html.txt","/var/www/straped/mufon/org/9097.html"],"Latitude":"34.265472","Sighting Duration":"Undisclosed","divs":["Sighting DetailsDriving home east on 60 an object appeared to the right side of the highway across from the airport. I was driving with my 7 year old grandson in front daughter, and infant in back seat. I observed an object sort of like stream in and thought it was a low flying plane getting ready to land at airport. There was a blue round light on the bottom of object. The blue light flashed once then seemed to travel at a slant then vanished, all very quickly. I turned to my daughter and asked if she saw that! She said, saw what? My grandson quickly said I did! what was that? I asked what did you see? He said he saw it come in and the blue light blinked, left up and was gone. I asked him to draw me a picture when we got home, then told him that I think we just saw a ufo. He asked what a ufo is. I told them it's called an unidentified flying object, something we can't explain. When we got home he drew what he saw and it corresponded with what I had witnessed, but he seemed to see more detail than me in his drawing."]}