{"Object Flight Path":"Path with directional change","Country":"United States","trends":["There have been 7 other sightings in Oak Ridge","There were no other sightings in Oak Ridge on or around October 31st 1987"],"Summary":"Triangular about one feet wide with lighted corners and a rotating red light in the center.","Viewing Distance":"101-500 Feet","Longitude":"-84.260935","Case Number":"9099","Tags":"City","Date of the Event":"10/31/1987 12:00 UTC","Disposition":"Unknown","Source":"MUFON","divs":["Sighting DetailsI retired from the national nuclear security administration three years and few months ago after thirty years service. One morning while doing the out side inventory checks.i was invintorying the special nuclear material holding tanks when i saw a tringular shaped object with a round white light at each corner in the center it had a red revolving light . It apeared to be about one hundred feet over the beta three building travleing at three to five miles per hour makeing no sound at all.I'm a sport pilot and have just finished my buildind my second expiremental aircraft, I knew this wasn't any aircraft i had ever saw before.A helicopter would have made alot of sound and a fixted wing it would have stalled and crashed at that speed. It was a quite night with unlimited visibality.The object passeed dirrectly over head at an altitude of about two hundred feet and travled arround three hundred yards then turned left and flew over the security headquarters building and out of sight toward building 9212.This area is a no fly zone no aircraft are allowed in this area. My first reaction was to report it as soon as possible.I went to the shift supervisors office and told him what i had saw.His reaction was to ask me what i had been smokeing .I told him i'll never tell you bastards anything else he didn't take it very well to say the least.When you work at a nuclear weapons production plant you have to be very carefull to not be labled as a nut or worse . It was never reported to security as far as i know. To keep my job i kept my mouth shut. This happened at the Y12 nuclear plant in Oak Ridge TN. I spell check this so please look over the spelling."],"Region":"Tennessee","Log Number":"US-01202008-0033","files":["/var/www/straped/mufon/html2text/9099.html.txt","/var/www/straped/mufon/org/9099.html"],"Object Shape":"Triangle","City":"Oak Ridge","Date Submitted":"10/31/1987 12:00 UTC","Weather Factors":"Unknown","Latitude":"36.016956","Object Features":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.016956,+-84.260935(9099)&iwloc=A&hl=en\"> mufon case (9099) map </A>"}