{"Weather Factors":"None","Tags":"City","Viewing Distance":"Over One Mile","City":"Amarillo","Object Features":"Undisclosed","Country":"United States","Summary":"Jan 5th object that matches newspaper descriptions and is unexplained......","Object Flight Path":"Stationary","Date Submitted":"01/05/2008 11:00 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.227747,+-101.826097(9100)&iwloc=A&hl=en\"> mufon case (9100) map </A>","Disposition":"IFO","Sighting Duration":"Undisclosed","Object Shape":"Square, Rectagular","Date of the Event":"01/05/2008 11:00 UTC","Case Number":"9100","divs":["Sighting DetailsJan 5th at approximately 11pm we were driving home from a ski trip and were going to spend the night in Amarillo. We were driving south on 385 approximately 35-40 minutes outside of Amarillo when my husband awakened me to show me a strange appearing string of lights to the west. It appeared to be approximately a mile long and the lights were arranged in pairs (I counted 35 pairs). The red lights would fade on and off together, cycling about 1-2 seconds. The string of lights never moved and it was difficult to tell exactly how far away it was since distance can be deceiving late at night. We are not aware of any kind of structure like that in the area and we have travelled this road many times and never seen this before. At the time, we were the only vehicle traveling south on this road (it's a back road that connects Amarillo to Channing). We were very curious about the object from the moment we could see it until we passed it and it was out of site. The object remained stationary the whole time and we never could come up with a plausible explanation. When we heard about the Stephenville incident that occurred on Jan 8th, we immediately thought of the object we had seen on Jan 5th. The massive size and light configuration matched exactly what we saw. I spoke with Steve Allen and told him of what we had seen and he said he is aware of the back road we were driving and says there is nothing but land in that area. Just thought we would pass this on.....we didn't take phots because 1. my husband was tired and ready to get to the hotel and our camera was packed in the back and 2. it was so dark outside and was off in a distance, it probably wouldn't have shown up anyway."],"Longitude":"-101.826097","files":["/var/www/straped/mufon/html2text/9100.html.txt","/var/www/straped/mufon/org/9100.html"],"Region":"Texas","Latitude":"35.227747","trends":["There have been 15 other sightings in Amarillo","There were no other sightings in Amarillo on or around January 5th 2008"],"Log Number":"US-01202008-0034"}