{"Sighting Duration":"Undisclosed","Summary":"Bright circle of light. No blinking of colored lights.","Longitude":"-95.36294","Tags":"City","Case Number":"9101","Object Features":"None","Object Shape":"Circle","Viewing Distance":"20 Feet or Less","Date Submitted":"11/18/2007 09:10 UTC","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around November 18th 2007"],"City":"Houston","Disposition":"Unknown","Log Number":"US-01202008-0035","Object Flight Path":"Straight-line path","Weather Factors":"Unknown","Date of the Event":"11/18/2007 09:10 UTC","Country":"United States","Source":"MUFON","Latitude":"29.765323","map":"<A HREF = \"http://maps.google.com/maps?q=29.765323,+-95.36294(9101)&iwloc=A&hl=en\"> mufon case (9101) map </A>","divs":["Sighting DetailsOn the night of November 18, 2007, I was flying into Houston on flight CO 1848. It was around 9:05 when the pilot announced we would be landing in Houston in about 10 minutes and to fasten our seatbelts. I was sitting 3 or 4 seats behind the left wing of the 737. I was staring outside my window into the pitch blackness of the night wondering just where my location could be if I was 10 minutes from Houston. Suddenly, a bright circle of light (like a headlight from a car) started falling straight down from the sky with extreme speed. My first impression was, \"Where did this bright moon come from\". I quickly realized it was too bright and it was quickly falling straight down. I elbowed my wife and she saw a few seconds of the light falling. As I was watching the light, the wing of the 737 got in the way of my view. I thought to myself... \" I'll just wait until it reapears again under the wing\". To my surprise it did reapear for a second or two, but then, without slowing its' speed, it suddenly sped to the left (towards the back of the plane). The pattern was a perfect \"L\" (but backward). My wife looked at me and asked,\" What was that?\" I was shocked and spooked because I could not believe what I had just seen. I even forgot to mention it to the flight attendent or the pilots. I am pretty sure the pilot saw something also because it happened towards his frontal left side of his seat. Needless to say, I was not able to sleep much that night just thinking over and over of what I had seen. I bring this incident up now because I wonder... could the 10 minutes from Houston be somewhere over the vicinity of Stephenville, Texas?"],"files":["/var/www/straped/mufon/html2text/9101.html.txt","/var/www/straped/mufon/org/9101.html"],"Region":"Texas"}