{"Viewing Distance":"21-100 Feet","City":"Calgary","Country":"Canada","Object Flight Path":"Straight-line path","Longitude":"-114.053062","Region":"Alberta","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=51.04643,+-114.053062(9103)&iwloc=A&hl=en\"> mufon case (9103) map </A>","Date Submitted":"08/31/1987 12:00 UTC","Disposition":"Unresolved","Latitude":"51.04643","divs":["Sighting DetailsI came home later in the evening (still lived with the folks) and didn't feel like going in just yet. Our deck on the back of the house made it easy to climb up onto the balcony off my parents bedroom and then up onto the roof where I would go once and a while and lay in the crease of the roof line and stare up at the sky. I was laying on my back and I heard something moving through the air. The only noise was the air flow...what I'd imagine a glider would sound like. No engine sound at all. I looked into the direction of the sound and saw this large dark shape flying low over the rooftops (which is how I estimated the size using the area on the roof). It was no more than 50ft above the rooftops and it flew directly above me giving me the erie feeling that it meant to. It did not turn or change speed which was not much faster than a car driving through a neighborhood. Our house was in a large newer subdivision and the terrain sloped down to the east which was the back of the house (house faced west). The object was heading east south east and I watched it 'glide' off into the distance and got the impression it was moving along the slope, as in maintaining the same height above the rooftops, because it seemed to get lower than my vantage point as I watched it disappear. It was definetly triagle shaped and I remember thinking it was like a large hang glider. No lights and no sound other than airflow. At the time our house in Millrise was the south end of the city of Calgary. It was partly cloudy that night and a little cool. Cheers"],"Log Number":"CA-01212008-0001","trends":["There have been 76 other sightings in Calgary","There were no other sightings in Calgary on or around August 31st 1987"],"files":["/var/www/straped/mufon/html2text/9103.html.txt","/var/www/straped/mufon/org/9103.html"],"Summary":"Dark triangle shape about the size in the roof top of an average house.","Case Number":"9103","Sighting Duration":"Undisclosed","Date of the Event":"08/31/1987 12:00 UTC","Tags":"City","Object Shape":"Triangle","Source":"MUFON","Object Features":"Unknown"}