{"files":["/var/www/straped/mufon/html2text/9104.html.txt","/var/www/straped/mufon/org/9104.html"],"Object Shape":"Triangle","Country":"United States","Date of the Event":"06/15/1995 12:00 UTC","Date Submitted":"06/15/1995 12:00 UTC","City":"Twentynine Palms","Source":"MUFON","Object Features":"Unknown","Case Number":"9104","Weather Factors":"None","Latitude":"34.143798","trends":["There have been 6 other sightings in Twentynine Palms","There were no other sightings in Twentynine Palms on or around June 15th 1995"],"divs":["Sighting DetailsWe were at a Barbque with a radio disjocky. We have helicopter flying over all the time due to being near the 29 Palms Marine base. So when saw the lights at first we thought there where 3 helicopters. When it got near to us we noticed there where no sound at all. At each point there was a round very bright white light. When it got over us it was dusk and we could see the outline of the entire craft. It was huge and triangler in shape. It was very close to the ground. It was headed toward the base we tought maybe it was an expariment by the Military. The disjocky the next day called a friend at the base who said they have no reports and he then called someone in command they to said they heard nothing. Jim Boxley the DJ then decided to put on the air for anyone who saw the same thing we did and to call him. He had many calls, I am not sure just how many. My friend who lives with us talked to a few people who also saw it Last night we watched the Larry King Show and the two ladies on the program saw the same thing we did. We all kept it to ourselves due to my political ties in this area and did not want people to think we are crazy. This is the first we talked about it since we saw it. Until now I feel confident what we saw was real. I should tell you we are to to terribly far from area 51. I also cannot under stand how an objest that big can go toward the Marine base any no one said anything from the base."],"Tags":"City","Disposition":"IFO","Log Number":"US-01212008-0002","Longitude":"-116.048129","Sighting Duration":"Undisclosed","Summary":"Triangle shape with 3 lights, No sound and approx 2 football fields","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=34.143798,+-116.048129(9104)&iwloc=A&hl=en\"> mufon case (9104) map </A>"}