{"Object Shape":"Circle, Disc, Saturn-like","Object Features":"Dome, Window(s)","Case Number":"9106","Summary":"I was sitting on my bike on watching this huge ship hover and shoot a light beam around the ground then another beam shoot holes in the road.Located at Midway rd. and Sexton ln. in Dallas.","Country":"United States","Viewing Distance":"101-500 Feet","Object Flight Path":"Stationary,Hovering then path","Weather Factors":"None","Longitude":"-96.762353","Sighting Duration":"Undisclosed","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around July 20th 1969"],"files":["/var/www/straped/mufon/html2text/9106.html.txt","/var/www/straped/mufon/org/9106.html"],"Latitude":"32.805565","Date of the Event":"07/20/1969 12:00 UTC","Tags":"City","Source":"MUFON","Region":"Texas","City":"Dallas","divs":["Sighting DetailsI had a strong instinct that something was coming,so I wrote president Nixon in red crayon ,that the aliens were coming.I never told my parents because they never listened to me.The night of the incident after midnight I quietly got my kodak brownie camera and my bike,and left the house.We lived at 4338 Merrell rd.in Dallas,Texas.I waited at Sexton and Crestline on my bike for what was to come,I did not know what a Ufo was.After an hour or so I saw a dark collaseum like object high in the sky with red lights come closer and hover over Midway rd. and Sexton ln.It had a loud circling sound,as it hovered it shot out a spotlight along the ground as if searching then it shot out rays of light blowing holes into the asphalt.People started to look out windows and come outside as I rolled my bike closer.A womans voice yelled out something from the ship then the spotlight found me.A strong force and a heavy sound without a light pulled me on the bike into the air.People were screaming as the force carried me high into the air until it ditched me in Mexico.Then I saw the ship land so I walked a good distance to it.I took a picture of it with my camera.I walked up the platform ramp and went inside where I saw this very big woman and the aliens with big black eyes,long fingers,with skin like the texture of a whale or shark but not wet.They were the same size I was and seemed to have animal instincts like that of a cat. I became scared when they pushed me to a table where they opened my skin with their fingers it didn't hurt but it wasn't understandable.They stopped being forceful with me when I calmed down and they sensed that I wasn't afraid.They stopped looking at me and one of them took me to the center of the ship that was a crystal like opened area that flashed lights back and forth and hummed and then got louder.There was a small window where I literally saw the Earth disappear into a tiny sphere then it was gone.The ship moved so fast it's hard to say.There were others of all ages on the ship that had been there a long time,some were scared of the woman others of the aliens.I got into a small circular ship with one of the aliens it had windows all around.It flew into a galaxy that had two suns and we landed on the planet that was a botanical nightmare. The plants moved and were dangerously grand.The alien became scared so we left. I'm trying to remember everything with time I will.The bigger ship landed back in the jungle so I walked out on the ramp where U.S. government men were yelling then one grabbed me and as the aliens came out they began rapid fire killing the aliens.They put me in a Jeep with gov't guys that drove me through a thicket of jungle every now and then they had to stop and cut the path.They said the neighbors reported my abduction and they had several witnesses in Mexico as to the location. I later learned they had tracked the Ufo from airplanes and the radio.The woman was able to send radio contact from the ship.Of course they confiscated my camera and I've never seen the photos I took but they would have been great.They put me in a van with two guys from the C.I.A. that drove me back to Dallas from Mexico.They dropped me off at Love field airport where I called my parents.They were furious since they thought I had ran away it seemed like I had been gone a few days when in fact it was more like a month.A few days later the guys came by the house with my bike and told my parents that I had been abducted. The neighborhood was in a frenzy so the gov't hauled me in and told me that I have to say that yes there was a Ufo but to not give out other details. I had to talk to the media to as they say \"calm the people down\".I learned that as the force drew me up with the ship it had also pulled people out of they're beds onto the ceiling.One man held onto the side of his rooftop to keep from getting pulled up.The gov't moved alot of them out of their houses.Later I only saw one of the neighbors in high school\"Ann\".I had many people stand by me that I had the experience other's like Carl Sagan badgered me to no end and called me a liar.I stood my ground then as well as now with people trying to hide behind their fears.You haven't seen it all until you've seen the Earth disappear in the window. There's so much more missing that having a therapist would greatly help.Over the years I have said nothing to anyone,because I have not been able to remember."],"Disposition":"Hoax","Date Submitted":"07/20/1969 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.805565,+-96.762353(9106)&iwloc=A&hl=en\"> mufon case (9106) map </A>","Log Number":"US-01212008-0004"}