{"Weather Factors":"Unknown","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around October 15th 1984"],"Tags":"City","Object Features":"None","Region":"California","Country":"United States","Case Number":"9107","Date of the Event":"10/15/1984 09:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9107.html.txt","/var/www/straped/mufon/org/9107.html"],"Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=37.77982,+-122.412096(9107)&iwloc=A&hl=en\"> mufon case (9107) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"10/15/1984 09:30 UTC","Log Number":"US-01212008-0005","divs":["Sighting Details I can't recall the exact date or year that happened since it was so long ago...I was in High School at the time in the mid 1980's and I can say it was around 1984 or 1985. I don't recall the exact month either. When this happened I sort of just dismissed it and put in the back of my head. I did not record any data. I lived in an area called 'Top of the Hill' in Daly City, California. It's just next to San Francisco, literally just a few blocks, but it belongs to the adjacent San Mateo County. This area has a small Hill facing East, to the North is San Francisco and the open Pacific Ocean to the exact West, which I had a clear view to from my backyard. I used to practice an exercise routine on my backyard on the weekday evenings so it could have been a Tuesday-Friday. The weather was a little foggy , which is typical of this area in the Spring, Summer,and Fall; with a light breeze and pleasant. The fog was not too low but high around 2000 feet...The night was quiet with only a few neighborhood sounds on the background. I don't know what made me turn around and look East towards the top of the hill, but there appeared a black triangle shaped object flying by. The triangle was metallic dark with a green glow around the edges and spinning in the most 'subtle' way, a slow spin while it flew overhead. There was absolutely no sound at all. Just the spinning and flying-floating away. It was the size of a small house, 100 feet each side in the triangle. The whole experience lasted only a few seconds..? It transversed from the East 'top of the hill' and headed West towards the Pacific Ocean until it disappeared into the horizon and fog. The speed was low as to float on air then it sped up into the ocean. It left me puzzled for a few minutes and then I tried to explain and use the laws of physics to categorize. It was not an airplane. Not a helicopter. Not a blimp. All the aircraft I have seen to date do not compare a bit. Not even the 'new' Stealth Bombers that exist today and this was the mid 1980's. Characteristics that stand out were: floating and spinning slowly as it flew overhead and total silence. Not a buzz or engine, not even with wind changes to take into consideration. I was dumbfounded for a few minutes after. I told my brother about the incident at that time but left it there as a big question mark. The years have gone by and it's not until these days of internet that I was made aware that other people have seen similar objects. I don't know if others saw what I experienced then. I haven't found any information online. I am still curious what that was and if I was the only person looking up at that point. In a city like San Francisco with the Bay Area having 5 million people I wonder how that went 'unnoticed'? Is there more information? I wonder."],"Object Flight Path":"Hovering then path,Straight-line path","Disposition":"Insufficient Data","Latitude":"37.77982","City":"San Francisco","Summary":"dark triangle with green light glow on the edges","Longitude":"-122.412096"}