{"Sighting Duration":"00:20:00","Viewing Distance":"Over One Mile","trends":["There have been 26 other sightings in Lakeland","There were no other sightings in Lakeland on or around January 20th 2008"],"Tags":"City","Object Features":"Dome","Region":"Florida","Case Number":"9109","files":["/var/www/straped/mufon/html2text/9109.html.txt","/var/www/straped/mufon/org/9109.html"],"divs":["sighting detailsi was on my way home from sarasota around 7 pm last night. i was late getting out of sarasota so i exited i-75 at the brandon mall exit (highway 60)to save time. my mind was on getting home and not getting a ticket and listening to a cool cd that i had gotten yesterday afternoon. as i was driving, i remember thinking that i must tell a friend of mine that \"they\" are here and that \"they've\" been here for a very, very long time (from reading zecharia sitchin's books about the nefilim). then no sooner did i think that thought that i then looked up in the sky ahead of me between brandon and lakeland and all of a sudden something caught my eye and i thought \"boy that's weird, i've never seen an airplane with all of those colors.\" i kept watching it expecting that as i got closer that i would recognize that it was an airplane. then the next thing i thought was \"oh, my god... it's a ufo!\" my next thought as i tried to talk myself out of it was... \"that can't be a plane. i've never seen a plane shaped like that.\" then the colors all along the bottom started to spin around and around in a band all around the bottom of the craft with regulated intermittent black outs (like morse code only with colors that moved around the craft but they didn't blink). it looked oval or round in shape with a round domed top. the light band was all along the bottom occupying approximately 1\\4 of the craft. the colors moved from left to right. there was some sort of dim light on the top but the bottom perimeter spun round and round with the blocks of color. then i thought again... \"oh, my god it is a ufo... why aren't people pulling off the highway? why aren't other people seeing this?\" i watched it up in the sky ahead of me until i had to turn off of highway 60 to reach my home in south lakeland. this is my account of my experience last night while driving between brandon and lakeland, florida on highway 60 at approximately 7:00."],"Longitude":"-81.94401","Date Submitted":"01/20/2008 07:00 UTC","Source":"MUFON","Summary":"Saw UFO with band of colors along bottom of craft between Brandon and Lakeland, Florida last night, January 20, 2008 at around 7:00 pm.","Date of the Event":"01/20/2008 07:00 UTC","City":"Lakeland","Object Shape":"Egg","Disposition":"IFO","Object Flight Path":"Stationary","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=28.016394,+-81.94401(9109)&iwloc=A&hl=en\"> mufon case (9109) map </A>","Latitude":"28.016394","Weather Factors":"Unknown","Log Number":"US-01212008-0007"}