{"Source":"MUFON","Object Shape":"Circle","trends":["There have been 15 other sightings in Carrollton","There were no other sightings in Carrollton on or around December 31st 2007"],"Date of the Event":"12/31/2007 09:15 UTC","Weather Factors":"Unknown","City":"Carrollton","Latitude":"32.981432","map":"<A HREF = \"http://maps.google.com/maps?q=32.981432,+-96.881704(9111)&iwloc=A&hl=en\"> mufon case (9111) map </A>","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Summary":"4 orange lights in a staright line","Sighting Duration":"Undisclosed","Longitude":"-96.881704","Object Features":"None","Case Number":"9111","Log Number":"US-01212008-0009","Disposition":"Unknown","divs":["Sighting DetailsI was at my home in Carrollton TX and i was getting ready fixing to go out for new years and i was getting ready,while my boyfriend and his friend were waiting outside. My boyfriend then screamed my name to go outside. My sister and her husband who where also inside ran outside with me. When i looked up there where 4 orange lights in the sky. They where in a perfect line and perfectly seperated and they where moving slowly across the sky heading south. The fourth light that was at the end seemed to be staying a lil behind and then sped up a bit back to its spot. We stood there and watched the lights as each one just seemed to fade into the sky this lasted maybe 5 to 7 minutes until the last light disappeared into the sky. At that moment we didnt know who to call and like always are camera was dead. I wanted to report it but i listened to the radio and watched the news and didnt hear any reportings. So i felt stupid to report, but as i am hearing about all the sightings in Texas its freaking me out and made me realize that we where not the only ones who saw the lights."],"files":["/var/www/straped/mufon/html2text/9111.html.txt","/var/www/straped/mufon/org/9111.html"],"Tags":"City","Region":"Texas","Country":"United States","Date Submitted":"12/31/2007 09:15 UTC"}