{"Viewing Distance":"Unknown","Tags":"City","Object Shape":"Other","trends":["There have been 16 other sightings in Sarnia","There were no other sightings in Sarnia on or around July 10th 1979","This sighting has never been favorited.",""],"divs":["Sighting DetailsA beautiful day in July of 1979. I was driving my dad's car to a nearby town. My 4 year old son was in the back seat. He was sitting right behind me. As we drove along a short stretch of straight road that had few houses, mostly fields, he kept asking me \"Mommy what's that?\" I looked in my rear view mirror and noticed that he was looking up out of his window. Without looking where he was looking I just answered \"a bird\", \"a phone wire\". He asked me again \"Mommy what's that?\" This time I looked out of my window and looked up. To my amazement I saw a chrome silver coloured object in the sky hovering above us. I can remember how beautiful the blue sky was against this object. It was barbell shaped (cylinder shaped body with round balls at each end of the cylinder). I watched it as I drove. We had to drive about a quarter mile before I could stop. It followed us around a bend and over a bridge. When I pulled the car over and got out it started rising straight up until it was out of sight. It made no noise. I tried to make sense of what it could have been at the time when my son asked me \"Mommy what's that?\" I do remember being very excited. After it disappeared I raced to my sister's office (she worked for the local police department) and I told her what we saw and asked if anyone else had reported a UFO sighting. No one else had. Today, January 21, 2008 is the first time I've ever looked on the internet to see if there were any UFO pictures that showed a likeness to the object I witnessed. I did find a site www.ufocasebook.com \"The Best UFO Pictures Ever Take, Page 8. The photo of the object shot by Steve Mera July 2005 in the United Kingdom is identical to the object I witnessed. If you click on the photo it will show you the whole photo. It made me very excited again to see that object, and to know that someone else saw the same type of craft that I saw some 26 years later. The attached photo is that taken by Steve Mera. But it is exactly like the one I saw."],"Log Number":"CA-01212008-0016","City":"Sarnia","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9118.html.txt","/var/www/straped/mufon/org/9118.html"],"Weather Factors":"None","Object Features":"Other","Date Submitted":"07/10/1979 01:00 UTC","Object Flight Path":"Unknown","Latitude":"42.99256","Region":"Ontario","Date of the Event":"07/10/1979 01:00 UTC","Longitude":"-82.35561","Disposition":"Unresolved","Summary":"Barbell Shaped Object. Followed my car for 1/4 mile. It was chrome silver in colour. It was silent. It lifted itself straight up and out of sight.","map":"<A HREF = \"http://maps.google.com/maps?q=42.99256,+-82.35561(9118)&iwloc=A&hl=en\"> mufon case (9118) map </A>","Case Number":"9118","Country":"Canada"}