{"Date Submitted":"04/15/1997 12:00 UTC","Summary":"Time loss during civilian night flight","Sighting Duration":"Undisclosed","Tags":"City","files":["/var/www/straped/mufon/html2text/9119.html.txt","/var/www/straped/mufon/more/9119_submitter_file1__F-18sRussell248.jpg","/var/www/straped/mufon/more/9119_submitter_file2__F-18sRussell250.jpg","/var/www/straped/mufon/more/9119_submitter_file3__F-18sRussell251.jpg","/var/www/straped/mufon/org/9119.html"],"Weather Factors":"Unknown","Latitude":"36.866751","trends":["There have been 4 other sightings in Hopkinsville","There were no other sightings in Hopkinsville on or around April 15th 1997","This sighting has never been favorited.",""],"Log Number":"US-01212008-0017","map":"<A HREF = \"http://maps.google.com/maps?q=36.866751,+-87.487339(9119)&iwloc=A&hl=en\"> mufon case (9119) map </A>","City":"Hopkinsville","Object Flight Path":"Other","Disposition":"Unknown","Date of the Event":"04/15/1997 12:00 UTC","Case Number":"9119","divs":["Sighting DetailsOn or about April 15 (exact date can be checked as we filed a flight plan to Dyersburgh Tenn.)a friend of mine ( now deceased less than a month later ) and I were to fly machined parts from his company to Dyersburgh Tenn. We rented a Cessna 172 and flew straight thru with no problem. In the flight office prior to our return flight we were watching a line of thunderstorms moving west to east and trying to decide when it would be safe to depart. As the line moved thru we decided to takeoff and fly to the backside of the storms heading north while the storms moved off. I wrote our departure time on the edge of the flight map as approx. 8:10 pm. We were ,what I believed to be an hour and a half into our flight when, as we flew north (I was piloting the aircraft and Tom was tending to the navigation)we began to encounter some clouding conditions and zero visibility. I immediatly changed our heading 180 degrees. A moment later ( or so it seemed ) Tom said to me \" what time have you got?\" I immediatly felt as though I had just been awoken. I was trying to gather my thoughts when Tom said \" hey, your watch is stopped\" I looked at my wrist watch and it was stopped at 7:25 , which alarmed me as I had used it earlier to check our departure time. I looked at all of our guages and they were not functioning either. Tom had a laptop nav. device that wasn't working either. We were both speechless for a short time. We were now in clear air and found a private airstrip to set down at. Getting our bearings again and with all the equipment back up and running ( watch included, though still an hour and a half behind ) we flew on back to Dayton intn'l with no further incidents. We didn't discuss it much after that and Tom had a massive heart attack a few weeks later and died. Myself, I started drawing. I will include some of these drawings I did after our flight. I have some more drawings but can't seem to get them uploaded. I have also some other sightings to report at some point that I have seen around Wright Pat. as I live not far from there."],"Longitude":"-87.487339","Object Features":"Window(s)","Viewing Distance":"Unknown","Object Shape":"Other","Region":"Kentucky","Country":"United States","Source":"MUFON"}