{"Longitude":"-97.321401","City":"Whitney","Summary":"bright green fluorescent cylinder shape with clear lights at tip","Region":"Texas","Object Shape":"Cylinder","Object Features":"None","Log Number":"US-01212008-0018","Case Number":"9120","files":["/var/www/straped/mufon/html2text/9120.html.txt","/var/www/straped/mufon/org/9120.html"],"Date Submitted":"12/30/2007 07:15 UTC","Tags":"City","Date of the Event":"12/30/2007 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.951823,+-97.321401(9120)&iwloc=A&hl=en\"> mufon case (9120) map </A>","Sighting Duration":"00:00:25","Source":"MUFON","trends":["There have been 2 other sightings in Whitney","There were no other sightings in Whitney on or around December 30th 2007"],"Object Flight Path":"Path with directional change","Latitude":"31.951823","Viewing Distance":"501 Feet - 1 Mile","divs":["Sighting DetailsAfter eating supper in town of Whitney TX on the evening of Dec 30, 2008, my husband and I were driving back home about 7:15 pm and saw this object. This date is approximate, but I do know it was on the day he returned from one of his trips as a corporate jet pilot. It was a very cloudy, misty, wet and cold evening - very dark. The object became visible to us in the southwest sky even through the clouds over a pasture to the south of HWY 22 between Whitney and the dam at Lake Whitney. At first, we thought it was fireworks because of the fluorescent glow, but it was coming down rather than gowing up. Then, we thought it was a falling star; but we've never seen one that color - bright fluorescent green. Also, it did not burn out as it come closer to earth. There was a brighter clear light at it's bottom tip. It was coming straight down virtically, then; it swiveled to reveal that it was not one light but two; and we were only seeing one side at first. As it got close to earth (a few feet over the tops of the trees), it quickly turned horizontally and sped off away from town and out of view. The whole event lasted for only a few seconds, so we did not have time to get a picture. Plus, it's movement was so fast, it would not be possible if we were prepared for it and had a camera in hand. We thought we would hear from others in town or the area about seeing the same thing but have not yet. When the sightings surfaced later in the Stephenville area, we thought our info might be helpful as well. We have been very curious about what it was since we've never heard of any lights of this nature or seen anything like it before. Let us know if we can provide any other details."],"Weather Factors":"None","Country":"United States","Disposition":"Unknown"}