{"map":"<A HREF = \"http://maps.google.com/maps?q=31.75334,+-106.488974(9123)&iwloc=A&hl=en\"> mufon case (9123) map </A>","Longitude":"-106.488974","Case Number":"9123","Source":"MUFON","Region":"Colorado","Country":"United States","trends":["There have been no other sightings in El Paso","This sighting has never been favorited."],"Tags":"City","Object Flight Path":"Stationary","Latitude":"31.75334","Summary":"massive, clouded, lits edges, bolts of lightnnig, huge shaft of light to ground","divs":["Sighting DetailsAt end of September or first of October 1997(exact date?)I was camping in New Mexico near the state line of Colorado, south of Durango with my wife. We were in a camper parked on a hill over looking a big lake. I woke to wind & lightning in the distance to the north and saw a huge oval shape throbbing with light as big storm clouds ripped past it. It was many miles from me but I had a clear view, the clouds were near it only. It was clearly pulsing with light over all but had a linier effect of multi colored lights aross the bottom area. Massive bolts of lighning were coming from above it to the ground to the east, or down wind. I saw many bolts of this lightning. Then a massive white beam of light shot from beneath the oval down to the ground. I remember it was 5:30 in the morning. The beam lasted a few minutes then shut off. The throbbing light faded and the lightning quit. Over all that was the end of it. I was on a fishing trip so I fished all the next day. Then late the next day I thought about it more and looked at the map to assume this events location. It was close to bayfield so I called the sheriffs office in Bayfield Colorado and spoke to a deputy that had seen the same thing. At first he wouldn't say anything and quizzed me about what I had seen. After I told him my story he said he saw the same as he drove into work that morning. he said his view was from underneath it as he was on hwy 160 east of Durango, Colorado. He mentioned the multicolored lights on the edges and the throbbing massive element above him . And he said the shaft of light hit the ground about 1000 yards from him. Said it was as white and bright as anything. Then shut off and it left the area. He said he had a police dog with him that cried and its hairs stood on end. He investgated the ground under the light but found nothing. I called the Durango airport tower and they reported nothing... they had to have seen this. It was enormous. Have not thought much about it untill I learned of your organization the other day."],"Object Features":"Unknown","Date of the Event":"09/29/1997 05:30 UTC","Date Submitted":"09/29/1997 05:30 UTC","Log Number":"US-01212008-0021","Object Shape":"Oval","City":"El Paso","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9123.html.txt","/var/www/straped/mufon/org/9123.html"],"Disposition":"Unknown","Viewing Distance":"Over One Mile"}