{"Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Object Flight Path":"Path with directional change","Object Features":"Unknown","Country":"United States","Source":"MUFON","Summary":"Driving On I75 North, and I16 West in Middle GA -- Flashing object","files":["/var/www/straped/mufon/html2text/9124.html.txt","/var/www/straped/mufon/org/9124.html"],"Latitude":"32.849335","map":"<A HREF = \"http://maps.google.com/maps?q=32.849335,+-83.624212(9124)&iwloc=A&hl=en\"> mufon case (9124) map </A>","Viewing Distance":"501 Feet - 1 Mile","divs":["sighting detailsas i was driving westbound on i16 (away from savannah, towards macon), i started seeing a very bright flashing light over the northern tree line. i at first thought that it could be heat lightning, but then noticed that it was too rhythmic and consistent. this is a very rural area, even just a short distance out of macon, and there were no other major lights or cars around at this time. after a minute or two of the seeing the light blinking, an object came over the tree line (southbound) and i could see that the pulsating light was coming from the bottom of it. the light was too bright when it was on to make out the shape of the object emitting it, and when the light went out i could not see anything. the object was several hundred yards above the trees, and came over the tree line in to sight for only a few seconds. it made an abrupt u-turn and went back northbound and out of sight. my first thought was that it must be a helicopter, but i quickly decided that it was not for several reasons: 1. helicopters usually use a spotlight to look for something, not a flashing light that projects from the bottom and side of it. this would not be useful for any normal purpose. 2. it's movement was too smooth and unwavering to be a helicopter. 3. i did not hear any sound (my windows were up at this time). my second thought was that it could be a weather balloon, but weather balloons do not move of their own accord - especially in such a fast, smooth manner. i also thought to look for reactions from other people, but there was literally nobody else on this rural section of interstate. approximately 20-30 minutes later i had turned onto i75 northbound and was just north of macon. this is a much more highly trafficked portion of interstate and there were now several other vehicles around. as i continued north, i observed a flashing light, exactly as described before, over the western tree line. after several seconds, the object came over that tree line (eastbound) and over the southbound lane of i75. other vehicles started braking dramatically as they were staring at the object (light traffic, no other reasons to stop). the object never came to a complete stop, but slowed almost to hover and then turned northbound (appx. 90 degree turn) for a short distance before turning and traveling back over the western tree line. during the encounter this time, i thought to role my window down, but was unable to hear anything. the distance was such that i definitely would have heard it if it was a helicopter. the height was about the same as before, and i would say, in linear distance, it was no more than about 1 - 2,000 yards from me. i would estimate the maximum travel speed (that i saw) to be 40-60mph. also, judging by the size of the light when it was illuminated, i would say the object (craft?) was approximately the size of a large helicopter or small plane. note: the date and time given for this event are approximate, as this was written well after the fact. regarding credibility: i am college educated police officer in a major suburb of atlanta. i have never posted anything like this before, and do not claim any supernatural\\extra-terrestrial activity to have occurred - simply and unexplained sighting that has made me very curious. this was striking enough to me that i have often pondered it over the last several years, but never knew of an appropriate venue to discuss it until i found this website. i also noticed that there is another user who posted a somewhat similar, but slightly vague, incident in the same date range in the same area. that definitely made me feel more obliged to post this."],"Date of the Event":"08/31/1998 12:00 UTC","Date Submitted":"08/31/1998 12:00 UTC","Tags":"City","Log Number":"US-01212008-0022","Longitude":"-83.624212","Region":"Georgia","Weather Factors":"Unknown","trends":["There have been 4 other sightings in Macon","There were no other sightings in Macon on or around August 31st 1998"],"City":"Macon","Case Number":"9124","Object Shape":"Unknown"}