{"files":["/var/www/straped/mufon/html2text/9126.html.txt","/var/www/straped/mufon/org/9126.html"],"Date Submitted":"08/31/1973 12:00 UTC","Country":"United States","Sighting Duration":"00:05:00","City":"Dallas","Longitude":"-96.761003","Object Shape":"Circle","Latitude":"32.812315","Disposition":"Hoax","Log Number":"US-01212008-0024","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Summary":"Mt Crk Lake - Dallas TX 1973","Object Features":"Undisclosed","Source":"MUFON","trends":["There have been 116 other sightings in Dallas","There were no other sightings in Dallas on or around August 31st 1973"],"Viewing Distance":"Unknown","divs":["Sighting DetailsI'm 50 now, and the UFO sighting occurred when I was 16, and the beginning of my sophomore yr, and it was a nice night, not cold out yet. My sighting was different than most I hear about. I had just gotten my first car a used Chevy Belaire, and picked up my steady for a first time ride. Also, during that first ride I was trying to muster up enough nerve to breakup, because I wanted to date. Anyway, he wanted to go to Mountain Creek Lake, near Mt View College in Dallas (aka Oak Cliff) to neck. I had never been there with him or as the driver, but we went. It was dark and I was driving up and down hilly treed narrow roads around the lake looking for a place to park and a car came flying in our direction headlights facing us and nearly wiped us off the road. That shook me up so bad I parked as soon as possible. We were parked in a public looking amber lit parking lot behind the electrical or water treatment plant at Mt Crk. I say behind because all I remember seeing is one window up fairly high and you would be able to see the water and craft out of that window. We always knew swimming was not allowed because of the electrial currents in the water. So I had stopped, heart beating fast from that driver, only car in the parking area which seemed odd, and we were just startled at what we saw. Very still, above the water but not touching it (maybe 3 ft and nothing in between it and the water) was a huge craft the size of a big ship but like none we'd ever seen before. We were like what in this world looks like that? It had lights running, maybe out little windows at the top. You could not see the bottom of this craft because it was sitting just 3 ft or so above water. So there were no visible doors or windows except what the light was coming from, which was not normal. The fact that nothing was in between the huge heavy craft which was quite tall and rounded but we did not see all around it and sitting abbove water seemed impossible. It was silent but running because of the lights moving. We thought of everything it could possibly be in minutes and narrowed it down very quickly to a UFO fueling up on the electricity from the currents down in the water. I wondered why we saw no one. Even the plant looked vacant and no one was looking out that one window. The view would have drawn a crowd. I would say in about 5 minutes we figured out we were in front of a huge UFO and we had to get away fast. My curfew was 11 pm that night. I got home approx 10:20 or 10:30 because my Mother commented she didn't expect to see me early. I told her what I saw and why. She sort of acted like she believed me. I never spoke to the boyfriend again after that, but I'm sure he must remember the last time we were together to this day. This is the absolute truth and if anyone has had any experience similar to mine in that area I want to hear about it. I went on about life, but anytime there was any UFO reported, I would know I was not the only one who believes and will to the day I die."],"Tags":"City","Case Number":"9126","Region":"Texas","Date of the Event":"08/31/1973 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.812315,+-96.761003(9126)&iwloc=A&hl=en\"> mufon case (9126) map </A>"}