{"Country":"United States","Object Flight Path":"Hovering then path","Weather Factors":"None","Date of the Event":"01/31/1964 09:00 UTC","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.729399,+-97.31567(9129)&iwloc=A&hl=en\"> mufon case (9129) map </A>","Case Number":"9129","Latitude":"32.729399","Disposition":"Unknown","divs":["Sighting DetailsI have seen two UFOs before, which were together at the same time, and that was when I was around 10 or possibly 11 years old. Here is why I know my age, keep in mind that I was born in 1953. I'm 54 now, so you can see it's been a long time ago. I wasn't the only one who saw them. My mother saw them also, who passed away in 1976. The only reason that I can tell you a time frame since it's been so many years ago is because we went to the drive-in movie in South Fort Worth called the Southside Drive-in, with our good friends. I remember the movie that was showing was \"Tom Jones,\" which is dated 1963. I remember this because I hated it and my mother hated it. I was too young to be interested in it back then. I was sitting next to her in the back seat of a large station wagon that our friends had. Both my mother and I saw the two UFOs around the same exact time. I'll never forget that. Needless to say that was a whole lot more interesting than the movie! Why do I think they were UFOs? It's weird that I can still visualize this, but I can see them clearly. We were looking at the drive-in screen and to the upper left of the screen in the sky, one oval-shaped UFO came up of what appeared to be several inches above the movie screen. Of course, it was probably a good distance. Then, directly to the left of that one, another one came up, same shape and everything, but they were not quite even in their hovering. Both were exactly the same appearance, oval-shaped, luminous objects, no other colors at all, just light-colored luminous objects. They hovered there for several minutes. It was one of those type of things that you cannot take your eyes off of and you're actually speechless. Then, the first one that came, went up and a little bit to the right, although upwards, and took off so quickly, then the other one did the same thing, both flying off together. It was almost simultaneous, but yet a little variance between the two. It happened so quickly. From what I am remember, they came from the east. I looked at my mother and said, Did you see that, Mama? She replied, Yes, DO NOT SAY ANYTHING! And that was in a very low voice but emphatic. It really did scare her. I wasn't scared, and I wanted to talk about it. We talked about it when we got home, but she made me promise to never mention it to anyone. I'm sure she thought they'd think that we were crazy. However, I did mention it to my daddy, who just listened intently. I don't feel that he thought that at all. He just knew that we both saw something extremely unusual, and I think that he wished that he could have seen it too! Apparently, our friends that we were with didn't see it. My mom's lady friend was in the front seat watching the movie all the time. Since one rolled up on a little hill to park your car to watch a movie (remember, it's a drive-in), I still don't know if she could have seen it, honestly, unless she was looking in that direction and bending her neck down. I had wished my mother would have said something anyway. It's possible that others at the drive-in or anywhere else saw it, though. That's the only reason that I'm posting this incidence. I can never forget this, but I don't talk about it much. I've told my husband, who himself thinks that he's seen a UFO also in his teenage years."],"Date Submitted":"01/31/1964 09:00 UTC","Object Shape":"Oval","Source":"MUFON","Log Number":"US-01212008-0027","Object Features":"Unknown","Longitude":"-97.31567","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9129.html.txt","/var/www/straped/mufon/org/9129.html"],"trends":["There have been 128 other sightings in Fort Worth","There were no other sightings in Fort Worth on or around January 31st 1964"],"Sighting Duration":"Undisclosed","Tags":"City","Summary":"Two UFOs to the left-hand side of Drive-in Movie theater","City":"Fort Worth"}