{"Case Number":"9130","files":["/var/www/straped/mufon/html2text/9130.html.txt","/var/www/straped/mufon/org/9130.html"],"divs":["Sighting Details In 1999, I had lived in front of a golf course in Moorestown, NJ. As I was sitting in my kid's room, I noticed a small bright light outside the window in front of my house, which overlooked a golf course. The light was too large to be a plane or a planet. I immediately went outside to check it out. It hovered in one place for a long time over the golf course, hundreds of feet in the air and about 400 yards away from my home. It was quiet outside and I heard no sounds of an airplane engine or helicopter. It was just baffling to me what it was! It was too high in the sky to be a crane or man made device, but it was also close enough to me that I should have been able to hear it, if it was indeed, a helicopter. It was simply a bright, clearly circular, white light that simply would not move from its position. It just stayed still. I showed it to my wife and to both of my kid's and even filmed it, but later on I could not see on the film much more than I saw up close, as the lens went in and out of focus and it was dark outside. After awhile, I went inside, as it was cold and I had been outside for about 30 minutes watching it. I came out about an hour later, but this time the light had shifted about a half mile southeast of its earlier location. It was no longer over the golf course, but had moved to what seemed like it was over the Main Street of our town. Again, it would not move and just hovered still. I called the Moorestown Police and I asked if anyone else had reported seeing anything in the sky over Moorestown. The operator told me \"NO\", and I asked her to have someone check it out. I never heard back from the police and I never heard of anyone else reporting what I had seen either. For years, I did not know who to report it to and I always thought that if it were a real UFO certainly many people would have noticed it that night. However, not many people are out on cold, dark winter nights and they usually would not be paying attention to the sky. Perhaps I was the only one who did notice it that night. In any case, I am glad to finally tell somebody about this incident."],"Country":"United States","Sighting Duration":"Undisclosed","Region":"New Jersey","Date Submitted":"12/31/1998 07:30 UTC","Date of the Event":"12/31/1998 07:30 UTC","City":"Moorestown","Log Number":"US-01212008-0028","Latitude":"39.977712","Object Shape":"Circle","Summary":"A bright, white circular light","map":"<A HREF = \"http://maps.google.com/maps?q=39.977712,+-74.947486(9130)&iwloc=A&hl=en\"> mufon case (9130) map </A>","Longitude":"-74.947486","Viewing Distance":"Unknown","Disposition":"Unknown","Object Flight Path":"Undisclosed","Tags":"City","Source":"MUFON","trends":["There have been 4 other sightings in Moorestown","There were no other sightings in Moorestown on or around December 31st 1998"],"Weather Factors":"Unknown","Object Features":"Undisclosed"}