{"map":"<A HREF = \"http://maps.google.com/maps?q=38.944083,+-77.068379(9134)&iwloc=A&hl=en\"> mufon case (9134) map </A>","Country":"United States","Object Flight Path":"Straight-line path","Case Number":"9134","Date Submitted":"01/10/2008 09:30 UTC","trends":["There have been 54 other sightings in Washington","There were no other sightings in Washington on or around January 10th 2008"],"Region":"District of Columbia","Log Number":"US-01212008-0032","files":["/var/www/straped/mufon/html2text/9134.html.txt","/var/www/straped/mufon/org/9134.html"],"Viewing Distance":"Over One Mile","City":"Washington","Disposition":"Unknown","Date of the Event":"01/10/2008 09:30 UTC","Tags":"City","Longitude":"-77.068379","Source":"MUFON","divs":["Sighting DetailsI was driving to a friend's house about 1-2 miles from my house. I was traveling south on Puerto Rico Avenue NE. I was looking at a large crane on the Catholic University of America's campus. They are building a new dorm and I was looking at the construction site. Then I saw a shooting star like thing in the sky. It was really bright flash in the sky that seemed to be a neon green color. The object was traveling at an unbelievably fast speed, much faster than any plane. The light seemed to leave a bright trail that was quite large. The object looked to be very far away. I was shocked, I never saw anything like that before. I watched it for a few seconds and then it disappeared in the sky. It was going so quick that not many people would have seen it. I was looking up at the crane and then it just appeared and then shot across the sky and disappeared. The first two thoughts that came to my mind was a UFO type object or a really large bright green star or meteor crashing into our atmosphere. There wasn't able to see where the flash was going, it was coming down, but it was moving so fast. My eyes could not keep up with this large bright missile like object. I went to my friend's house and greeted them. Within the first two minutes I brought up my experience driving over. I believe I said something like \"Guys, I think I just saw a UFO. I saw this unbelievable shooting light in the sky. It was either some UFO, some crazy shooting star, or some top secret plane our military has that is so technological that we wouldn't even be able to comprehend. I was like some crazy neon green light shooting across the sky.\" I began to ignore my sighting, but I knew I saw something really unique. When I heard that there had been a number of recent UFO sighting I felt like I should let somebody know I saw something too. I don't know really what I saw, but I was something really special and crazy looking."],"Summary":"Bright neon green shooting object in the sky traveling at an extremely fast speed. Looked like a large shooting star but glowing neon green","Object Shape":"Bullet, Missile, Flash, Star-like","Object Features":"None","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Latitude":"38.944083"}