{"Disposition":"Unknown","trends":["There have been 2 other sightings in Benton","There were no other sightings in Benton on or around August 15th 1980"],"Log Number":"US-01212008-0033","Viewing Distance":"101-500 Feet","Date Submitted":"08/15/1980 10:05 UTC","Summary":"Object changed colors, shape with light coming to the ground around us from it. Came from far away, rapid speed and stayed about 5 minutes very close to our house.","Case Number":"9135","Object Shape":"Disc, Oval, Other","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.857278,+-88.350315(9135)&iwloc=A&hl=en\"> mufon case (9135) map </A>","Latitude":"36.857278","Date of the Event":"08/15/1980 10:05 UTC","Longitude":"-88.350315","Weather Factors":"None","Sighting Duration":"Undisclosed","Region":"Kentucky","files":["/var/www/straped/mufon/html2text/9135.html.txt","/var/www/straped/mufon/org/9135.html"],"City":"Benton","Tags":"City","Object Features":"None","Source":"MUFON","divs":["Sighting DetailsMy wife and I were standing on the porch of our cabin in Kentucky..looking at the sky..thanking the Lord for His grace and goodness. We saw a light in the distance..red..that we thought was probably an airplane. We said to each other..look ..see that airplane over there. It started coming toward us..faster than any airplane with no sound..from the west..It began to change shapes..from a red dot..growing brighter and changing to bright orange. It changed from a red dot..to oval..saucer shape. As it stopped approxiamately 50 to 100 yards from our house..hovering over the tree tops..white fuzzy light...like powder was coming down from it lighting the tops of the trees like a covering of snow..then it would disappear and more come in its place..this happened several times..then we noticed white slats or streaks of light all across our yard from the object to our porch. After a period of time the object began to leave..the slats of light stopped and the object began to change back into the various shapes and colors it had been before and also looked like an orange cresent moon..ending up as a red dot in the sky moving away from us. It left at a very fast speed just as it had come. We experienced amazement, fear, joy..had many questions. After the experience..we called neighbors to see if they had spotted anything..none had..We would get up in the night..look to see if it was coming again...During the experience we had the radio on..there was no static or anything unusual in our reception."],"Object Flight Path":"Hovering then path,Straight-line path,Path then hovering"}