{"Region":"Texas","Object Features":"Unknown","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAt approximately 05:01 CST my friend and I stepped outside and spotted at least nine satellites that appeared to orbit in two loose (think constellation-sized) formations moving from the eastern horizon to the west. There is significant light pollution in Tyler, and the satellites were visible between the clouds. There were so many objects that I initially thought the objects were stars and that the clouds were moving instead of the objects. One formation appeared to be in a roughly triangular configuration, and the other looked like what I'm calling a \"medium\" dipper. They were not terribly far apart, and could actually have both been small parts of an even larger formation. I call the objects satellites because that is what they most closely resemble: small, steady points of light, moving silently across the sky a few hours before dawn. I was able to confirm the objects' motion against background stars, and if I recall correctly, stars were visible between individual objects. According to heavens-above.com, there was to be \"nothing\" brighter than a +4.5 magnitude satellite (I understand that their listing is incomplete, without many classified satellites as well as boosters, etc., but chances are, if you can see a satellite in urban skies, it's listed.) going in that direction in that part of the sky. The dimmest objects had to have been a +2 magnitude to be visible at all in the cloudy, light-polluted sky. They were over our heads and behind us in a matter of minutes. Following closely behind the cluster was a much brighter object that had an orange tint to it (think Lacrosse). This could be a manmade debris field in a low orbit, but from what? An NRO satellite was launched a little more than a week before the date of this sighting. Please let me know your thoughts, and thank you for taking a look at my report."],"Tags":"City","Summary":"Multiple satellite-like objects appear to share the same orbit","map":"<A HREF = \"http://maps.google.com/maps?q=32.35845,+-95.299162(9142)&iwloc=A&hl=en\"> mufon case (9142) map </A>","City":"Tyler","Object Flight Path":"Straight-line path","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around December 18th 2007"],"Case Number":"9142","Date Submitted":"12/18/2007 05:01 UTC","Latitude":"32.35845","files":["/var/www/straped/mufon/html2text/9142.html.txt","/var/www/straped/mufon/org/9142.html"],"Weather Factors":"Does Not Apply","Log Number":"US-01222008-0004","Date of the Event":"12/18/2007 05:01 UTC","Country":"United States","Object Shape":"Unknown","Disposition":"Unknown","Longitude":"-95.299162","Source":"MUFON"}