{"Region":"Pennsylvania","Viewing Distance":"Unknown","Date of the Event":"12/15/1997 06:30 UTC","Summary":"Black, equilateral triangle illuminated by four lights (3 blue, 1 white) flying slowly and silently above field.","trends":["There have been no other sightings in North Wales","This sighting has never been favorited."],"Latitude":"40.21094","Weather Factors":"Unknown","Country":"United States","City":"North Wales","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.21094,+-75.278232(9143)&iwloc=A&hl=en\"> mufon case (9143) map </A>","Disposition":"Insufficient Data","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Longitude":"-75.278232","files":["/var/www/straped/mufon/html2text/9143.html.txt","/var/www/straped/mufon/org/9143.html"],"Date Submitted":"12/15/1997 06:30 UTC","Log Number":"US-01222008-0005","Tags":"City","divs":["Sighting DetailsAt around 6:30 PM sometime during mid-December 1997, my mother and I were driving southwest along Kenas Road in North Wales, PA, 19454, towards the Montgomeryville Mall when we observed what we at first believed to be a stationary object hovering over a field on the southern side of the road. Thinking it was a helicopter we paid it no attention until we noticed that it was moving in a trajectory parallel to ours, directly above the treeline and clearing the uppermost branches by no more than 20 feet. We slowed down in order to see if we might get a closer look at what this 'helicopter' was investigating, only to discover that its appearance was unlike any conventional aircraft. It was comprised of a triangular array of 3 deep blue lights with a white central light; the white light came from a circular 'panel' maybe six or more feet in diameter. There were no flashing navigation lights. Eventually we slowed down until we could see the silhouette of the craft against the skyglow behind - a perfect equilateral triangle. By this time the object was about 150 to 300 feet away, maybe 60 or 80 feet from point to point, and probably matching our speed (considering its position relative to the car was unchanged during our deceleration and subsequent acceleration). In 1997 I was 12 years old, and after several minutes of watching this vessel appear to 'shadow' our car I began to grow very afraid and asked my mother to speed up and leave. She told me that we were probably seeing nothing more than an ordinary helicopter, and rolled down her window to prove her point. Upon hearing nothing, she slowed the car to a crawl, but there was no sound of rotors; the air was perfectly calm and the object was still silently floating along the treeline. The appearance of the craft and its failure to produce any noticeable sound despite its proximity soon convinced my mother and I that we were not looking at anything we could easily explain, and we entertained a number of frightening ideas as to its origins (one obvious explanation standing out above the rest) before becoming too frightened to continue watching. We accelerated, the object apparently matching our speed before it disappeared, although neither of us can remember seeing it move off. Most likely it stopped following the treeline and was obscured by the forest as the trees neared the road. 40 14 20 N, 75 12 W."],"Source":"MUFON","Sighting Duration":"Undisclosed","Case Number":"9143"}