{"Object Features":"Dome, Window(s)","Viewing Distance":"21-100 Feet","Weather Factors":"None","Date of the Event":"06/16/2001 05:45 UTC","Disposition":"Insufficient Data","Log Number":"US-01222008-0007","Date Submitted":"06/16/2001 05:45 UTC","Latitude":"36.298383","map":"<A HREF = \"http://maps.google.com/maps?q=36.298383,+-119.149944(9145)&iwloc=A&hl=en\"> mufon case (9145) map </A>","Case Number":"9145","trends":["There have been 2 other sightings in Exeter","There were no other sightings in Exeter on or around June 16th 2001"],"Sighting Duration":"00:03:00","Longitude":"-119.149944","Tags":"City","Object Shape":"Disc, Oval","Region":"California","Summary":"UFO out in the country","Source":"MUFON","divs":["Sighting DetailsI was about 16 at the time. I was in my bed. I got up early to go somewhere. I was laying in my bed and opened the blinds to just look at the sky and watch the sun rise. There were still stars out but the sun was just about to come up and it was bright enough to see everything outside. I was completely awake. I looked out and the first thing I saw was this saucer. Behind our orange trees and above the corn feild was a silver saucer. It had a rounded globe shape on top and strange almost square windows on the sides. The bottoms of the windows were wider though. There were red, turquoise and white lights all around the saucer. They were large lights. The saucer hovered there for a few minutes. I could not turn away. You could not see inside the window but I am guessing that there would not be room for more than 2 or 3 people (or aliens) inside of the ship. It was somewhat small. The ship all of a sudden lifted upwards about 5-8 feet and then shot across the sky faster than anything I've ever seen. The ship went west. Since this experience I have had many bad dreams about them."],"Country":"United States","Object Flight Path":"Hovering then path,Straight-line path","files":["/var/www/straped/mufon/html2text/9145.html.txt","/var/www/straped/mufon/org/9145.html"],"City":"Exeter"}