{"map":"<A HREF = \"http://maps.google.com/maps?q=32.227276,+-98.195163(9148)&iwloc=A&hl=en\"> mufon case (9148) map </A>","files":["/var/www/straped/mufon/html2text/9148.html.txt","/var/www/straped/mufon/org/9148.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Source":"MUFON","Tags":"City","Region":"Texas","Longitude":"-98.195163","Summary":"The object was a figure eight shaped object (two bright circles joined together) moving forward","Latitude":"32.227276","Weather Factors":"Unknown","Case Number":"9148","Date Submitted":"11/30/1994 12:00 UTC","City":"Stephenville","Object Features":"Unknown","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around November 30th 1994"],"Disposition":"Unknown","divs":["Sighting DetailsIn the new report of UFO sighting(s) reported in Stephenville, Texas, it took me by surprise and quite back to an event that occured in the same general area over 10 years ago. The event took place between the years of 93-96; I was on my way back to school, Tarleton State University located in Stephenville, Texas. I am originally from San Antonio. I just left Hico, Texas towards Stephenville, it was dark, approximaltey 7-8:00 p.m. There were limited to no vehicles on this stretch at that time. All of a sudden appeared this bright object, right above my vehicle, I did not see it approach behind me, it was right on top and appeared to me as a figure eight object; two bright circles joined together, joined vertically, in the direction of the road moving forward quickly. The object was low, approximatley 50-70 feet high, right above the trees. It looked like bright, silver, shiny large compact discs. The object moved in the same direction as my vehicle, faster than my vehicle, again, at a very low altitude (I thought). The object moved approximately 30-40 yards forward, then shot straight up. I did not see bright red lights, or colored lights of any sort. I remember only seeing bright, silver, shiny light. I did not hear anything. I kept driving. When I saw this I said, \"what the heck is that?\" I did not believe it to be a plane, or jet of some sort. It did not look like that. I did not feel frightened, or unable to drive the vehicle. I was merely confused as to what it was, but ironically I was not scared. I kept driving, and shortly thereafter eventually got home to Stephenville. I don't recall mentioning this to anyone at that time because I may have felt hesistant or lery to do so. I put it off."],"Object Flight Path":"Straight-line path,Path with directional change","Date of the Event":"11/30/1994 12:00 UTC","Log Number":"US-01222008-0010","Country":"United States","Object Shape":"Circle"}