{"Latitude":"39.095806","Weather Factors":"None","Object Shape":"Boomerang","Case Number":"9149","divs":["Sighting DetailsI was driving at about 11:00 when I noticed some lights in the sky. There were 6 lights that blinked in no certain order. I noticed the object because the lights were extremely bright. At first I thought that it was just an airplane but then I realized that the lights were far too big and the object was flying far too low to be an airplane (plus I'm about an hour away from the nearest airport). It flew in a straight line heading North. It appeared to be moving pretty slowly, it took a while to get across the sky. I watched the object for about 2 minutes when it suddenly disappeared. I kept watching for it to reappear because I thought that maybe trees had gotten in my line of vision but there is no possible way. I do not remember what color the lights were, I know that a few of them were white and the color green is sticking out in my head for some reason. I would really like to know if this was some sort of military experiment or what the deal is. When I saw the object I completely lost all sense of time and where I was, I was so interested in the object. After it disappeared I immediately called my boyfriend and tears filled my eyes out of fear that everyone would think I was crazy."],"Tags":"City","Country":"United States","Viewing Distance":"Unknown","trends":["There have been 67 other sightings in Independence","There were no other sightings in Independence on or around January 21st 2008","This sighting has never been favorited.",""],"Log Number":"US-01222008-0011","Object Flight Path":"Straight-line path","Date of the Event":"01/21/2008 11:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=39.095806,+-94.410747(9149)&iwloc=A&hl=en\"> mufon case (9149) map </A>","Sighting Duration":"Undisclosed","Longitude":"-94.410747","Date Submitted":"01/21/2008 11:10 UTC","Object Features":"Unknown","Disposition":"Unknown","Region":"Missouri","files":["/var/www/straped/mufon/html2text/9149.html.txt","/var/www/straped/mufon/org/9149.html"],"Source":"MUFON","City":"Independence","Summary":"6 lighted object appeared and floated across sky, then shortly after disappeared"}