{"Source":"MUFON","files":["/var/www/straped/mufon/html2text/9152.html.txt","/var/www/straped/mufon/org/9152.html"],"City":"Gooding","Case Number":"9152","map":"<A HREF = \"http://maps.google.com/maps?q=42.948302,+-114.705208(9152)&iwloc=A&hl=en\"> mufon case (9152) map </A>","Date Submitted":"03/15/1980 11:00 UTC","Longitude":"-114.705208","Sighting Duration":"Undisclosed","Summary":"Very distant - like a large aircraft or very bright star - flying above mountains - accelerated to ubbelievable speed and to a 90 debree (angular) turn to sky and disappeared","Weather Factors":"Does Not Apply","Object Shape":"Star-like","trends":["There has been one other sighting in Gooding","There was one other sighting in Gooding on or around March 15th 1980"],"Tags":"City","Object Flight Path":"Path with directional change","Latitude":"42.948302","Country":"United States","Log Number":"US-01222008-0014","Date of the Event":"03/15/1980 11:00 UTC","divs":["Sighting DetailsIn the spring of 1980 or 1981, to the north of Gooding, Idaho, I was getting a ride home from friends and was in the back right passenger seat. After we left Gooding (going north), I was sort of daydreaming and looking at the silhouettes of the mountain against a very clear night sky - with little moonlight and scores of stars(about 2300, rural). My eyes fixed on a moving light sort of flirting across the mountaintops at about the speed of an aircraft. It appeared to me at about the dimensions and intensity of the Evening Star, but it was moving in a northerly direction and therefore, no star. I kept watching it, thinking it was an aircraft from Mountain Home AFB - but I wasn't really intensely focused on it. It startled me when it accelerated beyond what seemed possible for an aircraft and continued to accelerate (like the speed of a shooting star). From my perspective, it was very close to the mountain tops. At the height of the speed increase, the star-like object took a 90 degree turn skyward - with the angle included, i.e. not bending toward the sky buy immediately flipping 90 degrees and shooting straight into the night sky - where it disappeared. I was just going to say something to my friend in the front seat, when she said. \"Did you see that?!\" We both saw it. This was many years ago but I have never forgotten it. I have no doubt that whatever it was we saw was not a natural phenomenon nor was it man-made. I wanted to make sure this was recorded somewhere. Thank you."],"Region":"Idaho","Disposition":"Unknown","Object Features":"Unknown","Viewing Distance":"Over One Mile"}