{"files":["/var/www/straped/mufon/html2text/9153.html.txt","/var/www/straped/mufon/org/9153.html"],"Region":"Virginia","Longitude":"-77.28083","Log Number":"US-01222008-0015","map":"<A HREF = \"http://maps.google.com/maps?q=37.309515,+-77.28083(9153)&iwloc=A&hl=en\"> mufon case (9153) map </A>","trends":["There have been 2 other sightings in Hopewell","There were no other sightings in Hopewell on or around January 2nd 2008"],"divs":["Sighting DetailsIt was the 2nd day of this year of 2008 at around 8:15 pm in Hopewell Va.(was dark out at this time) I had just dropped a friend off on the road behind his house on Boston St. After dropping him off on the corner, I had decided to go to Little Caesars to grab a pizza to take home. I only drove about a block when I saw 2 headlights flying close over the trees to my right. My first thought was boy that plane is pretty low. Then I noticed it stopped and turned, when it did this.. it exposed the whole underbelly of the craft. Other then the 2 headlight that were on the side of the craft as you could see from the side.. from the bottom I saw 1 white light at each point and a big round red dome light directly in the center of the craft. So I rolled my window down and turned of my heater. So, I could hear for any engine.. but, there was NO NOISE from this thing. Then it sorta glided like a air hockey puck away from me, then it stopped again, glided a little bit and stopped again.. by this time I had turned my Jeep around and started chasing it I got to a stop sign and was there for no more then 4 seconds and lost the craft behind a tree and when I turned the corner it was no longer insight.. I lost it. I went home and called up a friend to come over I had something I had to tell him. When he got there about 40 min. later.. I took him to where I had seen it and explained to him everything that happened. We both saw it again, off in the distance near the Riverside Jail, it was above the woods that; Fort Lee owns in front of the jail.. when we saw it. I knew exactly what it was so I told him to catch up to it. We got on the main road and was pacing it. When we saw a stoplight up ahead... we sped up just a little to hit the light and make a left on Miles Ave. to go toward the craft but, the craft never made it to the stoplight. So it had to have change direction again...we lost it. It's still hard for me to believe that I have now seen 2 UFOs' in pretty much the exact same spot with in the last 8 years. I reported the last 1 to MUFON as well. Boy.. I sure hope you guys take this as serious as I have because I am pretty damn scared at this point. I went snooping for insight at the airport in Richmond besides getting the run around and being laughed at. I did learn that what I had seen, most likely did not show up on radar ..at least thats what I have been told. P.S. I do not think it was alien, I do think it was military."],"Object Shape":"Triangle","Date of the Event":"01/02/2008 08:15 UTC","Disposition":"Unknown","Sighting Duration":"01:00:00","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Latitude":"37.309515","Date Submitted":"01/02/2008 08:15 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Source":"MUFON","Object Features":"None","Country":"United States","Case Number":"9153","City":"Hopewell","Weather Factors":"Unknown","Summary":"I saw a triangle shaped craft....it made no noise...it was just above the trees.","Tags":"City"}