{"Tags":"City","Viewing Distance":"101-500 Feet","Country":"United States","Weather Factors":"Windy, Medium, Light","Object Features":"Unknown","Source":"MUFON","Object Shape":"Boomerang, Circle","Object Flight Path":"Straight-line path","Disposition":"IFO","City":"Victorville","Log Number":"US-01222008-0017","Region":"California","Summary":"something black/dark brown slowly floating and turning in sky","Longitude":"-117.288156","map":"<A HREF = \"http://maps.google.com/maps?q=34.539607,+-117.288156(9155)&iwloc=A&hl=en\"> mufon case (9155) map </A>","Latitude":"34.539607","divs":["Sighting DetailsI was in a drive thru at Del Taco a couple blocks up the street from my house.There was two other cars in front of me after i ordered.Something dark in the sky floating in front of where i was sitting caught my attention.I first thought \"What is that?Black balloons floating in a cluster?\" Then it started slowly turning in a circular motion,so my next thought to myself was to wonder if it was black trash bags.(And there was no sound or smoke trail of any kind)But I could tell after it spun a couple times it was boomerang shaped because there was a big space in the middle.I know it was not a stealth because I use to do security at a military airport where they use to test unmanned airplanes,and they had a stealth flying there one time.After i could'nt figure out what it was,I pulled out my cell phone and called my mom and told her to go outside to see if she could see it to figure out what it was because it was slowly going towards the direction of our houses.I got my food from the drive thru,drove off,and did'nt see the object again for about 5 minutes.I had pulled into my drive way,took my baby in the house,then came back to the car for my food.I looked up again and there it was going towards the freeway,(Going towards Vegas)but it looked higher up in the sky this time. Then while watching it,it looked like it split into aty least five round objects, and then went back together into one.Then I went in the house because it was gettiing a bit farther away from me caring to stand out in the cold. I tried to call my mom again to see if she had seen it,and she did'nt because she had a house full of kids distracting her.This is something I would'nt have seen in the first place if it had not been directly in front of me at the time.I was not scared when I saw it because I did'nt know what it was,and could'nt figure out was it was."],"files":["/var/www/straped/mufon/html2text/9155.html.txt","/var/www/straped/mufon/org/9155.html"],"Case Number":"9155","Date Submitted":"01/20/2008 04:56 UTC","Sighting Duration":"00:10:00","trends":["There have been 22 other sightings in Victorville","There were no other sightings in Victorville on or around January 20th 2008"],"Date of the Event":"01/20/2008 04:56 UTC"}