{"Tags":"City","Longitude":"-102.071935","Region":"Texas","divs":["Sighting DetailsHello, My name is CrisAnn Garcia. I live in Plano, Texas. I just want to comment on the latest sightings in Stephenville. I can't believe people are just noticing these objects in the sky. Back in July of last year '07, my brother came home shaken up because he and my sister in law, and her brother, saw numerous flying objects hovering the sky. They all said they looked like hundreds of little lights zig zagging around so fast there was no way it could be man operated. I believed him, so for the next two days I took my son's telescope and started looking at the sky around sunset time. The second evening in July,sure enough, my son and I spotted these objects just like my brother described...right over Plano! I also noticed what looked like Air Force jets coming from different directions as if trying to surround these objects one by one. Everytime the jets got close to one, the objects sped off behind a cloud and disappeared. I finally figured it must have been the Air Force practicing manuevers up there, and that's exactly what I told my son. I haven't told anyone about this, being that people just don't talk about these things or they may think I'm making it up-it's best to forget about it. This is because of another personal account, back in my hometown in Midland, Texas. We lived on a 4 acres of farming land. I was only about 10 yrs old, my sister, 7. This was 29 years ago. Today's my B-day. Therefore, this was back in 1979. My sister and I actually saw one of these actually land on our property about 10 feet from our window! It was dark outside, and I remember these bright lights coming into our room from the window, sort of like when a police car has their patrol lights on, but much brighter. We both opened the curtain we just sat there and stared at it in shock, like in a trance. To tell the truth, I don't recall how long we stared at it but this thing was was about 12' X 12' and looked just like the typical saucer-shaped UFO that I later learned has been described in sightings. It was round disk-like, grey and had like Christmas colored lights rotating around it, which were blinking at the same time as they were rotating around its mid-circumference. Then it moved straight up and jetted off so fast into the sky it was as if it disappeared right before our eyes. My sister and I finally screamed and our mom came to find out what the heck was going on, but when we told her she told us to quit making stuff up, and that it must have been our imagination, and go to sleep. My sister was still crying so I told her it must have been her imagination and that I didn't see anything. After all these years, we finally talked about it and she said she saw a red glowing ball come to the window, hover, then head out toward the 'caliche pits' which is a place we kids were prohibited from going to. If I recall correctly this is a highly radioactive dumping ground, at least that's what the sign said. Anyway, I asked her if she saw the Christmas lights blinking around it, and she said she only saw a bright red glowing ball. I don't understand why she saw one thing and I saw another. The next day, out of curiousity, I went to the spot where it had landed and noticed the ground being like very dry powder (reminded me of ground cinnamon) and it was in the shape of a big round circle! Also out of curiousity, I took a water hose and sprayed it, and the water only floated on top of the powdered ground, it would never soak it up like normal dirt. Another strange thing is that two of my pet cats and other animals from my dad's farm turned up missing. My dad said it must have been the neighborhood dogs who ate them or something. It took me and my sister about 3 years to quit talking about it, but eventually we did. We just talked about it one more time about 3 days ago. To this day, this is the first time I tell anyone about that experience as an adult. I don't want my testimony getting around either. I've come to realize this was a personal experience and not to really be shared with anyone-it's also best to forget about it. Anyway, thank you for reading my story and I hope you continue your efforts in catching one. Although I know it will be impossible because of their velocity of speed. Besides, they are millions of light years more intelligent than we are. They are just curious about us, just like I was when I was a kid and checking out their landing spot. CrisAnn Garcia"],"Viewing Distance":"20 Feet or Less","Source":"MUFON","Object Features":"Dome, Patterned Surface","Latitude":"32.006636","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Country":"United States","Case Number":"9156","Object Shape":"Disc","Date of the Event":"01/20/1979 12:00 UTC","Object Flight Path":"Stationary,Hovering then path","Summary":"Disk shaped, grey, multi colored blinking lights around its mid circumference","map":"<A HREF = \"http://maps.google.com/maps?q=32.006636,+-102.071935(9156)&iwloc=A&hl=en\"> mufon case (9156) map </A>","Log Number":"US-01222008-0018","Date Submitted":"01/20/1979 12:00 UTC","files":["/var/www/straped/mufon/html2text/9156.html.txt","/var/www/straped/mufon/org/9156.html"],"trends":["There have been 9 other sightings in Midland","There were no other sightings in Midland on or around January 20th 1979"],"City":"Midland","Disposition":"Unknown"}