{"Sighting Duration":"Undisclosed","Date Submitted":"12/21/2007 09:05 UTC","Viewing Distance":"Unknown","trends":["There have been 8 other sightings in Hamilton","There were no other sightings in Hamilton on or around December 21st 2007","This sighting has never been favorited.",""],"Object Flight Path":"Straight-line path","Disposition":"Unknown","divs":["sighting detailsthis was a broad daylight sighting from our home on the outskirts of hamilton, texas. hamilton is located in the center of hamilton county adjacent to stephenville texas. this object was traveling from south to north toward stephenville\\chalk mountain. we are approx. 40 miles south of stephenville. i was out in the middle of the yard with our dogs at approx. 9 a.m. on a clear, cloudless day with unlimited and unobstructed visibility. i was alerted to look up by our labrador bird dog frantically barking at the sky. there were no wings, no contrail, and no noise associated with this event. it appeared to be very high and very huge. it would have taken a silver dollar at arms length to cover the object from fore to aft. it was traveling s. to n. at what appeared, from my perspective, a slow rate of flight. i first observed it at about the 10:00 position off the southern horizon and observed it to approx. the 2:00 position. total elapse time was approx. 45 seconds. i took my eyes off just long enough to shush the barking dog and when i looked back up... it had just disappeared. other than our dogs, i personally know of no other witnesses to this event. in fact, i would be very interested to know and compare notes\\thoughts with any other observers. this was definitely not a helicopter, airplane, blimp, baloon, bird, etc. although hamilton airport has no radar capabilities, ft. hood @ killeen and waco regional airport should have seen something. lots of luck on getting anything from the military. (sketch attached). i seek no notoriety, publicity, remuneration, ......no nothing. in fact, i demand privacy and confidentiality. i have a low tolerance and much disdain for rednecks & idiots who refuse to accept reality and admit the truth. jayne chambliss"],"Source":"MUFON","Log Number":"US-01222008-0021","Region":"Texas","files":["/var/www/straped/mufon/html2text/9159.html.txt","/var/www/straped/mufon/more/9159_submitter_file1__scan0001.jpg","/var/www/straped/mufon/org/9159.html"],"Latitude":"31.706696","Country":"United States","Object Features":"Dome, Patterned Surface","Date of the Event":"12/21/2007 09:05 UTC","Object Shape":"Bullet, Missile, Cone, Cylinder","Longitude":"-98.118333","City":"Hamilton","Summary":"UFO daylight sighting over Hamilton, Texas (see attachment)","map":"<A HREF = \"http://maps.google.com/maps?q=31.706696,+-98.118333(9159)&iwloc=A&hl=en\"> mufon case (9159) map </A>","Weather Factors":"Unknown","Case Number":"9159","Tags":"City"}