{"map":"<A HREF = \"http://maps.google.com/maps?q=40.718783,+-73.997613(9160)&iwloc=A&hl=en\"> mufon case (9160) map </A>","Tags":"City","Object Flight Path":"Undisclosed","City":"New York","Sighting Duration":"Undisclosed","Date Submitted":"01/20/2008 06:46 UTC","Object Features":"Undisclosed","Object Shape":"Star-like, Unknown","Region":"New York","divs":["sighting detailsi was driving to work on interstate 84 west and i was on the mountain and to my right i could see this strange light. i tried to see if it was an airplane and it was none that i have ever seen. it was all glittering light, it looked like 3 bright diamonds in the sky. i made sure to look at the time on my clock just in case anyone reported it. the area i saw it in was very clear, not many clouds and it was a morning blueish sky, not a night sky. this is a famous look out point where you have an amazing view. there were people who were stop at this truck\\rest stop. you can see three states. ny nj pa. i did not stop because i had to be at work at 7 a.m. i did not say anything to anybody. it was a very busy day at the hospital. the next day i was working with a different nurse and she mentioned to me that she saw a ufo yesterday. i was like you got to be kidding me. she describe it in much more detail. she was coming from sullivan county and may have been closer to it. she said it changed colors and was oval or circular. i then told her you will not believe this but i saw something strange when driving to work. she then told me she was also driving to work around the same time of day. i called our local newspaper and left a message. they did not call back. i called the port jervis police dept and asked if anyone had reported something strange in the sky and he said no. i told him there was someing in the sky early on the morning of the 19th and that was that. i called the same lousy newspaper again and they put me through to some reporters voice mail and i did not get a call back. what a suprise. in my 38 years i have never seen anything strange or unidentifiable in the sky. nobody cares. who knows what it was but i would think it would be important for national security."],"Latitude":"40.718783","Weather Factors":"Does Not Apply","Date of the Event":"01/20/2008 06:46 UTC","files":["/var/www/straped/mufon/html2text/9160.html.txt","/var/www/straped/mufon/org/9160.html"],"Source":"MUFON","Disposition":"Unresolved","Viewing Distance":"Unknown","Case Number":"9160","Log Number":"US-01222008-0022","trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around January 20th 2008"],"Country":"United States","Longitude":"-73.997613","Summary":"looked like 3 bright lights in the sky, beautiful start like glow, too close to be stars"}