{"divs":["Sighting DetailsMy friend and I drove to Ottawa the summer of 1972 or 73 for a weekend, looking for girls. We ended up without any, sleeping in my car on the side of a highway. We were awoken when a trooper stopped to check us out. When he left, we sat in the car eating some leftover bread. The terrain was very flat with a mountainous area ahead in the distance. We observed a disc-shaped object slowly moving across the flat field to our right, gradually approaching us. It made no sound and came to a stop about 50 feet in the air and perhaps 200 feet in front of us over the highway. It hovered there for around 10 minutes (I guess). I said to Dave \"You know what that is, right?\" and he said \"Yup\". No other words were spoken until the object was gone. There were colored lights that would appear across the side of the object and move along the surface. I wish I had had my camera along, for those would have been among the best photos ever taken. The object then gradually moved directly away from us at an upward angle toward the mountain range then picked up speed rapidly until it was just a light in the sky, and made an instantaeous 90 degree turn to the left and zipped out of sight. Later that morning, when the radio stations began broadcasting, all they talked about were the hundreds of UFO sightings reported along the entire Eastern seaboard from Canada down through Maine and into New England. The official Air Force explanation reported about what we saw was \"luminous gas from a factory\". I know what I saw clearly that night, and it was a solid craft of some sort, not \"luminous gas\". Although I did not experience any fear during the event, I had recurring nightmares involving UFOs and burning rays being shot from them (very thatrical) for many years, always the same helpless feeling. I haven't had those dreams for decades now, but I think of the event often. I located the friend who was with me about 20 years ago just to ask him if he still thinks about it and he indicated that he does not and cares no to."],"Sighting Duration":"Undisclosed","Case Number":"9170","Log Number":"CA-01222008-0032","Latitude":"45.4229","Object Flight Path":"Path with directional change,Path then hovering","Tags":"City","files":["/var/www/straped/mufon/html2text/9170.html.txt","/var/www/straped/mufon/org/9170.html"],"Country":"Canada","Object Shape":"Disc","City":"Ottawa","Source":"MUFON","trends":["There have been 55 other sightings in Ottawa","There were no other sightings in Ottawa on or around June 30th 1972"],"Summary":"Silent UFO close to us, very good observation","Disposition":"Unresolved","Date Submitted":"06/30/1972 12:00 UTC","Region":"Ontario","Viewing Distance":"101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=45.4229,+-75.689313(9170)&iwloc=A&hl=en\"> mufon case (9170) map </A>","Weather Factors":"Unknown","Object Features":"Unknown","Longitude":"-75.689313","Date of the Event":"06/30/1972 12:00 UTC"}