{"Object Features":"Dome","Object Flight Path":"Straight-line path","Tags":"City","Summary":"Orange glowing object about the size of a volkswagon","Region":"Alabama","map":"<A HREF = \"http://maps.google.com/maps?q=30.7388,+-88.078889(9171)&iwloc=A&hl=en\"> mufon case (9171) map </A>","Disposition":"Unknown","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/9171.html.txt","/var/www/straped/mufon/org/9171.html"],"City":"Prichard","Latitude":"30.7388","Longitude":"-88.078889","Log Number":"US-01222008-0033","divs":["Sighting DetailsCleaning up a trailer in my trailer park located at 132 Telegaph Rd. Plateau, AL about 8:00 p.m. when me and my son looked outside and saw a orange glowing fireball about the size of a volkswagon at tree top level coming down above the railroad located behind the trailer park and it was making some kind of noise and I assumed it was a small helicopter on fire. It landed on the railroad track behind the trailer park and me and my son Richard Taylor jumped into my car (1963 Cross-Country Rambler Station Wagon } to go around the woods between the trailer park and the railroad track to where we thought it went down. However the car would not start and the battery was dead. We tried several attempts to start the car and each time the battery appeared dead and we could not start the car...After about five minutes the glowing object arose up above the railroad track and at about tree top level headed down the railroad track and once it crossed bay bridge viaduct on bay bridge rd. we tried to start the car again and was amazed when it started. We drove out on telegraph rd and went down about 2 blocks and turned left onto bay bridge road and crossed Cochran Bridge and attempted to follow it until it went out over Mobile Bay at the Bankhead Tunnel, Mobile, AL.. Shortly after about 4 or 5 heiicopters seemed to be pursing it, so we turned around and proceeded back to the trailer park....... I never reported it because I thought maybe people would think I was nuts....My car had never failed tocrank before and never did fail me again..... The above story is the absolute truth and only now do I talk about it."],"Weather Factors":"None","Case Number":"9171","Object Shape":"Fireball","Viewing Distance":"101-500 Feet","Date Submitted":"08/31/1974 08:00 UTC","Date of the Event":"08/31/1974 08:00 UTC","trends":["There have been no other sightings in Prichard","This sighting has never been favorited."],"Sighting Duration":"00:20:00"}