{"Tags":"City","Log Number":"US-01222008-0034","Summary":"Bright white glowing completely silent oval","Object Shape":"Oval","Source":"MUFON","Country":"United States","Longitude":"-80.470817","Weather Factors":"Unknown","Object Flight Path":"Path then hovering","Region":"Florida","files":["/var/www/straped/mufon/html2text/9172.html.txt","/var/www/straped/mufon/org/9172.html"],"City":"Homestead","Object Features":"Window(s)","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=25.470082,+-80.470817(9172)&iwloc=A&hl=en\"> mufon case (9172) map </A>","Disposition":"Hoax","Case Number":"9172","Date Submitted":"01/13/2008 04:30 UTC","Latitude":"25.470082","trends":["There have been 21 other sightings in Homestead","There were no other sightings in Homestead on or around January 13th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy wife and I were driving in far western Dade County, west of Homestead, in the rural areas where strawberries and tomatoes are grown, and a few remaining citrus trees. We were looking at the last field, a 4 or 5 acre patch planted with strawberries, with a small house and barn towards the back, and beyond were the Everglades, on the other side of a canal and a chain link fence. We pulled to the side of the road to observe a bright light that was approachng silently from the WNW. It was very, very bright. It finally came to a stop and hovered over the farm house. With a sharp hissing noise, a beam of light shone directly on the roof of the house for a few seconds, and then disappeared. At this point, once our eyes had adjusted to the intense glare, we could se black spots (maybe windows?) along the widest point of the oval. Suddenly, there was a strange distortion developing in the sky over the house as the object became darker and appeared to shrink in on itself. It was a kind of swirling distortion that appeared to increase in size and seemed even to distort the sunlight and clouds as it did, and the object became even darker and smaller. Then there was an audible, low-pitched popping sound, almost like one can make by pulling a finger out of one's puckered mouth, and the object disappeared altogether. The distortion effect subsided, and then disappeared after a few seconds more. We approached the house by passing through the gate and going up the driveway, and detected the strong smell of ozone, like from a stong electrical gadget, as well as an organic kind of repugnant stink. We looked up at one of the windows and saw a grayish reptilian being staring at us. We were so frightened, that we tore a U-turn right through a flower bed and drove away as fast as we could. My wife begged me never to tell anyone about this, but I feel I must let the truth be known."],"Viewing Distance":"101-500 Feet","Date of the Event":"01/13/2008 04:30 UTC"}