{"trends":["There has been one other sighting in Union Gap","There were no other sightings in Union Gap on or around July 28th 1996"],"Object Features":"Undisclosed","Source":"MUFON","Log Number":"US-01232008-0001","Summary":"It started as a point of bright light and then became an object that hovered and landed nearby","Tags":"City","Object Flight Path":"Path then hovering","Object Shape":"Disc, Star-like","Longitude":"-120.475064","map":"<A HREF = \"http://maps.google.com/maps?q=46.557349,+-120.475064(9173)&iwloc=A&hl=en\"> mufon case (9173) map </A>","divs":["Sighting DetailsMy girl friend and I were driving from the Richland area towards Union Gap. I dont live in that area so I'm sure that there was a name for the location. It was about 15 miles souteast of Union Gap on I-84. There were few cars on the road and it is dark in that area. roadside lights are kind of rare in that area as well. I was driving and the girlfriend was the passenger. I was looking at the roadway and into the distance (NW) when I noticed a very bright star and I thought to myself \"I didn't see that before?\". It's brightness became more intense and larger. It was at that point that I said to the girlfriend \"look at that, do you see that?\". She said yes. It went from a ever intensifying light into a suddenly present object. I concluded that it had come from a great distance to nearby and that was accounting for its growing intensity. I said \"I'm gonna pull over\" and I brought the car to a stop on the side of the road. I turned of the headlights and then thought to myself \"somebody is going to hit me if I don't have the lights on\" and so I inadvertenly ended up flashing my headlights from on to off to bright to parking lights. I got out of the car and noticed that the object went from a bright white light to several concentric circles of changing lights. Maybe three or four rows. The lights changed colors from red to yellow and the object was having a visibly difficult time hovering in any one spot. It would wobble and then seem to lose stability and then it would have to correct it self by using amazing bursts of speed from left to right and back again. I thought to myself at the time \"thats not very impressive, it cant even hover without trouble.\" No helicopter could have stayed aloft with the stability issues this object was having and because of the sudden bursts of speed and the distance it was travelling in order to recover it was nearly immpossible that it was using rotors. I noticed that a few cars had driven past and had not noticed but a car had pulled up behind us and the driver had exited his vehicle. I looked at him and said \"do you see that?\" and he looked at at me and said yes as well as nodding. I looked inside my car at the girlfriend and she was frozen and staring at the object. The object continued to change colors and had periods of changing light intensity. We stood and watched as the object made its way towards us and to our left (NE). It began to descend about a quarter of a mile away and appeared to land just over the top of the hill to the North of our location. It was still giving off light and at the point that it seemed to settle on the ground it looked like some kind of wavy beam was emitted from it that was kind of difficult to describe. I looked back at the man who had stopped behind us and asked him if he was seeing this and he looked very scared and said yes. I looked into the car at my girlfriend and at this point she was refusing to look at the object and was crying. She was looking in the opposite direction and kept say \"no,no\" and crying. I took another look back at the other guy who was just stareing in the area of the object. It had become dark again and he was just trying to see whatever it was. I couldn't stand my girlfriends crying and began to think its time to get out of here. I got into the car and drove off while looking in the rearview mirror. The other guy just kept standing there looking and watching. I did my best to go over it with the girlfriend during the rest of our drive. We were on our way to Seattle at the time and it was about two more hours of me going over and over it. I remember it so clearly. It was difficult to judge the size of the object because it was dark and there were no visible objects on the ground for comparison or contrast. I would have to say that it was about 80 feet acrossed. Using the lights that were on the bottom portion as reference I concluded that it was likely disc shaped. I was amazed at how fast it originally approached from the Western sky and how quickly it stopped. Most amazing was watching its hovering. It was clearly unstable but could almost instantly dart from left to right at what was likely about a quarter of a mile (1100ft) to regain its stability. I have gone over this in my head thousands of times trying to explain it away but it appeared an then landed and three of us watched it and agreed that we were seeing something that was solid or at least had the presence of mass. I never reported it before because of the stigma attached to \"kooks\" who say they have seen something unexplainable. With the recent Texas sighting I noticed that the media has become a little less disrespectful of people who have made observations."],"Case Number":"9173","Sighting Duration":"00:03:30","Date Submitted":"07/28/1996 12:00 UTC","Date of the Event":"07/28/1996 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/9173.html.txt","/var/www/straped/mufon/org/9173.html"],"Disposition":"Unknown","Country":"United States","City":"Union Gap","Latitude":"46.557349","Region":"Washington","Weather Factors":"Unknown"}