{"City":"Undisclosed","Country":"United States","Log Number":"US-01232008-0005","trends":[""],"Object Flight Path":"Stationary,Straight-line path","Longitude":"-119.408822","Source":"MUFON","Disposition":"Unknown","Date Submitted":"01/17/2008 11:17 UTC","Region":"California","Date of the Event":"01/17/2008 11:17 UTC","Tags":"City","Viewing Distance":"Over One Mile","divs":["sighting detailswhile photographing on starry night mode, 15 second exposure, i took pictures approx every 40 seconds. a few groups of 3 and other groups up to 9 shots on tripod. when reviewing the shots later, many well defined lights and objects were present on the camera. they were literally everywhere. some they were under the moon. others their three light formation was above the moon. third session lead stationary craft were much closer. many small objects way off in the distance, way beyond the moon. all small craft seemed to revolve around a huge green transparent orb with a scarlet red center. this kept working its way around the moon, almost appearing to wrap around it like a lens. guess this is where the eye of ra might have come from after filming this. all shots are still but i have compiled two slideshow videos and posted on u2b. they can be found at www.youtube.com\\dontspraymebro i never saw the objects with my naked eye...everything looked clear and normal. actions were changing size and brightness, multipe \"swapping\" of bright colored light. no trails on the film which was set at 15 sec exposure, no contails and no light trail. from spot to spot instantly across what must be vast distances. i feel very confident that these are not ours, not even our best could have been this fast, this organized, and this many."],"Case Number":"9177","files":["/var/www/straped/mufon/html2text/9177.html.txt","/var/www/straped/mufon/more/9177_submitter_file1__L1030651copy.jpg","/var/www/straped/mufon/more/9177_submitter_file2__L1030625copy.jpg","/var/www/straped/mufon/org/9177.html"],"Object Shape":"Circle, Saturn-like, Sphere, Star-like","Sighting Duration":"Undisclosed","Object Features":"Patterned Surface, Unknown","Weather Factors":"Windy, Medium","map":"<A HREF = \"http://maps.google.com/maps?q=36.780531,+-119.408822(9177)&iwloc=A&hl=en\"> mufon case (9177) map </A>","Latitude":"36.780531","Summary":"photos of moon at night over SB. objects invisible. visible on Leica D-Lux3"}