{"Object Flight Path":"Straight-line path","Viewing Distance":"Over One Mile","Source":"MUFON","Weather Factors":"None","trends":["There have been 74 other sightings in Stephenville","There were 7 other sightings in Stephenville on or around January 8th 2008"],"Country":"United States","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=32.226786,+-98.196943(9178)&iwloc=A&hl=en\"> mufon case (9178) map </A>","Sighting Duration":"Undisclosed","Date Submitted":"01/08/2008 06:20 UTC","Object Features":"Unknown","Case Number":"9178","Longitude":"-98.196943","Log Number":"US-01232008-0006","City":"Stephenville","files":["/var/www/straped/mufon/html2text/9178.html.txt","/var/www/straped/mufon/org/9178.html"],"Latitude":"32.226786","Summary":"Two very bright orbs that took turns pulsating in brightness.","Disposition":"Unknown","Tags":"City","Date of the Event":"01/08/2008 06:20 UTC","divs":["Sighting DetailsThe witness was walking the dogs on the back nine of a golf course at this time. The golf course is the Legends Country Club and is located in Stephenville near Prairie Wind Blvd. The sun had set and only a slight redness could be seen in its direction. He saw what looked to be two welding ark strikes at a distance of arms length and peas sized between my index finger and thumb. First one appeared and then another as the first bleeped out. They were like pearls on a string and looked like bubbles with a light encased inside. They were incredibly bright...beyond halogen color temperature. Just like an arc welding strike. There was no sound and they just trailed off to the west. They were traveling just as a plane had passed and along the same trailing heading toward the southwest. They were probably 1 minute behind the plane and seemed to be moving at about the speed of a plane. They originated in the northeast and I saw them moving to the southwest towards Dublin. They were around 25-45 degrees above the horizon. He thought the lead plane might be a C-130 using a type of counter measure ordinance (as they use in Iraq to confuse heat seeking shoulder fired rockets) but there were no point of source trails from the aircraft. They had to be at least ten miles down stream from the aircraft. A week later on Jan.15 or 16 at the same location, he saw two military jets flying in the same approximate path as the orbs that he had seen on Jan. 8th."],"Object Shape":"Sphere"}