{"Source":"MUFON","Log Number":"US-01232008-0009","map":"<A HREF = \"http://maps.google.com/maps?q=31.7131,+-98.985601(9181)&iwloc=A&hl=en\"> mufon case (9181) map </A>","Object Features":"None","Longitude":"-98.985601","Date Submitted":"11/07/2007 06:30 UTC","Viewing Distance":"21-100 Feet","Object Flight Path":"Path then hovering","Object Shape":"Circle","Summary":"circular object about 100 yds in diameter","trends":["There have been 21 other sightings in Brownwood","There were no other sightings in Brownwood on or around November 7th 2007"],"files":["/var/www/straped/mufon/html2text/9181.html.txt","/var/www/straped/mufon/org/9181.html"],"City":"Brownwood","Disposition":"Unknown","Weather Factors":"None","Country":"United States","Region":"Texas","Sighting Duration":"Undisclosed","Tags":"City","Date of the Event":"11/07/2007 06:30 UTC","Latitude":"31.7131","divs":["Sighting DetailsWe were coming home from the Coleman Pizza Inn. We were driving a diesel Jetta and were heading east on 1850 towards Brownwood. We turned right onto 279 South and then turned left on Park Rd 15. During this time we saw an object in front of us through our windshield. It was amber in color. It appeared and disappeared about eight times, but it always appeared in the same location in front of us. When it appeared it would remain visible for about 30 seconds. I initially joked that a UFO was following us. But when the object remained with us, my wife became concerned. I wanted to stop the car and get out for a better look but my wife was too upset to allow me to stop. From Park Rd 15, we turned right onto County Road 461. As we got close to County Road 561, the object moved towards us and was directly above the car. It stayed above us for about 5 minutes. My wife thought it was about two telephone poles in height above the ground and I felt it was about 100 yards in diameter. It blocked out the stars. There were amber lights similar to a school bus around the perimeter of the circular object. Underneath it were white lights that went off and on in sequence. The object appeared to be a dark metal but it was difficult to see the color of the metal at night. The object was totally silent. After about 5 minutes it began to slowly leave. It moved towards the northeast. As it left, it emitted sparkler like lights similar to what you see on the 4th of July. The sparklers were being emitted out of thin air near the object. They didn't seem to be coming directly from the object. It took it about 3 minutes to go out of sight. This was the first UFO that we have ever seen. Prior to this experience we were somewhat skeptical of people seeing UFOs."],"Case Number":"9181"}