{"Latitude":"40.985434","Disposition":"Unresolved","trends":["There has been one other sighting in Rye","There were no other sightings in Rye on or around June 30th 1975"],"Date Submitted":"06/30/1975 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9183.html.txt","/var/www/straped/mufon/org/9183.html"],"Longitude":"-73.67643","Date of the Event":"06/30/1975 12:00 UTC","City":"Rye","Log Number":"US-01232008-0011","Case Number":"9183","Object Flight Path":"Undisclosed","Country":"United States","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.985434,+-73.67643(9183)&iwloc=A&hl=en\"> mufon case (9183) map </A>","Summary":"Slow moving silver disk, rotating light","Region":"New York","Object Shape":"Disc","divs":["Sighting DetailsAt least three of us watched in disbelief as the classic \"flying saucer\" made its way across the afternoon sky, heading east. Altitude was about 300-500 feet. No sound at all. It appeared to have rotating white panels of lights, but the lights didn't move...the panels just sequentially lit in a rotating manner. I was pumping gas at a gas station when I saw it...I ws just looking around at the trees. I asked the lady in her VW bug I was pumping gas into to get out of her car and tell me what that is. She said a flying saucer. So I ran into the gas station and got another attendant out there. Same thing. Flying saucer. The UFO remained at the same altitude as it flew slowly and absolutely silently toward the east, we lost sight of it once it went behind some tall trees. There was no audible or visible means of propulsion or lift (I am a pilot), and we were plent close enough (say 1500 feet) to hear it. About an hour later some friends came into the gas station. They were out on a golf course about 2 miles east of us. With no prompting from us, they blurted out that they had seen a flying saucer. I was about 16 years old when this happened. I'm 48 today and remember it like it was yesterday. Ever since then I've been a firm believer but have not seen another. The story about UFOs in Texas grabbed my attention and led me to this site. Thanks for hosting it. Its good to know that I (and for sure) WE are NOT alone!"],"Viewing Distance":"Unknown"}