{"map":"<A HREF = \"http://maps.google.com/maps?q=37.588106,+-90.629011(9184)&iwloc=A&hl=en\"> mufon case (9184) map </A>","Object Shape":"Fireball, Flash, Sphere","divs":["Sighting DetailsOur house was in a very rural area on a hill 10 miles south of Ironton and Arcadia, Missouri, on Hwy E. It overlooked the road and a large flat field (larger than a football field and similarly shaped) across the road. One night when I was 9 or 10 years old I was looking out the window and saw two lights in the field. At first I thought people must be out there with lanterns on foot because the lights were moving a bit and were close to the ground. I watched them because I had never seen anyone in that field before, not even during the day. They started to move (independently) and I thought they were headlights of motorcycles. But then they moved impossibly fast all the way to the other side of the field. I think they were joined by a third and possibly fourth light. They seemed to be checking out the field and the perimeter of it. I believe they stayed close to the ground the entire time. Their speed is why I remember this at all, because I couldn't understand what could possibly move that fast, especially since there were no roads there or anything. I went to get my parents to come see, but when we got back to the window, they were gone. I don't remember the time of year or exact time of night, but we only lived there less than a year I think. We moved out on April 1, 1970. We sold the 75 acre property later that year. I don't remember the address exactly, but you could find out by town records or I could probably find it. When I heard last week about the sightings in Texas, I was struck by the similarities. The lights I saw were bright, white or yellowish-white lights, each like a single car headlight, though now that I think about it, from my vantage point it was hard to tell how big they were. They could have been bigger, but not a lot bigger."],"Viewing Distance":"101-500 Feet","Summary":"lights moving around a field impossibly fast, like recent ones in Texas but 37 years ago","Latitude":"37.588106","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Region":"Missouri","Country":"United States","Date of the Event":"11/30/1969 12:00 UTC","City":"Arcadia","Object Features":"Unknown","Case Number":"9184","Date Submitted":"11/30/1969 12:00 UTC","trends":["There have been no other sightings in Arcadia","This sighting has never been favorited."],"Source":"MUFON","files":["/var/www/straped/mufon/html2text/9184.html.txt","/var/www/straped/mufon/org/9184.html"],"Log Number":"US-01232008-0012","Longitude":"-90.629011","Weather Factors":"Unknown","Disposition":"Unknown"}