{"City":"Laredo","Country":"United States","Tags":"City","divs":["Sighting DetailsI was in my home and my family had just left home that night to go grocery shopping I walked them to the car and I happened to look up at the television tower as I live near the cable companies office and I noticed the usual red flashing light from the tower and 1 perfect circle a few feet above it it looked like it was at least 200- 300 feet from above it from my estimate and that circle had very very birght white light I ranto get the video camera and it was still there so I started filminig it and fromt he camera angle it looked like that circle was turning into 2 but I thought it was something to do with the camera lense so I look up without the camera and in fact that 1 bright circle of white light had turned into two objects tey made no noise and it just hovered in that same spot when the other object appeared it was at the same altitude as the first but a few feet apart next to it. I don't know if someone taped over the video as I haven't seen that tape in years whic is a shame. a few months later I did see some unidentified object this time I was walking in a school yard at about 5 or 6 in the afternoon this one was a fireball looking object it was bright flourecent orange and it was moving slowly at what I estimate was about 500 in the air it had a tail like a meteorite or a comet but I knew it was nothing like that because at the speed that it was moving I did not take pictures or video of this object as I had no camera with me at the time. one thing I would want to mention is that I was aout 15 years old at the time of both sightings."],"Region":"Texas","Object Shape":"Fireball, Sphere","Sighting Duration":"01:05:00","Log Number":"US-01232008-0015","Latitude":"27.506407","Date of the Event":"03/13/1999 08:25 UTC","trends":["There have been 21 other sightings in Laredo","There were no other sightings in Laredo on or around March 13th 1999","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=27.506407,+-99.507542(9187)&iwloc=A&hl=en\"> mufon case (9187) map </A>","Object Features":"None","files":["/var/www/straped/mufon/html2text/9187.html.txt","/var/www/straped/mufon/more/9187_submitter_file1__whitelightspheresobjects.jpg","/var/www/straped/mufon/more/9187_submitter_file2__fireballobject.jpg","/var/www/straped/mufon/org/9187.html"],"Disposition":"Unknown","Longitude":"-99.507542","Date Submitted":"03/13/1999 08:25 UTC","Source":"MUFON","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Summary":"2 of my experiences","Case Number":"9187","Object Flight Path":"Stationary"}