{"files":["/var/www/straped/mufon/html2text/9188.html.txt","/var/www/straped/mufon/org/9188.html"],"City":"Lincoln","Disposition":"Unknown","Case Number":"9188","Weather Factors":"Unknown","Region":"Nebraska","Sighting Duration":"Undisclosed","Summary":"Triangular object(black)small light on each corner(3 total) floating silently in sky above","Date Submitted":"07/10/2007 12:00 UTC","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=40.808452,+-96.677139(9188)&iwloc=A&hl=en\"> mufon case (9188) map </A>","Source":"MUFON","Object Flight Path":"Undisclosed","Latitude":"40.808452","trends":["There have been 42 other sightings in Lincoln","There were no other sightings in Lincoln on or around July 10th 2007"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Country":"United States","Date of the Event":"07/10/2007 12:00 UTC","Longitude":"-96.677139","Tags":"City","divs":["Sighting DetailsWhile returning home on street next to apartment(bout to pull in drive) i happened to look up through driver window as i noticed what i thought to be helicopter flying overhead. On closer look.. this was too large(to be a helicopter), had 3 red lights forming a triangular shape, very dark(black)blocking out sky between its lights. Quite large from as best i could tell. This object made absolutely NO noise and looked to be floating cross the city sky. The distance away from me was hard to judge, thus I do not know size in relation to distance. It \"felt\" to be quite large based on gut feeling. It moved slow but was moving. I really didn't think much more about it other than \"wow, that was strange\".. and up till now, never talked about it nor reported it. I did wonder if others had seen it and just assumed if so.. it'd be in the paper the next day. I never did see any articles or hear anything and just washed it away as an abnormal experience. It was the silence of this object that truly was the most eerie part of it.. and the fact that it was blocking out the sky with it's blackness between its corner lights. The lights were not bright, and i remember them being redish in color and defining the outer edges of object(triangular). (this object was still passing overhead out of my view, but i didn't follow up on it - at the time, i had just put it out of mind as strange event and went inside) I now carry a camera with me whenever driving."],"Log Number":"US-01232008-0016"}