{"Source":"MUFON","Log Number":"US-01232008-0019","Object Features":"Unknown","Summary":"5 large quickly moving lights","Case Number":"9191","Disposition":"Unknown","Sighting Duration":"Undisclosed","Object Shape":"Star-like, Other","Viewing Distance":"501 Feet - 1 Mile","Latitude":"31.906039","Object Flight Path":"Path then hovering","City":"Comanche","Region":"Texas","map":"<A HREF = \"http://maps.google.com/maps?q=31.906039,+-98.599808(9191)&iwloc=A&hl=en\"> mufon case (9191) map </A>","Date of the Event":"01/08/2008 09:30 UTC","divs":["Sighting DetailsI am not sure of the exact time. My wife and I had made a trip to a local store. On our way home (4 blocks) we were crossing Grand Ave. As I looked left (west) for traffic, I saw several strange lights not far above the horizon. The lights were partially obscured by a two story building about 4 blocks away. I stopped in the middle of Grand Ave., blocking traffic and told my wife to look and pointed towards the lights. She looked and saw the lights also. When I first saw them, they looked like white fireworks (without the trailing flame) coming up from the ground. As we watched them, they appeared to fly around one another very quickly and randomly. We watched them for a little more than a minute and they just disappeared, like turning off a light switch. My wife was amazed at what she had witnessed. I have seen similar lights in the area many times over the last 15 years. I worked for five years as an Air Traffic Controller, mostly in a control tower at night. I can quite confidently state that these were NOT any known aircraft. I cannot estimate a size, but judging by how large they appeared in contrast to the building they were partially behind and not knowing how much further away they were, each individual light was much too large to be any type of known aircraft. If the lights were all part of a single unit then it would have been more massive than any craft I have ever seen or studied, including the Zepplins and other lighter than air giants. Approximately 15-20 minutes after we observed the lights, I saw a couple of small jet aircraft in the same area (this after arriving home). The contrast between the small jets and the strange lights is staggering. It would be like comparing the size of grapefruit to a raisin."],"trends":["There have been 8 other sightings in Comanche","There was one other sighting in Comanche on or around January 8th 2008"],"files":["/var/www/straped/mufon/html2text/9191.html.txt","/var/www/straped/mufon/org/9191.html"],"Longitude":"-98.599808","Tags":"City","Date Submitted":"01/08/2008 09:30 UTC","Country":"United States","Weather Factors":"Unknown"}