{"Weather Factors":"None","Object Features":"None","Tags":"City","Object Shape":"Circle, Sphere","City":"Lipan","Country":"United States","Date Submitted":"12/28/2007 07:30 UTC","Date of the Event":"12/28/2007 07:30 UTC","Log Number":"US-01232008-0020","Latitude":"32.518468","Source":"MUFON","Longitude":"-98.045873","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.518468,+-98.045873(9192)&iwloc=A&hl=en\"> mufon case (9192) map </A>","trends":["There has been one other sighting in Lipan","There were no other sightings in Lipan on or around December 28th 2007"],"files":["/var/www/straped/mufon/html2text/9192.html.txt","/var/www/straped/mufon/org/9192.html"],"divs":["sighting detailsi was driving back from lipan, december 28th about 7:30 pm ...it was overcast and dark and i notice the ground flickering, like a strobe lite and it made me look up and see two distinct circles of white just sitting there..they started to move and then just disappeared, moving toward the se. i thought i had seen a falling star or even some kind of falling depris. i was close to home and told my son that i had seen a falling star or meteor, as i have seen alot of them over the years, but has never expereinced the strobe effect that caught my attention in the first place. i didn't think much more about it but when the news broke on our local tv stations about all the sightings over stephenville. it made me re-think about that night.i even called my neighbors who were behind me that night about a 1\\2 mile and they did not see them. but i saw them. i live close to where hood, palo pinto and erath come together. i don't think it was a falling star as they move horizonal thru the sky and the strobe effect was effected in getting my attention. i was not fearful but awed in it all. i know what i saw that night and if i can help in anyway..let me know."],"Summary":"strobe effect on pasture..looked up..saw 2 white glowing circles..moved toward southeast and then disappeared","Case Number":"9192","Sighting Duration":"Undisclosed","Disposition":"Unknown","Region":"Texas"}