{"Source":"MUFON","Viewing Distance":"101-500 Feet","Date of the Event":"06/30/1954 12:00 UTC","Region":"New York","files":["/var/www/straped/mufon/html2text/9193.html.txt","/var/www/straped/mufon/org/9193.html"],"Country":"United States","Summary":"Five objects in formation, than two objects in formation","Disposition":"Unresolved","City":"Port Jefferson","Object Features":"None","Weather Factors":"Does Not Apply","Longitude":"-73.069273","trends":["There has been one other sighting in Port Jefferson","There were no other sightings in Port Jefferson on or around June 30th 1954"],"Object Shape":"Diamond, Other","Case Number":"9193","Date Submitted":"06/30/1954 12:00 UTC","Sighting Duration":"Undisclosed","Latitude":"40.946488","map":"<A HREF = \"http://maps.google.com/maps?q=40.946488,+-73.069273(9193)&iwloc=A&hl=en\"> mufon case (9193) map </A>","divs":["sighting detailsfirst sighting: mid summer, chrystal clear moonless night.five of us walking up to the club house on the highest point in sound beach the highest point in the area on the north shore of long island. i was 15 at the time (too young to drive)when i became aware of a diamond formation of what appeared to be 4 bright stars(brighter than the background) in a diamond formation with a brighter star dead center of the formation. i was an aviation buff and had some experience with aircraft performance. i called attention to the phenomenon and we all watched the motionless formation for several minutes. suddenly, the four bright points forming the perimeter of the diamond accelerated, linearly, to the four points of the compass, while the brightest,center point disappeared to what appeared to be straight up. shortly, the sound of a fighter jet became evident. the sound appeared to come from the direction(south) of the(then) west hampton beach afb. the aircraft showed no nav. lights, circled several times, then exited the area to the south. shortly thereafter the five point formation reappeared from the direction to which the had exited. unfortunately i do not remember how much longer they lingered. second sighting: same summer possibly two weeks later, two of us sitting on the cliffs overlooking long island sound when two what appeared to be bright stars appeared from over the horizon over the connecticut shore heading straight at us south\\south, east at a very rapid rate of speed.( the vehicle on the right was leading the one on the left) when the objects appeared to be over mid long island sound they made high speed right angle turns to the left heading east\\north east and quickly disappeared into the darkness over the far east end of long island sound, much faster than any of '50s aircraft. i reported this to the then bluebook program with no results."],"Tags":"City","Log Number":"US-01232008-0021","Object Flight Path":"Path then hovering"}