{"Object Shape":"Circle, Disc, Saturn-like","Log Number":"US-01232008-0022","Case Number":"9194","Sighting Duration":"Undisclosed","Date Submitted":"10/29/2005 11:30 UTC","Country":"United States","divs":["Sighting DetailsI was attending a Halloween party at a private home. I think it was a Sat. night. I had no alcohol at all. I was outside on Clematis St., talking with others facing me. I looked up in the sky and saw the saucer plain as day, suspended there, and as soon as I caught sight of it it sped away, disappearing as it went. It either had a cloaking type of device or the clouds enveloped it. Noone else saw it. I was too afraid they would think I was \"nuts.\" I just stood there, probably saying, \"Oh my G-d\" a few times if I remember that correctly. The only thing I could have been was some sophisticated, rather large hologram someone was using for a Halloween stunt. No idea if possible. It was very plain that it was like a traditional UFO saucer. Have always wondered if anyone else saw this. Didn't know until now to make the report. Someone else I know (a professional) said they had a very similar encounter-not the same date (don't know where and when)."],"Summary":"clear, large saucer with bright green lights all around seen just below cumulus clouds stationary at 1st then moved very swiftly and disappeared into clouds","Object Flight Path":"Hovering then path,Straight-line path","City":"Sarasota","Region":"Florida","Disposition":"Insufficient Data","trends":["There have been 39 other sightings in Sarasota","There were no other sightings in Sarasota on or around October 29th 2005"],"map":"<A HREF = \"http://maps.google.com/maps?q=27.345145,+-82.523953(9194)&iwloc=A&hl=en\"> mufon case (9194) map </A>","Date of the Event":"10/29/2005 11:30 UTC","Object Features":"Dome","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9194.html.txt","/var/www/straped/mufon/org/9194.html"],"Longitude":"-82.523953","Latitude":"27.345145","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown"}