{"Longitude":"-119.075423","Tags":"City","Sighting Duration":"Undisclosed","divs":["Sighting DetailsMy friends and I had been fishing up in the high Sierras all day and had just settled into camp, which was fairly secluded at approximately 10,000 feet. We ate some of our catch and had begun settling around the campfire. The stars had just started to come out and my friend noted two bright stars off in the horizon and said \"Look, twin stars.\" We first did not pay much attention to them and then looked back at them to see them in the same place. A couple minutes passed and we noticed that they had moved. When we payed closer attention to them we could see that they were moving in unison. However, unlike satellites, they did not follow an arc, but rather moved in a straight line in our direction. By no means did we believe that they were headed for us, they were quite far off in the distance, but they did seem to move straight and nearing us. Their movement was unwaivering, slow and steady. When they had covered about a quarter of the sky they immediately changed direction and took off very quickly 90degrees perpendicular to what had been their course. The change in course was so smooth and quick it was amazing. For us, it was obvious that there was nothing normal about what we had just witnessed. In retrospect we had initially had seen the objects hovering in distance for several minutes, then the movement in unison was our initial indication that something was odd. Further, the movement was not like any satellite, and the fact that they had moved so well together and had been hovering far off in the distance for at least what we had known to be a few minutes. Then the abrupt change in direction and the speed at which they took off together was further evidence that we had witnessed something abnormal."],"map":"<A HREF = \"http://maps.google.com/maps?q=37.779782,+-119.075423(9196)&iwloc=A&hl=en\"> mufon case (9196) map </A>","Latitude":"37.779782","Disposition":"IFO","trends":["There have been 2 other sightings in June Lake","There were no other sightings in June Lake on or around June 18th 2007"],"Log Number":"US-01232008-0024","Region":"California","files":["/var/www/straped/mufon/html2text/9196.html.txt","/var/www/straped/mufon/org/9196.html"],"Object Shape":"Star-like","Object Features":"Unknown","City":"June Lake","Case Number":"9196","Date of the Event":"06/18/2007 09:15 UTC","Source":"MUFON","Country":"United States","Object Flight Path":"Path with directional change","Summary":"Two starlike objects moved in unison across 1/4 of the horizon then immediately changed direction and took off upwards","Weather Factors":"None","Date Submitted":"06/18/2007 09:15 UTC","Viewing Distance":"Over 1 Mile, Unknown"}