{"Disposition":"Unknown","Tags":"City","City":"Aledo","Source":"MUFON","Date of the Event":"11/30/1974 12:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/9199.html.txt","/var/www/straped/mufon/org/9199.html"],"Object Shape":"Star-like","Weather Factors":"None","Object Features":"None","Longitude":"-97.602247","Country":"United States","Case Number":"9199","trends":["There have been 4 other sightings in Aledo","There were no other sightings in Aledo on or around November 30th 1974"],"Region":"Texas","Summary":"We thought we had seen a meteorite,","map":"<A HREF = \"http://maps.google.com/maps?q=32.695964,+-97.602247(9199)&iwloc=A&hl=en\"> mufon case (9199) map </A>","Log Number":"US-01232008-0027","Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","Latitude":"32.695964","Date Submitted":"11/30/1974 12:00 UTC","divs":["Sighting DetailsMy friend and I were driving west on McFarland Ranch Road in Parker County. We thought we were seeing a meteorite fall to the western horizon, but right above the horizon it stopped. It had been going very fast. We stopped the car and got out to look. The light flew all around the western and southern sky. It would go very fast and make right angle turns, and go up and down. I said, \"It must be an airplane of some sort.\" My friend with me said, \"When have you ever seen an airplane do that?\" It had no other lights on it, like red and green port and starboard lights on an airplane. It was just a brassy redish colored light. It flew very fast in the northern sky, and started coming towards us, hovering, no noise. My friend got scared and wanted to go, she said, \"That thing is looking at us!\" I felt the same way. It was maybe two or three hundred yards from us. Was hard to tell. We got in the car to take off, and the light went north at a high rate of speed. We didn't see it after that. It really left an impression on us. This happened some time in the summer of 1975 to the best of my recollection. We didn't know who to report this to. I come foward now because of the sightings in Stephenville. I would like to know if there were other sightings here in Texas at the time we saw our U.F.O."]}