{"trends":["There have been 13 other sightings in De Leon","There were no other sightings in De Leon on or around January 8th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-01242008-0001","Case Number":"9201","files":["/var/www/straped/mufon/html2text/9201.html.txt","/var/www/straped/mufon/more/9201_submitter_file1__MDGC0016.JPG","/var/www/straped/mufon/more/9201_submitter_file2__mufon1.jpg","/var/www/straped/mufon/more/9201_submitter_file3__Mufon2.jpg","/var/www/straped/mufon/more/9201_submitter_file4__Mufon3.jpg","/var/www/straped/mufon/more/9201_submitter_file5__Mufon4.jpg","/var/www/straped/mufon/org/9201.html"],"Object Flight Path":"Unknown","City":"De Leon","Latitude":"32.117304","map":"<A HREF = \"http://maps.google.com/maps?q=32.117304,+-98.532352(9201)&iwloc=A&hl=en\"> mufon case (9201) map </A>","Summary":"Flash of light at tree top level taken with deer camera attached to tree","Longitude":"-98.532352","Country":"United States","divs":["Sighting DetailsA flash of extremely bright light, rather broad in width, and short in height, was captured on a digital infrared game camera. This camera has been active for several weeks and placed in a stationary (fixed) position facing northwestern direction, where camera images are primarily targeted to capture photos of deer, turkey and other game in the area. This flash of light was captured on two consecutive camera images. There are no vehicular traffic or other modes of transportation available within view of this camera since this unit is located in a wooded area hundreds of yards away from the nearest highway. Additionally, the unidentified images are clearly seen at tree top level, and not in the line of sight of rising or setting sun. These photos were taken duting the same period of time as the UFO sightings occurred over Stephenville, TX. This camera is located 45-miles southwest of Stephenville. After reviewing the images on this camera several times and, being cognitive of the recent UFO sightings over Stephenville, Comanche and other nearby communities, the occurrance of the images observed were rather stange, and never before observed before or since the sightings over Stephenville. Just thought other curious and inquisitive minds might like to know? Still, the mystery remains....what are the unexplained images observed in the photos, and, could these same images be linked to the sightings seen be by people in Stephenville? One last note: the date was incorrected set and the time of day was in error, too, as this discrepency was noted when the camera was checked on January 19, 2008. However, the fact still stands that the images show an unexplained image which have yet to be duplicated. Any objectionable explanations are welcomed!"],"Object Shape":"Flash","Object Features":"None","Tags":"City","Date of the Event":"01/08/2008 12:00 UTC","Date Submitted":"01/08/2008 12:00 UTC","Viewing Distance":"Unknown","Disposition":"IFO","Source":"MUFON","Region":"Texas"}