{"Weather Factors":"Unknown","Date Submitted":"01/23/2008 12:00 UTC","Case Number":"9202","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=41.213022,+-77.188745(9202)&iwloc=A&hl=en\"> mufon case (9202) map </A>","Tags":"City","Object Shape":"Undisclosed","Sighting Duration":"Undisclosed","City":"Undisclosed","Source":"MUFON","Summary":"Metallurgical analysis - new review - Aurora TX","Region":"Pennsylvania","Country":"United States","Object Features":"Undisclosed","Longitude":"-77.188745","Latitude":"41.213022","Log Number":"US-01242008-0002","Date of the Event":"01/23/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/9202.html.txt","/var/www/straped/mufon/org/9202.html"],"Viewing Distance":"Unknown","divs":["Sighting DetailsAttached is a new assessment of the analysis on the Al-Fe alloy supposedly recovered from the 1897 Aurora TX debris field. From a scientific standpoint the 1973 MUFON investigation was hopelessly bungled. When any 'evidence' is removed from a site without verifiable archealogical controls applied it becomes useless. This is the case of the metal samples discussed in the 1973 documentation. Of all the metal samples discussed, the only one that is truly anomalous (not from normal agricultural activity) is the Al-Fe alloy sample. In my document, I review the 1973 metallurgical analysis and conclude that this is truly an advanced alloy that should not have been in this field. Given the publicity-seeking goals of the 'investigators' at the time it is likely that this sample was planted as a hoax. If it were not a hoax-- and was actually found in the Aurora 'debris field'-- then I am confident there must be more of this material, likely in larger quantities but dispersed in much smaller particles. They may be very small, like grains of sand, but most importantly they would not be found by a metal detector and should still be at that site. Luckily this is not something easily hauled off or planted, and may still offer a chance to at last have a real scientifically verifiable study of this site. -Anonymous"],"trends":[""],"Object Flight Path":"Undisclosed"}