{"map":"<A HREF = \"http://maps.google.com/maps?q=40.75426,+-80.31003(9208)&iwloc=A&hl=en\"> mufon case (9208) map </A>","Object Features":"Unknown","Date Submitted":"12/12/2007 11:30 UTC","Sighting Duration":"00:05:00","Latitude":"40.75426","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","City":"Beaver Falls","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"12/12/2007 11:30 UTC","Region":"Pennsylvania","divs":["Sighting DetailsI was going out to my shed to make sure that the doors were closed and it was dark of course so I Was looking at the stars. Nex to my house there is a field and off in the distance there is a power plant. I was looking that way and i saw a light. At first I thought it was an airplane but then I remembered that since 911 planes could not be that close to the plant.The object seemed to move up and down the erratically it went up into the sky then back down to wear it was i went in to get my binoculars. I came back outside to look at the object. In the lens I couls see the outline of one of the smoke stacks. then I saw the light. It seemed to be right beside the stack. After about five minutes i saw a flash were the object was in the sky and then the objectwas gone. After the event I felt almost peaceful and i dont really know why. Also I started to walk into the field next to my house to get closer to the tree line were the stacks of smoke come from. This was odd because i never go outside into woods alone when its dark but I felt like I could take anything on after that experience"],"Summary":"small light that flashed out of my sight","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/9208.html.txt","/var/www/straped/mufon/org/9208.html"],"Case Number":"9208","Country":"United States","Log Number":"US-01242008-0008","Object Shape":"Circle, Flash","Longitude":"-80.31003","trends":["There have been 2 other sightings in Beaver Falls","There were no other sightings in Beaver Falls on or around December 12th 2007"],"Object Flight Path":"Stationary,Other"}