{"Viewing Distance":"Unknown","Longitude":"-86.132293","Latitude":"40.496217","Case Number":"9210","Disposition":"Insufficient Data","Object Shape":"Circle","Source":"MUFON","Sighting Duration":"Undisclosed","Region":"Indiana","divs":["Sighting DetailsI was taking my dog out at 9:00 pm on October 12, 2007. I looked up at the sky because it was a clear and still night. Suddenly a bright light appeared in the western sky. It just appeared and there was no sound. It wasn't as big as a full moon, I would say it was half that size. It was a perfect circle and the brightest light I have ever seen. The light was stationary and then moved East. It stopped and I was looking straight up at it. Then it just got smaller and smaller like it was going straight up until it disappeared. My dog and the neighborhood dogs began to bark. I ran inside to get my husband. We both went outside but nothing was there. I looked in the paper the next day thinking someone must have seen this too. It was too bright and too big for me to be the only one. Nothing was reported so I guess I may never know what it was. During the time of seeing this object I never felt threatened or scared. I just watched it in disbelief and wished someone was there with me to see it."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.496217,+-86.132293(9210)&iwloc=A&hl=en\"> mufon case (9210) map </A>","Country":"United States","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path then hovering","Date Submitted":"10/12/2007 09:00 UTC","City":"Kokomo","Weather Factors":"None","files":["/var/www/straped/mufon/html2text/9210.html.txt","/var/www/straped/mufon/org/9210.html"],"trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around October 12th 2007"],"Log Number":"US-01242008-0010","Tags":"City","Summary":"Sudden bright light appeared then moved over me. The light grew brighter then within seconds got smaller and smaller until it just disappeared.","Date of the Event":"10/12/2007 09:00 UTC"}