{"Country":"United States","Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=32.504464,+-94.738709(9211)&iwloc=A&hl=en\"> mufon case (9211) map </A>","Source":"MUFON","Date Submitted":"10/31/2007 10:00 UTC","Latitude":"32.504464","Object Features":"Unknown","Object Shape":"Chevron, Diamond, Triangle","Date of the Event":"10/31/2007 10:00 UTC","Weather Factors":"None","trends":["There have been 7 other sightings in Longview","There were no other sightings in Longview on or around October 31st 2007","This sighting has never been favorited.",""],"Sighting Duration":"00:01:00","Region":"Texas","Tags":"City","files":["/var/www/straped/mufon/html2text/9211.html.txt","/var/www/straped/mufon/more/9211_submitter_file1__blacktriangle2.jpg","/var/www/straped/mufon/org/9211.html"],"Disposition":"Unknown","Longitude":"-94.738709","Case Number":"9211","Summary":"3 different events on three different nights within week in a half","Viewing Distance":"501 Feet - 1 Mile","City":"Longview","Log Number":"US-01242008-0011","divs":["Sighting DetailsAround 10:00 pm i had walked out of my house via the backdoor to retrieve something from my vehicle. I walked to the end of my little courtyard and turned to the left to go out the gate when i saw a very large V shape of lights moving from the west to the east. Directly over my house. There were numerous clusters of lights in various colors, mostly white and red, but also a strange hint of a green color as well. I watched it fly over my head at an altitude unknown to me, but it appeard to be very high up. I noticed a couple of things while i watched it completely cross the sky above me. 1) it was very big and although it wasnt making any type of manuvers (just flying in a straight path across the sky) it seemed to move effortlessly. 2) none of the lights blinked on it, and the lights themselves were large. they were glowing more than anything. 3) it was very loud, and was a strange sound, different than anything i had heard before.. 4) im not sure but i believe it had one lone light trailing in the distance, as if it could actually have been a diamond shape. if it was actually shaped like a diamond, and the trailing light was attached to the large V cluster in the front, its big... i watched as it faded away in the eastern distance, while still able to hear it i could no longer see it and i ran in the house to tell my wife what i had seen. i wasnt sure what i had seen but i knew it was something i had never seen before. the next night nothing happened. the night after, at 10:00 approximately, i heard it from inside my house and ran out to look. it was the same basic craft on the same exact path at what appeared to be the same altitude as the previous flight.. everything was the exact same, accept the clusters of lights were not as dense, or there werent as many lights on? i watched it fly over and went inside to tell me wife what i had seen. she informed me that she had heard it from bed and that it was really loud inside the house.. nothing happened for several nights... then at around 10:00 pm a few nights after the last sighting, i heard it from my living room again. i ran to the door and looked up and saw something different.. it was a perfect triangle. 1 huge white light at each corner and a equally large glowing, pulsing, red light in the middle... it was on the same path as the previous two flights at what appeared to be the same speed and altitude. it was apparent to me that if these were two different kinds of planes, they had a similar engine, or drive system based on the sound as it flew over.. i ran into the house to get my wife but she met me about halfway to the bedroom, saying she had heard it in bed and woken up. We ran outside to see it dissapearing in the distance, having completely crossed the sky. It was still very loud and my wife commented, based on the spread of the two lights we could see still, how big it must be.. that was it, hasnt happened since... i hadnt really thought anymore about it until the incident in stephenville. that got me lookin around on the internet where i came across a picture of the Triangle shaped craft. it is an artists rendition but it matches what i saw perfectly. The other thing is, both my sighting and the ones in stephenville are in close proximity to military bases... The times that i saw it, it appeard to be heading for barksdale airforce base in shreveport, louisiana. i dont think its necessarilly an alien craft, i think its man made."]}