{"Tags":"City","Date of the Event":"07/10/2004 10:10 UTC","trends":["There has been one other sighting in Oconomowoc","There were no other sightings in Oconomowoc on or around July 10th 2004"],"Object Shape":"Triangle","Case Number":"9214","Country":"United States","Viewing Distance":"21-100 Feet","Region":"Wisconsin","Date Submitted":"07/10/2004 10:10 UTC","Object Flight Path":"Stationary","map":"<A HREF = \"http://maps.google.com/maps?q=43.111673,+-88.499266(9214)&iwloc=A&hl=en\"> mufon case (9214) map </A>","City":"Oconomowoc","divs":["Sighting DetailsWhile driving alone on a summer night in the country, i turned on a stretch of rural road, farmland, to make my way home. as i turned onto the road i noticed a long light in the sky running parellel with the road. as i drove i kept looking up at it and thought to myself that it was similuar to a spot light that those car dealers use to advertise with light in the sky, or maybe a train light--it was a strong beam of light that shot straight ahead in the sky which did not move. following the light looking for its source, i realized it was near the only house on that road, which is in a farm field. driving closer i thought it must be a news helicopter, because it was hovering-not moving but staying in place with its light on, yet i thought how odd i don't hear any helicoptor--helicoptors have that loud chopper sound. it wasn't a helicoptor and it was not a normal aircraft. the homeowner has a cellphone tower on his land and that is where this aircraft was--over the cellphone tower which is right next to his house before the farmland begins. i couldn't help wonder if the people in the house knew what was near them. it was low enough for me to see it but too far up for me to see any details except the lights and shape. as i began approaching the part of the road ahead where i would be directly under this thing i could not believe it wasn't moving and there wasn't any sound--this is when i saw its shape. i looked up at it from my car window, as i drove, getting a look before the roof of my car blocked my view -- i did not dare stop. The aircraft was in the form of a dark trangle with small lights on it's ends and the one large beam which lit up the sky ahead of it. it never moved or made any sound-- it seemed to be sitting above the cellphone tower, charging itself. i never waited to see if it would leave, i just drove home quickly. to this day i still wonder what it was and from time to time when i drive home late i appraoch that road with caution."],"Summary":"triangle in shape with a beam of light in front of it as it was hovering over cellphone tower","Longitude":"-88.499266","files":["/var/www/straped/mufon/html2text/9214.html.txt","/var/www/straped/mufon/org/9214.html"],"Latitude":"43.111673","Weather Factors":"Unknown","Object Features":"Unknown","Disposition":"Unknown","Log Number":"US-01242008-0014","Sighting Duration":"00:02:00","Source":"MUFON"}