{"Tags":"City","Summary":"Large solid black square with no lights","Source":"MUFON","Object Flight Path":"Straight-line path","Disposition":"Unknown","Object Shape":"Square, Rectagular","Date of the Event":"02/28/2003 12:00 UTC","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=30.275703,+-97.737161(9215)&iwloc=A&hl=en\"> mufon case (9215) map </A>","Latitude":"30.275703","Longitude":"-97.737161","Weather Factors":"Unknown","Case Number":"9215","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 28th 2003"],"Object Features":"None","Country":"United States","Region":"Texas","divs":["Sighting DetailsI had just come home from a dinner with friends and proceeded to let the dogs out in the back yard. At this residence we had a very large and open back yard with a great view of the sky. The clouds in the sky were very bright due to the city lights reflecting off of them. The cloud ceiling was very low and there was some light rain. I walked out with the dogs and just looked up into the sky and saw the object traveling at a high rate of speed over the neighborhood from right to left. There were no running lights at all and no sound. This house was close to Austin-Bergstrom airport and I know what the aircraft looked like and their speed from watching them all the time. This object moved 3 times as fast as any aircraft. At this time I ran in to get my roommate and he was in the shower so I ran back out and it had disappeared after going behind a large tree in the distance. I never saw it again. In light of the recent events that have taken place here in Texas, Stephenville precisely I wanted to submit this account. Although I did report it on the National UFO reporting center at the time I wanted to re-report it here. I was in the US Air Force for 12 years and graduated from Texas State University and would hope that I am a well grounded person and I know what I saw and it was no earthly aircraft. I only which I had taken a photo but there was no time as it was gone in a flash. I will never forget that night and know as a matter of fact that there is something going on here in Texas."],"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/28/2003 12:00 UTC","files":["/var/www/straped/mufon/html2text/9215.html.txt","/var/www/straped/mufon/org/9215.html"],"Log Number":"US-01242008-0015","City":"Austin"}