{"Tags":"City","Longitude":"-69.959834","City":"Harpswell","divs":["Sighting DetailsAt the approximate time and date stated above, I awoke to what first appeared to be a car pulling into the driveway of the stated residence. It looked as if headlights were coming through the window. The light quickly grew in intensity and as I began to try to sit up to investigate, an incredibly bright, white light with a light bluish hue shown into the room. At the same time I felt a high-frequency vibration inside of my body preventing my movement. What I felt was complete paralysis. An overwhelming fear came over me, and I tried to scream, and was unable to. As soon as I tried to scream for help, I felt my body being levitated and I could see the ceiling getting closer. When I was just a few inches away from the ceiling I heard what sounded like my own voice talking to me. (What my voice sounds like from my perspective, not like a recording). The first words that I understood were such that I should not be afraid because no harm would come to me. What happens from here forward is sort of fuzzy and I cannot recall absolute detail except for the following: As the encounter ended, I saw the ceiling getting further away and I felt myself sink back into bed. All at once, the vibration and bright light stopped. I checked the clock and it said something like 2:40. I was not able to view the clock prior to the encounter, but it seemed as though ten minutes had elapsed from start to finish. The next morning I told my parents of the incident, who of course did not believe my statement. I have only told very few people about this encounter since it happened."],"Case Number":"9217","trends":["There have been no other sightings in Harpswell","This sighting has never been favorited."],"Region":"Maine","Date Submitted":"02/18/1996 02:30 UTC","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/9217.html.txt","/var/www/straped/mufon/org/9217.html"],"Date of the Event":"02/18/1996 02:30 UTC","Source":"MUFON","Object Flight Path":"Unknown","Sighting Duration":"00:10:00","map":"<A HREF = \"http://maps.google.com/maps?q=43.786434,+-69.959834(9217)&iwloc=A&hl=en\"> mufon case (9217) map </A>","Latitude":"43.786434","Weather Factors":"Unknown","Object Shape":"Unknown","Object Features":"Unknown","Log Number":"US-01242008-0017","Country":"United States","Viewing Distance":"Unknown","Summary":"Blinding white-blue light"}