{"Country":"United States","Summary":"Dark greyish-black pearl color","Date of the Event":"10/23/2007 11:00 UTC","Source":"MUFON","Object Features":"None","files":["/var/www/straped/mufon/html2text/9220.html.txt","/var/www/straped/mufon/org/9220.html"],"Case Number":"9220","trends":["There have been 9 other sightings in San Angelo","There were no other sightings in San Angelo on or around October 23rd 2007"],"Date Submitted":"10/23/2007 11:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=31.465682,+-100.434798(9220)&iwloc=A&hl=en\"> mufon case (9220) map </A>","Tags":"City","City":"San Angelo","divs":["Sighting DetailsThe UFO appeared to be round or oval flying in light low clouds at the bottom of the clouds so that the clouds swirled covering opposite sides giving the appearance of being oval shaped. It was the night of the Autumn Solstice when the earth tilts North toward North Northeast. The UFO was flying from the South toward the North. The moon was full and very bright. The UFO did not have lights and was flying about 1200' altitude and about 1\" long. My husband and I both saw the UFO and started viewing it after it had flown over our house and was about 75 degree angle to the North horizon. We watched until it disappeared into the clouds at about a 35 degree angle. The UFO flew silently and was cruising along at a slow speed. My husband and I were standing on the patio talking. I notice someting moving up above where we were standing and knew it was a UFO immediately. The UFO was flying silently and straight from South to North. We were excited to finally see a UFO close enough to know it was a UFO. I wondered how they communicate (language) and if they could read our minds and what kind of radar or detection equipment they have to be flying at night and if the UFO could detect people outdoors. Flying that low to the earth, it seems as if they were peaceful. What could they be searching for?"],"Sighting Duration":"Undisclosed","Longitude":"-100.434798","Log Number":"US-01242008-0020","Region":"Texas","Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Latitude":"31.465682","Object Shape":"Oval","Object Flight Path":"Straight-line path","Weather Factors":"Unknown"}