{"trends":["There have been 4 other sightings in Detroit Lakes","There were no other sightings in Detroit Lakes on or around January 24th 2008"],"Viewing Distance":"101-500 Feet","Weather Factors":"Unknown","City":"Detroit Lakes","Summary":"over 20 smaller ufo's also merged into larger past several nights","Tags":"City","Latitude":"46.825501","Country":"United States","Longitude":"-95.839035","map":"<A HREF = \"http://maps.google.com/maps?q=46.825501,+-95.839035(9225)&iwloc=A&hl=en\"> mufon case (9225) map </A>","Sighting Duration":"Undisclosed","Case Number":"9225","Disposition":"Unknown","Region":"Minnesota","Object Shape":"Circle","divs":["sighting detailsover the last several nights, there have been anywhere from 7 to 20 ufo's circling just above the tree tops - over white earth, minn. several people have seen these, and when fighter jets were scrambled to pursue, it was compared to a tricycle chasing a train. just after sunrise these last few days, the larger ufo, takes in the smaller ones. this has been reported to the local 911 dispatch..although nothing will be done about it. several witnesses over 20 adults and several children, the dogs are going nuts. i first noticed these 'strange lights' in the sky, then had my daughter come out and see it, many more started to appear, we also called the neighbors, we watched them throughout the night into the wee hours of the morning. these objects sprint in all different directions, up\\down\\sideways and different angles. they first started appearing about dusk in the location of the 'little dipper' what made me first notice : was that these 'stars' didn't behave as stars.. after noticing the first one, several others appeared..it became obvious they weren't stars. we never 'lost sight of the objects' as the larger 'mother ship' which appeared as a huge white light, absorbed the smaller lights (craft)"],"Object Features":"Dome","Log Number":"US-01242008-0025","Date of the Event":"01/24/2008 07:30 UTC","Object Flight Path":"Hovering then path","Date Submitted":"01/24/2008 07:30 UTC","files":["/var/www/straped/mufon/html2text/9225.html.txt","/var/www/straped/mufon/org/9225.html"],"Source":"MUFON"}