{"Object Features":"Unknown","Summary":"We saw a large shape in the eastern night sky turning different colors then smaller shapes came out of it in the same sequence of colors","City":"Sprague River","trends":["There have been 2 other sightings in Sprague River","There were no other sightings in Sprague River on or around October 31st 1991"],"Case Number":"9226","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=42.45694,+-121.498703(9226)&iwloc=A&hl=en\"> mufon case (9226) map </A>","Date of the Event":"10/31/1991 10:10 UTC","Tags":"City","divs":["Sighting DetailsAround 11PM. We lived in a mountainous area around Sprague River, on the very top. In our living room was several large picture windows. It was a very clear moonlit night, very cold and the moon lit up the entire valley below our house. I could see for what seemed miles in the eastern direction. I happened to look up and saw this large light pulsating different colors. I cannot remember the sequence of the colors but it would blink like red for a few seconds, the yellow, then green and so forth. I watched it in awe and called my friend to see it. It was about the position of 2 oclock. The colors were very clear and it stayed in the same place. At first I thought it was an airplane but the colors were much to vivid and it was stationary. We watched it for about five minutes, just sitting there pulsating these colors all the while. Then, in two rows from the bottom of it came first yellow lights, much smaller in size, then red ones with the yellow ones still visable, then green ones with the red and yellow ones still visable. (the color sequence cannot be remembered.). The row on the left whisked away toward the left and disappeared and the row on the right whisked away to the right and disappeared. The main large object stayed in the same place and the colors kept on flashing. In about what seemed like four or five minutes the smaller ones came back and entered into the larger one in the same fashion as they had left. o . . . . Went to left . . Went to Right We continued to watch as the smaller ones had apparently gone inside the larger one and then after another few minutes the large one disappeared. We were in amazement and could not believe what we had seen and discussed it with each other. I know what I saw and have now decided to let someone know. For reasons private I do not want any exposure from this report. Thank you."],"Region":"Oregon","Object Shape":"Unknown","Longitude":"-121.498703","Country":"United States","Log Number":"US-01242008-0026","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/9226.html.txt","/var/www/straped/mufon/org/9226.html"],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","Disposition":"Insufficient Data","Date Submitted":"10/31/1991 10:10 UTC","Source":"MUFON","Sighting Duration":"Undisclosed","Latitude":"42.45694"}