{"Case Number":"9233","trends":["There have been no other sightings in Sabinas","This sighting has never been favorited."],"Country":"Mexico","Viewing Distance":"Over One Mile","divs":["Sighting DetailsEvery year for the last 15 years or so I travel to mexico to visit family. And every year we see a or many Unidentified Flying objects. The great thing about seeing them in mexico is that they DO NOT HAVE high tech aircrafts like we have here in the U.S that can fancy around in the sky. What I see every year are small star sized and shaped objects maving back and forth in the sky. In the summer of 1997 while we were in the mountains of Monclova Coauhila Mex. My father was also with us that year but he was in a Ranch town called San Alberto about 60 miles away. He called us one morning and asked us if we saw a giant flash that covered the sky, Unfortunately we didnt but the next few days My Mex cousins, my bro and I witnessed something that we have never seen our \"common\" star shaped friends do. We were out camping in the mountains when I spotted 1 star shaped craft moving back and fourth in the sky for about 2-3 minutes I told my brother and my cousins about it. When they looked up..it was gone.. A few seconds later the craft appearedin the same general location in the sky then another craft appeared next to it. By this time all four of us were looking right at them.then they vanished. A minute or so later 1 appeared then it seemed like it bursted apart. The bursted pieces then started to move arount the original craft(it looked like 1 UFO laid an egg of 5). At that time there we a total of 5-6 crafts in the sky for a little over 5 minutes. During those five minutes those 6 crafts kept warping back and fourth and some even vanishing for a few seconds. Then another 3 crafts joined the other six and in a split second they all warped away. Like I mentioned above, seeing starshaped and sized ufo's was common for me and my brother during our summervisits to mexico. These were not human made aircrafts, these were not weather baloons and satellites that we occasionally see pass daily through our skies ( in a uniform straight line) these were not high tech airforce crafts (specially not in mexico) . I have not been to mexico in 4 years. This summer 08' I will travel to mexico again. I guarantee a visual of a UFO. the problem is that all of the UFO i see are the size of most stars in the sky . I dont know what kind of camera or lense will be appropriate for filming star shaped ojects that can be tracked while moveing anywhere from 1 inch to a few feet from their current location. Let me know... Good Hunting, H C"],"Weather Factors":"Unknown","Summary":"Yearly UFO sighting common in the mountains fo Monclova Coauhila Mex","City":"Sabinas","map":"<A HREF = \"http://maps.google.com/maps?q=27.86,+-101.12(9233)&iwloc=A&hl=en\"> mufon case (9233) map </A>","Object Features":"Undisclosed","Date Submitted":"01/25/2008 01:32 UTC","Latitude":"27.86","Region":"Coahuila","Date of the Event":"Unknown","Log Number":"MX-01252008-0003","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9233.html.txt","/var/www/straped/mufon/org/9233.html"],"Longitude":"-101.12","Tags":"City","Object Shape":"Star-like, Other","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Disposition":"Unresolved"}