{"Object Features":"Other","Object Flight Path":"Stationary","Date of the Event":"12/25/2007 03:22 UTC","trends":[],"Sighting Duration":"00:05:05","Object Shape":"Circle, Cylinder, Other","Date Submitted":"12/25/2007 03:22 UTC","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.552861,+-105.777047(9236)&iwloc=A&hl=en\"> mufon case (9236) map </A>","Summary":"Iyt was Bronze and was like metall looking, and it was circled on both sides, will kind like it was two shapes together very odd unlike the one I've seen before..","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9236.html.txt","/var/www/straped/mufon/org/9236.html"],"Case Number":"9236","Viewing Distance":"Over 1 Mile, Unknown","Region":"Colorado","Tags":"City","Latitude":"39.552861","Longitude":"-105.777047","Log Number":"US-01252008-0006","divs":["Sighting DetailsMe and my sister were at the Dollerstore on Fillmore and Nevada. She had her car parked in front of the store facing south. She ran in and when she did I waited in the car when she got back in the car I happened to look up and see something very weird unlike a UFO that was round this was very different it was bronze in color and kind of looked like the metal pieces that are on top on the electric poles. Round but not straight up, like laying down. The funny thing is if I didn't know better, that the parking lot didn't have any poles in it at all that I would have guessed that thats what it was flying but it wasn't flying it was just sitting there just watching or something. I told my sister to look up but she could see because she was in the drivers seat and coudn'nt see over me to get a better view so she turn the car around to see it and it was gone disappeared! I have seen lots of thing UFO\"S, Creatures, Comets, Little gnomes, Ghosts and etc.. But this one, kind of took me by surprize, their never bronze! Are they? Thanks for listening. Melissa"],"City":"Undisclosed","Source":"MUFON","Country":"United States"}