{"Summary":"UFO's and Glowing ball","Log Number":"US-01252008-0012","Longitude":"-81.517539","Disposition":"Insufficient Data","divs":["sighting detailsin response to the the person who just reported 1-25-08 glowing ball seen on 1\\1\\08 in massillon ohio. i have also seen the socker size glowing ball in mid april 2007. it appeared 10 feet away from me and approx 12 ft up. i looked at it for 2 seconds and then it disappeared leaving what i say is air filling the void. it also made a very loud boom noise. my boyfriend was inside of my home and he also heard the loud boom. then on may 11th 2007, i and a coworker seen a ufo going over the massillon moose lodge. that was a disc and all illuminous underneath with a beam of white light shining from the top and one slow blinking red light on the top. it was approx 60 feet above us. it was moving slow and we viewed it for about 25 seconds. that was reported in the town newspaper in may. in the summer of 1966, i seen a ufo approx 200-300ft away from me. i was 12 years old then. i ran back to my house and just sat down on the couch facing the picture window in the living room when i seen a glowing ball pass infront of the window. my sister was the only one at home at that time. these incidents all happened in the evening. i believe there is a connection. i also know of 2 other people who have seen the glowing balls in massillon. thanks for reporting your incident. it finally got me to take a moment and write about my encounter."],"Object Shape":"Disc, Fireball","trends":["There have been 5 other sightings in Massillon","There were no other sightings in Massillon on or around May 11th 2007"],"Object Flight Path":"Undisclosed","Region":"Ohio","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=40.804654,+-81.517539(9242)&iwloc=A&hl=en\"> mufon case (9242) map </A>","Tags":"City","Date of the Event":"05/11/2007 12:00 UTC","Object Features":"Undisclosed","Country":"United States","Date Submitted":"05/11/2007 12:00 UTC","Case Number":"9242","City":"Massillon","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9242.html.txt","/var/www/straped/mufon/org/9242.html"],"Latitude":"40.804654"}