{"Case Number":"9245","Date of the Event":"09/16/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=30.34132,+-95.085488(9245)&iwloc=A&hl=en\"> mufon case (9245) map </A>","Country":"United States","Weather Factors":"Unknown","City":"Cleveland","divs":["Sighting DetailsThis is not the only time that I have seen these lights, But this is the first time they seemed to be so close to the ground and to me. It startled me just a little and I slowed down to about 30 mile per hour. It was late and dark out that night, I was driving by my self south on a farm market road and about a mile after I had turned on to the farm market road I look up and noticed these bright bold aluminating lights (about 7 of them) that where almost prefectly spaced apart from one another, at a slight upwards angel, and they where huvering over the area in which I was in and travaling in. Every now and then one of them would shoot off in to the distance then quickly return, it was almost as if they where playing with each other in the sky. When I saw the lights I was frighten just a little because I could tell that this was not just a simple human made aircraft of any sort that I had ever seen or hard of before. I wanted to report it to some one but did not know who to turn to that would believe what I had to say, growing up a heard all kind of stories on how the Rosewell people where treated, and though I am still fearfull to what may come, I am still hopeful that the truth will eventually come out. I am convenced that what I saw was a UFO or several UFOs. I have seen things through out my life that where simular to these lights, but never this close to me. As a child I was always looking up at the stars, and I Know what airplanes look like and these lights were not airplanes. Remembering the past is not one of my strong points because complete details are some thing that my brain dose not recall for some reason. I have however witness several other things in the sky that where very much alike with this particular night. When I was a child I would tell my parent about the funny looking light(s) in the sky about they would say it was a falling star and to make a wish at first I beleived them, but as I grew up and more mature I was convinced that all of those times before they where not stars, but something more. As far as falling stars go, I did not get the opporitunity to see one of them until this past year right before Christmas. It is not every day that someone can witness some thing so bazzar like this night. A trip that should have only took me about 20 minuts, took me about 45 minutes because I was intriged by what I was seeing. I reliesed that I was going to be last so I picked up speed, so that I could get to my distanation."],"Latitude":"30.34132","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Longitude":"-95.085488","files":["/var/www/straped/mufon/html2text/9245.html.txt","/var/www/straped/mufon/org/9245.html"],"Object Shape":"Other","Tags":"City","Summary":"The lights where exactly like the ones that are connected with Stevensville Texas.","Sighting Duration":"05:00:00","Object Features":"Unknown","Date Submitted":"09/16/2007 12:00 UTC","Disposition":"Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","Region":"Texas","trends":["There have been 4 other sightings in Cleveland","There were no other sightings in Cleveland on or around September 16th 2007"],"Log Number":"US-01252008-0015"}