{"Case Number":"9247","Object Flight Path":"Hovering then path","Summary":"Black Object (Mass) Too large to be plane but was moving one way and then then descended","Date of the Event":"01/22/2008 05:30 UTC","Sighting Duration":"00:03:00","map":"<A HREF = \"http://maps.google.com/maps?q=35.20404,+-91.826763(9247)&iwloc=A&hl=en\"> mufon case (9247) map </A>","trends":["There have been no other sightings in Flight-Nashville to Dalla","This sighting has never been favorited."],"Latitude":"35.20404","Region":"Arkansas","Source":"MUFON","Object Features":"Unknown","Log Number":"US-01252008-0017","Longitude":"-91.826763","divs":["Sighting DetailsI was on a flight from Nashville, TN (BNA) to Dallas Fort Worth (DFW). The flight left just before 5 PM. There was a blanket of very white clouds under us. It was pretty solid. It was just before sunset time. The sun was in front of the plane and I was looking out at the beautiful white blanket of clouds. The form here makes you pick a state and county. Since I am not sure where we were in the flight, I chose the destination state and county, but this is not where it took place. It was in flight. I was looking out of the window pretty much most of the trip, wondering why I we don't see many planes usually in such a vast space when flying that high. During this trip however, I looked up and saw a plane, or maybe even a comet? It was so high and moving at a very fast speed. I started seeing other planes as well. I saw what looked like two private jets fly just below us at what seemed like a pretty close distance. Then looked back kind of behind to the left of our plane and saw a UFO. It was black and too far to be as big as it appeared to be a plane. It kind of stayed in the same place for a few minutes then it started changing shapes to a larger mass and it looked like it was coming towards us. I asked my business partner and friend to look out and asked if he could see it. He said yes and said what is it? He could not see very well though because he was having to lean forward and in order for him to see I had to move my head out of the way and could not view it at the same time that he was. Since he was struggling to see, I decided to look again thus not enabling him to see. I watched it for what seemed like a few minutes, then it seemed to change shapes into like a cigar shape and it started descending into the clouds. I watched as long as I could just to see if maybe it would appear again, but it did not. It was not a plane. It was too big and it was black. It was not a cloud as I could see it move as it went through the other clouds. It was descending. It also seemed to change directions and shape unlike a plane would be able to. I am sure I saw something unusual and not human."],"Tags":"City","Date Submitted":"01/22/2008 05:30 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9247.html.txt","/var/www/straped/mufon/org/9247.html"],"Viewing Distance":"Unknown","Disposition":"Unknown","Object Shape":"Bullet, Missile, Cigar, Other","Country":"United States","City":"Flight-Nashville to Dalla"}