{"Disposition":"Unknown","Latitude":"32.542082","Sighting Duration":"00:00:20","Tags":"City","City":"Burleson","Date Submitted":"01/08/2008 05:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.542082,+-97.320849(9251)&iwloc=A&hl=en\"> mufon case (9251) map </A>","Object Flight Path":"Straight-line path","Summary":"My 2 girls (10 & 7) witnessed a missle shaped UFO with 8 wings flying from North East to South West.","Date of the Event":"01/08/2008 05:00 UTC","Source":"MUFON","Log Number":"US-01252008-0021","Weather Factors":"None","Region":"Texas","Object Shape":"Bullet, Missile","Object Features":"Wings","Country":"United States","Case Number":"9251","Longitude":"-97.320849","trends":["There have been 8 other sightings in Burleson","There were no other sightings in Burleson on or around January 8th 2008","This sighting has never been favorited.",""],"divs":["Sighting DetailsMy 2 daughters ( ages 10 & 7 ) were out in the back yard jumping on their trampoline when my oldest daughter heard a strange dull humming noise coming from above a neighbors house to the northeast. Both of them looked up to see an object which they described as missle like with 8 wings flying very rapidly from northeast to southwest with no visible landing gear or propellers. This was approximately 5pm on the 8th of January 2008. They describe the object as being metallic silver with 8 wings and a thin black line running the bottom length of the craft. They stated they saw the object for approx. 15 to 20 seconds as it flew just behind our house. Since we live in the flight path of the local airport ( Ft. Worth Spinks) I asked them at what altitude they thought it was IE if it were flying as high as the General Aviation aircraft in the pattern and they said it was flying at or above that altitude which I believe is between 1000 to 1500ft AGL. They described the craft as being bigger than a Cessena but smaller than a airliner,which also fly over our house towards the DFW Airport area. They were both excited and my oldest daughter came in to tell me that they had seen something out of the ordinary fly over. I personally didn't think much of it until my daughter drew a picture of it for me and explained the event in greater detail. I asked them both independently what they had seen and they both described the object in the exact same way. I,being an aircraft mechanic by trade,was curious to see if they had seen a kit aircraft such as a long e z which I showed them a picture of and they both said that it wasn't the same craft they had witnessed. They said the craft surface was very smooth with no indentions or bumps. I have no explanation of what they saw and am very curious if anyone else in this area has seen anything of this nature."],"Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9251.html.txt","/var/www/straped/mufon/more/9251_submitter_file1__CCF01252008_00000.jpg","/var/www/straped/mufon/org/9251.html"]}