{"divs":["Sighting DetailsWe were spending the weekend on lake McClure on a friends houseboat. Myself and three others were sleeping on top of the houseboat on the upper deck. I awoke around 12:15am, after relieving myself I sat down lite a smoke and was watching the stars. An object moveing in the sky caught my attention. I started watching this object as it travled from one star to another. After watching this for about thirty minutes, I woke up my wife. Without telling her what she was looking for, I told her where to look and tell me if she saw anything. The next thing she said is honey what is that up there? I told her to watch it. I have been watching it for almost an hour now, it goes from that star there over to that one and after about four or five minutes it goes back. Now I have no way of knowing how far apart those stars were, what I did was hold my arm out at full length and by holding up my index and little finger about four inches apart. I could put one finger on one star and one on the other. We watched this object go back and forth for at least three hours. I would not even bother to write to you about this except for one thing. I was back fishing at lake Mc Clure in 2000. I got up in the middle of the night in hopes the object might still be going back and forth. Well it was. Still going back and forth just like a shuttle bus. Al Groo"],"Sighting Duration":"Undisclosed","City":"Merced","trends":["There have been 10 other sightings in Merced","There were no other sightings in Merced on or around July 4th 1977"],"Disposition":"Insufficient Data","Summary":"The object travled between two stars, back and forth for hours.","Log Number":"US-01252008-0022","Date Submitted":"07/04/1977 12:15 UTC","files":["/var/www/straped/mufon/html2text/9252.html.txt","/var/www/straped/mufon/org/9252.html"],"Region":"California","Viewing Distance":"Unknown","Object Flight Path":"Straight-line path","Longitude":"-120.479688","Tags":"City","Date of the Event":"07/04/1977 12:15 UTC","Object Features":"None","Weather Factors":"Unknown","Case Number":"9252","Latitude":"37.305903","Object Shape":"Star-like","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=37.305903,+-120.479688(9252)&iwloc=A&hl=en\"> mufon case (9252) map </A>"}