{"trends":["There has been one other sighting in St Michaels","There were no other sightings in St Michaels on or around July 23rd 1973"],"Summary":"Approached by Soft Ball Sized Glowing Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=38.788405,+-76.222227(9254)&iwloc=A&hl=en\"> mufon case (9254) map </A>","Country":"United States","divs":["sighting detailsmy experience with a ufo took place one summer evening in july 1973. a close friend and i were fishing on a large private estate located in a rural area of talbot co. maryland. my friends parents were the caretakers of the estate and he and his parents resided in a home also located on the estate grounds. that particular evening around dusk my friend and i had decided to go fishing and had selected a spot in a somewhat remote area located on the estate. we were sitting on bulk head with fishing lines in the water. my friends car was parked approximately 2 yards behind us with the passenger and driver's side doors open. i distinctly remember that the dome light was lit in the car. we had brought a portable radio with us. the radio was turned on at the time. behind the car was an open field with the opposite side of the field edged with a wooded area. at some point in time i happened to glance over my right shoulder and noticed a light moving through the woods at waste high level. at this time of the evening the interior of the woods was getting dark and it looked as if someone was walking through the woods carrying a flash light. i can remember at the time thinking it was my friends father, but looking back on the event there would have beeen absolutely no reason for him to have been doing so. i turned my head back towards the water and my fishing line. again, a few mintues later a glanced over my right should. now the light had left the wooded area and had started crossing the field in a very direct path coming in our direction. i nudged my friend on the elbow and told him to look. i remember he and i standing up at this point and watching a perfect sphere of light, a little larger than a soft ball, moving slowly across the field in a very straight determined path. the light was floating in air about waist high from the ground. we watched as the light approached the car and hovered approx 2 feet over the car roof as if it were interested in or \"checking out\" the car. we were approx 3-4 feet away from what ever this thing was and i remember both of us being absolutely frozen with fear. i can remember not moving and seeing my friend in my pheripheral vision also frozen and not moving a muscle. it seemed to hover only a few minutes and then slowly rose and floated over the top of some nearby trees. as soon as it was out of site he and i immediately got in the car and drove to his parents house that was located approx. 3\\4 of a mile away. after telling his parents what had happened and trying to calm down for a while we all walked out in the front yard. now it was dark and you could see the stars. i can remember all of us looking upward toward the sky and seeing, at a very high altitude, a triangular shaped object with lights moving at a very high rate of speed and making 45 degree angled turns. it would literally stop on a dime and make a right angled turn. my friend and i were so scared when we left the area where we were fishing, we left behind the radio and fishing poles. later my friend and his dad went back to retrieve the items and i refused to go."],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-76.222227","Object Features":"Undisclosed","Tags":"City","Date Submitted":"07/23/1973 12:00 UTC","Object Shape":"Sphere","Object Flight Path":"Undisclosed","Case Number":"9254","files":["/var/www/straped/mufon/html2text/9254.html.txt","/var/www/straped/mufon/org/9254.html"],"Log Number":"US-01252008-0024","Latitude":"38.788405","Date of the Event":"07/23/1973 12:00 UTC","Disposition":"Unknown","Viewing Distance":"Unknown","City":"St Michaels","Weather Factors":"Unknown","Region":"Maryland"}