{"Disposition":"IFO","Date of the Event":"09/25/2004 08:50 UTC","Longitude":"-71.407434","Tags":"City","City":"Providence","Date Submitted":"09/25/2004 08:50 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.828499,+-71.407434(9255)&iwloc=A&hl=en\"> mufon case (9255) map </A>","Country":"United States","Summary":"SUDDEN STAR MOVING ACROSS NIGHT SKY. AFTER SECONDS, BEGAN GLOWING/PULSATING. RETREATED WITH SEVERE SPEED. (ANOTHER SIMILAR SIGHTING YEARS BEFORE IN MARTH'S VINYARD","Latitude":"41.828499","Region":"Rhode Island","Case Number":"9255","trends":["There have been 27 other sightings in Providence","There were no other sightings in Providence on or around September 25th 2004"],"Sighting Duration":"Undisclosed","Log Number":"US-01252008-0025","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9255.html.txt","/var/www/straped/mufon/org/9255.html"],"Object Features":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsI WAS STANDING OUTSIDE IN MY NEIGHBOR'S YARD ALONE, WHEN I LOOKED UP AT THE STARS AND BEGAN TO GAZE. A SECOND STAR THE STAR I WAS LOOKING AT BEGAN TO MOVED NOTHERLY AT THE DISTANCE WAS A HIGH RATE OF SPEED (I COULD TELL BY THE STARS AROUND IT THAT IT WAS COVERING AT LARGE DISTANCE ) ALMOST LIKE A METEORITE. BUT, IT KEPT A STRAGHT PARALLEL COURSE ACROSS THE HORIZON. AT THIS TIME I REALIZED THIS WAS SOMETHING DIFFERENT. I CALLED EVERYONE OVER TO WHERE I WAS ( ABOUT 50FT AWAY ), BY THE TIME THEY CAME TO MY POSITION THE OBJECT WAS GLOWING INTERMITANTLY. IT FINALLY BEGAN TO GLOW SO BRIGHT THAT IT LOOKED LIKE IT WOULD EXPLODE BUT DID NOT. IT SIMPLY SHOT OFF IN A COMPLETELY DIFFERENT DIRECTION. AS IT DID THIS, IT SEEMED TO BE TRAVELING AWAY AT AN INTENSE RATE OF SPEED. THE VERY SAME OCCURANCE HAPPENED TO ME IN MARTHA'S VINYARD YEARS BEFORE, WHICH, TO ME IS PUZZLING. YEARS AGO, I ALSO HAD WHAT, I GUESS IS CALLED SLEEP PARALYSIS, FOR A SHORT LENGHT OF TIME AFTER BOTH INCIDENTS HAD OCCURED. I COULD NOT MOVE AND IT MADE ME VEY AFRAID TO SLEEP FOR A LONG TIME. I WAS HAVING NIGHTMARES FREQUENTLY. THEY HAVE SINCE GONE AWAY BUT THE FEAR THAT THEY WILL RETURN HAUNTS ME. THIS MAY SOUND LIKE ANOTHER HYPOCONDRIAC BUT IT'S THE TRUTH. THERE WAS ANOTHER SIGHTING BACK WHEN I WAS YOUNGER ON HALLOWEEN AT A HAUNTED HOUSE IN THE TOWN OF COVENTRY ( NEXT DOOR TO MY TOWN, WHICH ALSO HAD A NIKE ( MISSLES )SIGHT AT THE TIME. TAHT ONE WAS A LIGHT SHOW OF DIFFERENT LIGHTS FLASHING ON A FOGGY NIGHT. ABOUT 50 TO 75 PEOPLE WATHED THAT DISPLAY WITH NO NOISE AT ALL RIGHT OVER EVERYONE'S HEAD. MY FATHER AND I WERE IN SHOCK. HE IS A MILITARY VETERAN AND HAD NO IDEA WHAT IT WAS. NO ONE COULD MAKE OUT ANY DETAILS OF THE OBJECT, SO IT REMAINED A MYSTERY. THINGS SEEM TO ADD UP OVER THE YEARS. I, MYSELF, THINK SOMETHING IS HAPPENING THAT WE ALL SHOULD BE AWARE OF."],"Object Shape":"Fireball","Object Flight Path":"Undisclosed"}