{"Latitude":"40.199507","Tags":"City","Date of the Event":"01/24/2008 06:01 UTC","Longitude":"-85.38246","divs":["Sighting DetailsWell, you might not believe the events that just happened, and I don't know if I do either. I was on my way home from work, and I saw some disturbance in the water down at the river that moves through Muncie Indiana, I stopped and got out of my vehicle, and just then the lights dimmed, and then the engine turned off. The water got very noisy, and the sound of ice breaking, and a bright lighted disk shape appeared to slowly rise out of the ice. The shape appeared to hover and seemed to get closer to me. I ducked underneath the front of the car, and yelled 'leave me alone', in case it wanted to approach me. I wasn't armed then, but I wish I was. I'll bet some buckshot would have scared them off. Anyway, after a minute or so, I could see the lights getting dimmer, so I looked out and saw the shape hovering toward the tree line along the White River. A low hum came from the disk as it sped up and flew off to the north-east skyline. When I got home, I noticed I had a sunburn that appeared around the back of my neck, but my wife said it was there before, so I am not sure if it is related."],"Case Number":"9258","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Date Submitted":"01/24/2008 06:01 UTC","files":["/var/www/straped/mufon/html2text/9258.html.txt","/var/www/straped/mufon/org/9258.html"],"Source":"MUFON","Object Features":"Undisclosed","Summary":"Disc shape emerged from White River, Muncie Indiana","map":"<A HREF = \"http://maps.google.com/maps?q=40.199507,+-85.38246(9258)&iwloc=A&hl=en\"> mufon case (9258) map </A>","Sighting Duration":"00:05:00","Country":"United States","Log Number":"US-01252008-0028","Region":"Indiana","Viewing Distance":"Unknown","trends":["There have been 13 other sightings in Muncie","There were no other sightings in Muncie on or around January 24th 2008"],"Object Shape":"Disc","Disposition":"Hoax","City":"Muncie"}