{"map":"<A HREF = \"http://maps.google.com/maps?q=39.100966,+-94.576747(9260)&iwloc=A&hl=en\"> mufon case (9260) map </A>","Region":"Missouri","Log Number":"US-01252008-0030","divs":["Sighting DetailsIt was pretty much straight up 10PM CDT. I was sitting on my couch, watching TV and just happened to look out the window to the west. I noticed a bright white object in the sky just over the trees and the horizen. I was expecting as it came closer to start blinking red lights or white to show that it was a plane or helicopter. As it approached I never saw any blinking lights whatsover. It was like no plane or object that I'd ever seen before. I ran in to get my video camera, cause I knew that no one would believe me, and I wanted proof for myself to study later. After I grabbed the camera I went out onto my deck for a better view and turned on the video recorder. I was having trouble picking up the object on video. But I could see it clearly with the naked eye as it was moving overhead from west to east. It was moving at what seemed like about 3 to 4 times the speed of normal jet planes moving from west to east out of KCI airport in KC. The object faded or disappeared twice, the second time it disappeared was just before it passed by the west side of my house, when it reappeared it was a very bright white light, still no sound. Upon the closest view, from my vanage point, it appeared to be like one larger white glow to the front of the object, a smaller, line like light leading from the front light to another large white glowing light on the back side of the object. The front white glow, was slightly larger on the front than that on the back of the object. To me, for it to be moving that fast across the entire sky, it had to be close to the ground, but I never heard a sound from it, which I always hear the jets, helicopters, and sometimes military aircraft that fly overhead. It seemed up in the sky quite a way, maybe a little bit lower than the jets normally fly in this area. Was much larger than a passenger jet or helicopter. I couldn't make out a definate shape to the vehicle. Just that the glow was larger in the front, light was spherical on front and back, and a white light in a line between the front and back lights. I only captured about 6 or 7 seconds of video of the object. I looked at it over and over but didn't get much from the video. I was holding the camera in my hand, so it's shaky, but it does show a white glowing ball towards the front, and another smaller, glowing white ball to the back of the object. It moved across the sky in a fluid motion like that of normal aircraft, but seemed to be going much faster. It took the object approximately 2 minutes to move from just this side of the horizen in the west, to the horizen in the east and then out of site. No sound at all, no flashing lights at all. This is what really puzzled me the most. For what it's worth, I said earlier that day the following, \"OK, I want to finally see a UFO.\" Kind of strange, that I asked to see one earlier that day, and then it happened. A couple of months ago I noticed, out this same window, what looked like a glowing ball, very large, maybe half the size of the full moon in the sky. It was dark orange in color. I noticed it out of the corner of my eye. I looked directly at it, as I did it looked like a dark light or door or something came around from behind the light from right to left and closed off the orange glow and then I couldn't see it anymore. It was there in my vision of sight for approx 2-3 seconds. I immediately looked to the TV to see if it was a reflection, it was far from the reflecting light of the TV. No other lights were on in the house, except for the light coming from the TV. We have a DVR, I replayed the show on the the DVR, to see if there were any objects that could have put off that reflection, even though it was far away from the reflection of the TV, and there was nothing that could have reflected anything close to orange or spherical or ball shaped. No explantation for what either object was, so I guess they are unidentified. My feelings during the sighting were pretty much that I was expecting something to happen that would prove that it is just a plane or helicopter, but it wasn't. After the sighting, I was trying to come up with a logical explanation for what I had just seen. All I can say is, I'd never seen anything like it before. If it was a U.S. Air Force aircraft it was completely silent and extremely fast. I keep replaying it in my mind. But can come up with no explanation, either a UFO or some new Air Force aircraft with serious technology. The object either just went far enough from site that I couldn't see the light from it anymore or it disappeared."],"Weather Factors":"None","Case Number":"9260","Country":"United States","City":"Kansas City","Longitude":"-94.576747","Viewing Distance":"Unknown","Date Submitted":"01/23/2008 10:00 UTC","Latitude":"39.100966","Summary":"White object, brighter towards front of object, moved west to east, very fast, no sound at all","Date of the Event":"01/23/2008 10:00 UTC","Tags":"City","trends":["There have been 134 other sightings in Kansas City","There was one other sighting in Kansas City on or around January 23rd 2008"],"Disposition":"Unknown","Object Flight Path":"Straight-line path","Sighting Duration":"00:02:00","files":["/var/www/straped/mufon/html2text/9260.html.txt","/var/www/straped/mufon/org/9260.html"],"Object Shape":"Unknown","Object Features":"Unknown","Source":"MUFON"}