{"Country":"United States","Longitude":"-71.873356","City":"Thompson","divs":["Sighting Details I was in the passenger seat of a car with two friends in March of 2004 on the way to another friends house at approximately 9 pm. We picked up our friend and began driving down the road. I noticed immediately a medium sized aircraft hovering above the road at the treeline up ahead. I thought it must have been a plane at first but as we approached I saw it was nothing I had ever seen. It was triangular shaped, kind of like a boomerang. At this time we slowed down to almost a complete stop. The aircraft was still infront of us barely moving in the air. I turned the radio off and rolled down my window. There was absolutely no sound coming from the aircraft. This is a quiet town where even the smallest sound would be heard. There was absolutely no sign the aircraft was even there if you did not happen to glance up. The ufo had white lights at the tips of the wings. Its hard to remember the details about the white lights. On the middle underside of the aircraft was a red light. The color of the aircraft was black and it looked like there was a big shiny completely tinted black window at the front underside. For a good 15 seconds we stared at it, and they probably stared at us.I cannot explain the feelings I had at that time. The car slowly inched forward and the aircraft slowly moved in our direction. I was afraid to drive directly underneath the aircraft where the red light was, you never know in a situation like that, so I told my friend to take a direct right turn onto the next road. I could feel my heart beating like crazy. I turned around in my seat and kept my eye on the ufo, I did not take my eyes off it the entire time. As we began to drive I saw it shoot off at an angle in the blink of an eye. The speed and acceleration of it was incredible.There was no disturbance, sound, wind, nothing.The technology seemed so advanced. We watched it fly at an incredibly fast speed over the lake. This was an extremely intense and emotional event. I was shaking after the incident and was in a complete awe during the time that we saw it. There were two witnesses with me that saw the exact same thing. I dont know where this came from but I do think this was an incredible experience that makes you look at things in different ways. I only wish I had a digital camera or even a camera phone at the time."],"Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=41.992813,+-71.873356(9261)&iwloc=A&hl=en\"> mufon case (9261) map </A>","Date of the Event":"03/04/2004 09:00 UTC","Log Number":"US-01262008-0001","Latitude":"41.992813","Summary":"triangular aircraft hovered at treeline on the road was seen while in a car at apprx. 9 pm. It Was completely silent and had white and red lights.","Sighting Duration":"Undisclosed","Disposition":"Unknown","Tags":"City","Object Features":"Window(s)","files":["/var/www/straped/mufon/html2text/9261.html.txt","/var/www/straped/mufon/org/9261.html"],"trends":["There has been one other sighting in Thompson","There was one other sighting in Thompson on or around March 4th 2004"],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Case Number":"9261","Weather Factors":"None","Object Shape":"Boomerang, Triangle","Date Submitted":"03/04/2004 09:00 UTC","Region":"Connecticut"}