{"City":"Titusville","map":"<A HREF = \"http://maps.google.com/maps?q=28.619109,+-80.802694(9262)&iwloc=A&hl=en\"> mufon case (9262) map </A>","trends":["There have been 9 other sightings in Titusville","There were no other sightings in Titusville on or around January 20th 2008"],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Date of the Event":"01/20/2008 04:30 UTC","Tags":"City","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other","Region":"Florida","Summary":"20-30 seperate objects at various heights and distances 1 came very low and hovererd very irrattic movement and color changing","Log Number":"US-01262008-0002","Case Number":"9262","Object Shape":"Circle, Diamond, Flash, Sphere, Star-like, Triangle, Other, Unknown","Longitude":"-80.802694","divs":["sighting detailsme and my wife were fishing on hollover canal(masquitto lagoon) at about 4am i looked towards the sky and saw one star like light moving very quickly in a zig zag and clock wise motion within 3-5 minutes 4-8 more started to apear and more were apearing every minute spread across speraticly in straight lines and triangles formations some were mimiking each others movements these obcts were very high or small in size color of lights that were high in the sky were red and white at about 4:45 to5:15 my wife was looking south and i was looking north and at the same time exactly. 2 objects went through the sky that looked like comets almost ghostly (transparent\\almost cloudy)very low no more than 1000ft heading east -west for a couple of minutes we thought we saw the same object then she told me she was looking south.we were shrimping so we had very bright lights in the water within 30 seconds of these things went over my lights surged and my battery running the lights got very low powererd my battery wasalmost completly drained.until sun rise these things were all over the sky most of them moving slowly not in one any direction but short and very irradicke movements. at about 6:00 one object suddenly appeared right above the tree line south of our dirrection and hoverred in the general assembly building area moving side to side back &forth up and down it had three different colored lights that would glow white and red,red and green, but never white and green this object would hover and all of asudden it would dissappear and reappear within seconds.we looked up and saw 2-4 very bright lights moving north to south there was no real formation to the grouping at very high speeds very high altitude we watched the lower object for almost 1hour as the sun came up the object would slowly creaete disstance from were it was. we thought it was very strange that we did\"nt see any airplanes in the sky for the entire time we watched after the last one dissappeared within 10 minutes air traffic started back.and alot of traffic started heading into nasa's property.aircraft started flying and leaving alot of very low smoke. while the one hovered i shined my flash light at it blinking and it would change colors and distance away from us.i felt very nervous and currious when we saw these things esspecially when the one appeared very close to us ;i don;t hear anything from the object even the wildlife in the area went dead silence and then it slowly got higher in the sky stopping for a couple of minutes and then go a little higher and kept doing this until it vanished and one by one the others that were very hyigh would flash once and dissappear."],"Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9262.html.txt","/var/www/straped/mufon/org/9262.html"],"Date Submitted":"01/20/2008 04:30 UTC","Latitude":"28.619109","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Object Features":"Dome, Other"}