{"Summary":"Sounded like a camera's shutter every 8-10 seconds, with a low frequency, vibrating humming noise. the sky was clear but the stars were blacked out by what I perceived to be a 100 yd object.","Object Flight Path":"Other","Case Number":"9266","Weather Factors":"Unknown","trends":["There have been no other sightings in Gratis","This sighting has never been favorited."],"Disposition":"Insufficient Data","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9266.html.txt","/var/www/straped/mufon/org/9266.html"],"Country":"United States","Viewing Distance":"21-100 Feet","Latitude":"39.647832","Longitude":"-84.527171","Tags":"City","divs":["Sighting Details I was camping with my children when I was awoke by a low frequency humming noise. Our campsite was about fifty feet into the woods in a small clearing. I went outside the tent, after not being able to get a good view of what it was from the windows of the tent, i went outside the tent. Immediatly I knew that the noise was from above, about 30 feet above the trees. When I looked up through the trees I noticed that the stars were blacked out and that's when I started hearing what I can only describe as a camera's shutter sound. As I followed the noise I started getting deeper into the woods and decided that if I wanted a better view I would have to turn around and make my way out of the woods. I tried to move as fast as I could through the woods, checked on the children quickly, and ran to the edge of the woods. The shutter noise started fading and the object's humming soon could no longer be heard. I stood outside the woods for better than an hour and never seen or heard anything else. There were plenty of dogs barking and I could almost tell were the object was because of the barking in the distance. The woods prevented me from identifing anything else about the object. In closing; I have woked around aircraft for the military, 9yrs and know their limits. This was not anything that I have experienced or seen and I will never forget it as long as I live."],"City":"Gratis","Log Number":"US-01262008-0006","Region":"Ohio","Object Shape":"Unknown","Date Submitted":"07/10/1999 12:00 UTC","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.647832,+-84.527171(9266)&iwloc=A&hl=en\"> mufon case (9266) map </A>","Date of the Event":"07/10/1999 12:00 UTC","Sighting Duration":"Undisclosed"}