{"trends":[],"City":"Undisclosed","Region":"Indiana","Log Number":"US-01262008-0008","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Date Submitted":"04/15/1999 12:00 UTC","Date of the Event":"04/15/1999 12:00 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Case Number":"9268","divs":["Sighting DetailsOutside with my friend smoking a cigarette outside. I was standing on the concrete and my friend was standing on the porch. I decided to take two steps onto the porch. I saw spotlight flash, about 1.5 ft in diameter on the ground. My first instinct was to look up to see where it was coming from and all I saw was a flash and a little smoke that was lit up in purple and yellowish green. I looked at the ground again, the spotlight was gone. I looked up again and just a tiny puff of smoke left. I looked at the ground again the light was still gone. I looked at the sky again and it was clear with a tiny trail of smoke, then in an instance the smoke trail was gone. But, my friend was looking up at the sky the same time I saw the spotlight. She saw a ovalish type of craft, but didn't see the spotlight on the ground. She couldn't believe what she saw and I couldn't believe what I saw and we both couldn't believe what we saw at the same time in 2 differnet spots. I also got scared because I was standing in the exact same spot that the spotlight flashed at 2 seconds before I took two steps up on the porch. We didn't know what to do. We felt deeply compelled to report it, but we knew nobody would believe us. The internet was not as big as the time, so really didn't have a way to research how to report. We knew if we called the cops, they would think that we were crazy. The sighting lasted no more than 2 seconds. We hope that something would be on the news the next day, but nothing. I am reporting this now, because I finally have an avenue to report it, eventhough so many years have passed."],"Latitude":"40.560276","Longitude":"-85.596764","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9268.html.txt","/var/www/straped/mufon/org/9268.html"],"Object Shape":"Flash, Other","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=40.560276,+-85.596764(9268)&iwloc=A&hl=en\"> mufon case (9268) map </A>","Sighting Duration":"Undisclosed","Disposition":"Insufficient Data","Summary":"Brief UFO sighting in sky and ground"}