{"Tags":"City","divs":["Sighting DetailsI have had multiple UFO sightings since I moved to my new home in 2003. They always occur after July 15th each year. After July 15th 2003, I was going to the bathroom at 3 A.M. and noticed darting white lights in the sky going VERY fast and was fasinated so I watched them. As they came closer, the \"lights\" turned into a huge metallic blue \"saucer\" shaped craft with large rectangular windows. I was shocked, stunned and fasinated all at the same time. The craft just sat above my home and my neighbor's home for 20 minutes. I was sitting on the commode and thought to myself, \"if I can make out the color, shape of windows, etc. so clearly of THEM I wonder if they can see ME and I became scared for the first time and I hid behind the window shutter in my bathroom. From each window a huge white beam of light shone except for the end window which had either a red or blue beam from it. I followed one beam from the craft's window with my eyes and it fell about 3 feet short of the grass near my lilac bush in my back yard. The craft made absolutely no noise and hovered...literally sat in the sky above my home and my neighbor's home for 20 minutes. Then it flew off into the western sky and \"sat\"....if I had not seen it do what it just did, I would think I was looking at a star in the sky. I have NEVER seen any craft go as fast as what this thing did. After July 15th of 2004, I was going to the bathroom again in the middle of the night and happened to look out the window and I saw the rapidly moving darting lights and was stunned and said out loud, \"THEY'RE BACK!!!\" (they never came close enough to turn into a shape). After July 15th in 2005, I saw the same saucer-shaped craft flying very low going west to east towards Mountville... after July 15th in 2006 I saw a huge rectangle of light whizzing past my house going from west to east towards Mountville. My daughter (age 32) saw a small triangle ship hovering above the trees in back of our home in 2006. It was just after midnight on July 15th and she got scared and turned off her bedroom light because she was afraid they (someone, something) could see her. She was yelling for me to come to her bedroom but the object flew off at a very high speed. Just in May 2007 she got lost coming home from the Philadelphia airport and was on back roads near Reading, PA when she drove under a HUGE triangle ship with purple lights. There were 2 other cars on the back roads with her. It was hovering and she and the other cars drove right under it. She said that she felt it was a surreal moment that she couldn't believe she was seeing what she was seeing. I am a 57 year old mother of 3, nurse and grandmother. She is a nursing student with a firefighter's degree and is on the dean's list at her college."],"Country":"United States","Log Number":"US-01262008-0013","Region":"Pennsylvania","Weather Factors":"Unknown","Longitude":"-76.430796","Date Submitted":"07/15/2003 03:40 UTC","Object Shape":"Circle, Disc, Sphere","map":"<A HREF = \"http://maps.google.com/maps?q=40.039264,+-76.430796(9273)&iwloc=A&hl=en\"> mufon case (9273) map </A>","Latitude":"40.039264","Case Number":"9273","Viewing Distance":"21-100 Feet","Object Features":"Window(s)","trends":["There have been 2 other sightings in Mountville","There were no other sightings in Mountville on or around July 15th 2003"],"Object Flight Path":"Hovering then path","Sighting Duration":"Undisclosed","Summary":"I saw darting white lights that when they came closer turned into a flying saucer shaped craft","files":["/var/www/straped/mufon/html2text/9273.html.txt","/var/www/straped/mufon/org/9273.html"],"Date of the Event":"07/15/2003 03:40 UTC","City":"Mountville","Disposition":"Insufficient Data","Source":"MUFON"}