{"Log Number":"US-01262008-0015","Tags":"City","Viewing Distance":"Unknown","Latitude":"35.714259","Sighting Duration":"Undisclosed","Country":"United States","Source":"MUFON","Summary":"Triangular object with rectangular orange lights around perimeter on two sides, not back side","Disposition":"Unknown","divs":["Sighting DetailsMy fiance and I were vacationing in Gatlinburg, TN and were renting out a cabin in the Smokey Mountain Area. I decided to go out on the back deck and I looked up to admire the stars when all of a sudden, flying directly above our cabin, I saw a triangle shaped object. At first I thought it was a UFO, then maybe some secret military craft. The pointed side was facing the front. The two sides were longer than the back side. The two sides had rectangular orange lights on the perimeter. The back side was dark and had no lights.It was moving pretty fast, but not real fast. It was moving in a straight line-no weird movements. There were other airplanes in the sky as well, so I wonder if any pilots saw it. It was high - around where airplanes would fly. I called my fiance to come out and look, but he was stubborn and said it was airplane and wouldn't come out. I tried - but he wouldn't come out to see as he was already in bed. I think he was scared hee hee. It was a definite mechanical object - not an astroid, comet, star or whatever else skeptic may try to say it was. AFterwards, I felt frustrated that my fiance didn't come out to see it. But, later I was disappointed in my self for not pushing him to come out and see it more! Thinking about it, I wonder why I didn't try to get him to come see it more. During the sighting, I was excited to see a UFO. Afterwards, confused if it was a UFO or some secret military craft."],"Object Shape":"Triangle","Case Number":"9275","map":"<A HREF = \"http://maps.google.com/maps?q=35.714259,+-83.510164(9275)&iwloc=A&hl=en\"> mufon case (9275) map </A>","Date of the Event":"11/03/2006 10:00 UTC","Object Features":"Unknown","Longitude":"-83.510164","Date Submitted":"11/03/2006 10:00 UTC","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","City":"Gatlinburg","trends":["There has been one other sighting in Gatlinburg","There were no other sightings in Gatlinburg on or around November 3rd 2006","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/9275.html.txt","/var/www/straped/mufon/org/9275.html"],"Region":"Tennessee"}