{"Object Flight Path":"Straight-line path","Summary":"Travling east bound in southern South Dakota on HWY 46 , it was alittle foggy , I witnessed a large oval shaped object traveling very slowly south bound , metallic an no lights an no noise","files":["/var/www/straped/mufon/html2text/9277.html.txt","/var/www/straped/mufon/org/9277.html"],"Disposition":"Unknown","divs":["sighting detailsi am a truck driver and was traveling south on hwy 81, after turning east on hwy 46, i noticed something in front of me--maybe 200 ft off the ground traveling south bound very slowly, but very very large,there were no visable lights an ther was no noise that i could hear. it was foggy in layers and in and out of my veiw. it was metallic in color. it was so large i could not see how tall it was. i could veiw i think the bottom portion of the object. i could see the curve 0f the bottom only. as it travled south i could see it was extremely long, maybe the length of a football field. when i first saw it i was probably 1\\2 to 3\\4 mile from the object. by the time i reached it it had already crossed the hwy and my headlights were no longer able to light the object. i was very curious about it and tried to speed towards it as fast as i could. but could not get close enough fast enough to get a better view. almost looked like the bottom half of a 747 jet liner. after the object was out of sight was when reality hit me and i did get very frightened of what i saw. i proceeded east to the first truck stop which was outside of beresford, south dakota where i stopped and went inside. i inqired at the fuel desk if anyone had reported anything in the sky. the man looked at me as if i was crazy as i told him what i had seen. i was physically shaken. this was 19 years ago and this is the first time i have reported this incident to anyone. i also have 3 photos of a ufo my sister found in an antique store that she stopped at in winner,south dakota. she inspected a dresser and an taped to the underside of one of the drawers was several pictures of a ufo. there were no dates on these pictures,but looked to be from the 50's or 60's. she gave me only 3 pictures, which i still have today."],"trends":["There have been no other sightings in Beresford","This sighting has been favorited 1 time."],"Latitude":"43.080545","Sighting Duration":"00:10:00","Viewing Distance":"501 Feet - 1 Mile","Case Number":"9277","City":"Beresford","map":"<A HREF = \"http://maps.google.com/maps?q=43.080545,+-96.773655(9277)&iwloc=A&hl=en\"> mufon case (9277) map </A>","Log Number":"US-01262008-0017","Country":"United States","Region":"South Dakota","Tags":"City","Longitude":"-96.773655","Source":"MUFON","Weather Factors":"Fog","Date of the Event":"08/31/1979 12:00 UTC","Date Submitted":"08/31/1979 12:00 UTC","Object Shape":"Oval","Object Features":"Unknown"}