{"Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/9283.html.txt","/var/www/straped/mufon/org/9283.html"],"Disposition":"Unknown","Tags":"City","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-122.325291","Log Number":"US-01262008-0023","Object Shape":"Sphere","Country":"United States","Summary":"3 oval bright white balloonlike(size of party balloons) objects shaped in a triangle flew over cruise ship(over my balcony(facing east to land ridges )off my suite in the sound north of seatle.from east to west","Case Number":"9283","Object Features":"None","Region":"Washington","Date Submitted":"08/16/2007 02:00 UTC","Date of the Event":"08/16/2007 02:00 UTC","Object Flight Path":"Straight-line path","Latitude":"47.60765","map":"<A HREF = \"http://maps.google.com/maps?q=47.60765,+-122.325291(9283)&iwloc=A&hl=en\"> mufon case (9283) map </A>","City":"Seattle","divs":["Sighting DetailsIt was our first night on the Holland America Cruise Ship leaving Seattle towards Alaska. The 3 oval shaped lights seemed to come from the east appearing over the ridge of the Sound directly over my balcony. At first I thought they were 3 white birds coming directly at the ship. As they got closer (in a few seconds) they looked like someone let go of 3 white balloons from the other side of the ridge floating very fast (no sound) but they came over extremely fast and they were very bright. Moving quickly, they passed over my head to the other side of the ship where i could no longer see them. As i saw them approaching i started to run into the room out of fear of the unknown, but my head was still turned looking towards the strange objects. Then they were over the ship and gone. I never reported it although I wanted to ask the captain or radar controller but never did. As far as the county of which it was in, I have no idea but I could'nt send this without filling in the question."],"trends":["There have been 110 other sightings in Seattle","There were no other sightings in Seattle on or around August 16th 2007"],"Source":"MUFON"}