{"Object Features":"None","Region":"South Carolina","Disposition":"Unknown","City":"Fort Mill","map":"<A HREF = \"http://maps.google.com/maps?q=35.00979,+-80.942236(9284)&iwloc=A&hl=en\"> mufon case (9284) map </A>","Tags":"City","Country":"United States","Longitude":"-80.942236","Log Number":"US-01272008-0001","Viewing Distance":"101-500 Feet","trends":["There have been 7 other sightings in Fort Mill","There were no other sightings in Fort Mill on or around January 25th 2008"],"Sighting Duration":"Undisclosed","Weather Factors":"None","divs":["Sighting Detailswhile walking my dog a noticed a light just within the clouds that traveled in a circle with a diameter of approximately 300yrds. The light itself was about the size of a kite. At first I thought it was someone pointing a light beam into the sky, much like those car dealerships do to get attention. I began to seek out the source. When I first noticed the light, it was to my left. I followed it off the trail to the top of a hill where there were houses. Where I thought it might be coming from. As I traveled in the direction to see if I could find the source, I noticed the light moved away as if following just ahead of me. I still didn't think much of it at this time. I was just curious. I saw I could not get under it. So I turned around to return to the pathway I had left, a distance of about 150 feet. When I did, the light stopped retreating and reversed its cirling flight to go in the direction I was going. I continued. This seemed odd and I began to study it. The flight had a constant velocity and a constant radius. It never appeared directly over me either. It always stayed a little in front of me before it turned in its counter clockwise route. There was no tail on this amorphous light to give me an indication of where the source was located. The light looked self contained, self emitting. The light did not continued downward from the sky to illuminate the ground either, ruling out a source about and in the center of the circle. Also it appear just inside the clouds and not on the surface facing me. There were no sounds. No wind either, just a quite night. The cloud coverage was blanket like and low. No stars could be seen. The night was almost foggy. This circling light contiuned to follow my progress along the winding pathway. This went on for about 20-25 minutes. It disappeared about the time the pathway I was walking cut behind a hill and trees. It would have been hard to see me from above for a while until the pathway exited in the open after rounding the terrain. And when I did exit the trail it was gone."],"Object Flight Path":"Path with directional change","files":["/var/www/straped/mufon/html2text/9284.html.txt","/var/www/straped/mufon/org/9284.html"],"Case Number":"9284","Source":"MUFON","Date Submitted":"01/25/2008 11:45 UTC","Latitude":"35.00979","Object Shape":"Other","Date of the Event":"01/25/2008 11:45 UTC","Summary":"circling light"}