{"City":"St Joseph","Longitude":"-94.826779","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","files":["/var/www/straped/mufon/html2text/9285.html.txt","/var/www/straped/mufon/org/9285.html"],"Source":"MUFON","Country":"United States","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Object Features":"Other","Summary":"Big Triangle UFO while deer hunting","trends":["There have been 10 other sightings in St Joseph","There were no other sightings in St Joseph on or around October 26th 2006"],"Case Number":"9285","divs":["Sighting DetailsI was archery hunting on a farm in Buchanan County Agency, MO., I was on the most northern part of the farm looking over about 300 acres of land. It was about 50 mintues to sundown. Approx a mile away I saw what I thought was a military cargo plane coming towards me from the south because it was very large and what looked like two headlights on the front and was a thin line like looking at a front of a plane that was fairly low to the ground. I was hutning so i kept looking for deer and there was a farming out harvesting corn with a combine. I looked back to the south because I expected to hear the plane go by when I looked back it was higher and above the corn silo at the top of the hill, there weren't any lights shining so I thought it had turned to go back south, again I looked to the field for more deer. I looked back up at the silo and the craft was still there and I thought how odd it is just sitting there and the one side shifted down towards the field in a 45 degree angle and just sat there. It now had my complete attention and I just watched it sit there for about 10 minutes then it came closer to me maybe 400 yards or so it appeared. It traveled west very slowly above the tree line. I was sitting there thinking what the hell is this thing. It was very large long ways but it was hard to tell the exact distance until it slowy started to move up maybe 50 feet and kinda of rolled to the south, thats when my jawed dropped, it turned flush to me with the bottom I would asume facing right at me. It was a huge arrowhead shaped aircraft trianle with about 9 or 10 perfectly distanced white lights on the bottom, they covered the bottom symetrically over the whole craft. It then leveled back off so I could see it as a thin line again and slowy worked its way south and then seemed to dissapear into the tree line which I would assume just travelled further south until it appeared to go behind the trees. Not knowing the exact distance of the craft it is hard to judge size, but I would say it was atleast 100 yards long and 50 yards wide at the bottom of the triangle. The people who own the farm had mentioned to me a year before they saw a triangle thing in the sky early one night out coon hunting. I have hunted there for 20 years and never saw anything like that before. The farmer harvesting the field never saw a thing but he was not at my elavation so he may have had his view blocked by the tree line. This craft was far bigger than anything i had ever seen, made absolutely no noise that i could hear, and move with the percision of a car in the sky, it sat stationary for a good 10 minutes. I am sorry I did not have my camera with me that day but I assure you that this is not a wives tale this really did happen. I saw a similar craft on tv last year that was seen in the saint louis mo and Illinois area, it was very similar to that it was seen by multiple witnesses there."],"Weather Factors":"Light","Tags":"City","Object Shape":"Triangle","Log Number":"US-01272008-0002","Disposition":"Unknown","Region":"Missouri","Date Submitted":"10/26/2006 05:44 UTC","Sighting Duration":"00:46:00","Date of the Event":"10/26/2006 05:44 UTC","Latitude":"39.761648","map":"<A HREF = \"http://maps.google.com/maps?q=39.761648,+-94.826779(9285)&iwloc=A&hl=en\"> mufon case (9285) map </A>"}