{"Source":"MUFON","trends":["There have been 4 other sightings in Placentia","There were 2 other sightings in Placentia on or around January 26th 2008"],"Disposition":"IFO","Weather Factors":"Windy","Summary":"A slow moving yellow-white oval emitting a ring of fire or sparks","Date of the Event":"01/26/2008 12:00 UTC","Case Number":"9287","City":"Placentia","Latitude":"33.872237","Object Features":"Unknown","Log Number":"US-01272008-0004","files":["/var/www/straped/mufon/html2text/9287.html.txt","/var/www/straped/mufon/org/9287.html"],"Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","Region":"California","map":"<A HREF = \"http://maps.google.com/maps?q=33.872237,+-117.870336(9287)&iwloc=A&hl=en\"> mufon case (9287) map </A>","Object Shape":"Disc, Oval","Country":"United States","Longitude":"-117.870336","divs":["Sighting DetailsI was watching a movie in the living room with my mother when she noticed a very bright light in the western sky through the window and we both got up and went outside to investigate. She thought at first that it was several helicopters and then quickly decided that wasn't the case. What I saw was a very bright oval or saucer-shaped thing, yellow-white, moving slowly in a north or northwest direction while a small private or commuter plane apparently circled above the object as though it were watching it from above. About 5 degrees north of the bright oval I saw what appeared as a meteor-like trail against the black cloudy sky in the shape of a tight oval or circle. This was when I knew something extraordinary was going on. And then I saw the bright saucer-shaped oval emit a similar \"ring of fire\" like light about its outer edges. The whole thing was incredible. As I watch, the bright oval emitted this weird ring of fire twice and then I ran inside to get my digital SLR because I knew I could photograph it. However, by the time I returned and had the lens cap off and the camera up to my eye the object passed behind trees in the distance and was lost from view. I should state the the object appeared to be growing lower in the sky the further north it moved. I detected no noise of any kind from the object, and the only noise from the sky was that of the engines of the plane which circled above. The plane continued to circle for a few minutes after we lost sight of the object and then it turned and flew off into the southeast."],"Date Submitted":"01/26/2008 12:00 UTC","Viewing Distance":"Unknown"}