{"Latitude":"34.050288","Date of the Event":"01/15/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/9290.html.txt","/var/www/straped/mufon/org/9290.html"],"Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Object Features":"None","Summary":"I was in our back yard at night. I notices three triangles in a triangle formation flying S/W","Longitude":"-118.436796","Region":"California","Disposition":"IFO","Tags":"City","Object Shape":"Triangle","Case Number":"9290","Object Flight Path":"Undisclosed","Source":"MUFON","Log Number":"US-01272008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=34.050288,+-118.436796(9290)&iwloc=A&hl=en\"> mufon case (9290) map </A>","City":"West Los Angeles","trends":["There have been 2 other sightings in West Los Angeles","There were no other sightings in West Los Angeles on or around January 15th 2008"],"divs":["Sighting DetailsOn around January 15th 2008,at aprox. 8:00 pm, I was jumping on our trampoline with my son. Three flying lights got my attention. They were shaped like triangles and were flyng in unison in a three point formation. It seemed to be flying slow in a south west direction. I was at first confused at the altitude. It seemed to be flying a little higher than the landing small planes at Santa Monica Airport. Although I thought the altitude might be high because it seemed to be moving slow and very steady.Once I saw it, I stopped jumping and observed it for maybe 45 seconds.I new it looked unusual. My initial explanation was that it was a group of shooting stars.The next day I forgot about the sighting until January 26th 2008 when I was watching a Larry King program on a January 8th Texas sighting. It reminded me of what I saw. I went to my computer and did a search for recent UFO sightings. I was truly astonished when I started reading the descriptions of different sightings in the last 100 years. Many of them were described exactly the same as what I saw. Could they have been three jets or shooting stars. Until tonight I thought that to be a reasonable explanation."],"Sighting Duration":"Undisclosed","Date Submitted":"01/15/2008 12:00 UTC"}