{"Latitude":"37.304803","Object Flight Path":"Undisclosed","Tags":"City","City":"Merced","Region":"California","Object Shape":"Sphere","Case Number":"9297","Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=37.304803,+-120.478698(9297)&iwloc=A&hl=en\"> mufon case (9297) map </A>","Country":"United States","Date of the Event":"08/15/1952 07:30 UTC","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 10 other sightings in Merced","There were no other sightings in Merced on or around August 15th 1952"],"Weather Factors":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9297.html.txt","/var/www/straped/mufon/org/9297.html"],"Summary":"This happened in 1952, at a drive-in near Castle A. F. Base, Merced, CA","divs":["Sighting DetailsMy mother, dad,sister, and girl friend (now wife of 55 years) were in a line up of about 15 cars at a drive in movie in Merced, near Castle A.F Base. I saw a group of about 5 or 6 large,shimering gold colored spheres, about a mile high. They were moving about at incredible speeds, making stops and reversing or changing course in an instant. Nearly all of the many occupants in the cars in line got out to witness this. This went on for about 10 minutes, then they formed into one large sphere and continued moving about. They seemed to resist all rules of gravity and inertia, and centered their activity pretty much around the A.F. Base perimeter. About 5 or so minutes later, the large sphere started moving upward and Eastward at a rapid speed, and then moved so fast that it became a pin point in about 3 seconds. I was 19 at the time. About 25 or 30 years later, i saw a video on TV of the exact same phenomenon over Mexico City, (I think that was the site). And a few years later, I saw another TV video of the same thing, over Brazil. Within that same year, my dad, his partner and I were headed east, just past Castle A.F. Base, to go fishing at night. Something very large arose behind us, apparently out of the A.F. Base, hovered over us, killed our motor, then sped off at nearly the speed of light. Our car's motor re-stated on its own. About 30 years after the Merced incidents, I was the CEO of the hospital in Big Bear,San Bernadino County. I hired a fundraiser who, as it turns out, was a retired A.F.Lt., and had been on Project Blue Book. He had covered Castle A.F.base many times, he said. When I shared the above experiences, he ordered a few drinks, then started crying. He had investigated the globes, and a secret visit president Eisnhower had made to one of the hangers about the same time. He said that the president was there to view wreckage remains of a UFO, and alien bodies, and he started crying. He would not discuss the matter any further, and went back to his apartment."],"Disposition":"Unknown","Longitude":"-120.478698","Date Submitted":"08/15/1952 07:30 UTC","Log Number":"US-01272008-0014"}