{"Longitude":"-118.904544","Summary":"bright multi-colored lights covered every inch of it. Hovered between treetop and deck.","Viewing Distance":"20 Feet or Less","Source":"MUFON","trends":["There has been one other sighting in Three Rivers","There were no other sightings in Three Rivers on or around July 26th 1990"],"Date of the Event":"07/26/1990 09:30 UTC","Object Features":"None","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=36.438836,+-118.904544(9299)&iwloc=A&hl=en\"> mufon case (9299) map </A>","Object Flight Path":"Stationary","Case Number":"9299","Region":"California","Sighting Duration":"01:00:00","Date Submitted":"07/26/1990 09:30 UTC","Latitude":"36.438836","City":"Three Rivers","Object Shape":"Saturn-like","Weather Factors":"Unknown","Disposition":"Unknown","Tags":"City","divs":["Sighting DetailsI was about 10 or 11 at the time. I do not remember the exact date, but I know it was in the summer because at night, we used to sleep outside on our deck on mattresses in the summer time. My mom and step-dad were downstairs in their bedroom; I was outside by myself looking at the stars waiting for them to come outside too. I do not remember how it got there, but the next thing I do remember is seeing this medium-large sized thing floating in the air. Our house is 3 stories and our main floor is the second story, which is where our deck is. My mom's room was downstairs below the main floor. The ufo was not even close to a mile or even a half mile wide. It was about as large as a small plane. It was shaped like a planet with rings, but it was like all one shape, the top, middle and bottom flowed together smoothly but it was not round or oval. It was covered all over in multi-colored lights. I don't think there was a spot on it that could fit another light. The colored lights were not in any particular pattern, it looked like a billion christmas lights but all the colors were shades that were not normal everyday colors...not any colors I have seen lights or lightbulbs be. It was hovering between this tree, that was about 20 feet from the deck, and the deck. It was right about level with the top of the tree and about 15-20 feet above the deck and me. There was no sound, it was very silent and quiet. I just remember being in shock and standing there staring at it. I don't even know how long I was out there because I did not look at a clock before or after it happened. The next thing I remember is running in the house scared out of my mind, screaming for my mom and step-dad to come upstaris and screaming about a ufo and freaking out. I was running all over the house locking the doors and windows...I WAS TERRIFIED! My mom of course told me that I was making up things and to go back outside. I started crying and begged her not to make me go out there again alone...but she made me anyways. So I went back out there...still terrified not knowing if it was still out there or not. When I got outside, I looked up at the stars and over at the mountain that was to the left of me. I saw, what I assume was the ufo I had just witnessed, hovering above the top of the mountain, then I saw a light coming from the bottom of it, shining down at the ground. It then slowly lowered to the ground...then all the lights disappeared and I never saw it again."],"Log Number":"US-01272008-0016","files":["/var/www/straped/mufon/html2text/9299.html.txt","/var/www/straped/mufon/org/9299.html"]}