{"Summary":"OBJECT CIRCLED NEIGHBORHOOD MANY TIMES LAST NIGHT","Object Features":"Unknown","Date Submitted":"01/26/2008 11:55 UTC","Latitude":"30.271333","City":"Austin","Region":"Texas","Viewing Distance":"101-500 Feet","Log Number":"US-01272008-0017","Sighting Duration":"00:30:00","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9300.html.txt","/var/www/straped/mufon/org/9300.html"],"Date of the Event":"01/26/2008 11:55 UTC","Object Shape":"Cigar","Longitude":"-97.735611","map":"<A HREF = \"http://maps.google.com/maps?q=30.271333,+-97.735611(9300)&iwloc=A&hl=en\"> mufon case (9300) map </A>","divs":["Sighting DetailsI was sleeping when a loud object like a helicopter flew real low over my house. Then it did it again and again. I thought there were several objects, but I got up to look out the window and saw just one circling over and over. I went outside to get a better look.At first I thought it was a helicopter but it didn't have any searchlights turned on (no lights streaming down). It had lights only on the bottom. There were 3 red ones in a row front to back, but in an irregular pattern (not a straight line) and a white one and a green or blue one. Pretty sure it was green. So a total of 5 lights on its underbelly. Its noise was loud like a plane or copter. It was flying very low and in quite a small radius, just circling the same part of my neighborhood.It did this for a long time, possibly as long as 30 minutes. I called the police station to ask if they had had any calls and they said they had had a lot of them. The dispatcher said \"we're looking for somebody but we don't see anything.\" I assumed it was a copter looking for a fugitive, but when I called the police today to see if they caught anyone, she claimed she didn't know anything about it and said \"we don't have a press release\" which I thought was odd.When I googled the \"light arrangements\"of copters and planes, I could not find one that met this description, so I am sending this in as unidentified. Before, during and after this event I had a terrible headache, much worse than any I might usually have. So, was this a helicopter, or something else ?"],"Case Number":"9300","Disposition":"Unknown","Object Flight Path":"Path with directional change","Tags":"City","Source":"MUFON","Country":"United States","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around January 26th 2008"]}