{"Source":"MUFON","Sighting Duration":"Undisclosed","Log Number":"US-01272008-0018","Case Number":"9301","Object Shape":"Disc, Sphere","Tags":"City","divs":["Sighting DetailsI left my bands practice to pick up a friend around the block. I picked him up and we were on our way back when we noticed a very bright object in the sky to our left. I believe it was in the southwest direction, and it was directly over a sand pit which is about 2 miles by 2 miles in diameter. at first we thought it may have been a planet, but we quikly ruled that out considering that it was only about 1500 feet up and bigger than a 2 story home. The sand pit is directly across the street from our practice so we ended up almost directly under the object which is when we ruled out the idea of a plane. The object was a bright white light in the middle and had red and blue lights swirling around it and was hovering in the same place the whole time. We did not take our eyes off it for a second. Then we arrived at our destination and pulled in the driveway not looking anymore, got out and looked up and it was gone. We even went into the pit across the street and it was nowhere in sight. I find it strange that something that big and that bright could have been floating in the sky and dissapeared in a matter of 2-3 seconds. Definately wierd, but an exciting rush! It still freaks me out when I think about it..."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=39.939007,+-74.192919(9301)&iwloc=A&hl=en\"> mufon case (9301) map </A>","Region":"New Jersey","Latitude":"39.939007","Date of the Event":"01/25/2008 09:20 UTC","Weather Factors":"Unknown","trends":["There has been one other sighting in Beachwood","There were no other sightings in Beachwood on or around January 25th 2008"],"City":"Beachwood","Summary":"Unknown object: first you see it, then you dont!","Longitude":"-74.192919","Date Submitted":"01/25/2008 09:20 UTC","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9301.html.txt","/var/www/straped/mufon/org/9301.html"],"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed"}