{"Country":"United States","trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around January 26th 2008","This sighting has never been favorited.",""],"Object Shape":"Disc, Flash, Star-like, Other","Summary":"UFO visits periodically over area in evening","Tags":"City","Date Submitted":"01/26/2008 05:45 UTC","Longitude":"-98.487338","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.426462,+-98.487338(9303)&iwloc=A&hl=en\"> mufon case (9303) map </A>","Latitude":"29.426462","Weather Factors":"Unknown","Source":"MUFON","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9303.html.txt","/var/www/straped/mufon/org/9303.html"],"Case Number":"9303","City":"San Antonio","Log Number":"US-01272008-0020","Date of the Event":"01/26/2008 05:45 UTC","Object Features":"Undisclosed","divs":["Sighting DetailsI first noticed the visitations around November when I was actually filming and investigating chemtrail patterns over Northern San Antonio. I began noticing a strong light in the evening hours which I dismissed for Venus. Somedays it was visible in the same area of sky and the next it was not. I am a religious person and would pray outside a prayer that I do not know where I learned it from or why I started doing it with my other regular prayers, but since then these visitations had become more frequent, until I stopped praying this prayer recently. I do not claim that this prayer is bringing them around, just the oddness of it happening when it was said. The lights would change color just like when you look at a satellite at night and I again thought maybe this was the case until it started moving in patterns not typical of helicopters,planes or balloons. At about the size of a peanut from arms length it is nuetral for about one minute, then it descends to about the size of a watermelon at arms length. It then makes what I can only call \"shots\" across the sky in various directions for about another minute, then the color patterns begin again of amber,green,blue and red rotating in different areas of a circle pattern. I managed to on my last day of doing this prayer to capture it coming down very low almost like it was scanning or wanted a closer look at me and am submitting it here for anyone to look at. It is not common aircraft nor weather balloon, I have seen plenty of those to be able to know the difference. The other thing is there is no sound unless it comes down close like the one in these pictures, then it has a bumblebee sound but very airy to it. I had been having trouble sleeping when all this started staying awake till 3 or 4 in the morning as if someone was in my house. But since stopping that prayer it has quieted down extremely. I will not repeat the prayer nor wish these feelings on anyone else so I am not including it here. I do not expect anyone to believe me nor do I care, I just had to get this off my chest once and for all."],"Region":"Texas","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown"}