{"Longitude":"-105.780217","Region":"Colorado","Date Submitted":"08/31/2001 04:00 UTC","Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","City":"Undisclosed","trends":[],"Summary":"Brown, spiked teardrop in daylight over foothills","Weather Factors":"None","Object Shape":"Teardrop","files":["/var/www/straped/mufon/html2text/9305.html.txt","/var/www/straped/mufon/org/9305.html"],"Latitude":"39.552611","Case Number":"9305","Tags":"City","Log Number":"US-01272008-0022","map":"<A HREF = \"http://maps.google.com/maps?q=39.552611,+-105.780217(9305)&iwloc=A&hl=en\"> mufon case (9305) map </A>","Date of the Event":"08/31/2001 04:00 UTC","Disposition":"IFO","Object Features":"Appendage(s)","Source":"MUFON","Object Flight Path":"Hovering then path","Country":"United States","divs":["Sighting DetailsI was driving with a friend from the easter edge of Boulder back towards the foothills, we were at a spot a little ways out on a mesa where you could see up over them. It was fall 2001, approximately 4:00pm, the sun was low in the sky, less than an hour from droping behind the mountains. I was driving due west when I noticed something in the sky hovering over the foothills through some tree branches. At first I did not pay it any attention, but as I continued to drive I noticed it was extremely out of place just as my friend in the car noticed it as well. It was so akward and strange that I pulled my truck over and we climbed on top with a pair of binocular I always carried with me (not a camera unfortunately). The object was of an elongated teardrop shape, with the tapered end (spike) pointing into the sky, this protrusion was slightly curved to the right from our angle, as well it had two smaller, inwardly curved spikes proturding from the top of the main section of the objet, directly on either side of the larger spike. It was dirt brown, and I could see the sun reflecting off the bottom, so it was obviously a solid object. Given the distance and how large it still looked, I would say it was between 40 to 100 feet tall, but that is a very rough estimate, it was fairly large though. The other witness and I took turns looking at it through my binoculars for about four minutes, it looked smooth to me, I could not discern and feature on its surface. It hovered motionless for this time then began to move slowly north and west for a short distace, at this time my friend and I gave eachother a very startled look, but when we glaced back, it was gone, I REALLY wish I had not looked away. This was not some fleeting glance of a strage light in the night, we saw a solid, very oddly shaped craft of some sort hovering motionless in broad daylight through binoculars. I don't know what to say, it did not look man made to me, and it was BIG."]}