{"Object Features":"None","Weather Factors":"Unknown","Tags":"City","Object Flight Path":"Straight-line path","City":"Morristown","Date of the Event":"10/31/1979 12:00 UTC","Summary":"While playing with friend in backyard during day, saw two gold oval-shaped craft flying silently","trends":["There have been 9 other sightings in Morristown","There were no other sightings in Morristown on or around October 31st 1979"],"Log Number":"US-01272008-0024","Object Shape":"Oval","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Region":"New Jersey","files":["/var/www/straped/mufon/html2text/9307.html.txt","/var/www/straped/mufon/org/9307.html"],"Longitude":"-74.478644","Source":"MUFON","Latitude":"40.798117","map":"<A HREF = \"http://maps.google.com/maps?q=40.798117,+-74.478644(9307)&iwloc=A&hl=en\"> mufon case (9307) map </A>","Disposition":"IFO","Country":"United States","Date Submitted":"10/31/1979 12:00 UTC","Case Number":"9307","divs":["sighting detailswhile a small child (am estimating the year as 1979, but it could have been a couple of years after that), i was playing in my backyard in morristown, new jersey, with my next door neighbor. it was mid or late afternoon, and i believe it was some time in fall. we both noticed two objects flying in formation, either fairly far off in the distance or rather small, not too far above the horizon. they appeared to be flying at precisely the same altitude, with one flying perhaps ten craft-lengths behind the other. they were entirely silent. i remember very distinctly that they appeared to glow an odd amber\\gold\\orange color that was very unlike any color i have ever seen emanate from an airplane's lights. we watched the two objects as they flew silently and very smoothly, a bit faster than the average plane but not remarkably fast. they disappeared behind a treeline and we lost sight of them. i imagine that they could have been two airplanes reflecting light from the sun, but somehow that did not seem right at the time, for two reasons. first, the crafts did not gleam or glint; rather, it appeared that the light was emanating from the crafts themselves, and both were evenly and identically the same color. second, the shape of the crafts was wrong for an average plane - they seemed a bit too fat in the middle, more an oval than a tube. the best way to describe their appearance and size from my perspective was that they looked like two flying tic-tac breath mints that glowed gold."]}