{"divs":["Sighting DetailsMy mom was driving, and my dad sitting in the back seat, I was sitting in the front passengers seat, and we were going north on the 57 freeway towards Brea, and the traffic started to slow down significantly. I looked ahead, and then a big light (close to the apparent size of the moon) appeared high up in the sky. It looked as though it had a trail of sparks behind it, and it was very slow in its descent. Then, it went out, but another one appeared, just like the first. It seemed to veer off to the right, in a twirling motion. It went out again, and there was a pause, for about 3-5 seconds during which I couldn't see any. Then two more appeared, and a third, and they continued to do the same things. One went out, and another two appeared. At this time there were about four or five in the sky at once, all doing the exact same things, except at progressively lower heights. As they got lower, the impression that they were trailing sparks became much more distinct. Towards the end of (what I saw of) the event, there was one which seemed to be very close to the ground - not so close as I would think it a few feet from the ground, but close enough that I grew the genuine concern that it might hit our car, or hit the freeway close enough to cause a crash that would cause damage to us as a result. However, this, too, disappeared from sight, as though it had burnt out and lost its light. At first, I thought it was pieces of a satellite, as the trails of sparks that gave them their fiery looks seemed to suggest, and it's far too slow to be a meteor, at least any meteor I've seen. I would think that such a case would involve the objects falling faster, though, so I do have some questions surrounding this idea. I felt pretty neutral beforehand, and was pretty shaken up during it, mostly relieved afterward that it hadn't caused us harm, whatever it was. I still don't know, don't think this is an extraterrestrial-controlled thing, but it is certainly very unusual (first thing I've seen like it, compared to any UFOs, stars, planets, meteors, satellites that I have seen), and I wouldn't rule this possibility out, particularly as I lack a better explanation as of this point."],"Tags":"City","Longitude":"-117.89702","map":"<A HREF = \"http://maps.google.com/maps?q=33.91798,+-117.89702(9309)&iwloc=A&hl=en\"> mufon case (9309) map </A>","Date of the Event":"01/26/2008 12:00 UTC","Source":"MUFON","Summary":"A bunch of fiery objects appearing, twirling, falling, and going out again.","Country":"United States","Disposition":"IFO","Viewing Distance":"Over 1 Mile, Unknown","Log Number":"US-01272008-0026","Object Features":"Unknown","Region":"California","Sighting Duration":"Undisclosed","Date Submitted":"01/26/2008 12:00 UTC","Object Shape":"Fireball, Unknown","Case Number":"9309","trends":["There have been 8 other sightings in Brea","There were 3 other sightings in Brea on or around January 26th 2008"],"City":"Brea","Object Flight Path":"Path with directional change,Other","Latitude":"33.91798","Weather Factors":"Windy, Medium","files":["/var/www/straped/mufon/html2text/9309.html.txt","/var/www/straped/mufon/org/9309.html"]}