{"Object Features":"Unknown","Region":"Massachusetts","City":"Boston","Disposition":"Hoax","Summary":"It was like a disc with a kind of head at its middle, above it","Log Number":"US-01282008-0006","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9316.html.txt","/var/www/straped/mufon/org/9316.html"],"Longitude":"-71.052963","map":"<A HREF = \"http://maps.google.com/maps?q=42.366161,+-71.052963(9316)&iwloc=A&hl=en\"> mufon case (9316) map </A>","Object Shape":"Disc","Latitude":"42.366161","Source":"MUFON","Date Submitted":"08/15/2007 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Unknown","Tags":"City","divs":["Sighting DetailsWhat happened left me troubled up to now. I was coming from Africa vi a London where we took American Airlines and we were heading to Miami. our port of entrance. I was travelling with my wife, my daughter (4 years old) and my son (20 months old). We were sitting in the right side of the plane. I don't remember well but i think it happened in the sky above Massashussets according to the on-board map navigation that has that plane to each passenger seat. Just when i wake up from a long sleep, i check the young kid if he is ok because he was sleeping in the hand of his mother, then later on i look outside trough the window and, for a while i admire the clouds. Then i saw a kind point coming very fast. First i tought it was a bird or a plane, but speed with which it was coming left me wonder. Suddenly i saw it stop to a distance of about half a km, but the clouds were at its right side and the left side was clear. I remained admiringit for a while. It was that kind of ufo that we have seen in documentary then i tried to wake up my wife because she was sleeping. When she wake up i tried to show it to her but it was not there anymore. I tried to explain to her what i've seen, but she could not understand what is really an UFO (OVNI in french). It did not impressed me to much because i was thinking that it was american made aircraft copying UFO. But what happened later on is what made me wonder all the time what i've seen in the sky of massachussets: I cannot remember the date but i think it one week or ten days after my arrival in Las Vegas, one Congolese had shown to me an African Market where i could get some food imported from Africa. The market was situated on West Charleston, and i was in the RTNC bus sitting with a certain man. He was tall and not fat. He asked me if i was which part in Africa and when i've arrived in Las Vegas. I explained to him. He was talking to me in English while my mind was somewhere else. So, he was a kind of talkative and, to discourage him talking to me, i was answering whatever he said with a hmmm! all the time then speak to me surprisingly asking me if i saw it then i realize that he notice that i was not paying attention to what he was telling me. I asked him what does he want, then he asked if i didn't see an UFO when i was un the plane. I ask him what is an UFO, he explained to me it is. Then he asked me again if i've seen it. I told him no. Then i started thinking why he was talking to me wearing sun glasses, then he did like he read my mind. He took off he sun glasses and look at me and repeat the same question asking if i've seen the UFO. I said no but with the feeling of fear because he was black and his eyes were like pure white and ovale without the black color that we usually have (Really very strange). He told me that he doesn't understand that i didn't se it and many people report seeing it in the sky. I fell unconfortable to sit with him but by chance the bus reached my stage of exit (Charleston & Mayland PKWY). Back home i explained to my wife what happened, but i'm still wondering how he knew that i've seen it because i didn't tell anybody about it. What i've seen in the sky was for me just a kind of american super power man made aircraft. If it so, please, let me know. Contact me any time you want but please, i want to be anonymous"],"Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"08/15/2007 12:00 UTC","Case Number":"9316","trends":["There have been 54 other sightings in Boston","There were no other sightings in Boston on or around August 15th 2007"]}