{"Summary":"The light from no where...","Case Number":"9317","Weather Factors":"None","Object Flight Path":"Unknown","Latitude":"36.613198","Tags":"City","Log Number":"US-01282008-0007","Region":"Kentucky","Date of the Event":"09/16/1996 09:30 UTC","Sighting Duration":"Undisclosed","Longitude":"-83.72237","Object Features":"Unknown","Country":"United States","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9317.html.txt","/var/www/straped/mufon/org/9317.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=36.613198,+-83.72237(9317)&iwloc=A&hl=en\"> mufon case (9317) map </A>","trends":["There have been 3 other sightings in Middlesboro","There were no other sightings in Middlesboro on or around September 16th 1996"],"Date Submitted":"09/16/1996 09:30 UTC","City":"Middlesboro","Source":"MUFON","Viewing Distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","Object Shape":"Unknown","divs":["Sighting DetailsI was traviling back from visiting family and I saw what I thought to be a helicopter's spot light; covering basicly a whole mountain side. The closer I got to the light, the brighter and whiter it seemed to be. Once I got my car into an area where I could see the mountain side better, I pulled over onto a wide-spot along side a curve; I was curious, as the light seemed to be coming from nowhere and I did not hear the roar of a helicopter. I turned off my engine so I could hear better and kept waiting to see what or where the light was originating from; no luck. I decided then to restart my car and head on down the road but as I reached for the key the light started coming closer my way. I lost around two hours of time that night, no idea what happened either. I had no physical trauma after this, but low frequency sounds now send me into an anxiety attack (for no reason) and also give me pain all over my body. Not much of a story to tell, but I am almost 100% positive I had some kind of encounter that night with something not of this world."]}