{"Log Number":"US-01282008-0008","Latitude":"33.34167","trends":["There have been 3 other sightings in Ahwatukee","There were no other sightings in Ahwatukee on or around May 17th 2007"],"Region":"Arizona","files":["/var/www/straped/mufon/html2text/9318.html.txt","/var/www/straped/mufon/org/9318.html"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=33.34167,+-111.98333(9318)&iwloc=A&hl=en\"> mufon case (9318) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Summary":"Star type object","Weather Factors":"Unknown","Object Flight Path":"Stationary","City":"Ahwatukee","Object Features":"None","Date Submitted":"05/17/2007 12:00 UTC","Date of the Event":"05/17/2007 12:00 UTC","Longitude":"-111.98333","Object Shape":"Star-like","Viewing Distance":"Over One Mile","divs":["Sighting DetailsI work in a recording studio and on occasion I will walk outside while taking a break to get fresh air and on occasion to use the phone. This particular night I walked to the end of the building and leaned against it while making a phone call. I didn't really notice anything at first upon looking into the southeast sky. Having seen the constellation Orion many times I am very familiar with it's stars and their alignment. While chatting on the phone I noticed there was a bright \"star\" within close proximity to Orion. I had never noticed this bright \"star\" before. Shortly thereafter I ended my phone conversation and turned my full attention to it. While I was curiously staring and wondering why I hadn't noticed it faded away within 3 seconds. It was as if it had a dimmer on it and was just turned off. It was shocking because all the other stars next to it were so clear in the sky and this object was brighter than them. There were no clouds in the sky at all. I made a point of paying close attention to the weather conditions. The whole time I looked it seemed to move just ever so slightly but I couldn't really tell if it was or not. I think that's why I was staring at it so much too. I had the impression that it was not completely stationary but not really moving much either. I was so surprised by this event I called my friend back immediately and told her about it. It was pretty exciting to see something out of the ordinary. I was awestruck by this event even though it wasn't a spectacular sighting by any means. I went back to work and when I got the chance to go out and look again a couple of hours later, clouds had moved in. I don't remember exactly when the date was that this happened which is why I put approximate time of incident."],"Country":"United States","Case Number":"9318"}