{"Object Shape":"Other","City":"Aubrey","Latitude":"33.304283","Date Submitted":"01/08/2008 07:30 UTC","trends":["There has been one other sighting in Aubrey","There were no other sightings in Aubrey on or around January 8th 2008"],"Tags":"City","Longitude":"-96.986118","Country":"United States","Source":"MUFON","Sighting Duration":"Undisclosed","Date of the Event":"01/08/2008 07:30 UTC","Log Number":"US-01282008-0012","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9322.html.txt","/var/www/straped/mufon/org/9322.html"],"Region":"Texas","Object Flight Path":"Path with directional change","Disposition":"Unknown","Case Number":"9322","Object Features":"Undisclosed","Summary":"Thin, very bright lights,shaped like 2 hands cupped together","map":"<A HREF = \"http://maps.google.com/maps?q=33.304283,+-96.986118(9322)&iwloc=A&hl=en\"> mufon case (9322) map </A>","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsThis is actually my dad's caregiver's story. She does not believe in UFOs but on Jan. 9, 2008 told me of an unusual experience she had the night before (Jan 8, 2008). She wanted to know what my husband thought of it, as he was a Army Med-Evac pilot for 25 years. She told that she went to the mailbox around 7-8:00 PM. They live in a small subdivision in Aubrey, Texas. After placing her letters in the mailbox, she noticed two very bright and very low flying objects moving quickly toward her, just over the houses on the south side of her street. She thought they were airplanes or helicopters. She was perplexed by how low they were and as they got closer to her, she realized there was not any noise normally associated with aircraft. Just as they approached her, they made a sharp turn and headed South, toward Denton. This is when she lost sight of them. She said they were shaped like two hands cupped together and had the brightest lights she had ever seen. If you are interested in hearing this story directly from her, I am sure she would talk with you. She loves to talk! I have known this woman for four years and I would trust her with my life and every cent I own. She is undoubtedly the most truthful person I have even known. Please let me know if you would like to talk with her. I thought perhaps her story might aid you in your investigation of the January 8th sightings. Best regards, Theresa Wood"]}