{"Latitude":"43.100774","Summary":"Two witnesses see two large bright silent glowing orbs at the same time.","Object Features":"None","Case Number":"9324","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=43.100774,+-79.035889(9324)&iwloc=A&hl=en\"> mufon case (9324) map </A>","Longitude":"-79.035889","Object Shape":"Circle, Sphere","Log Number":"US-01282008-0014","divs":["sighting detailswe\\mghee & mesmer families were having a birthday celebration dinner for thenext door naighbor's wife. (mesmer) both families are good friends. both families have had sightings. dale (witness one) had a weeks vacation and spent three evenings searching the skies for ufo's that week as there had been activity on and off over the past few years. dale saw nothing in the three evenings he was out. his next door neighbor (witness 2)who has had multiple sightings and is the subject of an ongoing investigation said \"lets go to my house (next door) and take a look off my back deck\" to see if there is anything out there. done on a whim. they went to the neighbors house. they took a pair of binoculars and a pair of night vision binoculars owned by witness #2. as they looked off the back deck of the house of witness 2-witness 1 (dale) saw two large glowing orbs flying in a northwest to southeast direction and saw the two orbs through the night vision binoculars. the two objects flew diagonally across the back of the field behind witness #2's house. the orbs were large, glowing and silent. the sighting lasted perhaps 2 minutes in length. the objects were first seen through the the night vision binoculars then with regular binoculars and with eyesight."],"Date Submitted":"08/19/2007 09:00 UTC","files":["/var/www/straped/mufon/html2text/9324.html.txt","/var/www/straped/mufon/org/9324.html"],"Tags":"City","Object Flight Path":"Straight-line path","Region":"New York","Source":"MUFON","Disposition":"Unknown","Date of the Event":"08/19/2007 09:00 UTC","Sighting Duration":"Undisclosed","trends":["There have been 19 other sightings in Niagara Falls","There were no other sightings in Niagara Falls on or around August 19th 2007"],"Weather Factors":"None","Viewing Distance":"Over One Mile","City":"Niagara Falls"}