{"Date of the Event":"01/11/2008 06:25 UTC","Case Number":"9333","Summary":"Triangular object hovers, then passes over I-210","map":"<A HREF = \"http://maps.google.com/maps?q=30.233285,+-93.211166(9333)&iwloc=A&hl=en\"> mufon case (9333) map </A>","divs":["Sighting DetailsI'm a comprehensive mental health case manager for Volunteers of America, and am currently pursuing a masters in counseling psychology. Anything that sounds like a definitive conclusion that I may mention I stress is purely speculative on my part. I'd like to think my background is fairly based in scientific observation. This occurred at 6:25 pm on Friday, January 11, 2008. I was in my car in Lake Charles, LA. I had turned off 5th Avenue onto Prien Lake rd., headed east-bound towards the onramp onto interstate 2-10 west (where I was going to merge). There is a fairly short distance between that corner and the onramp, perhaps a half mile. I noticed up to my left something that I hadn't seen before. I assumed it was a tower; Lake Charles is a fairly large town so it didn't surprise me that I had missed seeing it before. The reason I thought it was a tower was because it appeared almost stationary, and was about the height of a tower top. There was three white lights in a triangular formation, and along the back base was a blinking red light. I thought for sure it was a tower top, yet when I kept trying to locate the actual tower itself, I couldn't see it. It was dark, so I assumed that it was just obscured. Then I realized it was moving. At that point my onramp was coming up, so instead of pulling over and risk not being able to get a good shot of this thing, I merged onto 2-10 west-bound and grabbed my 5 megapixel digital camera out of my tech bag (I keep my PSP, DS, and cam in there when I spend a couple days away from my apartment). The thing was moving slow still, from north to southwest. I took an initial picture with the flash on, which looked like crap because of the glare of my dirty windshield. I turned the flash off and took several more photos. The thing disappeared over the southwest horizon just before I hit the 2-10 bridge of the Calcasieu ship channel. I wouldn't have given this a second thought if the thing hadn't just *sat* in place while I passed it, and like I said, it seemed somewhat low over the Oak Park area of Lake Charles. My camera picked up little more than taillights and darkness, except for one picture. I had to adjust the brightness on it to see anything, but I believe I may have gotten it on the right side of the frame. I've been monitoring local media to see if anyone else saw it, but I've heard nothing yet. Traffic was fairly busy, too, at that time. I will say this, too: I've been to Long Island, NY, so I know what real air traffic looks like. We don't get that here, but as soon as this thing was out of sight, lots of planes with blinkblink-pause, blinkblink-pause white running lights started popping up all over. I'm not saying they were chasing anything, just that they were there in stronger numbers than I remember seeing before. I've attached the single photo that looks like it might show anything, and boxed out where I think the object is."],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"00:06:00","Latitude":"30.233285","trends":["There have been 16 other sightings in Lake Charles","There were no other sightings in Lake Charles on or around January 11th 2008","This sighting has never been favorited.",""],"files":["/var/www/straped/mufon/html2text/9333.html.txt","/var/www/straped/mufon/more/9333_submitter_file1__tri2.jpg","/var/www/straped/mufon/org/9333.html"],"Date Submitted":"01/11/2008 06:25 UTC","Disposition":"Insufficient Data","Source":"MUFON","City":"Lake Charles","Object Shape":"Triangle","Tags":"City","Object Features":"Unknown","Object Flight Path":"Hovering then path","Country":"United States","Region":"Louisiana","Longitude":"-93.211166","Weather Factors":"None","Log Number":"US-01282008-0023"}