{"Object Shape":"Egg, Fireball","Region":"California","Case Number":"9334","City":"Placentia","Object Flight Path":"Unknown","divs":["Sighting DetailsAfirst it looked very similar to 2 asteroids entering the earths orbit, 2 orange elliptical fireballs falling to earth, with what looked like a trail of fire behind them. It seemed like that at first until they both slowed and hovered, and begand to fly around, around the same altitude. They then descended more, leaving behind a trail of what seemed to be some kind of smoke, but dissapated rapidly. They then hovered around some more and began to descend again, they repeated this until they were below the trees and out of sight, I did not see them again. I thought I was seeing things, but now I hear my friends saying they saw the same thing too, he called Anaheim and asked if there had been sightings, and the operator said there had. Unfortunatelly, I was unable to capture these objects on camera. I also would like to note that it seemed like one of them faded out almost completely of sight, then relit to its normal intensity. They were easily spotted againsed the dark sky. I also spotted a general aviation pilot flying around the 2 objects, probably as curious as I was, but im sure the other object was just that, a normal plane."],"Country":"United States","Tags":"City","Log Number":"US-01282008-0024","Weather Factors":"Unknown","Date Submitted":"01/26/2008 05:00 UTC","Viewing Distance":"Unknown","Longitude":"-117.865086","trends":["There have been 4 other sightings in Placentia","There were 2 other sightings in Placentia on or around January 26th 2008"],"Summary":"2 objects falling followed by hovering and continued falling","Source":"MUFON","Object Features":"None","Latitude":"33.882117","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/9334.html.txt","/var/www/straped/mufon/org/9334.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.882117,+-117.865086(9334)&iwloc=A&hl=en\"> mufon case (9334) map </A>","Date of the Event":"01/26/2008 05:00 UTC","Sighting Duration":"00:06:00"}