{"City":"Bridgeport","Longitude":"-73.187277","Date of the Event":"01/26/2008 05:58 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=41.195968,+-73.187277(9337)&iwloc=A&hl=en\"> mufon case (9337) map </A>","Object Features":"Unknown","Object Shape":"Diamond, Star-like","Summary":"Star-Burst","divs":["Sighting DetailsIt was almost six o'clock on Saturday night. It was cold, slightly windy, and dark. Finally a night to relax; I decided to set up my telescope in my back yard. Facing South and looking up at the sky, viewing conditions were terrible; a very heavy cloud cover blanket with an over glow of city lights. I figured what the hell, I lit a cigarette, and decided to wait for a cloud break. I just wanted to zoom on to one star, get my fix, and head back into the warmth of my house! While gazing up (NOT through the telescope) within the sky something very unusual happened. I observed what looked like an over-sized star. Almost directly above my head, at 500 hundred feet up in the sky (?estimated?)...I said to myself, \"oh wow, what a big star...\" Chills went up my spine at that very second, because I realized it was not a star. Due to its altitude, brightness, and size. It appeared to be a super star and it quickly, incrementally, gained an incredible amount of brightness, and peaked its brightness. It lit up so bright white I was frozen stiff. And then it simply vanished...I was honestly scared. I am no scientist, just a space gazer, but I know what I witnessed. It's fair to say that a natural weather phenomenon could be excluded as far as an explanation for what I observed. Furthermore, the star-like object did not move, it took on an incredible brightening, and did not make any noise at all. It remained in the same position for the duration of no longer than six seconds. I also observed some aircraft in the sky a later that very night, and there can be NO comparison at all. It was just so strange that it shocked me, and I could not resolve this occurrence with any rational explanation at the moment, or now. So I ran inside to tell my wife what happened. She didn't seem to take me seriously so, I returned a few minutes later to catch some stars on the telescope. Nothing else strange happened that night, but it is definitely worth being documented here. I feel better sharing my experience here."],"Viewing Distance":"501 Feet - 1 Mile","Case Number":"9337","Weather Factors":"Unknown","Object Flight Path":"Stationary","Disposition":"Unknown","Log Number":"US-01292008-0003","Latitude":"41.195968","files":["/var/www/straped/mufon/html2text/9337.html.txt","/var/www/straped/mufon/org/9337.html"],"Tags":"City","Country":"United States","Region":"Connecticut","Sighting Duration":"00:00:06","trends":["There have been 11 other sightings in Bridgeport","There were no other sightings in Bridgeport on or around January 26th 2008"],"Date Submitted":"01/26/2008 05:58 UTC","Source":"MUFON"}