{"Region":"California","Viewing Distance":"Unknown","Country":"United States","Summary":"Meteor/Astroid-like object(s) enter earth's atmosphere and do not burn out immediately but swoop and make 90 degree manuevers before they disappear.","divs":["Sighting DetailsDriving northbound on the 57 freeway through Fullerton, we observe what appears to be a meteorite with a long and beautiful tail in the NE sky. When it does not disappear after 10-15 seconds we, as well as everyone else on the freeway are slowing and braking and seeing this object make a 90 degree turn. Then a second object appears and they both are moving strangely and not burning out and I am getting really excited and saying, \"What in the heck is that!?!\" to my friend, the driver of the car I am riding in. He is an FAA pilot and has seen many \"shooting stars\" before as well as pyrotechnics and confirms that we are not seeing fireworks. The two objects seem to burn out and disappear, then all of sudden flare up again and take off, only now there are three parts. Then all three parts disappeared from sight. I called 911 on my cell phone to report this and ask the dispatcher if there have been any other calls, but she does not know or won't tell me. Later I called the Orange County Sheriff's Dept. as well as KFI radio but no one had any information. I know many people driving witnessed this event. I posted a note on Craigslist. org to try and find others that saw this event and was contacted by someone in the city of Placentia who witnessed this from the ground and said it was a blimp-like flaming object."],"Log Number":"US-01292008-0004","Source":"MUFON","Date Submitted":"01/26/2008 05:55 UTC","Case Number":"9338","Object Flight Path":"Path then hovering","Object Shape":"Bullet, Missile, Fireball, Other, Unknown","Disposition":"IFO","Date of the Event":"01/26/2008 05:55 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.876902,+-117.917138(9338)&iwloc=A&hl=en\"> mufon case (9338) map </A>","Latitude":"33.876902","Longitude":"-117.917138","Object Features":"None","Tags":"City","trends":["There have been 14 other sightings in Fullerton","There was one other sighting in Fullerton on or around January 26th 2008"],"City":"Fullerton","files":["/var/www/straped/mufon/html2text/9338.html.txt","/var/www/straped/mufon/org/9338.html"]}