{"Log Number":"US-01292008-0005","divs":["Sighting DetailsA few weeks before the picture was taken I had heard that there was supposed to be a semi eclipse happening that day. Around the time that the eclipse was due to happen I had my camera on me so that I could get a picture of this event. I was in the car driving around trying to find the most strategic spot to get a picture but the eclipse never happened. Due to this disappointment I began taking pictures of the sky because the colors just looked bright an fluidlike. After taking a few pictures I went home and uploaded the pictures onto my laptop. after uploading i realized that the pictures that i took of the same part of the sky had a spot that looked as if something was there but wasnt. I can see the shape of some type of ship though when i took the photo all i saw was sky. the photo i uploaded has not been altered in anyways. I do not know what quite to make of the picture that i took but i do believe in a part of me that it is an invisible to the naked eye ship that was coasting through the atmosphere. please contact me if you also see the same ship that i see in the photos because I am very interested in your thoughts on the photo."],"Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=33.750055,+-84.384982(9339)&iwloc=A&hl=en\"> mufon case (9339) map </A>","Date Submitted":"08/18/2007 12:00 UTC","Weather Factors":"Unknown","Tags":"City","Longitude":"-84.384982","Summary":"a picture of an invisible aircraft","Latitude":"33.750055","trends":["There have been 95 other sightings in Atlanta","There were no other sightings in Atlanta on or around August 18th 2007","This sighting has never been favorited.",""],"Country":"United States","Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Object Shape":"Blimp","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9339.html.txt","/var/www/straped/mufon/more/9339_submitter_file1__l_3bec3b46aa240b7ce0e66f615543a5b8.jpg","/var/www/straped/mufon/org/9339.html"],"Disposition":"IFO","City":"Atlanta","Case Number":"9339","Region":"Georgia","Date of the Event":"08/18/2007 12:00 UTC"}