{"Object Flight Path":"Stationary","Region":"Pennsylvania","City":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Fireball, Oval, Sphere, Unknown","Date Submitted":"01/27/2008 12:00 UTC","Date of the Event":"01/27/2008 12:00 UTC","Latitude":"41.212692","trends":[""],"files":["/var/www/straped/mufon/html2text/9340.html.txt","/var/www/straped/mufon/more/9340_submitter_file1__100_8893.JPG","/var/www/straped/mufon/more/9340_submitter_file2__100_8891.JPG","/var/www/straped/mufon/org/9340.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=41.212692,+-77.190685(9340)&iwloc=A&hl=en\"> mufon case (9340) map </A>","Country":"United States","Object Features":"Undisclosed","Case Number":"9340","Weather Factors":"Unknown","Longitude":"-77.190685","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIt was around 11o clock on saturday night. I had just gotten done my delivery job at the local pizza shop. I pulled up on Dunbury Road, in Fairless Hills to pick up a friend of mine. As i pulled up to his house, pointed east, he got into my vehicle and something over the tree line of Vermillion hills woods caught our eye. It was a plane that was flying towards us that made us look, but the funny thing was, after we realized it was a plane flying next to a distant star we no longer had our sites set on the plane, it was the star that appeared to be blinking. Red, white and green lights. We drove up the block to my driveway and called some family members to get out the camera and telescope. All i told them was, they need to make sure im not seeing things. When the 3 family members came out front i asked the to do the following things. First, locate the north star. Then locate mars. Finally locate saturn. ( I did this to make sure it was not one of those stars, cause it was burning as bright as one )When that was all done, i directed their attention eastward and asked them what they saw. At first the answer was a distant plane. Then i told them to look again. It was not a plane. We observed every star that night in the cold atmosphere and they all displayed the same characteristics. Blue hue, with a white star. This one was different. It was out there all by itself. At times it would fade out almost to nothing, then come back more intense than ever. At a point, we could not tell if our eyes were playing tricks on us, but 2 of us thought we saw at the same time something faint fly around the object in a circular motion. I called a friend who lives on the other side of town, and told him to do the same thing i did to everyone else, and the then tell me what he saw to the left of the moon. He told me he saw 2 objects that looked like stars almost on top of each other. We know he had the right star, but we could not see that from our vantage point. So since it was freezing cold and we were already outside for 2 hours and the thing got no closer, we went in to see what the net had to say about the nights sky. The only thing on the net was something about a comet hitting mars. Well that was Saturday. So last night, (Monday) we decide to look to the sky. There is nothing in the sky where we saw the object a 2 nights before. So i take a ride down to my buddys house on the other end of town, and as soon as i pull up his street, there it is. Except this time i can see the two lights. We watched it for a minute and then drove back to my house to get the telescope. When we got to my house there was nothing in the sky. Can anyone tell me what was suppost to be in the in the eastern hemisphere over the weekend, parallel to the moon to the left, glowing unlike any star in the sky? The reason why i am writing this is because i would like to know what was out there, and because i live in a town with no ufo reports ever. Ironically Friday night, there were 2 calls to the falls police station about a ufo being over an old restruant in the area. How weird is that?"],"Log Number":"US-01292008-0006","Source":"MUFON","Disposition":"Insufficient Data","Tags":"City","Summary":"To the left of the moon"}