{"Weather Factors":"Unknown","Latitude":"27.978356","Case Number":"9341","Log Number":"US-01292008-0007","Sighting Duration":"Undisclosed","Object Features":"Unknown","Date Submitted":"12/23/2007 12:00 UTC","Date of the Event":"12/23/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.978356,+-81.756469(9341)&iwloc=A&hl=en\"> mufon case (9341) map </A>","divs":["Sighting Details1. I AND SERVERAL NEIGHBORS (WITH THEIR CHILDREN) HAD JUST COME IN FROM FISHING, WHEN I SAW A VERY BRIGHT OBJECT IN THE WESTERN SKY. (THREE ADULTS AND THREE CHILDREN WATCHED IT) 2. THE BRIGHTNESS. THE SKY WAS VERY CLEAR, BLUE, THE SUN WAS GOING DOWN. WE SAW SEVERAL JETS IN THE AREA THAT WERE LEAVING LONG VAPOR TRAILS. 3. IT WAS SO BRIGHT. FIRST WE THOUGHT THAT IT WAS A JET MOVING AWAY FROM US AT THE ANGLE THAT IT APPEARED TO NOT BE MOVING. WE COMPARED IT WITH THE OTHER AIRCRAFT AND WE FOUND THAT THE OBJECT WAS NOT LEAVING A LONG TRAIL, NOT MOVING AND WAS THE BRIGHTEST OBJECT IN THE SKY. NEXT WE THOUGHT THAT IT WAS THE SPACE STATION, BUT A QUICK CALL TO A FRIEND IN THAT FIELD AND WE LEARNED THAT THE STATION WAS NOT AT LOCATION THAT WE COULD SEE. WE FIRST THOUGHT THAT IT WAS NOT MOVING UNTIL WE COMPARED IT WITH THE MOON. WE HAD A FULL MOON RISING IN THE EAST. WE SAW THAT THE MOON WAS RISING AT THE SAME PACE AS THE OBJECT WAS DROPPING IN THE WEST. THE ROTATION OF THE EARTH CAUSED THE OBJECT TO APPEAR THAT IT WAS GOING DOWN IN THE HORIZON. NO OTHER STAR WAS IN THE SKY AND THE SUN WAS STILL UP. I WAS NOW THINKING THAT IT WAS A SATELLITE. 4. THE OBJECT WAS VERY BRIGHT AND APPEARED TO HAVE SHAPE, USING A PAIR OF BINOCULARS WE ALL SAW AN INVERTED \"V\" SHAPE. NO ACTIONS IT JUST WENT DOWN IN THE WESTERN HORIZON AND THE MOON CAME UP IN THE EAST. 5. I HAD HEARD ABOUT THE EVENT IN TEXAS. I DID GO ON LINE AND THAT IS WHEN I SAW THE VIDEO WITH THE NEWS STORY. IT WAS THE SAME SHAPE AND OBJECT THAT WE HAD SEEN IN FLORIDA."],"Object Flight Path":"Stationary","Longitude":"-81.756469","Summary":"BRIGHT, VERY BRIGHT, INVERTED \"v\"","City":"Eagle Lake","Source":"MUFON","Country":"United States","files":["/var/www/straped/mufon/html2text/9341.html.txt","/var/www/straped/mufon/org/9341.html"],"Tags":"City","Viewing Distance":"Unknown","Region":"Florida","trends":["There have been 2 other sightings in Eagle Lake","There were no other sightings in Eagle Lake on or around December 23rd 2007"],"Disposition":"IFO","Object Shape":"Chevron"}