{"Latitude":"61.222446","Object Flight Path":"Stationary","Object Shape":"Fireball, Other","Date Submitted":"09/30/2001 12:00 UTC","files":["/var/www/straped/mufon/html2text/9345.html.txt","/var/www/straped/mufon/org/9345.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Source":"MUFON","Summary":"looked like a burning or molten object with round appearance","divs":["Sighting DetailsHello, This incident happened sometime ago in Anchorage Alaska, I lived at 1331 West 26th Ave. #1. I had a small area of sight from my front room and parking area that I know was over the Anchorage International Airport because I lived there for 7 years (that address - 30 yrs total in AK) and I know the flight pattern over the airport, the whole town knows the flight pattern. Anyway, it was evening, must have been between 5 and 7 pm and it was dark so it was winter time. I had been home a short time from work when i looked out my window and saw something odd looking. It was fairly high in the air and appeared to be orangeish color with some red and seemed to be very hot, I went outside to get a better view, my brother was with me during all this and I pointed it out to him and he couldn't figure what it was but we both watched this thing and as we watched, it seemed to be like a hot molten or burning object, i say this because that is how it acted and while watching this it \"dripped\" off a piece from the bottom which seemed to drop or drip like something very hot - like hot metal would burn or boil and drip \"molten like\" all this time I am thinking \"my god, I hope that's not a small plane burning in the air\" (I mention this because next to the Int'l Ariport is Lake Hood, a busy small plane and floatplane base) I was waiting for the thing to just drop out of the sky but during this whole time it stayed in ONE place. It didn't fall, or move up or down or explode, it didn't move right or left - it just stayed where it was. The part that dripped off didn't drop far before dissapearing, with-in approx 4 to 6 min the whole thing just \"dissapeared\"!. I was so SURE that something was happening that I was sure I would see it on the news, or a special report coming on tv. I was so sure that I called EVERYONE I could think of, the local news stations, the radio stations, the police department, the FAA, and I called the tower at the airport! NO ONE SAW ANYTHING!. I described what i saw and it seems that only myself and my brother and my landlady saw it. she has passed. I don't remember the exact date - but I rememeber exactly what I saw. Just wanted to pass this on - have you ever had a similar report?would appreciate your reply. Thank you for your time, Janna Schroeder."],"Weather Factors":"Unknown","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around September 30th 2001"],"Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-01292008-0011","Case Number":"9345","Disposition":"Insufficient Data","City":"Anchorage","Region":"Alaska","Date of the Event":"09/30/2001 12:00 UTC","Object Features":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=61.222446,+-149.891278(9345)&iwloc=A&hl=en\"> mufon case (9345) map </A>","Country":"United States","Longitude":"-149.891278"}