{"Country":"United States","Disposition":"Unknown","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.215024,+-115.978505(9354)&iwloc=A&hl=en\"> mufon case (9354) map </A>","Date Submitted":"12/21/2007 12:00 UTC","Viewing Distance":"Over One Mile","City":"Pahrump","Date of the Event":"12/21/2007 12:00 UTC","Latitude":"36.215024","Region":"Nevada","Source":"MUFON","trends":["There have been 12 other sightings in Pahrump","There were no other sightings in Pahrump on or around December 21st 2007"],"Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","divs":["Sighting Details+It was about 8 pm It was dark already and I heard a large amount of jets in the air. So I went outside and started counting the jets I counted approx: 10- or more when I looked west there was a arrow of lights it was 6 to 8 lights that formed a v but the point of the v was headed toward me. It was much bigger than the jets. The jets lights in the sky are about half the size of a pencil eraser, this thing was the size of a big pink school eraser. It was quiet the only thing you could hear was all the jets zooming around this object. It turned south and then all that you could see is 4 lights, two at each end of the object. The center was dark. It slowly moved south, and I lost sight of it because of my neighbors truck. I had called my husband and daughter out, he saw the object and my daughter saw it after it turned. Most of the jets followed the object, but I watched 2 jets circle the valley for awhile. This is very unusual I have never seen jets do this here I lived here 12 years. I knew this object wasn't anything I ever seen. I lived on air force bases for 14 years and I know the difference between aircraft and something unnatural."],"Log Number":"US-01302008-0005","Object Shape":"Triangle","Object Flight Path":"Path with directional change","Case Number":"9354","Summary":"Arrow of lights moving slow and silent with around 10 jets in the air","files":["/var/www/straped/mufon/html2text/9354.html.txt","/var/www/straped/mufon/org/9354.html"],"Longitude":"-115.978505"}