{"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=44.694229,+-75.486336(9355)&iwloc=A&hl=en\"> mufon case (9355) map </A>","Summary":"orange fireballs in Ogd,NY","Object Features":"Unknown","trends":["There have been no other sightings in Ogdensburg","This sighting has never been favorited."],"Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Tags":"City","City":"Ogdensburg","Longitude":"-75.486336","files":["/var/www/straped/mufon/html2text/9355.html.txt","/var/www/straped/mufon/org/9355.html"],"Date of the Event":"01/16/2008 06:10 UTC","Latitude":"44.694229","divs":["Sighting Details My son and young daughter was with me on Wednesday jan 16 I had just picked my son up from a meeting and was traveling towards the local airport when in the sky appears and orange ball that looked pointed on the top and the size of a small plane the object just appeared out of nowhere. Along with that object was a very bright star or planet in the eastern sky that caught our attention at first. Then this object appeared over the airport or NYS highway 68 heading to Canton,NY my son and I both said did you see that it lasted about a minute in duration, other people in the area must have seen it as well. Friday night the 18th my wife, son and I were headed to my other sons track meet in Canton, NY when we all witnessed the orange light together again just one at first and then up the road we witnessed about 6 orange lights in a horizontal position they appeared and then disappeared very quickly. My wife has been a skeptic and has had a problem with my interest in the UFO's but she even was questioning what it was. Again she was blaming the Ft. Drum scenerio as well.The week before my son was coming back from a track meet on a Friday and the whole bus reported seeing something strange that night as well. We lost sight of the objects because they just disappeared."],"Case Number":"9355","Log Number":"US-01302008-0006","Region":"New York","Source":"MUFON","Country":"United States","Disposition":"Unresolved","Date Submitted":"01/16/2008 06:10 UTC","Object Shape":"Cone, Fireball","Sighting Duration":"Undisclosed"}