{"Object Shape":"Blimp, Cigar","divs":["Sighting DetailsCarolyn While my husband and I were on the way to the movie, I noticed a blimp like shape in the sky. Thinking it was an advertisement from the blimp from the old Albertsons store (Park and N.W. Highway), we drove to check it out thinking how cool it was that is was all lit up. Once we got to that location, there was no blimp to be found. However, the blimp like object was still visible. It appeared to have very bright lights all around it and lights going through the center. I remember them being more green neon color in the center and white everywhere else. It pretty much stayed in the same location while we were looking at it. I kept trying to figure out if it said something. Never could figure it out. It was so large that I thought that some place locally was advertising. We were only there for maybe 5 minutes. Not putting much more thought into it, my husband and I went off to see our movie which started at 7:05 pm. It took us about 20-25 minutes to get to the movies. So I would say that we saw the blimp like object around 6:40 pm. The next day we heard about the UFO sighting in Stephenville and realized that what we saw must have been the UFO. The lights were too bright for it to be an airplane of any kind. We looked Stephenville up on the map and sure enough it was that exact direction that we were looking when we saw the blimp like object the night before. It's to coincidental that we saw something within the same time and same direction that the residents of Stephenville did. A UFO never even entered our minds at the time. But, I am a firm believer that what we saw was the same thing that was seen in Stephenville 100 miles away. I used to not think anything about UFO's. I really didn't believe in them. Now after that experience on January 8th, 2008 I am a believer that there are UFO's. Not necessarily extra-terrestrial, but something. Glenn I confirm everything that Carolyn said above and I wanted to add that I was driving and did not get to look at the object the entire time. I did get a good look at it when we arrived at the albertsons parking lot. We live by DFW airport and are very used to seeing aircraft of all kinds (every 5 mins or so). I was a redeye gunner while in the U.S. Army and received aircraft recognition training. This was in no way any aircraft I have ever seen. The entire time I saw the object it did not move, completely stationary. I have included a photoshop drawing of what we both agree we saw."],"Source":"MUFON","Region":"Texas","Object Features":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=32.940972,+-97.073715(9358)&iwloc=A&hl=en\"> mufon case (9358) map </A>","Sighting Duration":"Undisclosed","Tags":"City","Longitude":"-97.073715","Viewing Distance":"Unknown","Summary":"Observed a blimp shaped object with extremely bright lights.","files":["/var/www/straped/mufon/html2text/9358.html.txt","/var/www/straped/mufon/more/9358_submitter_file1__UFOWeSaw.jpg","/var/www/straped/mufon/org/9358.html"],"trends":["There have been 6 other sightings in Grapevine","There were no other sightings in Grapevine on or around January 8th 2008","This sighting has never been favorited.",""],"Country":"United States","Date Submitted":"01/08/2008 06:40 UTC","Disposition":"Unknown","Object Flight Path":"Stationary","Date of the Event":"01/08/2008 06:40 UTC","City":"Grapevine","Latitude":"32.940972","Weather Factors":"None","Case Number":"9358","Log Number":"US-01302008-0009"}