{"Tags":"City","Date of the Event":"01/28/2008 06:20 UTC","Date Submitted":"01/28/2008 06:20 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","Region":"New York","Source":"MUFON","Log Number":"US-01302008-0014","Summary":"Object appears to twinkle brightly in orbit to the eye, but through binoculars is bright lights in patterns.","Object Features":"Unknown","Latitude":"43.006359","Sighting Duration":"Undisclosed","Object Shape":"Circle, Sphere, Unknown","divs":["Sighting DetailsThe craft at first appeared to be an unusually bright and twinkling star. Which caught my eye shortly after returning from work and bringing in some firewood. So I watched it for a good min or so. Before deciding it was not any celestial body I was familiar with and seemed too deliberate in it's \"twinkle\". The object was obviously high above the earth and did not appear to be moving from it's general position. Which was not far above the tree line and to the SE of my position when first noticed it. I went and grabbed my astronomical binoculars and returned with it not having appeared to move. I focused on the craft and clearly made out intense bright lights which varied in pattern and color. The colors appeared to be red, green and white. The white light seemed particularly intense. There was a variation in speed of color change and pattern change. As well as varied patterns. Though hard to be certain it did appear to be a circle perhaps a sphere? But due to some of the patterns and the manner they appeared it seemed a circle. Honestly hard to be sure of a dark shape against a dark sky. The lights however were very visible and easy to make out as well as certain patterns. For example a circle of light alone made up of lights appearing to be on the edge of the craft. As well as patterns appearing on what appeared to be the bottom and a mixture of the two. It did seem to move but not in a rotational \"flying\" manner. It seemed to only move across the sky very slow as though stationary. As it was first noticed from the front walk and was followed over the hours to the side and back. There was another witness whom I called out to confirm what I was seeing and followed it off and on for the duration as well. They too used astronomical binoculars and actually were kind of startled. They could make out the lights and the changing of patterns and intensity as well. Though never under the impression that it was the ISS as I have observed it. We confirmed the ISS was not in the area. Further when it is it does not exactly linger. Likewise with satellites which it could not be for several reasons. Nor was it any type of airplane or helicopter. First it was far too high and second I live near an airport. I know what a plane and a chopper in the sky look like. Not to mention both actually went by as well in the course of the night and the difference was glaring to say the least. The sighting actually continues as I write this. This is now 1-30-08. It appeared in the same place and followed the same path tonight. I would imagine it could have been there last night too. It was overcast so I don't know."],"City":"Ballston Spa","trends":["There have been 2 other sightings in Ballston Spa","There were no other sightings in Ballston Spa on or around January 28th 2008"],"Country":"United States","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=43.006359,+-73.846731(9363)&iwloc=A&hl=en\"> mufon case (9363) map </A>","Case Number":"9363","Longitude":"-73.846731","files":["/var/www/straped/mufon/html2text/9363.html.txt","/var/www/straped/mufon/org/9363.html"],"Object Flight Path":"Stationary"}