{"Country":"United States","Object Flight Path":"Hovering then path","Tags":"City","Summary":"Things moving so quickly - changing paths on a dime - or so slowly you couldn't even see them until you realized the \"constellation\" had changed","Case Number":"9365","divs":["Sighting DetailsMy sister and I were camping at Baker Lake, Wa, with the family. We were outside in sleeping bags, looking at the stars - you know, how you make shapes with the stars - there was a triangle up above - gradually, we noticed the long end of the triangle had elongated - that was strange - and it was squiggling. Next, we saw what we thought was a light-house on the island in the lake - bright - like a star - but gradually, it too, became higher and higher over the island - slowly - so slowly, it squiggled over to the \"star\" of the triangle that had moved - elongated - this took several hours - then suddenly - like a flash - another \"star\" shot up over the island - incredibly fsst - then it took many minutes to \"squiggle\" over to the other two bright objects - they were now in a little triangle of their own - then they \"squiggled\" off together - so slowly, that you didn't even realize they were moving, except to see the distance now between other objects in the sky - so sneaky - at one point, they all shot out colored beams - green? red? blue? I don't quite remember - exept I ran into my folks' trailer and told them there were some UFO's in the sky - dad's response: if they offer you a ride, say NO. The next morning, when my sister and I recouted the story, he was irritated that we didn't wake him up - but we did try!!!! What was that? I have known all my life that it was not any airplanes, satellites, or anything that we have. THey were able to change course on a dime - and they were so Danged sneaky - moving so slowly - and then so fast when they wanted to....? Squiggling off into oblivion. All together like they were meeting up....."],"Viewing Distance":"Over One Mile","Source":"MUFON","Log Number":"US-01312008-0001","Longitude":"-121.635866","City":"baker lake","Date of the Event":"05/31/1964 12:00 UTC","Region":"Washington","Latitude":"48.722323","files":["/var/www/straped/mufon/html2text/9365.html.txt","/var/www/straped/mufon/org/9365.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=48.722323,+-121.635866(9365)&iwloc=A&hl=en\"> mufon case (9365) map </A>","Disposition":"Unknown","Date Submitted":"05/31/1964 12:00 UTC","Weather Factors":"None","Object Shape":"Star-like","Sighting Duration":"04:00:00","trends":["There has been one other sighting in baker lake","There were no other sightings in baker lake on or around May 31st 1964"],"Object Features":"Unknown"}