{"Object Shape":"Unknown","divs":["Sighting DetailsOK, HERE GOES, HAVE THREE OTHER WITNESS'S WHO WERE WITH ME AT THE TIME. I LIVE IN THE COUNTRY, THERE ARE SOME DAYS, THE AIRFORCE HAVE DOGFIGHTS AT NIGHT, USING FLARES, AND THERE IS AIR- FREIGHT COMPANY IN WILMINTON, OHIO. I LOOK OUT THE BACK DECK AND SAW AIR CRAFT LIGHTS, I THOUGHT ANOTHER TEST FIGHT BETWEEN AIRCRAFT. I GRAB MY CAMERAS..35 MM. \" RAYMOND , RYAN \" & \"NAOMI\".. ASK WHERE ARE YOU GOING ? I SAID, LOKS LIKE ANOTHER DOG FIGHT\". I WAS \" WRONG\".. THERE WERE {5 } AIRCRAFT, BUZZING THE FIELD, SUDDENLY, { 3 } OTHER AIRCRAFT TURED ON THEIR LIGHTS FROM ACROSS THE FIELD, AND JOIN THE OTHER, BUT THESE CRAFT WERE GOING VERY SLOW ALSO . THESE CRAFT WENT UP AND DOWN AND SIDE WAYS.. THEY WERE DIPPING LOW IN THE RAVINE & COMIMG UP VERY SLOW. ONE CRAFT WOULD MOVE SLIGHTY, THEN GO BACK TO WHERE IT WAS. I HAVE PHOTO'S, BUT THEY ARE TIME LASP.HERE COMES THE INTERESTED PARTS..EVERYTIME A CARGO JET WOULD COME BY...THESE THINGS WOULD TURN OFF THERE LIGHTS, AND THEN TURN THEM ON AGAIN WHEN THE JETS LEFT. THIR LIGHTS WOULD GO FROM DIM TO BRIGHT...THIS WENT ON FOR HOURS, ALONG WITH A FEW METEORS. I WENT OUT INTO THE FIELD AND YES, I WAS ARMED\" I WALKED OUT ABOUT 300 YARDS, AND THE THINGS TURNED OFF THEIR LIGHTS, OR DIM THEM VERY LOW...SO I CAME BACK, THE BOYS ASK ME ' WHAT IS GOING ON, I SAID , I DON'T KNOW, BUT IT LOOKS LIKE THEY ARE LOOKING FOR SOMETHING OVER THER. THESE GUYS ARE 19 YEARS OLD. AT 4 AM IN THE MORNING THE GUYS WERE STILL UP\" SCARED, OR WORRIED, , BECAUSE ONE LIGHT WAS STILL OUT IN THE FIELD, DIMING IT'S LIGHT EVERTIME AN AIRCRAFT WOULD GO BY. NEXT MORNING THERE WERE LOTS MILITARY AIRCRAFT\" THERE WAS NO NOISE FROM THE CRAFTS. IF WANT WANT THE PHOTO'S, YOU CAN HAVE THEM, OR WOULD YOU LIKE THE NEGATIVES. MY HOBBIES ARE, AMATURE ASTROPHOTOGRAPHY, AND SOME LAPIDARY ..I HAVE NEWSPAPERS, WITH MY PHOTO'S, THAT I HAVE TAKEN..\"COMETS\" LUNER ECLIPES,...MY NEW PHONE NUMBER IS NOW 937 -648 -7507...MOVED TO DAYTON..TEMPORARY"],"trends":["There has been one other sighting in Greenfield","There were no other sightings in Greenfield on or around September 30th 2006","This sighting has never been favorited.",""],"Region":"Ohio","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Weather Factors":"None, Unknown","Date of the Event":"09/30/2006 12:00 UTC","Longitude":"-83.381263","City":"Greenfield","files":["/var/www/straped/mufon/html2text/9366.html.txt","/var/www/straped/mufon/more/9366_submitter_file1__MapC.Dessecker.jpg","/var/www/straped/mufon/org/9366.html"],"Tags":"City","Log Number":"US-01312008-0002","Latitude":"39.356258","map":"<A HREF = \"http://maps.google.com/maps?q=39.356258,+-83.381263(9366)&iwloc=A&hl=en\"> mufon case (9366) map </A>","Disposition":"IFO","Source":"MUFON","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/30/2006 12:00 UTC","Country":"United States","Object Features":"Unknown","Summary":"LOTS OF UNKNOWNS AIRCRAFT","Sighting Duration":"Undisclosed","Case Number":"9366"}