{"Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/9373.html.txt","/var/www/straped/mufon/org/9373.html"],"Date of the Event":"01/30/2008 09:50 UTC","Summary":"SIghting in Myrtle Beach, SC. Seen in the South, South-East Skies. A Disc-like object was observed, with a couple red and white lights, and an almost orange colored blinking light. There were many lights, and appeared to be around the entire object.","Viewing Distance":"Unknown","Object Features":"Unknown","Source":"MUFON","Weather Factors":"None","Sighting Duration":"00:32:00","Latitude":"33.69889","Country":"United States","Tags":"City","Date Submitted":"01/30/2008 09:50 UTC","trends":["There have been 52 other sightings in Myrtle Beach","There were no other sightings in Myrtle Beach on or around January 30th 2008"],"Case Number":"9373","Longitude":"-78.882544","Disposition":"Unknown","City":"Myrtle Beach","divs":["sighting detailsmyrtle beach, sc 1\\30\\2008 9:30pm est: my husband and i went outside, on our porch like we do every evening. our porch faces the southern skies, and since we live on a dark street, we enjoy watching the stars, listening to crickets and enjoying the evening. tonight tho, it was unusually quiet. i did hear neighbors dogs barking, and my dog, a maltese was barking also. at 9:45, my cat was at the door, wanting to go in, which is unusual for her, since she is a predominantly outdoor cat. at about 9:50pm i kept noticing an object in the sky, with red and white lights, sometimes an orange-like light would blink. it was about 1\\4 the size of a full moon, disc shaped and the lights were arround the entire object. it was about 10x larger than the brightest biggest star in the sky, and appeared motionless for about 15 minutes. my husband, who does not believe in ufo's stood in disbelief at what we were seeing, and ran inside to find binoculars. i continued to watch the object, almost in a trance. i marked a banister on my porch, to see if the object was moving at all, and after 15 minutes, it seemed to be moving in a south-southeast direction at a very slow pace. it stopped again for about 5 minutes. i called my neighbor at 9:57pm and she came running over. she also witnessed this and just kept saying \"that is so weird.\" she watched for about 10 minutes and went home to tell her husband. my husband came outside, unable to find the binoculars, and saw it was still out there. he went in to take an incoming phone call. still watching, i observed a shooting star, just below this object, and for 2 minutes the object seemed to be blinking more. then it disappeared. i was in complete awe of this sighting. at first i wanted to run inside and watch from inside, but i was almost in a trance, watching, in disbelief. i knew from the first sighting that it wasnt an airplane. we live between myrtle beach and charleston airports, and i often see planes at night and day. this was definitly not an airplane. they move and this object was stationary for a very long time. i wish i had a camera with a high zoom, so i could have proof of my sighting. i did send an email to ireport@cnn.com, but received no response."],"Object Flight Path":"Stationary","Log Number":"US-01312008-0009","Region":"South Carolina","map":"<A HREF = \"http://maps.google.com/maps?q=33.69889,+-78.882544(9373)&iwloc=A&hl=en\"> mufon case (9373) map </A>"}