{"divs":["Sighting DetailsMy husband and I were outside on our patio having a cigarette. We see many airplane and helicopter lights at night as we live only 3 miles south of I-94 and survival flight copters travel the highway for traffic accidents. The Detroit metro airport is less than an hour away as well. A survival flight happened to be traveling west bound parallel with I-94 that night and I looked up to watch for a second. After the helicopter was past, I noticed another object just south of the path the copter had just taken, but it was not making any noise and was not moving as fast as all other airplanes and copters we normally see. We can always hear the copters and most airplanes depending on how high they are in the sky. This object was moving slow and steady and making no noise. The lights on the object were also different. There were three I could see making the shape of a triangle, hence the reason I think the object itself was shaped like a triangle. The lights were dimmer - kind of hazy, not blinking and larger in diameter than lights on airplanes and copters. I couldn't guess as to how close the object was due to it being dark. I said to my husband, \"What the hell is that? Do you see that?\" and even tried to point it out to him to see, my finger following it's path as it traveled, but he didn't see it. By the time he focused in on the area I was pointing to (remember it was dark), the object was gone. The last thing I saw was it rotating slightly to the left - looking like it tipped toward the sky and disappeared. I asked my husband if he knew of anything shaped like that and was silent while in flight. I explained what I saw to him and he said nothing came to mind that he knew of. He's an army kid and is a military weapons and aircraft buff - believe me we watch a LOT of the military channel due to this passion. Now I've never before seen anything like this. I've never witnesses anything I couldn't explain away thinking it was something military or the like. I do believe there could be other types of intellegance out there, but have never seen anything personally that would back up this thought. I'm a sane person and hold a good job. I have a level head and would usually blow something like this off, but it keeps popping up in my mind what I saw and I just needed to see if anyone else saw the same thing in my area. I really did not know where to look for reports like this in my area as there are so many sites online that cover this topic. As always, you never know which sites are the most respectable or reputable. I hope yours is one of them. :)"],"Object Shape":"Triangle","files":["/var/www/straped/mufon/html2text/9377.html.txt","/var/www/straped/mufon/org/9377.html"],"City":"Grass Lake","Disposition":"Unknown","trends":["There have been no other sightings in Grass Lake","This sighting has never been favorited."],"Latitude":"42.250869","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=42.250869,+-84.213008(9377)&iwloc=A&hl=en\"> mufon case (9377) map </A>","Date Submitted":"01/12/2008 09:00 UTC","Viewing Distance":"Unknown","Summary":"Witnessed triangular object with dim lights on corners moving across the sky to the east at a steady but slower speed. Object rotated slightly and disappeared.","Longitude":"-84.213008","Object Flight Path":"Path with directional change","Log Number":"US-01312008-0011","Source":"MUFON","Country":"United States","Case Number":"9377","Tags":"City","Object Features":"Unknown","Date of the Event":"01/12/2008 09:00 UTC","Region":"Michigan","Weather Factors":"None"}