{"divs":["sighting detailsi was driving home from returning two videos to hollywood video, just a few minutes ago, and as i always do when driving on that street, i looked out east when i got to the top of the hill. i noticed an unusual light pattern flying over and then east of my location (southeastern colorado springs, in the widefield\\security suburb). it was triangular, with solid white lights on the three corners of the triangle, and a flashing red light in the center. the object was flying slowly, and moving almost due east. i live near an airport and am very familiar with the various types of airplanes and what they look like at night. this was no airplane, at least not one in use by that airport. there were no unusual feelings accompanying this sighting. i lost sight of the object when the houses i was driving past obscured it, and by that point it was too far out east for me to be able to get my nikon and take a photo. i always carry a small point-and-shoot digital camera with me, but it wouldn't have been able to take any kind of decent photo of the night sky. this seems to be a standard \"black triangle\" type ufo."],"Source":"MUFON","Sighting Duration":"00:01:00","City":"Colorado Springs","Object Flight Path":"Straight-line path","Longitude":"-104.812363","Date of the Event":"01/31/2008 08:38 UTC","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9379.html.txt","/var/www/straped/mufon/org/9379.html"],"Summary":"Triangular UFO seen flying East","Log Number":"US-01312008-0013","Disposition":"Unknown","Latitude":"38.841762","Object Features":"Unknown","Object Shape":"Triangle","Country":"United States","Case Number":"9379","Tags":"City","Viewing Distance":"Over One Mile","Region":"Colorado","map":"<A HREF = \"http://maps.google.com/maps?q=38.841762,+-104.812363(9379)&iwloc=A&hl=en\"> mufon case (9379) map </A>","trends":["There have been 106 other sightings in Colorado Springs","There were no other sightings in Colorado Springs on or around January 31st 2008"],"Date Submitted":"01/31/2008 08:38 UTC"}