{"files":["/var/www/straped/mufon/html2text/9380.html.txt","/var/www/straped/mufon/org/9380.html"],"divs":["Sighting DetailsIn 1974, I lived in Huntsville Ala. on Monte Sano Blvd. located on a small mount overlooking Grass Valley. It was about 1 or 1:30 AM, I was in the study doing homework and noticed that the neighborhoods Dogs were all howling. I went outside to investigate what might be causing all of the animals to behave as such. I listened for distant sirens and all was quiet except for the howling dogs. Looking SW,and two bright lights cought my attention. They were coming toward where I was standing in front of the house. The night sky was clear and starlighted. The two white lights (halogen like) continued to approach, and as they grew nearer I felt slight rush of fear. I stood and watched as they passed directly overhead with the realization that this was not an airplane. The object seemed very large, did not make any sound as it glided overhead. As it passed I noticed that the objects shape was clearly visible against the starlit sky. It was shaped similar to our modern stealth bomber, but much larger. It had on front the two bright white lights and lights near the wing tips underneath similar to running lights, (the one on the right was yellow-green and the left was violet-blue). There were no other visible lights on the object. Looking up at it as it passed you could see shimmering lights as if the stars above were shining through the skin of the aircraft. A few minutes later, looking toward the same direction this object came from, I spotted another pair of lights. As these grew nearer I could hear the sound of jet engines and could see as they flew overhead that they were a pair of military fighter aircraft, seemingly tailing the other object. The direction and path that this event happened in nearly followed the exact path that a tornado did during the super weather event of April 4,1974. When it was all quiet again I went back inside and wondered who to call to report what I witnessed. I called a local FM radio station, reported the incident to the female night DJ, asked if there were any other people with similar reports. The response was no, and she proceeded to announce on air a reference to my call and her wanting to smoke what ever she assumed the excited caller had been smoking (which I was not!). Since that time, whenever I'm involved in conversation on the subject of unexplained phenomenon, I have told others my personal observation and get a reaction similar to what I recieved that night from the radio DJ."],"Object Flight Path":"Straight-line path","Summary":"Clear moonless night, was doing homework, heard neighborhood dogs howling, went to investigate and noticed off in distance what appeared to be aircraft landing lights approaching.","Object Shape":"Triangle","Disposition":"Unknown","Date Submitted":"11/20/1974 01:30 UTC","Region":"Alabama","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=34.737469,+-86.578244(9380)&iwloc=A&hl=en\"> mufon case (9380) map </A>","Source":"MUFON","Longitude":"-86.578244","Log Number":"US-01312008-0014","Country":"United States","trends":["There have been 17 other sightings in Huntsville","There were no other sightings in Huntsville on or around November 20th 1974"],"Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Latitude":"34.737469","City":"Huntsville","Weather Factors":"Unknown","Date of the Event":"11/20/1974 01:30 UTC","Case Number":"9380","Sighting Duration":"Undisclosed"}