{"Object Features":"Unknown","Sighting Duration":"Undisclosed","City":"Sacramento","Log Number":"US-01312008-0015","Region":"California","Case Number":"9381","Longitude":"-121.49186","Country":"United States","Date of the Event":"01/29/2008 10:15 UTC","Object Flight Path":"Hovering then path,Path with directional change","files":["/var/www/straped/mufon/html2text/9381.html.txt","/var/www/straped/mufon/org/9381.html"],"Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.590982","divs":["sighting detailsi exited the \"p\" street exit off of buiness 80 west into downtown sacramento & stopped at the light off the exit for approx. 2 min. while waiting, i noticed a very amber\\dark orange light in the sky above me. it twinkled a bit, but not for long. at first i thought it must be some sort of airplane or helicopter but then it started to make very sudden zig zag movements to the right and then vanished into the clear sky. (dispite all the bad weather lately, it was actually one of the clearest nights in sacramento, ca in a while!) once the light i was stopped at turned green & i began to drive toward home, i continued to try & locate what i had seen, but it never appeared the rest of the way home. (about 10 min.) i have seen many falling stars, bright planets\\bright twinkling stars\\ helicopters\\airplanes w\\ blinking lights etc...this was nothing of the sort. it was very distinct! and very unusual. as much as i do believe in the possibility of ufo's, i've always been extremely skeptical! this sighting however, actually proved to me that something is definitely out there. i was not afraid, i could not wait to get home & tell my husband who is very fasinated w\\ such things. he always talks about things he reads regarding ufo's and is always trying to get me more interested in looking at the stars etc...just for scientific education. we both have always found crop circles to be very amazing & interesting! so upon telling him my experience, he suggested that i write to you. hopefully my story can spark some interest into possible ufo's and the sacramento, ca area. (a sketch of my experience is coming soon)"],"Object Shape":"Sphere, Star-like","Tags":"City","Summary":"Amber colored light zig zagged across sky & disappeared","Source":"MUFON","Date Submitted":"01/29/2008 10:15 UTC","Weather Factors":"Unknown","trends":["There have been 83 other sightings in Sacramento","There were no other sightings in Sacramento on or around January 29th 2008"],"Disposition":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=38.590982,+-121.49186(9381)&iwloc=A&hl=en\"> mufon case (9381) map </A>"}