{"Object Shape":"Sphere","Case Number":"9386","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"CHROME LIKE SPHERE TRACKING 737","City":"Nashville","Longitude":"-86.775603","Date of the Event":"09/15/1987 12:00 UTC","divs":["sighting detailsi wrote this up for some ufo group back in 1987 but i have put my thoughts on youtube.com recently. we were flying from newark to nashville , tenn on either sept 15 or 16 in 1987 for an iapd convention. a bunch of plastic people. about 30 mins out of nashville just before our descent i noticed a shinny sphere about30 degrees in front of my perpendicular out the side of the plane. it was on the right side and about the same alitude as us. this went on for about 10 mins.during this time i spoke to a bob scheffler about the object . he claimed it was a plane until i asked him if he saw a tail or wings .. then he said your right it is a ufo. i got out of my seat and asked all the passengers if they could see it. they said yes.... i went back to my seat and then as it kept pace with us.. it dove away and immediately zoomed up into the cloud base. in a flash. maybe a second. it was i think at that exact time that we started our decent. perhaps when the pilot pulled back on the throttle or nosed down the zoom thing happened. the pilot denied there was anythinghtere. i called the traffic controllers and sent in a report to some organization. maybe in new england, i can't remember. the sphere was 10-15 feet in diameter and about 1\\4 to 1\\2 mile away..is my best guesstament. i do not know the county. joe dupont"],"Viewing Distance":"501 Feet - 1 Mile","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.16729,+-86.775603(9386)&iwloc=A&hl=en\"> mufon case (9386) map </A>","Region":"Tennessee","Date Submitted":"09/15/1987 12:00 UTC","files":["/var/www/straped/mufon/html2text/9386.html.txt","/var/www/straped/mufon/org/9386.html"],"Object Features":"None","Latitude":"36.16729","Tags":"City","trends":["There have been 72 other sightings in Nashville","There were no other sightings in Nashville on or around September 15th 1987","This sighting has never been favorited.",""],"Log Number":"US-02012008-0005","Disposition":"Unknown"}