{"files":["/var/www/straped/mufon/html2text/939.html.txt","/var/www/straped/mufon/org/939.html"],"City":"Del Rio","Object Features":"Other","Summary":"Late 70s, memory of seeing large vessel in the sky","Latitude":"29.370886","Longitude":"-100.895867","Region":"Texas","Disposition":"Unknown","Source":"MUFON","Weather Factors":"Lightning, Light","Object Flight Path":"Straight-line path","Country":"United States","Object Shape":"Unknown","trends":["There have been 12 other sightings in Del Rio","There were no other sightings in Del Rio on or around"],"Viewing Distance":"Over One Mile","divs":["sighting detailsfirst, i apologize for the apparent lack of answers above. this is something iremembered friday, nov. 17, 2000. the event happened in del rio, tx. the best ican give you about when is between the years of 1973 and 1977, between the timesi was 5 and 10 years old. i was standing in the front yard of my grandparentshouse. it was nighttime, it was dark. the weather above was crystal clear, butmiles to the north it was overcast with lightning. i was looking to the north,watching the approaching storm. lightning flash in the stormclouds, and i saw alarge vessel in the clouds. it was illuminated from the back, providing asilhouette, and from the side, providing a front view. it was apparently verylarge, on the order of several hundred yards. it had several shapes associatedwith it. a large, horizontal, cylinder (1\\2 the height26 1\\2 the length) and vertical rectangle (separated from cylinder) on the top1\\2 of the vessel. another rectangle, horizontal, connected to verticalrectangle, extending as a rear end. two smaller horizontal rectangles along thebottom. it was travelling west, and was not visible after the lightning flashes.i get the impression that it was using the clouds as cover. the entire incidenttook, at most, 1 1\\2 minutes. i am sorry about the poor visual description. ifnecessary, i can sketch it for you, but i am not an artist, either! dont knowwhy i didnt remember until the age of 33, but that is what i remember. i amsending this to you primarily as a cross-reference tool for you."],"Date of the Event":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=29.370886,+-100.895867(939)&iwloc=A&hl=en\"> mufon case (939) map </A>","Sighting Duration":"00:00:59","Log Number":"","Case Number":"939","Tags":"City","Date Submitted":"11/18/2000 10:31 UTC"}