{"City":"San Diego","Weather Factors":"None","Sighting Duration":"00:00:15","files":["/var/www/straped/mufon/html2text/9393.html.txt","/var/www/straped/mufon/more/9393_submitter_file1__UFO.jpg","/var/www/straped/mufon/more/9393_submitter_file2__UFO2.jpg","/var/www/straped/mufon/more/9393_submitter_file3__UFO3.jpg","/var/www/straped/mufon/org/9393.html"],"Summary":"Rectangular T-shaped object seen from my house. It was viewed from the rear of the UFO. The UFO was fairly close to my vantage point.","Longitude":"-117.147775","Country":"United States","Tags":"City","Disposition":"Unknown","trends":["There have been 151 other sightings in San Diego","There were no other sightings in San Diego on or around September 5th 2006","This sighting has never been favorited.",""],"Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Viewing Distance":"101-500 Feet","Case Number":"9393","Date Submitted":"09/05/2006 08:00 UTC","Region":"California","Object Features":"Unknown","Date of the Event":"09/05/2006 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.722569,+-117.147775(9393)&iwloc=A&hl=en\"> mufon case (9393) map </A>","Latitude":"32.722569","Log Number":"US-02022008-0002","Source":"MUFON","Object Shape":"Square, Rectagular","divs":["sighting detailsthe date of the sighting was the night september 5th, 2006. i arrived at my bathroom ready to take a shower at around 8 pm pst. from the corner of my eye i saw an object accelerating away from me to the south. when i saw the object i immediatly clearly did not think it was an airplane,helicopter, or baloon, but something else. the object was a t-shaped object and was rectangular in shape. it seemed to be no bigger than a small house.i had a good view of the back of the object and some view of its top. i estimated that it was several hundred feet in the air. in the back it had what looked like a thruster in the center and a light on either side. there also seemed to be a light on the top of the object as well. the color of the lights\\thruster was a bright blue glow. the lights were blinking and they seemed fairly small. it certainly did not sound like an airplane at all and was very quiet. it hovered for 3-5 seconds then accelerated.it was a low frequency rumble as it accelerated. it did not make any erratic motions, it continued to head south at remarkable speed and within 10-15 seconds it was gone from my viewpoint. during the encounter i was in complete amazement and awe. i stood there for the duration and just watched it. after the sighting i rushed into my mother's room and told her that i had just seen an ufo. then i ran downstairs and told my dad. i took a quick shower and i headed outside with my dad. outside in my backyard i heard a low grumbling noise and noticed a object with lights blinking about a mile away(my house over looks a large hill), it seemed close to miramar airforce base. it headed north towards a commercial center northeast of my house. it flew near\\ between two tall buildings and seemed to be going in a zig-zag motion and then accelerated northward. finally after about a couple minutes i could not see the object anymore. i heard the same low grumbling noise for some time afterwards. -------------- this narrative was based on my memories of my experiences of that night and my report i typed that same night on a ufo discussion website: http:\\\\www.alienhub.com\\showthread.php?t=313 the attachments below are sketches of the ufo along with descriptions of what i saw on that night(sorry they're bad quality) i am interested to see if the airbase picked up anything unsual on their radar on that particualar night. also i can take a polygraph test and undergo hypnosis if neccesary. if you have any questions please email me - thanks"]}