{"Longitude":"-119.195567","Weather Factors":"Windy","trends":["There have been no other sightings in Echo","This sighting has never been favorited."],"files":["/var/www/straped/mufon/html2text/9398.html.txt","/var/www/straped/mufon/org/9398.html"],"Latitude":"45.742354","Date Submitted":"07/04/2005 02:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.742354,+-119.195567(9398)&iwloc=A&hl=en\"> mufon case (9398) map </A>","Country":"United States","Object Shape":"Circle, Sphere","Object Features":"Unknown","Summary":"7 balloon objects","Tags":"City","Case Number":"9398","Disposition":"Unknown","divs":["Sighting DetailsI was coming back from talking a walk along the creek where I lived in Echo, Oregon on the 4th of July, 2005. I noticed in the sky (which was clear and blue) 7 objects clustered together which appeared, at first, to be a bunch of kids balloons floating high in the sky. It was the fourth of July and I thought some kid had lost his balloons from a nearby town that was 10 miles away. I was facing East and the wind was blowing fairly well at maybe 15 mph from West to East (the normal prevailing wind in that area) however, the \"balloons\" were traveling from North to South. There was a farmer's orange wind sock nearby (which is used for crop dusting) which verified the wind direction. I thought maybe the upper winds might be blowing differently than the ground winds and that might account for what I was seeing. I watched the \"balloons\" more carefully then while I was wondering about them and estimated their altitude to be approximately 2000 to 2500 feet high, IF, they were normal size kids balloons. I estimated their speed to be approximately 40 mph IF they were normal sized kids balloons. While I was observing them more closely, I noticed there were 7 \"balloons\", which were of the same color of the sky and would be very difficult to notice unless viewed directly. They were not bobbling around like balloons would, but rather, they were moving uniformly in loose formation all together as if a coordinated flight of aircraft. I then noticed that the leading 3 balloons were slowly separating from the trailing 4 balloons and were obviously on a slightly separate course from each other and were widening their position from each other as they continued South across the sky. At this point in my observation, the lead 3 balloons seemed to make a very slight course change for several seconds and then recorrect because, all 3 at one time had what was undoubtedly, sun reflections appear horizontally across the width of each balloon sphere. The trailing 4 balloons did not have these sun reflections and continued to widen their separation from the leading 3. After approximately 5 seconds, the leading 3 balloons appeared to correct their course and the sun reflections disappeared from them at the same time. After this, the objects were too far away and too close to the sun to see. I want to say at this point I did NOT think these objects were extraterrestial. I DID think the united states air force has something they are not telling us about, and this is still my impression of what I saw to this day."],"City":"Echo","Sighting Duration":"00:05:00","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"07/04/2005 02:00 UTC","Log Number":"US-02022008-0007","Source":"MUFON","Region":"Oregon"}