{"Object Features":"None","Date of the Event":"09/15/2000 09:30 UTC","Summary":"first started like shooting star,split in 2 ,did 90deg.turn spread into huge golden fire ball and went strait down into forest.disapeerd.","divs":["Sighting DetailsA FRIEND AND I WERE DRIVING FROM LORAIN OHIO TO COLUMBUS OHIO FOR ELECTRONIC MUSIC PARTY TITLED STRANGLEY \"TRANSFORMATION\". DATE WAS SOME TIME BETWEEN 1999-2001 DATE CAN BE CONFIRMED. I WAS DRIVING MY BLUE CHEVY CAVALIER ON 71 SOUTH THE FASTEST WAY TO MAKE THE TRIP. WE MADE IT PROBABLY MORE THAN HALFWAY TO COLUMBUS IT WAS PITCH BLACK OUT AT THE TIME AS ANY BODY WHO TRAVELS THAT STRETCH OF 71 SOUTH KNOWS IT IS QUITE DESOLATE. OF COURSE AT TIME OF SIGHTING THERE WAS NO TRAFFIC ON FREEWAY. IT WAS COMPLETE BLACKNESS BEHIND US NO CAR HEADLIGHTS COULD BE SEEN AND A SEMI TRUCK WAS WAY WAY AHEAD OF US I COULD BARLEY SEE ITS TAIL LIGHTS,WHEN ALL OF A SUDDEN I LOOK UP THRU MY FRONT WINDSHIELD AND I POINT OUT TO MY FRIEND JARED \"LOOK A SHOOTING STAR\" THE \"SHOOTING STAR\" WAS TRAVELING LONGITUGIONAL AT A GREAT DEAL OF SPEED AND I WAS EXPECTING IT TO JUST DISPERSE LIKE SHOOTING STARS DO...BUT IT DIDNT IT KEPT TRAVELING STRAIT ACROSS OUR FORWARD POINT OF VIEW AND GOING AND GOING FOR @ LEAST 45 SECONDS .MY FOOT LIFTED OF THE GAS A BIT AS WE WERE WATCHING IN DISBELIEF AND WE SLOWED WAY DOWN AND WATCHED ,THEN IT STARTED TAKING THE STRANGE DIRECTORY OF A MISSLE CHANGING DIRECTIONS TO HEAD TWORDS EARTH .JARED POINTED OUT IT REALLY LOOKED LIKE IT WAS A MISSLE ATTACK, IT MOVED TO A 90 DEGREE ANGLE IN 3 SHARP TURNS BY THE 2ND TURN THIS THING SPLITS IN TWO OBJECTS AND FOLLOWS JUST A TINY BIT A HEAD OF THE OTHER FOLLOWING THE SAME TRAJECTORY TO COMPLETE THE 90 DEGREE TURN STRAIT TWORDS THE EARTH THIS WAS ALL HAPPENING ABOUT 2 TO 3 MILES UP IN THE AIR AND AT TREMENDOUS SPEEDS, WHEN THE OBJECTS COMPLETED THE 90 DEGREE TURN ABOUT A MILE OR TWO UP IT HEADED STRAIT TWORD THE GROUND THEN ABOUT A MILE OFF THE GROUND ,IT NOT REALLY EXPLODED BUT MORE LIKE FORMED INTO A GIANT, GIANT GOLDEN (A GOLD IVE NEVER SEEN BEFORE) WHAT I CAN ONLY EXPLAIN AS A FIRE BALL WHITH A BRILLIANT WHITE GIANT ORB IN THE CENTER, IT LOOKED ALMOST ANGELIC IN ITS COLORS, THEN WE WATCHED AS WENT STRAIT DOWN TWORDS THE GROUND BEHIND THE FOREST THAT WE WERE TRAVELLING PARRALEL TO, TO THE FRONT RIGHT IN FRONT OF US ABOUT A MILE BACK INTO THE WOODS, NOW THE REALLY STRANGE THING WAS... WE WERE ALREADY IN SHOCK, EXPECTING TO SEE A HUGE EXPLOSION AS IN MUSHROOM CLOUD HUGE I WAS GRIPPING THE STEERING WHEEL EXPECTING TO MAKE AN EVASIVE MANUVER BUT......THERE WAS NOTHING NO EXPLOSION NO NOISE.NO LIGHTS BEHIND THE WOODS NO FIRE NO VIBRATIONS NOTHING...NOTHING BUT SILENCE AND THE PITCH BLACKNESS OF CENTRAL OHIO THERE ARE NO STREET LIGHTS IN THAT SECTION OF THE HIGHWAY , SO WE WHERE REALLY IN DISBELIEF WHEN WERE A SECOND AGO BATHED IN GOLDEN LIGHT THEN THER WAS NOTHING BUT DARKNESS BESIDES MY DIM HEADLIGHTS WE HAD SLOWED FROM ABUT 75 MPH TO ABOUT 20 MPH WE SAT THERE STUNNED THERE WERE NO OTHER CARS FOR MILES. THE DURATION OF THE EVENT LASTED ABOUT 3 TO 4 MINUTES GIVE OR TAKE A MINUTE EVRYTHING SEEMED TO SLOW DOWN . I CAN BEST DESCRIBE THE DISTANCE THIS THING TRAVELLED AS \"FROM THE FAR LEFT VIEW OF MY WIND SHIELD ---ALL THE WAY ACROSS MY FIELD OF VIEW TO THE RIGHT SIDE OF US AND THE TURN OCCURED TWORDS THE RIGHT SIDE OF MY FIELD OF VIEW AND THE EXPANSION INTO THE FIRE BALL OCCURED TO THE FARTHEST RIGHT FIELD OF VEIW FROM THE FRONT WINDSHIELD WE NEVER HAD TO LOOK OUT THE SIDE WINDOWS, IT ALL OCCURED RIGHT IN FRONT AND UP WERE WE HAD TO ALMOST LEAN A LITTLE FORWARD TO SEE IT MORE CLEARLY. IN OHIO YOULL SEE MANY SHOOTING STARS BUT IN ALL MY TIME OF BEING IN RUAL AREAS IVE NEVER SEEN THIS BEHAVIOR IN \"SHOTINGSTARS THEY USUALLY FLASH IN AND FLASHOUT WITH IN SECONDS & MOVE MORE NATURALLY. THIS THING MOVED MORE MECHANICLLY, AS IF STEERED OR DIRECTED, AND IT SPLITTING IN TO TWO DISTICNT OBEJECTS ALMOST RACING TWORDS THERE DESTINATION. WE CONTINUED OUR TRIP TO COLUMBUS AND MADE IT TO THE PARTY WITHIN ABOUT 45MINUTES TO AN HOUR WE WALKED AROUND IN A BIT OF A DAZE TELLING A COUPLE PEOPLE OF WHAT WE SEEN. BUT NOT MANY,IT WAS KIND OF DRAINING TO BE HONEST. ANOTHER CRAZY THING WAS I MET 2 GIRLS THERE FROM OUR AREA WHO I ENDED UP REALLY CONNECTING WITH FOR A FEW YEARS. LATER THAT SUMMER JARED PAINTED A PICTURE OF THE EVENT THAT BROUGHT BACK REALLY CRAZY FEELINGS AS IF SOMETHING DEEPER HAD OCCURED. IM NOT SURE IF ANY ONE EVEN BELIVES US . FOR FEAR OF SOUNDING CRAZY I RARELY SPEAK OF IT BUT THINK ABOUT IT AND ACTUALLY DREAM ABOUT IT OFTEN."],"Longitude":"-82.989544","Viewing Distance":"Over One Mile","Country":"United States","Sighting Duration":"Undisclosed","Log Number":"US-02022008-0010","Case Number":"9401","Latitude":"39.967136","Object Shape":"Bullet, Missile, Fireball, Flash","Disposition":"Insufficient Data","Source":"MUFON","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=39.967136,+-82.989544(9401)&iwloc=A&hl=en\"> mufon case (9401) map </A>","files":["/var/www/straped/mufon/html2text/9401.html.txt","/var/www/straped/mufon/org/9401.html"],"Region":"Ohio","City":"Columbus","Date Submitted":"09/15/2000 09:30 UTC","trends":["There have been 70 other sightings in Columbus","There were no other sightings in Columbus on or around September 15th 2000"],"Tags":"City","Object Flight Path":"Straight-line path,Path with directional change"}