{"files":["/var/www/straped/mufon/html2text/9402.html.txt","/var/www/straped/mufon/org/9402.html"],"Latitude":"43.16444","Source":"MUFON","Country":"United States","Object Features":"None","trends":["There have been 53 other sightings in Rochester","There were no other sightings in Rochester on or around May 29th 2005"],"Tags":"City","Date Submitted":"05/29/2005 10:30 UTC","Longitude":"-77.604732","divs":["Sighting DetailsWell, im an 11th grader at Hilton Highschool. Im not an outsider looking for some attention or publicity. Me and my friends have become local celebritys at our high school due to an event that has occured in 2005. It all started May 29th 2005. Around 9 pm Ryan Williams 8th grdae, Keith Poloats 8th grade, Kyle collins 7th grdae, Derick Houser 9th grade, a black kid named Tim 6th grade, and I 8th grade had been roaming the streets and causing trouble. We had finished fighting some kids we disliked, and got the bright idea to egg the kids house when it got dark. At about 9, we did. I lived in Cedar Terrace apartment 99 with my father at the time. Currently im in 143 with my mother. We had gone back to my back porch, and was chilling out for the night. My back door faced the driveway and parking lot. I was sitting on the steps, Tim in a chair, this kid Derek was standing, and Keith was walking on the curb in the driveway area. While i was talking to one of them, i was loudly cut off by the sound of Keiths voice. As we looked at him, his finger was pointing twords the sky over my roof, and he yelled \"what the fuck is that!\". We all jumped up, as we did, we hear a simualr sound to a burning furnace. As I looked directly above my head, a ginat green and orange fireball fly over my roof, spewing forth shining gold dust like particles. It was so low to the ground, it had skimmed the top on the tree in my backyard. Branches came down allright. It continued to travel about another few sconds twords the parking lot, then dissapeared. At this point we were crazy. That was the coolest thing we have ever seen. We ran to the parking lot. The black kid Tim statred freaking out and punched keith in the face when he suddenly turned around in front of him. We just laughfed about it. There was this mexican family that lived there at the time that faced the parking lot. They was all out on the back porch tword the parking lot, one guy name Chad was smoking a joint. As we made it to the parking lot, was shouted to them \" did u see that! blah blah a ufo fireball blha blah\". They laughed and thought we were crazy, sarcasticaly remarking, Yeah chad saw it! Haha. At this point, derek, tim and kyle had gone home. Me keith and ryan went into my house. We called my dad's cell phone, he had been out on a date. Being the ufo and alien guy that he is, i couldnt wait to tell him the amazing story. The call didnt go well. I pictured him at a resurant, and his phone rings. He picks it up, and hear three boys screaming into the phone all at once, only making out the words ufo and aliens. That call ended with \" Im glading your having fun boys, stay out of trouble\". At this point, it was about 10 when we decided to do somthing. The parking lot ends and turns into a hill. At the bottom is a huge empty lot, at the end of that is a tree line about 30 feet thick, then a huge feild on the other side. When ever i herd of any ufo storys, they always seemed to take place in feilds. So we decided to grab a flshlight, and check it out! As we aproched the woods, ryan then rufused to enter. We grabbed him and tryed to force him in. He was such a wimp, but finaly we entered the woods about 5 minutes later of fighting with him. Keith was first, i was second, ryan last. Keith had the light. We made it to the feild. It was extremly dark, no moon or anything. We felt black top, and relized we were standing on this rely old horse track thing. There is a horse farm right by there, must have been why it was there. Keith had been tieing his shoes when i noticed somthing standing about 15 feet away. As have goose bumbs as i write this next part. Ryan was bickering about how there nothing here and we should leave. Thats when i wrabbed keiths wrist with the light in his hand, and directed it to the spot i had noticed a dark figure. man, if im lyin im dying. We shone the light onto the face of a reptile like creature. God its eyes were so big. It was like the same design as a fly has on its eyes, like a window screen. The were cleary oily. Greens and purples and oranges mixed in, glisening in the light. The skin was white, very very white. The creature stood about 7 and a half feet tall. This wasnt a rosewell alien, this was a huge muscle bound tall ass thing that could have ripped us apart. Its neck was vey long and skinny, showing its esophogus through it. We screamed like girls. The next part is truly terrifying. The creature was standing next to a bush. It was about up to his midsection. He lefted his leg up and stepped over the bush! Its ankles were thin and it had long webbed feet! At this point we ran faster then ever. I felt so scared and was just screaming. We reched the trees and then, directly to our right side, stood another one. Yes, this all happened, and i would swear my life on it, and ryan and keith would to. We were complelty sobre, and in solem mind. We just kept running, till we reached the lot, then the top at of the hill. I cant explain it, but we stopped right there, we just knew to, we like knew at that point we were safe. We sat there staring into the dark woods for about a half of an hour. When you see somthing that incredable, its like u cant belive it. I said aloud \" that didnt happen, its impossible, its not real\". Keith had looking right into my eyes, and right there, the toughest kid in our grade, Keith Poloats had tears in his eyes and said to me \" You can NOT denie what just happened. We never told a soul. Never. The next day we drew up a picture of the thing, and wrote a story about what had happend. Ever since, im a complete ufo and extra terrestrial nut. I assure you, im no ufo nerd or geeky kid that gets pushed around at school. We actualy are considered very popular and we get all the girls. This event rely did happen. I tell of it now, because its been leaked out, why not leak it out to some higher authority. Ryan began telling evryone last school year. One night a i gota phone call from a girl i had dated, she called to ask me of an event that happend in 05. She said ryan had told her and evryone. My heart froze. \"Great, mike grana is gonna be known as the alien freak\". Well, to my luck, the exact oppisite happened. Our town is so boring and lame, nothing to do but drugs, fight, start bands or have partys, and this crazy story spread like wild fire. Evry kid in town ate it up. Theres these partys held by a boy whos parents own the apple farm. Back on his land, he throws enormous partys with bands and food and bonfires and evrything. \"The Alien Story\" is a now legendary tale of hiltonknights, told around the bonfires."],"Object Flight Path":"Straight-line path","map":"<A HREF = \"http://maps.google.com/maps?q=43.16444,+-77.604732(9402)&iwloc=A&hl=en\"> mufon case (9402) map </A>","Object Shape":"Fireball","Log Number":"US-02022008-0011","Weather Factors":"None","Date of the Event":"05/29/2005 10:30 UTC","Viewing Distance":"21-100 Feet","Disposition":"Hoax","Region":"New York","City":"Rochester","Sighting Duration":"01:00:00","Summary":"Flying ufo, aliens in woods","Case Number":"9402"}