{"files":["/var/www/straped/mufon/html2text/9404.html.txt","/var/www/straped/mufon/org/9404.html"],"Disposition":"Unknown","City":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Latitude":"19.902766","trends":[""],"Weather Factors":"Unknown","Case Number":"9404","Summary":"saw a sphere the size of a medicine ball emitting bright blue light, it hovered 15 feet in front of me 5 ft. off the ground and then flew away at super speed, no noise","Date Submitted":"11/18/1980 04:15 UTC","Country":"United States","Log Number":"US-02022008-0012","Date of the Event":"11/18/1980 04:15 UTC","Longitude":"-155.577922","map":"<A HREF = \"http://maps.google.com/maps?q=19.902766,+-155.577922(9404)&iwloc=A&hl=en\"> mufon case (9404) map </A>","Region":"Hawaii","divs":["Sighting DetailsIn 1980, I had a paper route on the hill above my house and would deliver the papers between 3:30am and 4:30am each morning. I drove my car and threw the papers out of the sunroof, but there was a house, sitting alone with no other houses around for 3-4 lots on each side, and the streetlight above had burnt out and I was required to stop my car, walk over to the porch area and toss the paper onto the front door area. As I was walking back to my car, the entire area suddenly became lit up in a bright blue light. I turned around and saw this sphere moving over the roof of the house, maintaining a constant distance from the roof, and emitting a VERY BRIGHT blue light, but making no noise nor any odors. It floated down to about 5 feet above the ground, about 10 feet in front of me. As I watched, I stood motionless and obviously totally amazed. I don't think that I had any thoughts running through my head, I was an observer in the truest sense of the word, simply watching this thing in front of me, hovering above the ground. As soon as my brain kicked in, and I started to think, \" what could it be?\", it went from directly in front of me to over the top of the hill, out of my sight, in a fraction of a second, it's movement producing a blue streak in my vision that followed it over the hill. No sounds, nothing, just zip! and it was gone.I finished my paper route without incident.As I thought about it later that day and since then, I feel that it must have been a probe of some kind, unoccupied (it was only as big as a medicine ball, maybe twice the size of a baskerball)and the fact that it maintained a constant distance above the roof, following the roof line, makes me think that it was measuring something, or doing some sort of investigative monitoring. I also beleive that it left the area when it sensed cognizant thought on my part, as if it wanted to remain secret and I had accidentally seen something that I wasn't supossed to--ergo, the hasty retreat."],"Sighting Duration":"00:02:00","Object Features":"Undisclosed","Object Flight Path":"Undisclosed","Tags":"City","Object Shape":"Sphere"}