{"trends":["There have been 39 other sightings in Lakewood","There were no other sightings in Lakewood on or around December 24th 2007"],"Source":"MUFON","Country":"United States","Disposition":"IFO","Object Shape":"Star-like","Sighting Duration":"Undisclosed","Weather Factors":"None","City":"Lakewood","Case Number":"9405","Date of the Event":"12/24/2007 06:00 UTC","Region":"Colorado","Tags":"City","Object Flight Path":"Hovering then path","Object Features":"Unknown","Longitude":"-105.076453","Date Submitted":"12/24/2007 06:00 UTC","Latitude":"39.71197","map":"<A HREF = \"http://maps.google.com/maps?q=39.71197,+-105.076453(9405)&iwloc=A&hl=en\"> mufon case (9405) map </A>","Viewing Distance":"Over One Mile","Summary":"Bright light appearing near the full moon","divs":["Sighting DetailsI was out with family, going for a holiday lights viewing ride in a car. We decided to drive around the ritzy neighborhood on the north side of Green Mountain. I noticed earlier that there was a full moon and it was very bright, in the ENE sky. I like looking at the moon, so occasionally I would look at it again. One time I looked at it there was a bright light just to the right of the moon. I assumed it was Venus or a bright star, although I've never seen one so close to such a bright full moon. I looked again about 10 minutes later, and now the same light was to the LEFT of the moon. That didn't seem right to me. Someone told me they thought it was probably Mars. Two problems with that: it didn't have the usual reddish tint and was brighter than it would be EVEN IF it was AWAY FROM a full moon--it should have appeared even dimmer to me because of the brightness of the full moon so close to it; and how did it move over to the other side of the moon? I decided at the time to doubt my observations, but now I am more curious, as there have been other reports of this object, one with photos, on this site. I didn't mention it at the time to anyone; they were only looking at the holiday lights in that neighborhood. I am a member of MUFON and Colorado MUFON; my MUFON ID is 10646."],"Log Number":"US-02022008-0013","files":["/var/www/straped/mufon/html2text/9405.html.txt","/var/www/straped/mufon/org/9405.html"]}