{"Sighting Duration":"Undisclosed","Log Number":"US-02022008-0014","City":"Roseburg","files":["/var/www/straped/mufon/html2text/9406.html.txt","/var/www/straped/mufon/org/9406.html"],"Country":"United States","Weather Factors":"Rain, Medium","Object Shape":"Flash, Sphere","trends":["There have been 8 other sightings in Roseburg","There were no other sightings in Roseburg on or around September 30th 1973"],"Date Submitted":"09/30/1973 09:00 UTC","Region":"Oregon","Disposition":"Unresolved","Date of the Event":"09/30/1973 09:00 UTC","Object Flight Path":"Hovering then path,Path with directional change","Latitude":"43.218355","Tags":"City","Longitude":"-123.337598","Viewing Distance":"20 Feet or Less, Over 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=43.218355,+-123.337598(9406)&iwloc=A&hl=en\"> mufon case (9406) map </A>","Object Features":"Unknown","Case Number":"9406","Summary":"Rainy, cold evening, coming back into town, passed sewer plant and were enveloped in white light","divs":["Sighting DetailsIt was a rainy, dreary, cold day. My ex-husband and myself had been at his Aunt's house in the country all day and into the evening. We were going back into town, just on the outskirts where there was a sewage treatment plant. There was no traffic on the road and as we rounded the corner this blinding white light seemed to encompass the car. The next thing I remember is being on the old Oak St Bridge and being so scared and my ex was driving so fast we were fishtailing all over the bridge. There is a lapse in memory from the sewage plant to the bridge which is about 5 miles, or so. It was like we lost that part of the drive. Once on the bridge, I remember looking up and seeing this star-like object following us the rest of the way home, which had to have been another 2 or 3 miles. We were both so terrified, neither one of us could speak. Upon arriving at the house, I watched as the object zig-zagged in the sky and then was gone. We both leaped from the car and ran into the house, both of us almost hysterical, telling my Aunt & Uncle and a couple of their friends, what we had just witnessed. As you can imagine, they all started laughing at us and turning it into a joke. I insisted it was all true, but my ex, because of the ridiculing we were taking, started denying that it had happened. I was furious with him, but he continued to deny the event. Several years after the fact, my ex-husband and myself had a chance to sit and discuss the event and he admitted to me that he did in fact see what we had both originally witnessed. I have always wanted to be hyptonized to see if I could remember the entire incident and to find out what happened in that lost 5 miles, if anything."],"Source":"MUFON"}