{"Date Submitted":"02/02/2008 12:00 UTC","Object Features":"Undisclosed","Disposition":"Hoax","City":"Austin","Sighting Duration":"00:06:00","Country":"United States","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=30.273583,+-97.741921(9408)&iwloc=A&hl=en\"> mufon case (9408) map </A>","files":["/var/www/straped/mufon/html2text/9408.html.txt","/var/www/straped/mufon/org/9408.html"],"Region":"Texas","Case Number":"9408","Log Number":"US-02022008-0016","Date of the Event":"02/02/2008 12:00 UTC","Weather Factors":"Unknown","Latitude":"30.273583","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around February 2nd 2008"],"Viewing Distance":"Unknown","Object Flight Path":"Undisclosed","Longitude":"-97.741921","divs":["Sighting Details Today, while lying on the rocks with some hippies in the barton creek greenbelt, I observed a very distant point of silver light hovering motionless in what I assumed to be the upper atmosphere. I immidiately turned to my friends and said, \"I think thats a u.f.o.\". They were excited, but not as surprised as I had expected. One of my friends turned to me at once and said, \" Yeah, juan here's been tellin' us 'bout em'. Says he's seen em flyin around on and off all day.\" (typical, huh?) Juan jumped up from his crosslegged position and asked me to point it out for him. I assume that the others present were to intoxicated to make out such a small light, or perhaps they just didn't care. (I was only under the influence of the ussual nicotine buzz, and jaun quit drinking a couple of weeks ago) We watched it for a few minutes and observed niether any change in the position nor the intensity of the light for several minutes. It appeared to be composed of a highly reflective metallic substance, but I wouldn't make a bet on that assertion. It dissapeared abruptly after about 6 minutes, and I did not see any other lights. The sky was a deep, healthy shade of blue during the sighting, and there were no visible clouds in the vicinity. I witnessed a very similiar phenomenon last march and I plan to re-post the mufon report shortly. Peace."],"Object Shape":"Star-like","Summary":"Distant point of silver light over Austin. Motionless, dissapearing abruptly."}