{"map":"<A HREF = \"http://maps.google.com/maps?q=49.257579,+-122.966796(9409)&iwloc=A&hl=en\"> mufon case (9409) map </A>","Object Shape":"Bullet, Missile, Cigar, Oval, Other","Date Submitted":"01/16/2008 10:20 UTC","Case Number":"9409","trends":["There have been 6 other sightings in Burnaby","There were no other sightings in Burnaby on or around January 16th 2008"],"Tags":"City","files":["/var/www/straped/mufon/html2text/9409.html.txt","/var/www/straped/mufon/org/9409.html"],"Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Country":"Canada","City":"Burnaby","Sighting Duration":"00:02:00","Object Features":"None","Disposition":"Unresolved","Source":"MUFON","Longitude":"-122.966796","Date of the Event":"01/16/2008 10:20 UTC","divs":["Sighting DetailsI was driving a couple of friends home in Burnaby and swung by a different route than I normally take. As we were getting off of Lougheed highway and taking the slip to Winston Street, I saw what looked like a bright blueish-white light in the low, eye level skyline. I thought it was a planet at first, as it wasn't bright enough to be a plane or a helicopter. But then it started moving towards us. I slowed the car down and asked my passengers if they saw it too, which of course they did. The object was approximately 1000ft in the air and was below the cloud line. It was moving towards us. We thought it was a plane or a helicopter, but there were no accompanying lights. As it got closer, almost above us, we noticed that it was grey or silver in colour and had no wings or rotors. So we were curious as to how it was flying. It wasn't moving very fast either, so we clearly saw it and watched it for a couple of minutes before we drove off. Another strange thing was that there was no sound emanating from it. A day later, one of my other friends saw it and called me, asking me about it as he was watching it in the sky near the same area. Although when he saw it, there was a red blinking light towards the back. Four days after that sighting, he saw it once more, but with no light other than the blue one. He heard no sounds from it either and with it being so low in the sky, one would expect sound, especially with cloud cover just above it."],"Latitude":"49.257579","Object Flight Path":"Hovering then path,Straight-line path","Summary":"Shaped like the body of an airplane, but with no wings or tail, and a blue-white light in the front, no sound","Weather Factors":"Unknown","Log Number":"CA-02022008-0017","Region":"British Columbia"}