{"Tags":"City","Latitude":"30.286863","map":"<A HREF = \"http://maps.google.com/maps?q=30.286863,+-89.376159(9411)&iwloc=A&hl=en\"> mufon case (9411) map </A>","divs":["Sighting Details Just before sunset on a summer day in 1985 i was at my mom's home and as i looked out the window facing south towards US hwy 90 i noticed a bright light moving slowly west to east, visible just above the treetops across the wide highway. I observed this for a short period of time. I went to my room and got the binoculars, by this time the twilight had just turned to dark. The object, now a bright white circle bigger that a star, was moving north to south and directly away from me when i returned to the window. I focused the binoculars on the object and saw a white ball of light with a rotating band of colored balls of blinking lights. the object seemed to be slowly tumbling as the band would be high on left, low on right, then change to low on left, high on right, about every half minute. I wacthed this for at least 5 minutes untill it was too small to make out as it moved away from me to the south over the eastern end of the Mississippi sound of the Gulf of Mexico about 3 miles to the south. I was certain this was something unusual when I first noticed it. I really felt I was getting a good look at a real UFO."],"Weather Factors":"Unknown","Case Number":"9411","Summary":"observed light moving west to east, then with binoculars observed it moving south away from me.","Object Shape":"Circle","Sighting Duration":"00:10:00","Date of the Event":"07/15/1985 08:00 UTC","trends":["There has been one other sighting in Waveland","There were no other sightings in Waveland on or around July 15th 1985"],"Viewing Distance":"Unknown","City":"Waveland","Country":"United States","Longitude":"-89.376159","Date Submitted":"07/15/1985 08:00 UTC","files":["/var/www/straped/mufon/html2text/9411.html.txt","/var/www/straped/mufon/org/9411.html"],"Source":"MUFON","Region":"Mississippi","Log Number":"US-02022008-0019","Disposition":"Unknown","Object Flight Path":"Undisclosed","Object Features":"Undisclosed"}