{"Case Number":"9413","City":"Miami","Disposition":"Unknown","Object Features":"None","files":["/var/www/straped/mufon/html2text/9413.html.txt","/var/www/straped/mufon/org/9413.html"],"Date Submitted":"06/30/1978 08:30 UTC","Object Shape":"Circle","Summary":"Stationary Light in Sky which then moved, changed colors, put out smaller white lights","Date of the Event":"06/30/1978 08:30 UTC","divs":["Sighting DetailsI was playing with the tennis ball with my little dog Woody on a summer night in 1978 between 12th and 13th Avenues and Southwest 1st Street in Miami, Florida. While tossing the ball against a boarded up window of the duplex second floor across the patio from my home, I looked just a tad west of due north, east of the Orange Bowl Stadium area, east of St. John Bosco Catholic Church, up 13th avenue, and saw what I took for a stationary hovering helicopter's headlight. I gave it no thought and kept playing tennis ball with my little dog Woody. A few minutes later, I glanced in the same direction and that light was still there, and I thought \"wow, that helicopter (no noise) has sure been sitting still for a long time,\" and went back to playing ball with my dog. A few minutes later still, I looked again and that light was still there, and I thought \"what IS that?\" so I gave Woody the tennis ball and walked toward the north end of the patio-parking driveway, and started staring at the light. After a few minutes, it began suddenly to \"heat up\" as if from the inside of it, and rose silently and smoothly straight up into the air. Now, I still wasn't thinking UFO, I just kept watching it. It began to move to the east until it was north-northeast above my home and it looked like a white, round dinnerplate against the dark night sky. Then abruptly it \"turned off,\" the light went off, and I remember thinking what the heck?? And then it came back on, this time blue, then went off, and came back on red, went off, came back on blue, went off (I'm not sure how many times it went off and came back on, each time changing from red to blue, still utterly silent, and then it came back on white and stayed on white. Then, and again it looked about the size of a dinner plate, then smaller ones, that looked about the size of a golf-ball by comparison to a dinner plate, emerged from it and lined up one after the other in a straight line and sat there a few seconds. Then abruptly the smaller ones took off in all directions, clear across the sky in all directions, zig zagging without curving at all, and the big light kept putting out smaller ones that lined up one after the other and took off zig zagging clear across the sky. At THIS moment is when I thought \"UFO\" and ran shouting into my house and got my dad (and I think my mom and sister came out too), and my grandma (who has since died - in 1994 - etc., and we stood out in the yard and watch the big one silently move around smoothly in the sky, putting out more little ones that took off zigzagging, and this must have lasted at least an hour and a half from when I first saw the light off to my north-northwest. At some point, I went inside and called the military station (Navy I think) in Coconut Grove and a man answered, and before I could tell him what I was seeing, he said, \"Those aren't YOO-FOES (((that's how he pronouced UFO's, YOO-FOES))), he said, \"the're flares being shot off on Key Biscayne.\" And I told him, Sir, this is NOT a flare. And it DIDN'T come from Key Biscayne, it had been sitting in place to my north and northwest for a long time, in one place before it started moving\" ((Key Biscayne was just east of due-south of my location between 12th and 13th avenue and Southwest 1st Street near downtown Miami, in \"Little Havana\".)) The man flat-out lied to me. And when I told him that it came from the north-northwest, he again lyingly said that \"they are flares from Key Biscayne.\" What a crock of nonsense. There was nothing in the sky to my south or southeast before of during the entire event. This came from the north-northwest and had sat still for about 20 minutes in the air before it ever began to move. Anyway, that is what I remember. My dad still remembers watching this, and says to this day that it was the weirdest thing he has ever seen in his life. Let me make clear: I didn't see anything that looked like a \"space-ship\", no windows, it was a perfectly round white light that changed colors and put out smaller versions of itself that zig-zagged all over the sky without curving at all. It was a fascinating experience, and it made me know (KNOW, not merely believe) that the UFO phenomenon is REAL, not imaginary. But though it was fascinating, it was very uncanny, and I truly am not looking forward to ever seeing anything like that again. Thanks for listening & God bless. D.R. North Miami Beach, Florida, USA"],"Country":"United States","Tags":"City","Object Flight Path":"Hovering then path","Sighting Duration":"01:30:00","Source":"MUFON","trends":["There have been 97 other sightings in Miami","There were no other sightings in Miami on or around June 30th 1978"],"map":"<A HREF = \"http://maps.google.com/maps?q=25.798849,+-80.223309(9413)&iwloc=A&hl=en\"> mufon case (9413) map </A>","Log Number":"US-02022008-0021","Longitude":"-80.223309","Latitude":"25.798849","Region":"Florida","Viewing Distance":"Unknown","Weather Factors":"None"}