{"Tags":"City","Object Features":"Unknown","Longitude":"-120.83138","Country":"United States","divs":["Sighting DetailsI noted this while finally getting around to a detailed revue of photos taken in 2003 while in Montana De Oro State Park near Los Osos, CA. I took a series of photos while there, and one frame in particular stood out. While shooting photos of the beach & surf, I captured an object about 1,000 feet up along with 3 black lines which look sort of like sheet music or high voltage lines. There are no such lines in the park (besides these are too high in the sky to be power lines). Looks to me as if the object might be somehow projecting the lines, however in subsequent frames the object disappears but the lines are still there for about 3 frames. I took another set of photos in the same area about 3 minutes later with no lines, however I did capture what my son has told me is an F111 Stealth Fighter. Vanderburg AFB isn't too far away, so maybe it's one of their's. The F111 was flying much lower than the object and it was strange to see it. It appeared at 11:08 AM, about 21 minutes later."],"Object Shape":"Oval","Object Flight Path":"Stationary","Weather Factors":"Unknown","Viewing Distance":"Over One Mile","Source":"MUFON","Region":"California","Latitude":"35.322523","Case Number":"9415","map":"<A HREF = \"http://maps.google.com/maps?q=35.322523,+-120.83138(9415)&iwloc=A&hl=en\"> mufon case (9415) map </A>","Date of the Event":"10/18/2003 10:47 UTC","Date Submitted":"10/18/2003 10:47 UTC","Sighting Duration":"Undisclosed","City":"Baywood-Los Osos","trends":["There has been one other sighting in Baywood-Los Osos","There were no other sightings in Baywood-Los Osos on or around October 18th 2003","This sighting has never been favorited.",""],"Log Number":"US-02022008-0023","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9415.html.txt","/var/www/straped/mufon/more/9415_submitter_file1__107_0749copy1.JPG","/var/www/straped/mufon/org/9415.html"],"Summary":"Saucer Shaped object along with 3 distinct black lines in the sky"}