{"map":"<A HREF = \"http://maps.google.com/maps?q=42.850935,+-72.557862(9420)&iwloc=A&hl=en\"> mufon case (9420) map </A>","Source":"MUFON","Date of the Event":"01/31/2008 11:52 UTC","Object Flight Path":"Path with directional change","Date Submitted":"01/31/2008 11:52 UTC","Longitude":"-72.557862","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Weather Factors":"Unknown","Case Number":"9420","Summary":"An series of blinking lights, rapidly, less than a second in between","Latitude":"42.850935","City":"Brattleboro","Object Shape":"Unknown","Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/9420.html.txt","/var/www/straped/mufon/org/9420.html"],"Object Features":"Unknown","divs":["Sighting Details I was hungry and decided to head to the nearest town for some fast food. I was driving in my car down route 91 heading from Putney Vermont to Brattleboro, the nearest city. I go to college nearby. As I drove I noticed a set of blinking lights at 10 o'clock high in my windshield. At first I assumed they were running lights from a helicopter or a prop driven plane. The object remained in my field of view for about a minute and a half when I took notice of it's oddly behaving running lights, they were blinking very rapidly, far faster than any running lights I have ever seen. They were also more numerous, at least eight. My father flew helicopters for the army and I was intent upon getting a pilots license for many years. I am somewhat familiar with running lights.The object moved in a slow circle, never altering its angle or appearance. The lights kept flashing in random colors, reds, greens, blues, and inbetween colors such as orange, purple, yellow, and it simply hung around in the night sky. I thought that it may have been something in my car that was flashing, so I waved my hand over the dashboard while I drove. Then I shut off my instrument panel, and even briefly killed my headlights, there was enough moonlight for me to navigate briefly without them on. Which was a stupid and illegal thing to do, but I wanted to make sure that I saw what I saw. The object, whatever it was disappeared behind the tree line as I took a curve. I thought I had lost it, but it reappeared approximately 15 seconds later, circling back overhead. I reached Brattleboro exit #3 off of Route 91 at between two or three minutes of Spotting the object, the object never got any closer to my vehicle, either by descending or ascending. Nor did it appear to get any closer to my vehilce than when I first noticed it. I pulled off of the exit and ran over the entire event again in my head. As for feelings and emotions, I was confused when I noticed the lights, they didn't seem to match anything I had ever seen. I was curious, but the object never acted in a manner that would make me feel threatened or nervous. I wasn't in awe because at the time I was just a little unsure of what I was seeing. After 4 days, I figured it would be at least appropriate to send in a report."],"Region":"Vermont","Log Number":"US-02032008-0002","trends":["There have been no other sightings in Brattleboro","This sighting has never been favorited."],"Disposition":"Unknown"}