{"Date of the Event":"01/01/1991 12:00 UTC","City":"Pompano Beach","Object Flight Path":"Hovering then path","Log Number":"US-02032008-0005","Tags":"City","Date Submitted":"01/01/1991 12:00 UTC","trends":["There have been 11 other sightings in Pompano Beach","There were no other sightings in Pompano Beach on or around January 1st 1991"],"Weather Factors":"Unknown","Object Features":"Window(s), Appendage(s)","Object Shape":"Square, Rectagular, Other","Case Number":"9423","Longitude":"-80.121307","Disposition":"Insufficient Data","Viewing Distance":"21-100 Feet, 101-500 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=26.24091,+-80.121307(9423)&iwloc=A&hl=en\"> mufon case (9423) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9423.html.txt","/var/www/straped/mufon/org/9423.html"],"divs":["sighting detailsi lived in a hotel that was being remodeled on the beach in pampano, fl. i was only 7 years old at the time and was living with my mother and brother. our hotel room had a small balconly that faced the pacific ocean. i remember waking up late at night and walking outside onto the balconey where my brother was already siting in a beach chair facing the ocean, there was no noise and no wind, when i looked down to see the beach there where strang human shaped figures glowing red walking along the beach. the red glow looked like when you take a flashlight and put it against your hand the othere side of your hand glows red. i then noticed a large odd shaped gray\\black cube ufo with yellow lights moving very slow between two large hotels that were to the right of our hotel. my brother was awake but dazed. i don't remember anything else about the night but what i did remember of the night stuck with me. a few years later when i was 9 or 10 my brother and i were on a trip with our father it was really late at night and i can't remember what started the conversation but my brother was telling me about what he thought was a very vivid dream. he saw the same thing that i saw but from his prospective in the beach chair on the balconey. he does not remember me standing to his left on the balconey but he does remember the human shaped figures on the beach and the odd cubed shaped ufo slowly moving between the hotels. it really scared me that i was not the only one with the exact memory. i have not seen anything like it since and i am now 23 years old. i believe we both witnessed a ufo and some form of alien life forms. my brother was 11 or 12 years old at the time. i have always wonderd if anyone else has reported a simalure sighting around the same dates and place as we did. i now it was 1991 but i am not sure of the month. i remember the year because hurican andrew hit in feb\\1992 and we had to move."],"Country":"United States","Latitude":"26.24091","Region":"Florida","Summary":"Large cube with small cubes attached"}