{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Tags":"City","divs":["Sighting DetailsOur 11 year old daughter and her friend were on the playground at Round Top Elementary near Blythewood, SC outside of Columbia on Monday January 28th, 2008 when they saw a cigar shaped metallic craft hovering over the tree line. She said it was approximately the size of a two story house and made no noise and had no doors or windows. Her friend immediately said Oh my god it's a UFO. They continued to stare at it for about 1 or 2 minutes and then it just disappeared. She said they were both very scared and afraid to say anything to the teacher or the other kids. They were shocked by what they saw. When my wife picked her up at school later that day, she was very excited and told my wife what she had seen. Now she doesn't want to talk about it. On February 2nd, 2008 while our daughter was staying at a friends house, at approximately 2:30 AM our 16 year old son came running into our bedroom waking us up saying he had just seen a cigar shaped craft hovering over our house outside of his window. He said it had blue and red lights and a kind of beam of light shining out to the front. It had no doors or windows and no flames or exhaust coming out that would allow it to hover like that. He said it appeared to be about 30 or so feet in length and was up over the house towards the front, but it was hard to tell how far up it was because there was nothing to judge the distance by. But it did appear to be close. He ran to get a camera in our family room and when he returned it was gone. He then came and woke us up. He was very scared."],"Summary":"Our daughter and her friend saw a cigar shaped object hovering over the trees at school while on the playground.","Country":"United States","Disposition":"Unknown","Object Features":"Other","Date of the Event":"01/28/2008 12:00 UTC","Object Shape":"Cigar","Date Submitted":"01/28/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/9426.html.txt","/var/www/straped/mufon/org/9426.html"],"Weather Factors":"None","Latitude":"34.214316","Object Flight Path":"Stationary","City":"Blythewood","Case Number":"9426","Source":"MUFON","trends":["There have been 2 other sightings in Blythewood","There were no other sightings in Blythewood on or around January 28th 2008"],"Region":"South Carolina","Longitude":"-80.973977","map":"<A HREF = \"http://maps.google.com/maps?q=34.214316,+-80.973977(9426)&iwloc=A&hl=en\"> mufon case (9426) map </A>","Log Number":"US-02032008-0008"}