{"Date Submitted":"02/17/2007 07:25 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=28.547046,+-81.374396(9428)&iwloc=A&hl=en\"> mufon case (9428) map </A>","Longitude":"-81.374396","Viewing Distance":"Unknown","Region":"Florida","Case Number":"9428","Latitude":"28.547046","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Source":"MUFON","Object Shape":"Boomerang","City":"Orlando","Log Number":"US-02032008-0010","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around February 17th 2007","This sighting has never been favorited.",""],"Tags":"City","Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/9428.html.txt","/var/www/straped/mufon/more/9428_submitter_file1__jebUFO.jpg","/var/www/straped/mufon/org/9428.html"],"Country":"United States","Summary":"Saw a boomerang object with 3 lights flying VERY strangely.","Object Flight Path":"Path with directional change,Other","divs":["Sighting DetailsIt was around 7:20-7:30pm ish and i was standing in my driveway waiting to be picked up by family to go to a dinner outing. The sky had a few clouds, but was otherwise clear. I occasionally looked up, as anyone bored and waiting would do, when i spotted what i thought was a plane since the lights were so bright. It moved pretty slow, but i realized it wasn't flying normally, it was flying in strange patterns and making EXTREMELY sudden direction changes without any sort of pause. (IE- left to right instantly) It was low enough and blocked out some of the stars enough to see it was distinctly boomerang shaped with 3 white lights. One on the tip and one on each 'wing'. It ascended and descended rapidly and made zig-zag motions(i joked that it looked like 2 people were fighting over the controls), it finally started to move in one direction but made one last jog in the opposite direction before continuing in the original direction. It dissapeared, but it didn't just fly away, the lights just went out. Like someone just turned them off. I was very startled, when family arrived to get me only seconds later i was in a minor panic. My family is open to the idea of U.F.O.'s so i wasn't met with any criticism. I captured only one photo on my cell phone, but i don't think it's of much value, it's at an angle and you can only see the lights. It looks like airplane lights in the picture. But i've never heard of such a distinctly shaped airplane, i did a lot of research trying to find airplanes that look like what i saw. A few days later, a family friend who is a self-declared sceptic saw the same object flying in a similar motion. The only difference was that it shot off faster than anything he had ever seen. Needless to say, he now believes there is something out there worth investigating."],"Date of the Event":"02/17/2007 07:25 UTC","Object Features":"Unknown"}