{"Longitude":"-81.085653","Viewing Distance":"101-500 Feet, Unknown","Summary":"heard noise, looked up and saw strange light","Tags":"City","City":"Carrollton","files":["/var/www/straped/mufon/html2text/9429.html.txt","/var/www/straped/mufon/org/9429.html"],"Date Submitted":"10/17/1976 07:20 UTC","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change","Source":"MUFON","Case Number":"9429","Disposition":"Unknown","Object Shape":"Circle, Sphere","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been no other sightings in Carrollton","This sighting has never been favorited."],"map":"<A HREF = \"http://maps.google.com/maps?q=40.57284,+-81.085653(9429)&iwloc=A&hl=en\"> mufon case (9429) map </A>","Log Number":"US-02032008-0011","Object Features":"None","Date of the Event":"10/17/1976 07:20 UTC","divs":["Sighting DetailsI was sitting on the steps,and heard a strange noise. Kind of like a chain saw but different, like the sound you hear space ships make on tv, that zing zing, but some what like a chain saw too. Just unusual. I live on a farm, which can be quite noisy. The cows had been balling, you know mooing. When this noise started they got very quiet. Spooky. Then there was a motercycly, that just came out the road way, then back and forth, several times. Just short distance then back again, may be five or six times. That is when I felt something kind of pull my attention up to the sky. As I looked up I saw 2 lights, about the size of car lights hoovering side by side in the sky. They started to move towards me, then all of a sudden they were gone, like a switch was turned off. Then again my attention was drawn, this time to the right, about 1 quarter of a mile away. There the lights were again, then zip gone again, right back in front of me. Then they rotated, one over the other. I jumped up and ran in the house scared silly. But I ran to the front window and looked out again to see where the lights were. They were slowly coming towards me. I had the tv on and the sound went off. I started to get a tingly sensation on my neck and arms, my 2 year old son was sleeping on the couch, sound asleep, this was unusual for him this time of the evening,he was normaly up running around. I could feel a pulling sensation on my body, kind of like all the hair on my skin was standing on end. I then ran to the back of the house to see if I could see the lights going over, but they were gone. I ran back out side the cows had started mooing again, the motor cycle was gone, the sound on the tv was back. I was very shaken by this, of coures everyone thinks I'm nuts but I know there was something there. That is my story. Since then I have only seen one other unsual sighting it only lasted a few seconds, so I won't call this a ufo"],"Weather Factors":"None","Region":"Ohio","Latitude":"40.57284"}