{"trends":["There have been 3 other sightings in New Britain","There were no other sightings in New Britain on or around November 30th 1999"],"Country":"United States","Tags":"City","City":"New Britain","divs":["Sighting DetailsI was driving on Rte. 72 in New Britain, CT. It was roughly 5pm and the sun had yet to set. It was probably the spring of 2000, but I don't remember the exact date and unfortunately did not document this event at the time. From a distance as I was driving, I saw a large, dark object motionless in the sky. Within a minute I was about to merge onto Rte. 84, and I could clearly view this object. It was a large, black triangle hovering directly above the highway. It was as long as a football field, with white flashing lights at each tip, and a glowing magenta colored circle in the middle. It did not make a sound. It was approximately 300 feet off the ground. Some cars were pulling over to view the UFO, however I drove under it. I was terrified beyond belief, and did not look back. My heart was literally pounding out of my chest. The UFO clearly was not trying to hide. I thought surely it would be on the news. There was not a single mention of the UFO on the news, on the radio, or in the newspaper. I contemplated calling the police, but figured one of the hundreds of other people witnessing this UFO had probably beat me to it."],"Longitude":"-72.779542","Summary":"Black triangle hovering over highway in central CT","Weather Factors":"Unknown","Object Shape":"Triangle","Object Flight Path":"Stationary","Disposition":"Unknown","Date of the Event":"11/30/1999 12:00 UTC","Case Number":"9432","Region":"Connecticut","map":"<A HREF = \"http://maps.google.com/maps?q=41.66121,+-72.779542(9432)&iwloc=A&hl=en\"> mufon case (9432) map </A>","Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"41.66121","files":["/var/www/straped/mufon/html2text/9432.html.txt","/var/www/straped/mufon/org/9432.html"],"Log Number":"US-02032008-0014","Viewing Distance":"101-500 Feet","Object Features":"Undisclosed","Date Submitted":"11/30/1999 12:00 UTC"}