{"divs":["Sighting DetailsI was driving west on Interstate Hwy. 25. It was dark and the sky was completely overcast. Approx. half-way between Las Vegas and Santa Fe, NM, I suddenly observed a stationary, dome shaped object to my left (south of the Highway, and an estimated 700 to 800 yards away), in an area of low cliffs and mesas. The object stood out, dimly lit, despite the dark night, and a wedge-shaped opening - brighter than the rest of the object -was opening slowly on the front of the dome-shaped object. It looked very much like an observatory dome which was in the process of opening to allow use of the telescope. I had driven this route numerous times before, and had never noticed an observatory here before, so was surprised. By the time this all registered in my mind I was at least a quarter of a mile down the highway, and the object had disappeared from view. I pulled over to the side of the highway to try to back up and get another look, but traffic coming from behind me, and safety concerns, prevented this. I was in a hurry to get to Santa Fe, so drove on. After checking in to a hotel in Santa Fe I got out a New Mexico map to see if it showed an observatory in the area. The map showed no observatory anywhere in that area, and also showed no roads in to that area. I did not pursue it farther at the time, but a couple of weeks later, when I was driving through the area again - this time in daylight - I watched the area where I had seen the object closely as I drove east on Interstate Hwy 25. I saw no sign of any buildings located in the appropriate location or area, but did notice that, in what seemed to be the location of my sighting, there was a high-tension power line running from the highway, south through a deep draw and over the mesa beyond. Although I can not swear beyond any doubt that what I saw was not something \"normal\" and explainable, I was left with the impression that I had observed a \"UFO\", and that the proximity of the power line may have some significance."],"Disposition":"Unknown","Date of the Event":"12/22/1970 07:00 UTC","Log Number":"US-02032008-0017","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"12/22/1970 07:00 UTC","Tags":"City","Object Flight Path":"Stationary","Summary":"Observed dome-shaped object, on or close to ground, with wedge-shaped, lighted opening.","Longitude":"-105.216887","map":"<A HREF = \"http://maps.google.com/maps?q=35.595822,+-105.216887(9435)&iwloc=A&hl=en\"> mufon case (9435) map </A>","Source":"MUFON","Object Shape":"Other","Object Features":"Dome","Country":"United States","Weather Factors":"None","Region":"New Mexico","City":"Las Vegas","Sighting Duration":"00:01:00","files":["/var/www/straped/mufon/html2text/9435.html.txt","/var/www/straped/mufon/org/9435.html"],"Case Number":"9435","trends":["There have been 2 other sightings in Las Vegas","There were no other sightings in Las Vegas on or around December 22nd 1970"],"Latitude":"35.595822"}