{"Region":"California","Longitude":"-119.643445","Case Number":"9436","Viewing Distance":"501 Feet - 1 Mile","Disposition":"Unknown","Date Submitted":"02/03/2008 02:30 UTC","Object Features":"Other","trends":["There have been 3 other sightings in Oakhurst","There were no other sightings in Oakhurst on or around February 3rd 2008","This sighting has never been favorited.",""],"Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=37.33119,+-119.643445(9436)&iwloc=A&hl=en\"> mufon case (9436) map </A>","Object Shape":"Sphere","Latitude":"37.33119","Date of the Event":"02/03/2008 02:30 UTC","Sighting Duration":"00:04:00","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/9436.html.txt","/var/www/straped/mufon/org/9436.html"],"divs":["Sighting DetailsMy wife and I were driving from fresno to oakhurst. Fresno sits in the San Juaquin valley and oakhurst sits up in the mountains west of fresno, about 45 miles away. Oakhurst sits at an elevation of about 4,000 feet. Anyways we were going to a Super bowl party at a friends cabin. At the time we left Fresno it was overcast and lightly raining, once we got into oakhurst it was partly cloudy. At about 2:30 p.m. we saw a cluster of 3 gold spheres about 300 yards from the hightes ground level. They were stationary but seemed to vibrate violently. Like the way things look in a rear view mirror when you have the bass all the way up in your car. I pulled the car off the road onto a sight seeing turn out. My wife was listing to her Ipod when I first saw the objects but was soon as frightened as me. We got out of the car and the objects were still vibrating. I dont know if they were vibrating but its the only word I can think of to describe the event. My wife was silent as I began to fumble through my pockets for my cell phone to take a picture. As soon as I pulled my phone out the objects vibration seemed to intensify and then all the sudden vanished. They didnt move out of sight, they just vanished like a Romulen \"Bird Of Prey\". We booth stood there for a few minutes longer in hopes of the objects re-appearing but they did not. We both got in the car my wife speechless and I blabbering on about what we just had seen. Once we got to my friends cabin I told them what we had seen. My wife seemed cautious to validate what I told them. Needless to say I do not drink and my wife drinks very little, we both have perfect vision. I will not speculate on what I saw as being a UFO but it was like nothing I had ever seen in real life or a movie. Again there was 3 gold shpere shaped objects, Each one were equal in size. My wife and I agreed that they had the circumference of a large silo. Diameter of about 30 feet. I couldent tell how thick they were. Anyways I was in awe at the time but now Im kinda spooked as is my wife."],"City":"Oakhurst","Source":"MUFON","Log Number":"US-02032008-0018","Tags":"City","Summary":"3 Gold sphere shaped objects about 300 yards off the ground in Oakhurst CA","Weather Factors":"Windy"}