{"Viewing Distance":"21-100 Feet, 101-500 Feet","files":["/var/www/straped/mufon/html2text/9437.html.txt","/var/www/straped/mufon/more/9437_submitter_file1__ufopicset1001.jpg","/var/www/straped/mufon/org/9437.html"],"Latitude":"36.422021","Object Features":"Dome, Unknown","Disposition":"Unknown","Object Flight Path":"Straight-line path,Path then hovering","Date of the Event":"02/05/2007 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=36.422021,+-94.453548(9437)&iwloc=A&hl=en\"> mufon case (9437) map </A>","Country":"United States","trends":["There have been 2 other sightings in Gravette","There were no other sightings in Gravette on or around February 5th 2007","This sighting has never been favorited.",""],"Source":"MUFON","Sighting Duration":"Undisclosed","Longitude":"-94.453548","divs":["Sighting DetailsI was going outside to take my dog to pee. And i saw this object that at the time appeared to be a black circle a little ways behind the house. It looked at eye level to be about a quarter the size of the moon and was moving with no noise and moved at a slow unwavering pace. At that moment i became frightened so i went inside. then i went and got my camera to get a picture so my parents wouldnt think i was being paranoid or anything like that, but i was to nervous at that point to return outside. so i went to my bedroom and looked out my window and the object was a little ways behind and above the tree level in our front yard. so i took the camera and took 4 pictures. only one of the pictures was even remotely good enough to show to anyone because the object was so far away at this point. but when the object was over the trees while i was viewing it out my window it was not moving and i continued to watch it untill it did. And when it started moving it was gone pretty fast. I'm really not sure why or how i first noticed the object.And as far as emotional or physical reaction to the objects presence, i felt extremely hot and my skin was kinda warm and i felt shakey..... but i am assuming that was adreneline from the initial shock of seeing the object. The bottom of the object appeared smoth and black but not shiny. and in the picture you can see a hump on the top like most typical saucers, but when i saw the object it only appeared like a black hole in the sky. the camera i used was a PowerShot A530 Canon model if that helps with anything."],"Log Number":"US-02032008-0019","Tags":"City","Region":"Arkansas","Case Number":"9437","Date Submitted":"02/05/2007 12:00 UTC","City":"Gravette","Summary":"UFO flew slowly in straight line over my house, then stopped briefly above tree line, then continued in original direction.","Weather Factors":"Fog, Light","Object Shape":"Disc, Sphere"}