{"files":["/var/www/straped/mufon/html2text/9438.html.txt","/var/www/straped/mufon/org/9438.html"],"Disposition":"Insufficient Data","Weather Factors":"Unknown","Case Number":"9438","Region":"Kentucky","map":"<A HREF = \"http://maps.google.com/maps?q=36.870401,+-87.484219(9438)&iwloc=A&hl=en\"> mufon case (9438) map </A>","Object Flight Path":"Undisclosed","Tags":"City","Country":"United States","Sighting Duration":"04:00:00","Date of the Event":"11/30/1972 12:00 UTC","City":"Hopkinsville","divs":["Sighting Detailssome years back' while fishing with my grandpa on the comberland river. we had just arrived to the fishing area we had always gone to. my grandpa pumped up the lantern lit it and hung it on a tree nub.grandpa set up one fishing pole and casted it out. while attempting to set up the second pole the lantern went out. i was setting on a make shift saw horse as a stoolto watch to the pole while gramps was telling me a story.suddenly the lantern went out and i was looking out to the bigger opening of the lake watching the water glistiining for an unknown reason or just because of the clear star filled sky i just ask my grandpa if he had ever seen a ufo. he told me he didnt like to talk about them because every time he did something seemd to happen. soon as he said that the lentern went out and allthe lake frogs and bugs crickets went silent. i then looked over at gramps trying to pump the lantern and relight it with a brown paper bag strip. but it would not relight up. grandpa said! ummm thats funny i just pumped this lantern up and it should burn for about two hours. then just about 22deg.to my right... and 45deg.from thr ground upward was 2 craft flying diagnalto each other.the front craft had a very bright buleish light at the left front corner. the light was shinning completley to the side and not in the direction the craft was traveling. all the sounds of the lake frogs and bugs went dead silent.i picked up the big flash light to shine it on the craft. but gramps told me not to shine the light. he said we didnt know what it was and it could have been from the military. we where spooked pretty bad. just about the time to two craft went over our heads just above yree top level .. i looked in the direction where the crafts came from and another set of them went over just as the first two had done.we quickly reeled the poles in and grabed the fishing gear. and went on a fast pace home. me and my granddad never talked abut the sighting again as though it never happened. it was like we we was not supposed to remark. i never understood why. Then\" my grandmother who is still alive told me that me and grandad where down there under them lights for four hours. but i cant seem to fill in that time frame. because when we got there and granpa lit the lantern the shortly it went out. .. he said thats funny i just pumped that thing up and it should burn for two hours. and i know i was in a room whith my grandpa neather one of us had clothes. both naked. setting on a metal bench but not cold.the room was lit up but no lights. the walls where lights. grandpa looked like he was frozen in a stair dazed looking straight ahead knees togather elbows to his sides and hands in his lap. the tall living thing was standiing to my right behind what looked like a medical table but the table was extra wide and not so long from head to toe. i was going to lay my head underneath the things coming down above the bed. but the lizerdy looking thing told me to lay the other way. once it touched me .. i was so shocked i went out. like passed out. i woke up. set up .. then stood on my feet. i then was lead to a dark hall that bent to the right as i walked i came to a box of wiggley blue watery looking light on the floor... the creature thing just looked at it.. like i had the feeling we could just stand and look at it forever or i could step into it. so i did step into the box of blue watery light and .... bingo! every bit of that was over. just wanted to mention.. they dont speak. they comunicate through there face. and you seem to have to know whats being said. as they stare at you. i told it to do what it was needing to do and put us back. i think i have always known what they want from us. im now 45 years old. and that was not the only time this stuff has happend. i have seen the boomerang that you can see thrugh. and what looked like a chevron vee shap and a white candy corn shape craft. and some blinking transporting from one spot to another n the blink of an eye. i have removed a small object from my body dome shaped with a small coil spring like antana looking black indistructibal hair like wire. i have seen the small short cratures in my home just a few years ago... i would be williing to be hipnotized and or what ever means of info providing i could give you.. but you must know i am telling the truth. i am in sound mind.. as crazy as this may sound. you would know by profesionaly testing me. that im telling the truth. give me the chance. to prove this and i'll tell you what they want. i know alot of folks laugh at people who has incountered this stuff and thats why i have not come forward before. but\" if you want to know more.. just ask... and if not! then good enough. the four craft where rectangle reflecting heavy bulky black hot pinkish inside lighting. on an upper area or level. the craft looked flat as to the length an width.no sharp corners. rounded."],"Date Submitted":"11/30/1972 12:00 UTC","Summary":"DARK' IN COLOR' NO SOUND' SLOW SPEED HOT PINK IN SLATS,LIKE ALTURA VIOLET LIGHT. HIGH BLUE LIGHT BEEM. 4 CRAFTS DIAGNAL TO EACH OTHER IN SETS OF 2. DISTANCE FROM ME. ABOUT SEVENTY FIVE FEET, MISSING TIME. BURNT SKIN. RED POWDER. REPTILE LOOKING THINGS","trends":["There have been 4 other sightings in Hopkinsville","There were no other sightings in Hopkinsville on or around November 30th 1972","This sighting has never been favorited.",""],"Source":"MUFON","Viewing Distance":"Unknown","Latitude":"36.870401","Longitude":"-87.484219","Object Features":"Undisclosed","Log Number":"US-02042008-0001","Object Shape":"Boomerang, Chevron, Square, Rectagular"}