{"Date of the Event":"02/04/2008 12:00 UTC","Object Features":"None, Unknown","Longitude":"-77.306373","map":"<A HREF = \"http://maps.google.com/maps?q=38.846224,+-77.306373(9440)&iwloc=A&hl=en\"> mufon case (9440) map </A>","Latitude":"38.846224","Summary":"Reddish Yellow Fireball like object hoovering in Eastern Sky","Disposition":"Unknown","Date Submitted":"02/04/2008 12:00 UTC","Tags":"City","Source":"MUFON","Object Shape":"Fireball, Flash","Region":"Virginia","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9440.html.txt","/var/www/straped/mufon/org/9440.html"],"divs":["Sighting DetailsAt 6:00 AM I woke up and went to my kitchen that has a window facing looking east. I just happened to look out the window into my back yeard and notice the stange bright light in the sky. It was not a headlight on an airplane as most of the airplanes that fly over my house are usually very high up and noticeable. It was something similar to those of the PHX lights from 97-98, however, only one light. It was a very bright reddish yellow almost fireball looking. I must also mention that it was somewhat cloudy this morning...cloudy enough to not see stars. At first I thought of the satellite thats due to hit Earth this month. Moreover, it was steady with a bit of a flicker and then disappeared. A few seconds later it was just as bright again in an area a few away and then moved back to its original spot and then just vanished. I would say that the distance it was away from me was anywhere where from 1 to 5 miles...but it could of been further and at a higher altitude due to the position I was in. I was looking out my window over the roof of an adjacent property with clear view of the sky. That's what I saw and I'm sticking to it. Sorry I have no pictures or videos or anything of the sort. Thanks, ~Experiencing strange stuff."],"Object Flight Path":"Path with directional change","Log Number":"US-02042008-0003","City":"Fairfax","Viewing Distance":"Unknown","Case Number":"9440","trends":["There have been 14 other sightings in Fairfax","There were no other sightings in Fairfax on or around February 4th 2008"],"Country":"United States"}