{"Source":"MUFON","Date Submitted":"05/31/1986 12:00 UTC","Region":"Pennsylvania","divs":["Sighting Details#1 sitting on our porch (my wife & I) we observed very bright, unblinking lights move to the south, turn abruptly and move east, and continue for aprox 30 minutes moving in a calculated path, changing directions as if observing something. Our house was directly in the path of the secret air base in southern Pa. and every few days were punctuated with low flight of A-10 warthogs and a few other unidentified aircraft which would make thunderous noises and be extremely low to the ground. #2 on a mid summer evening my son (19 at the time) saw a bank of five, unblinking lites approaching from the north. We watched for aprox 4 or 5 minutes when we realized there was no sound and there was a very slow, steady approachment. I ran upstairs, grabbed a camcorder and rushed downstairs to tape the 'sighting'. Unfortuneatly, I left the lenscap on the cam,corder and all that was taped was our voices. (since than, eradicated). The lites seemed to either hoover over, or stop short of our barn, and both of us were tremondusly excited. The lights moved backwards and suddenly moved abruptly upwards and dissapeared."],"Disposition":"Unresolved","Tags":"City","Summary":"#1 lite chged directions several times #2 80+ ft over barn(30 ft) visible","Sighting Duration":"Undisclosed","Date of the Event":"05/31/1986 12:00 UTC","Object Features":"Undisclosed","Object Shape":"Circle","trends":["There has been one other sighting in Bedford","There were no other sightings in Bedford on or around May 31st 1986"],"City":"Bedford","map":"<A HREF = \"http://maps.google.com/maps?q=40.018692,+-78.503907(9441)&iwloc=A&hl=en\"> mufon case (9441) map </A>","Country":"United States","Latitude":"40.018692","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9441.html.txt","/var/www/straped/mufon/org/9441.html"],"Case Number":"9441","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-02042008-0004","Longitude":"-78.503907"}