{"Object Features":"Unknown","Longitude":"-122.082701","Summary":"Red colored object","Latitude":"37.389162","divs":["Sighting DetailsI was in my parents backyard just hanging out and I remember just staring up in the night sky. The time was between 7-8PM. I was looking up and at the left corner of my eye I noticed an object that was red in color. At first I thought it was just another satelite. The object was far away like above the atmosphere so I can't tell you the shape. It was moving like the same speed as a satelite would circulating the earth. The direction it was going was east. I stared at it and did not take my eyes of it. Then the most weirdest thing was that it stopped. It completely stopped, it just stayed frozen, then what seemed like the speed of light, it u-turned back to the other direction (west) so fast that it left a red streak of light. I will never forget that experience. I still talk about my experience till this day. This is unexplainable. It can not be an astroid, a satelite or even one of our own. No rock stops and goes. No aircraft today can do what I described. No human being can survive the speed it traveled when it took off especially when it turned around and took off. We are not alone."],"Date Submitted":"08/16/1988 08:00 UTC","Object Shape":"Other, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=37.389162,+-122.082701(9442)&iwloc=A&hl=en\"> mufon case (9442) map </A>","Viewing Distance":"Over One Mile","Disposition":"Unknown","Log Number":"US-02042008-0005","files":["/var/www/straped/mufon/html2text/9442.html.txt","/var/www/straped/mufon/org/9442.html"],"City":"Mountain View","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Region":"California","Case Number":"9442","Weather Factors":"Does Not Apply","Country":"United States","Object Flight Path":"Path with directional change,Other","trends":["There have been 10 other sightings in Mountain View","There were no other sightings in Mountain View on or around August 16th 1988"],"Date of the Event":"08/16/1988 08:00 UTC"}