{"Date Submitted":"02/03/2008 05:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=37.78115,+-122.417826(9445)&iwloc=A&hl=en\"> mufon case (9445) map </A>","Object Features":"Unknown","Object Flight Path":"Path then hovering","Summary":"Bright orange saucer-shaped object in San Francisco","Longitude":"-122.417826","divs":["Sighting DetailsWe were leaving our apartment, and right away I noticed a bright orange light in the western horizon. It was sort of shaped like a sideways teardrop, my partner thought it looked more saucer shaped. I said to my partner 'look at that.\" We were on our way somewhere and started walking down the street toward it. She looked and saw it as we walked west down the sidewalk. As we were walking I said I thought maybe it was a chemtrail. It wasnt. It was bigger, lower in the sky and clearly not an airplane. We followed it for awhile, (it was moving quite slowly. It wasnt a cloud or a trick of the sun. we lost sight of it for a few minutes because we were heading downhill. We thought maybe it was a comet, but it wasnt. It was incredibly bright but not so bright you couldnt stare at it. As we continued our walk, we lost sight of it and really tried to get to a place where we would see it. If it was a plane(which it wasnt) I think it would have still been visible in the sky considering how slow it seemed to be moving. We actually saw a plane and then it was really apparent that what we saw wasnt a plane."],"trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around February 3rd 2008"],"City":"San Francisco","Sighting Duration":"Undisclosed","Latitude":"37.78115","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet","Source":"MUFON","Object Shape":"Fireball, Sphere, Teardrop","Date of the Event":"02/03/2008 05:45 UTC","Tags":"City","Case Number":"9445","Country":"United States","files":["/var/www/straped/mufon/html2text/9445.html.txt","/var/www/straped/mufon/org/9445.html"],"Disposition":"Unknown","Log Number":"US-02052008-0001","Region":"California"}