{"Summary":"Bluewhite, Intensely bright ovals (2) about the same size as a f-16","files":["/var/www/straped/mufon/html2text/9448.html.txt","/var/www/straped/mufon/more/9448_submitter_file1__ufoflightpath.jpg","/var/www/straped/mufon/more/9448_submitter_file2__ufosighting.jpg","/var/www/straped/mufon/more/9448_submitter_file3__UFOsoverhead.jpg","/var/www/straped/mufon/org/9448.html"],"Longitude":"-111.299698","Date Submitted":"09/21/1974 07:00 UTC","Log Number":"US-02052008-0004","City":"Great Falls","Disposition":"Unknown","Country":"United States","Sighting Duration":"00:02:00","Latitude":"47.503335","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","trends":["There have been 5 other sightings in Great Falls","There were no other sightings in Great Falls on or around September 21st 1974","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Case Number":"9448","map":"<A HREF = \"http://maps.google.com/maps?q=47.503335,+-111.299698(9448)&iwloc=A&hl=en\"> mufon case (9448) map </A>","Date of the Event":"09/21/1974 07:00 UTC","Region":"Montana","Source":"MUFON","Object Features":"Undisclosed","Tags":"City","Object Shape":"Oval","divs":["Sighting DetailsI was standing in the front yard of my parents house when I looked to the east and I noticed two, intensely bright, bluewhite, \"dots\" over Old Baldy, 50 miles east of Malmstrom AFB. These \"dots\" instantly accelerated in a westward trajectory and within one tenth of a second they were flying at about six or seven hundred feet off of the deck. Upon reaching Malstrom these objects suddenly slowed down to about 10 knots and cruised down the river valley past the Giants Stadium where there was a ballgame in progress. As the objects reached the area where the Anaconda smoke stack used to stand, they turned upward at a sharp angle, (about 70 degrees) and instantly accelerated to a point out in space. I saw the light distort and stretch as they were gone very quickly. It was as fast as the flash of a flashbulb. BANG! They were gone. The manager of the Ballpark was filming a game and he caught them flying directly over his head on super 8mm. It was shown on the news that night on KFBB. I asked KFBB if they might have that footage and they said it was \"misplaced\". Yeah....I bet it was. I knew that these were intelligent flight paths, in perfect tandem formation, and a human could not withstand the acceleration changes that were occurring to these objects. They weren't natural phenomenon and both objects were identical in size and shape. File 1: What I saw from my perspective File 2: Flight path map File 3: What they looked like on television"]}