{"Sighting Duration":"00:02:00","Case Number":"9449","Tags":"City","Weather Factors":"Unknown","Country":"United States","Viewing Distance":"Unknown","Object Features":"Undisclosed","Summary":"Intense bright lights hovering behind barn.","Date Submitted":"07/20/2002 01:00 UTC","City":"West Tisbury","Disposition":"IFO","files":["/var/www/straped/mufon/html2text/9449.html.txt","/var/www/straped/mufon/org/9449.html"],"trends":["There has been one other sighting in West Tisbury","There was one other sighting in West Tisbury on or around July 20th 2002","This sighting has never been favorited.",""],"Date of the Event":"07/20/2002 01:00 UTC","Longitude":"-70.674472","Log Number":"US-02052008-0005","Object Shape":"Unknown","Region":"Massachusetts","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.381224,+-70.674472(9449)&iwloc=A&hl=en\"> mufon case (9449) map </A>","Source":"MUFON","divs":["Sighting DetailsThe date isnt exact but in mid-july of 2002, a friend and myself had snuck out of my parents house, a beautiful 38 acre horseriding farm located in West Tisbury MA on the Island of Martha's Vineyard, to enjoy our late night ciggarette. Est time of event 1-2 am. Our dedicated smoking spot was about 100 yards or so away from the house and happened to be a granite slab bench used as a mounting stone for riders. We face away from the farmhouse as to not be discovered and were looking directly at the Indoor riding ring (shaped like a giant T square, about 45 feet high, shown in image)We were almost done with our cigarettes when a light appeared as if on the other side of the riding indoor arena in the outdoor jumping arena. At this point it seemed as if someone was sitting in a car behind the arena with its brights on, as we could see the haze of light hidden behind our barn. Just as we were about to investigate the angle of the light shining over the roof began changing as if the object projecting the light was rising. All this time not a singe noise was heard. The light had just reached over the apex of the roof when it instantly dissapeared. In response to this stood up and walked backwards. never for a moment taking my eyes off the site of the event. I remember not being able to sleep that night and to date retelling of the event still gives me goosebumps. Also on an unrelated topic, I've spent my life sailing wooden schooners around the waters of the cape and islands. In the remote locations we anchor, we escape the haze of city lights and most of the time are in near complete star gazing conditions. Lets just say ive seen my fare share of zig zagging objects, light patterens and amazing meteor showers. WE BELIEVE Cpt Brooke Douglas"],"Latitude":"41.381224"}