{"Sighting Duration":"Undisclosed","Source":"MUFON","Latitude":"36.016027","divs":["Sighting Details Driving north on US-93 just south of Hoover Dam I wittnessed a cloud with a light inside of it. I stopped the car and started video taping. As I sat watching trying to figure out where the light was coming from I noticed a blue light hovering behind my car. I turned and looked and saw that the light changed its perspective of me every time I moved my head changing my perspective of it. I turned on the car and started driving franticly. I called my friends in Vegas and told them of the situation.I also called 911. They had no troopers available in the area. The blue lights followed me to Hoover Dam. At the Homeland security check-point I explained to the agent what was going on. He told me to move on. After passing through Hoover Dam I saw that the cloud with the light in it was on top of the hillside. Driving on I reached a town called Boulder. Stopped at a light I saw that the cloud was on top of the next mountain. I stepped out of my car and while talking to my mother on my cell trying to get the cloud in focus, I noticed that the lights had reappeared behind my car with two small ships. There were what seemed to be beeings in a large window moving around watching me. My camera went dead. I got back in the car drove down to Vegas. Approaching my exit, 75, my rear passenger side tire blew out. Waiting for the police to arrive I noticed that there was a cloud directly above my car. Explaining to my mother the situation as it was happening the cloud seemingly was pulsating, waiting for me to exit the car. The police arrived. I changed the tire and went to the Venetian hotel. When I got into my room, I plugged in my camera and started watching the video. Immediatly there were voices that I had not previously experienced. Sitting in my room, I felt as if I was not alone. I left the room and went down to the casino. My phone rang, it was a man identifying himself as Marty Kay with the FAA. He wanted to know my story. I asked him how he got my number. He said the police had contacted him. I told the story but would not let him know where I was staying. I went and got my video camera and had it placed in a hotel safe. I notified an agent from MUFON, a Mr. Mark Easter. He has kept in contact with me ever since. I had notified the local TV stations thinking it would be best if others saw this tape before the government made it or me disappear. I contacted friends and family all suggesting that I not let anyone touch or copy this tape. I arrived at my final destination, Huntington Beach, Ca. where a friend lives. The MUFON people asked if they could make a copy of the tape. I had them sign a non-disclosure contract. They also took samples of my tire. It is apparent that something had scraped the outside of the tire until it blew. I kept the tire."],"Summary":"Light inside of a mushroom shaped cloud. Small bright lights followed my car. Then two small ships flew beside my car","Date Submitted":"01/15/2008 12:00 UTC","Object Features":"Undisclosed","files":["/var/www/straped/mufon/html2text/9451.html.txt","/var/www/straped/mufon/org/9451.html"],"Tags":"City","trends":["There have been no other sightings in Hoover Dam-Las Vegas","This sighting has never been favorited."],"Region":"Nevada","Object Flight Path":"Undisclosed","Log Number":"US-02052008-0007","Disposition":"Hoax","City":"Hoover Dam-Las Vegas","Object Shape":"Other","Date of the Event":"01/15/2008 12:00 UTC","Longitude":"-114.737488","Weather Factors":"Unknown","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=36.016027,+-114.737488(9451)&iwloc=A&hl=en\"> mufon case (9451) map </A>","Country":"United States","Case Number":"9451"}