{"Date Submitted":"08/31/1976 07:40 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=34.096676,+-117.719778(9452)&iwloc=A&hl=en\"> mufon case (9452) map </A>","Log Number":"US-02052008-0008","Object Flight Path":"Hovering then path,Other","Latitude":"34.096676","trends":["There has been one other sighting in Claremont","There were no other sightings in Claremont on or around August 31st 1976"],"Case Number":"9452","Viewing Distance":"21-100 Feet","Object Features":"None","Sighting Duration":"Undisclosed","Longitude":"-117.719778","files":["/var/www/straped/mufon/html2text/9452.html.txt","/var/www/straped/mufon/org/9452.html"],"Summary":"Not including the three glowing, darting spheres in the sky, I would have thought the UFO that hovered over my mother and me was an F-117 Stealth though they did not exist at that time and the craft did not completly match the Stealth we have today.","Region":"California","Country":"United States","divs":["Sighting DetailsIt was long ago when I was about seven... it seemed everything started to happen for me at that age. I never forgot that evening when my mother and I went for a walk. I didn't take many walks with her so this night seemed unusual already and I felt uneasy. I remember wondering why the neighborhood was so dark; it made the clear night sky seem closer since the stars were brighter but my observations were quickly interrupted when my mother grabbed my hand and pulled me toward the Sumner School Park, there in my hometown of Claremont California. My confusion turned to fear when I saw a hovering black craft. I tried to stop my mom from taking me any further but her hand held on tight. She was very excited. She told me not to be scared. The lights of the park dimmed then flickered out completely. Then I noticed three spheres of light dancing in the north-west sky. Sometimes they darted, sometimes they hovered in place, one second they seemed very close while the next they seemed miles away. Their size would increase or decrease depending on the directions they took. They were beautiful balls of light that would subtly change color. Before I knew it, I was standing under the craft, frozen in fear and time. There was no sound... none at all... not from the craft or from the crickets we would usually hear. Above me was a huge, triangular craft not unlike the F-117 Stealth we have today but this craft didn't have any seams that I could tell, its corners were rounded off while the sides were straight across. It had three large, bright lights... one at each corner of its underside. The UFO just hung there at about the same height of a two-story house but it was so massive and I just a child that my size perception was no doubt off. Without warning, sound, or movement of air, the UFO darted straight up then moved slowly to the west. The three spheres met up with it then together they all darted west and then north to the mountains, disappearing into the stars. I had mixed emotions standing there in shock. I don't know how long we were gone but I think it was about 15-20 minutes. Our neighborhood had lost its electricity not long after we had left, my father said, and we didn't gain it back for a good 5-10 minutes after we got back home. My father, who worked for JPL at the time, told my mom and I not to repeat our story to anyone so I didn't. I don't even know if my mother remembers our encounter. Though my fear went away, I continued to carry feelings of insecurity for a long time and I would have the same, strange, recurring dream, of aliens coming into my room, that still haunts me to this day. I continue to suffer from seizures, as does my father, and I still have EEG brain waves that continue to baffle neurologists. I have a bump behind my ear that doctors can't identify but have told me to leave alone saying if it's not bothering me then why bother with it. I am still searching for answers. I just want the truth whether of this world or not, and I finally have this opportunity to tell others who might be able to piece the puzzle together."],"City":"Claremont","Date of the Event":"08/31/1976 07:40 UTC","Disposition":"Unknown","Object Shape":"Sphere, Triangle","Tags":"City","Source":"MUFON","Weather Factors":"Unknown"}