{"Case Number":"9454","Disposition":"Unresolved","divs":["Sighting Details I came from the woodshed with an armload of wood before bed time at about 1:00 AM on a clear fall night with moon shining and snow on the ground. There was no breese blowing. I was walking across my front lawn with the wood when a flash of light caught my eye. In front of me was an object which was all dark and moving at a walking pace or a little faster. There were no lights on it, but the moon was reflecting brightly off of its upper surface. I would estimate it to be about 30 or more feet in length. It was completely silent, not even the sound of moving air. I appeared to be about 100 feet or less from me and about 40 feet above the street. This is a rural area and there are only five houses on this quarter mile long street. My first reaction was that it was a flock of Canada geese, but I should have heard honking or the sound of their wings, and they would have been moving faster. Once I looked it, it immediately picked up speed and sped northward. I turned 90 degrees to my left, and it was moving away directly in front of me. It covered about one third of a mile before I lost sight of it in the night sky, It travelled that distance in about five seconds or less. As it sped away, I could see a very flat object about five times as wide as it was high.The outside edges on each side appeared to dip down slightly. I learned a few days later that my neighbour who was working a half mile from my location had seen a silver rectangular object mooving fast far above him on two different days in the daytime. His sightings were a few days before mine. As the object sped away, I was convinced that it was not a craft which the public is aware of, and I believe it was what we call An Unidentified Flying Object. I was not alarmed, because UFO sightings in this area have been commom for over 30 years, and it was not the first one I have seen."],"City":"Woodstock","Source":"MUFON","Date Submitted":"11/15/2005 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=46.165826,+-67.582976(9454)&iwloc=A&hl=en\"> mufon case (9454) map </A>","Longitude":"-67.582976","Object Flight Path":"Undisclosed","Latitude":"46.165826","Weather Factors":"Unknown","Date of the Event":"11/15/2005 12:00 UTC","Object Shape":"Boomerang, Chevron, Other","Sighting Duration":"00:00:10","Region":"New Brunswick","Tags":"City","Viewing Distance":"Unknown","Log Number":"CA-02052008-0010","Country":"Canada","Summary":"Saw moonlight reflect off of a non illuminated silent object about 100 feet from me which was moving slowly at first.","files":["/var/www/straped/mufon/html2text/9454.html.txt","/var/www/straped/mufon/org/9454.html"],"trends":["There have been 4 other sightings in Woodstock","There was one other sighting in Woodstock on or around November 15th 2005"],"Object Features":"Undisclosed"}