{"Longitude":"-91.530251","Weather Factors":"Unknown","Summary":"a huge fire ball that changed shape rapidly i blacked out wake up with unexplanible bruises and burns","Viewing Distance":"Unknown","Sighting Duration":"00:20:00","Object Flight Path":"Undisclosed","Source":"MUFON","City":"Salem","divs":["Sighting DetailsI was waching t.v inside my house when i heard a anoying squekellike when irst turn on a old t.v. I ent out side with my dog rascal. I walked out to it it had the apperince of fire but i went up to touch it and it was slightly cold like steel that had been left in a freezer or in a snow storm. i than heard a very high frequncy sound that knocked me out. I woke up i my bad in my under wear as if i had gone to bed. I went to make coffe when i reached out to take the pitcher out of the coffe maker i noticed a very large purple and yellow bruise.The next day i went to see my sister who had recenty learned hypnosis. She put me under and she said i told her a tail of horror. They took sperm samples and did reprouduction expeiments on me. they also implanted a chip in my heart. here is my e-mail address if you would like to talk to me personaly:jesstheshizz@yahoo.com here also is my cell-phone # 573-247-3366"],"Tags":"City","Country":"United States","files":["/var/www/straped/mufon/html2text/9459.html.txt","/var/www/straped/mufon/org/9459.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.649789,+-91.530251(9459)&iwloc=A&hl=en\"> mufon case (9459) map </A>","Object Shape":"Blimp, Boomerang, Bullet, Missile, Cigar, Cone, Chevron, Circle, Cross, Cylinder, Diamond, Disc, Egg, Fireball, Flash, Oval, Saturn-like, Sphere, Square, Rectagular, Star-like, Teardrop, Triangle, Other","Date Submitted":"02/02/2007 01:00 UTC","Log Number":"US-02062008-0002","Latitude":"37.649789","Case Number":"9459","Disposition":"Unresolved","Region":"Missouri","Date of the Event":"02/02/2007 01:00 UTC","Object Features":"Undisclosed","trends":["There have been 11 other sightings in Salem","There were no other sightings in Salem on or around February 2nd 2007"]}