{"Date of the Event":"11/15/1969 09:00 UTC","Source":"MUFON","Date Submitted":"11/15/1969 09:00 UTC","Tags":"City","Viewing Distance":"Over One Mile","Case Number":"9462","Weather Factors":"None","Latitude":"33.20374","Country":"United States","Summary":"Ball of light hovering along the desert; could be seen only with Star-light Scope","trends":["There have been 29 other sightings in Oceanside","There were no other sightings in Oceanside on or around November 15th 1969"],"Object Shape":"Other","Object Flight Path":"Path then hovering","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=33.20374,+-117.372283(9462)&iwloc=A&hl=en\"> mufon case (9462) map </A>","City":"Oceanside","Region":"California","Disposition":"Unknown","Sighting Duration":"00:10:00","Log Number":"US-02062008-0005","Longitude":"-117.372283","divs":["sighting detailsthis event ocurred during a marine scout sniper training session at a night firing range on camp pendleton. the date and time is approximate but could be confirmed exactly if government records are kept regarding training. i don't remember the size of the class but at least 20-30 people were present during the training session. marines who were shooting at the targets using star-light scopes began commenting and became excited about a ball of light hovering on the horizon. i looked through a scope and you could see a bright light moving over the desert at low altitude. it went behind a mountain\\hill in the background then reappeared through the valley. the weird thing was when you looked without a scope you could see nothing, just darkness. through the scope you saw an obvious bright light that was moving. the distance is unknown but could be determined because the background was a mountain range and the light went around one of the mountains or larger hills beyond the firing range. at the end the ball of light seemed to stop moving forward, rose higher above the mountains and then streaked up into the night sky at tremendous speed then was gone. it reminded me of a shooting star in reverse. again, nothing could be seen with the naked eye. there was no sound of any kind. i recall we had a gunnery sgt. from the phillipines. he became very excited\\upset and told everyone the incident would not be reported and we were not to speak about it. he did not want to deal with the paper work. i have told many family and friends over the years about this incident and just wanted to document it here. i can be contacted if any further information is required."],"files":["/var/www/straped/mufon/html2text/9462.html.txt","/var/www/straped/mufon/org/9462.html"]}