{"Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","map":"<A HREF = \"http://maps.google.com/maps?q=28.301546,+-81.407571(9465)&iwloc=A&hl=en\"> mufon case (9465) map </A>","Longitude":"-81.407571","Country":"United States","Summary":"sighted flyng object from north to south acrss direct field of moving vehicle","Date of the Event":"05/15/1969 11:00 UTC","Source":"MUFON","Date Submitted":"05/15/1969 11:00 UTC","Case Number":"9465","Weather Factors":"None","Region":"Florida","Latitude":"28.301546","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9465.html.txt","/var/www/straped/mufon/org/9465.html"],"divs":["Sighting Detailswe were traveling from tennessee to florida on a visiting trip to see family. at 11pm we stopped at kissimmee, florida, to fill with gas and call the folks and let them know we woudld be there in an hour. kissimmee was at that time 50 miles from melbourne on a mostly barren streth of straight road. both my wife and i saw a shining flying disc coming approximately from the northeast heading towards ours vehicle, in which we were driving around 60mph. the disc almost instantly approached our vehicle (a 68 camaro) and hovered steadily 3 or so feet above the hood for several minutes while we continued to drive. the disc was many times the size of our vehicle and had a slight glow all around it. after what seemed a few seconds, the disc silently flew away from us towards the southeast at an incredible speed with no audible sound. my wife and looked at each other and simply asked asked eavh other if we saw that. we both calmly agreed we had and spoke not another word about it. the oddest thing about it all was we arrived in melbourne at 2am. our relatives questioned us as to why we took so long to make the hour's drive, but we made no sensible excuse at the time, nor did we speak of the incident ever again. it's now 2008 and i still am haunted by dreams of my wife and i being carried around inside some strange craft. i have no further memories regarding what may or not have occurred."],"Disposition":"Insufficient Data","trends":["There have been 18 other sightings in Kissimmee","There were no other sightings in Kissimmee on or around May 15th 1969"],"City":"Kissimmee","Object Features":"Dome","Log Number":"US-02062008-0008","Tags":"City","Viewing Distance":"20 Feet or Less","Object Shape":"Disc"}