{"divs":["Sighting Detailsmy wife and i wer sitting in the hot tub, that was located on back deck faceing the n. we wer just relaxing and talking and looking at the stars,when she said, what is that light thats comming from the n.? i looked at it for a bit an noticed it had a greenish glowing halo around it.since it was aroind 4:00 a.m. i wondered if any one else was witnessing this. when we first saw it, it was on the n.e. horizen,but after a min.or so ,it was strait towrds us , heading due s,im sure ,it was a lot higher up than it appered to be, but it seemed to be so low.and this thing was huge.at least the size of a football field. when it was directly over us,the sky was iit up like the northern lights.it was outlined with white lights and was rectangular in shape,it had pulsating purple an pinkish lights in the center portion an a green glow all around it.we could hear popping an crackling sounds as it passed over us. we were speechless for afew seconds wile it went over the house,then we jumped from the tub,ran through the house,to the front deck,to the s. side.we watched as it continued to fly strait s. out of sight.we wer still stunned an speechless for a few min.we wer unsure what,if any thing,we should do. so we went to bed,but neather of us could stop talking about it, much less,sleep.about7:00 we flipped thrugh all the news chaneles, but heard nothing.we called nearly every one we knew, but no one had seen it,but weeks later,a friend said, he heard a desciption that sounded like our ufo,from a friend of his in ohio, about the same time we saw this one.we will nevwer for get about this,be fore that night,i was a non believer,not any more.........mark mccartney stillwater ok."],"map":"<A HREF = \"http://maps.google.com/maps?q=36.115607,+-97.058368(9466)&iwloc=A&hl=en\"> mufon case (9466) map </A>","Longitude":"-97.058368","Object Features":"Patterned Surface","Object Flight Path":"Path with directional change","Disposition":"Unknown","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9466.html.txt","/var/www/straped/mufon/org/9466.html"],"Log Number":"US-02062008-0009","Date of the Event":"05/25/2004 04:30 UTC","Summary":"we saw lights comming from the north,so, we watched them until they passed over head , and cont. south out of sight.","trends":["There have been 6 other sightings in Stillwater","There was one other sighting in Stillwater on or around May 25th 2004"],"Sighting Duration":"Undisclosed","Latitude":"36.115607","Case Number":"9466","Country":"United States","Source":"MUFON","Region":"Oklahoma","Date Submitted":"05/25/2004 04:30 UTC","Tags":"City","City":"Stillwater","Object Shape":"Fireball, Flash, Square, Rectagular, Star-like, Other"}