{"divs":["Sighting DetailsWhen I took the dog out, I frequently look at the stars. While in the front yard of our rural home, I noticed a very bright star at about 135 degrees (southeast) and about 20 degrees above the horizon. Sorry, my compass is malfunctioning, so my directions are approximate. As an engineer, I'm fairly good at angles. At first I thought it was a star, until I saw the color changes. Then I thought it might be an aircraft with landing lights on, though it was too high in the sky to be approaching any nearby airport. Other aircraft passed in the vicinity of the light during observation, and they were obviously aircraft. The light was slightly larger than the brightest star in the sky at the time. It changed colors, randomly changing white, blue, and red. While other stars \"twinkled\" in their usual way, this light was brighter, more colorful, \"flashed\" instead of \"twinkled\" and it moved. And by \"flashed\" I mean changed colors. It did not turn on and off. The movement was extremely erratic, sometimes moving slowly, sometimes jumping quickly from one spot to another. The distance it moved would probably fit into a square inch had I held a ruler up at arm's length. Four people saw it and witnessed the movement and color changes. The movement often was a sweeping arc, sometimes a straight line. There was no pattern to the movement. After an hour, the light appears to be moving with the star field. When I am almost convinced it is a star or planet, it jumps around again. None of the other stars or constellations exhibit this kind of movement. I confirmed the object was moving by bracing myself against the house wall and watching as the object danced back and forth behind a tree maybe 200 feet away. The wind is calm, and the object moved behind the main trunk of the tree (and back again), so I would claim that wind is not a factor. The movement is also quite apparent in unobstructed sky without reference objects. I observed the object from several vantage points near our property. There are no clouds. Temperature is 16F. Winds calm. No moon. We are in rural Wisconsin, and there are no cities in the direction of the light, so the sky is dark except for stars in that direction. The two nearby towns cause glowing light in the sky only 5 or 10 degrees above the horizon and are NE and NW of here. I don't have a camera sensitive enough to pick up this \"star\" and show its movement. Again, except for the movement and color changes, I would call it a star. After referencing a star chart at skyviewcafe.com, the light appears to be located close to a line between Procyon and Sirius and about a quarter of the way from Procyon towards Sirius. I cannot place the light on a star chart directly. It is not moving fast enough to be a satellite, yet seems to be moving with the starfield, so probably is not a geostationary bird."],"Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=45.314127,+-91.651001(9467)&iwloc=A&hl=en\"> mufon case (9467) map </A>","Object Features":"Unknown","Sighting Duration":"Undisclosed","Summary":"Erratically moving distant light in sky.","Latitude":"45.314127","trends":["There has been one other sighting in Chetek","There were no other sightings in Chetek on or around February 6th 2008"],"Country":"United States","Disposition":"Insufficient Data","Log Number":"US-02062008-0010","Case Number":"9467","Longitude":"-91.651001","Region":"Wisconsin","Date Submitted":"02/06/2008 06:45 UTC","Viewing Distance":"Over 1 Mile, Unknown","City":"Chetek","Source":"MUFON","Tags":"City","Date of the Event":"02/06/2008 06:45 UTC","files":["/var/www/straped/mufon/html2text/9467.html.txt","/var/www/straped/mufon/org/9467.html"],"Object Shape":"Star-like","Weather Factors":"None"}