{"map":"<A HREF = \"http://maps.google.com/maps?q=48.079536,+-123.101844(9469)&iwloc=A&hl=en\"> mufon case (9469) map </A>","Date Submitted":"02/05/2008 12:20 UTC","files":["/var/www/straped/mufon/html2text/9469.html.txt","/var/www/straped/mufon/org/9469.html"],"City":"Sequim","Latitude":"48.079536","Disposition":"Insufficient Data","Date of the Event":"02/05/2008 12:20 UTC","Region":"Washington","divs":["Sighting Details I wasn't going to report this, but after reading somebodies post today, from Wisconsin, I have to say I think I saw the same thing. Last night I noticed an extra bright Star in the sky and I grabbed my binoculars to take a look. It was white, looked like a Star, yet the way the light seemed to be reflecting off it was odd, it didnt look natural, more like a beam.. it wasnt going downwards, it was more like pointing across the sky, I have no idea what that means but it intrigued me to keep studying the object. All of a sudden it started to Jolt around, not moving far from its original spot, it shot around - up n down back n forth, and changed colors. Blue and purple i saw for sure. I shouted at my husband to come take a look, he took the binoculars and found the object, deeming it a star and handed them back to me. I looked through them again and studied the object hard, I could make no sense of it but I didnt think it was a Star. It again repeated its actions in shooting around and I asked my husband \"Did you see what Im seeing? cause this does not look like a star\" he was like \"what?\" and I had him look again. Again he noted nothing special. I asked him if he saw the colors or it shooting around and he said he hadn't."],"Source":"MUFON","Tags":"City","Viewing Distance":"Unknown","Log Number":"US-02062008-0012","Object Features":"Undisclosed","Summary":"Strange Star in Sky, same as Wisconsin Siting","Case Number":"9469","Country":"United States","trends":["There have been 2 other sightings in Sequim","There were no other sightings in Sequim on or around February 5th 2008"],"Object Shape":"Star-like, Unknown","Weather Factors":"Unknown","Longitude":"-123.101844","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed"}