{"Sighting Duration":"Undisclosed","Region":"California","Date Submitted":"05/10/1995 10:00 UTC","Date of the Event":"05/10/1995 10:00 UTC","Country":"United States","City":"Oxnard","Case Number":"9471","Viewing Distance":"20 Feet or Less","map":"<A HREF = \"http://maps.google.com/maps?q=34.203495,+-119.171072(9471)&iwloc=A&hl=en\"> mufon case (9471) map </A>","Object Features":"Patterned Surface, Wings","Disposition":"IFO","Tags":"City","Log Number":"US-02062008-0014","Latitude":"34.203495","Object Shape":"Boomerang, Chevron","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9471.html.txt","/var/www/straped/mufon/org/9471.html"],"Longitude":"-119.171072","divs":["Sighting Details2007-08-17 1995-05-10 it looked like a steath bomber CA, US This incident occurred in Oxnard, Calif (Ventura Co.) by Ventura Rd. and W.Gonzales Rd. Mothers Day weekend in 1995. My friend Steve and i stepped outside in the evening (10 pm) to smoke a cigarette when i thought i saw out if the northeast a white barn owl swoop from the top of our curb side tree...but it disappeared in the black sky??? Puzzled and starring at the spot i saw NO STARS. As my eyes adjusted more to the Crystal clear night sky the BLANK area grew in size till it filled a yard width chunk of sky? Then a faint outline could be seen of this now TO CLOSE (it made me reflectively DUCK) huge, slow moving silent boomerang shaped object. It now could be seen clearly with the stars twinkling all around it. The rear serrated edges (visually 2 inches) of this flying wing (B-2 Bomber) were shaded in a lighter grayish color like cooling Space Shuttle tiles would look. It seemed to be moving 5 to 10 mph at 1000 ft. above the ground, heading southwest towards the ocean and the Channel Islands off shore. It filled the sky before us silently moving. We watched it for 5 mins. even climbing up on our second story roof top as it flew over us then over the strawberry and corn fields towards the sea. When we lost sight i immediately called Pt. Mugu Air Station knowing that it was the nearest operating radar station within 50 mile.because I'm an ex Air Force Air Traffic Radar Controller once stationed 100 mile north at Vandenberg AFB Lompoc, Cal. They had seen no such contact on the radar screens. In after thought the Owl i thought i saw was one of 3 advertising search light at a nearby car dealership 2 miles away and what i saw was the light hitting the curved surface (lower fuselage) under the left wing. We both went into the house and drew what we EACH saw without comments then compared them and i swear it looked like the B-2 Bomber!!! I think it had been retrofitted with some type of alien technology to move silently and slow. Also if you draw a reverse flight path from the Channel Islands ..Oxnard..Simi Valley back you would end up at Palmdale, Ca and Edwards AFB and if continued Area 51 in Nevada!"],"trends":["There have been 19 other sightings in Oxnard","There were no other sightings in Oxnard on or around May 10th 1995"],"Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Summary":"Close Huge Slow Silent Moving B-2 Stealth Chevron Boomerang shaped"}