{"Source":"MUFON","Log Number":"US-02072008-0002","Summary":"Orb enters bedroom and leaves through wall","Sighting Duration":"00:05:00","Longitude":"-85.499419","Date of the Event":"07/14/2005 12:00 UTC","Case Number":"9473","Object Shape":"Sphere","trends":["There have been no other sightings in Ada","This sighting has never been favorited."],"Date Submitted":"07/14/2005 12:00 UTC","City":"Ada","map":"<A HREF = \"http://maps.google.com/maps?q=42.989493,+-85.499419(9473)&iwloc=A&hl=en\"> mufon case (9473) map </A>","Viewing Distance":"20 Feet or Less","Weather Factors":"Unknown","Object Flight Path":"Stationary","Region":"Michigan","divs":["Sighting DetailsMy wife and I were both in bed and witnessed UFO's on two occasions within 1 month. The first time my wife witnessed the orb in our bedroom. I did not remember the experience but from her account I reached for the orb from a \"dead sleep\" and then the orb came gradually closer to my hand and then left through the wall. On the second occurance, I saw the orb. It came close to my wife's stomach. She was awake and pregnant at the time. It hovered for about two minutes. I was counting the seconds in fear, but also in respect for what I was experiencing I did not move. She was entranced but responded rapidly as it left through the wall. During both experieces the orb hovered steadily near our television in the corner of the bedroom. Then it moved closer to my hand in the first experience and closer to my wife's stomach when she was pregnant. Our certainty of our experiences is absolute. I knew that the first experience had occurred the next morning. My wife was confident in what I saw and what she saw and felt on the second. As Erich Von Daniken described; \"The Gods are with us\" using the \"Chariots of the Gods\". We are a function of their influence on the human race. We need to understand this influence better to develop the means of contact and disolution of human fear. We have the primordial right to understand our perveyors and what they mean to human society. My experiences indicates to me that if we do not change our religiously based view on the \"outerworld\", we will fail ourselves on truth and technological opportunity. J. Scott Kirkman 5387 Hartfield Ct. Ada, MI 49301 616-822-4016"],"Latitude":"42.989493","Country":"United States","Object Features":"None","files":["/var/www/straped/mufon/html2text/9473.html.txt","/var/www/straped/mufon/org/9473.html"],"Disposition":"Unknown","Tags":"City"}