{"Disposition":"IFO","Region":"New Mexico","Source":"MUFON","Viewing Distance":"Unknown","Log Number":"US-02072008-0008","Summary":"Observed object moving from NE to SE in curving track at very high rate of speed.","Date of the Event":"02/07/2008 07:25 UTC","Date Submitted":"02/07/2008 07:25 UTC","City":"Albuquerque","divs":["sighting detailsi was on my front porch watching a small group of sandhill cranes flying directly overhead of me (azimuth +90 degrees) while facing due south when a small object, a bright white dot about the size of a ballpoint pen's head at arms length, came into my view traveling from the northeast towards the southeast. my immediate thought was that this was a satelite but as i watched it pass overhead the object's course began to slightly curve to the west-southwest. the object was moving at a very high rate of speed, taking about 4 seconds to travel from exactly overhead to an azimuth of about +40 degrees when i lost sight of it behind a tree. there was no contrail produced by the object, nor was there any sound. about 2 seconds into its passage the direction changed slightly but was noticeable (making an estimate, if the original course was 225 degrees it would be heading about 240 when i lost sight of it). i have watched multiple planes fly over since, all leave a very obvious contrails. also, i have counted how long it takes for a plane to cover the apporximate distance that i saw the object travel and have averaged about 45 seconds. i have had time to walk from my front porch to my truck, about 20 feet total, open a locked door, take my binoculars out and sight in on the aircraft and verify that it is a airliner in that time span. i knew the moment that i saw this object it was not a military aircraft, i have seen in flight the following: f-106, f-4, f-5\\t-38, f-15, f-16, f-14, f\\a-18, and am reasonably sure i saw an f-22. as an avid bird watcher with over 225 positive species i have seen high flying birds visable only with binoculars, these are clearly identifiable as birds you just can't tell the species. i am also a backyard astronomy buff and have seen satelites\\space station\\space shuttle pass overhead when they are visable but in all cases these have originated in the west side of the compass and headed in a straight line to the east, the ne to se course is what really made me wonder what i was seeing. the very high rate of speed was the second thing that confused me, the only things i have seen travel that fast are meteors but again there was no contrail and i have never seen a meteor travel essentially half way across the visable sky or change direction."],"files":["/var/www/straped/mufon/html2text/9479.html.txt","/var/www/straped/mufon/org/9479.html"],"Tags":"City","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around February 7th 2008"],"Sighting Duration":"Undisclosed","Longitude":"-106.645887","Case Number":"9479","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=35.090491,+-106.645887(9479)&iwloc=A&hl=en\"> mufon case (9479) map </A>","Object Shape":"Circle","Object Flight Path":"Path with directional change","Latitude":"35.090491","Object Features":"Unknown","Weather Factors":"Unknown"}