{"Summary":"a circle or sphere very high in the air probably 50-60 thousand feet, hovering then moving a sharp angles","Object Flight Path":"Hovering then path","Object Features":"Unknown","Tags":"City","City":"Indio","Weather Factors":"None","Latitude":"33.725977","Case Number":"9482","Viewing Distance":"Over One Mile","Disposition":"IFO","divs":["Sighting DetailsThis was the last day of the Bob Hope Chrysler Classic in the Coachella Valley. My friend and I were playing golf down the road in Indio at Landmark Golf Club (now called Terra Lago). We were playing the north course. We had hit our tee shots and were waiting for the group ahead to finish so we could go for the green. I was in the fairway and my friend was off to the right about 30yds. I am a licensed private pilot as well as being a surgeon who is interested in the constellations and I'm always looking for things in the sky. I know what routes commercial planes take out of LA toward Julian VOR etc. I know what a satellite looks like and the path they usually take. While waiting I just looked up and there it was, I just looked right at it. Near as I could tell it looked spherical, it was light gray in color and it appeared judging from passing planes to be well above the 32plus thousand feet the commercial planes were at. It had to be about 50-60 thousand or higher. It appeared stationary and I watched it for about one minute and it did not appear to move. It was a little north of me in direction. Then it did move at acute angles 45 degrees, 90 degrees etc, and I watched it for a few seconds doing that. As soon as I saw it I knew it was a UFO. I then called my friend over so he could verify I wasn't seeing things. He saw it right away after I pointed it out. Together we saw it for another three minutes or so and we verified to each other its movements. We hit up on the green and I tried again to find it but could not. Now one of the only things it could have been I suppose is a weather balloon. At that altitude the wind could have appeared to move it acutely. However,I am not aware of any regular weather balloon launches here in the valley. I discount this because of the angles it took and because it was such a clear day what a waste a balloon would have been. Sorry I don't have any photos. I was at 29 Palms Marine Air Ground Combat Center for four years as a civilian physician and during that time was not aware of regular weather balloon launching. Also, as you are aware, Nellis Air Force base is just north of Vegas as is Area 51. At the height it was you could probably see that far without difficulty. This was really cool and I just wanted them to know that if it wasn't a balloon than someone saw the technology because there are those of us who look up and who understand what certain things look like and that they just can't hide it forever. I would be disappointed if it was a balloon."],"Date Submitted":"01/20/2008 02:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=33.725977,+-116.211652(9482)&iwloc=A&hl=en\"> mufon case (9482) map </A>","Source":"MUFON","Longitude":"-116.211652","Date of the Event":"01/20/2008 02:30 UTC","Sighting Duration":"00:06:00","trends":["There have been 9 other sightings in Indio","There were no other sightings in Indio on or around January 20th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/9482.html.txt","/var/www/straped/mufon/org/9482.html"],"Region":"California","Object Shape":"Circle, Sphere","Log Number":"US-02072008-0011"}