{"Region":"South Carolina","Object Flight Path":"Hovering then path","Latitude":"33.501803","Tags":"City","Summary":"Object hovered in back of trees line still, then afer appx 3 min flew very slowly overhead","Viewing Distance":"20 Feet or Less","Log Number":"US-02072008-0012","divs":["Sighting DetailsI went out on my daughters front porch to have a cigarette and sat down. I noticed a light behind a tree across the street and at first thought it was a street light behind the tree opening. I stared at it because it seemed to blink and move very, very slowly but then seemed to stand still again. I couldn't decide at first whether it was moving or just blinking.Then after watching it hover still in the sky it slowly began to move into sight and I opened the door and yelled into my daughter to come out and said, What are those lights? SHe looked up into the sky and said \"Mom, that's a plane\" and I said \"No, and laughed and said \"Look at how damn big it is, does that look like a plane?\" Then as it flew slowly overhead she could see what I was talking about and it was huge! There was about 3-4 lights, white, in the front, and red and orange lights in the back with a flat greyish middle. It is hard to discribe, but it was rectangular in shape and flat on the bottom and if it were compared in size would have to be atleast two football size long. Very odd! She had then ran back inside to grab her glasses when she could see it was very obviously NOT a plane. But it was gone by the time she got out back in front of the house. We couldn't believe what we had just seen. I asked her what it sounded like to her and how she would discribe it. She says a \"hmmmmmmmmmm\" sound and I say a very low deep rumble sound. This is very strange! We lost sight of the object when it flew overhead of us and out back behind her home into the sky."],"Object Shape":"Square, Rectagular","map":"<A HREF = \"http://maps.google.com/maps?q=33.501803,+-81.965115(9483)&iwloc=A&hl=en\"> mufon case (9483) map </A>","Date of the Event":"02/07/2008 08:15 UTC","files":["/var/www/straped/mufon/html2text/9483.html.txt","/var/www/straped/mufon/org/9483.html"],"Disposition":"Unknown","Longitude":"-81.965115","Date Submitted":"02/07/2008 08:15 UTC","Case Number":"9483","City":"North Augusta","Country":"United States","Sighting Duration":"Undisclosed","Object Features":"None","trends":["There have been 7 other sightings in North Augusta","There were no other sightings in North Augusta on or around February 7th 2008"],"Weather Factors":"None","Source":"MUFON"}