{"Date of the Event":"02/06/2008 06:35 UTC","Summary":"4 orange glowing objects over the western horizon","Country":"United States","Longitude":"-75.921535","Log Number":"US-02082008-0002","Tags":"City","divs":["sighting detailstraveling on brownsville rd. west coming toward the t intersection of bernville\\robesonia road just north of robesonia. i saw a glowing fireball in the horizon roughly over the town of myerstown. the light would stay glowing in the same spot for 5-10 seconds then immediately go out and another glow would appear just to the right of the previous glowing object. the distance apart from the glowing object would be roughly the with of your thumb if you extended your arm toward the objects. there were a total of 4 glowing objects that appeared. they did not appear at the same time, but in the a sequence moving right. when one would go out, another would appear to the right and stay lit and pulsating for 5-10 seconds. this same sequence of glowing lights were witnessed by my brother, dad, and i almost 11 years ago feb 20th 1997. we lived in richland pa and saw the same type of light sequence over the town of myerstown. my brother got a look at it with binoculars and could see tiny white sparkles circling the glowing objects. the feb 20th light sequence lasted much longer, around 30 mins and ended with the orange glowing streaking off and disapearing."],"Object Features":"None","Source":"MUFON","Weather Factors":"Unknown","Sighting Duration":"00:00:15","Latitude":"40.339408","Region":"Pennsylvania","Disposition":"Unknown","Viewing Distance":"Over One Mile","trends":["There have been 42 other sightings in Reading","There was one other sighting in Reading on or around February 6th 2008"],"City":"Reading","files":["/var/www/straped/mufon/html2text/9491.html.txt","/var/www/straped/mufon/org/9491.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=40.339408,+-75.921535(9491)&iwloc=A&hl=en\"> mufon case (9491) map </A>","Date Submitted":"02/06/2008 06:35 UTC","Case Number":"9491","Object Shape":"Circle, Star-like","Object Flight Path":"Stationary"}