{"Log Number":"US-02082008-0007","Summary":"Starlike object maneuvering","divs":["Sighting DetailsOn the evening of the event 2 friends and I were out fishing on the Red River in the area due east of Wichita Falls, Tx. just north of hiway 79. At around 10 pm (it was totally dark)we were just sitting around the campfire enjoying the evening when one of us, and im not sure if it were me or one of my friends noticed a star like object, just a little bit brighter than the majority of the stars, say about the brightness of venus moving along like a satellite. We made the comment about the satellite overhead. As we were watching the object it slowed to a complete stop. It appeared to us that the object was at about the altitude of a jetliner but was very hard to tell. Anyway as we watched the thing, as i said earlier it made a complete stop. Then proceded on after the intitial stop. The object did this three times, and in the process formed a triangle trajectory. In essence the object traveled a straight line, stopped, formed the second border of the triangle then stopped say for 30 seconds at each corner, then completed the triangular trajectory, which was straight overhead.The area covered was probably about the size of a basketball if outstretched at arms length. It did this complete manuever twice, then proceeded in a northwesterly direction at a fairly slow rate of speed ,10 minutes or so until in went out of site to the northwest horizon. There was absolutely no noise associated with this object doing whatever it was doing. We all were fairly shaken up by this because we did not think a satellite could manuever in this manner and that there was abslutely no noise associated. We decided to pack up and leave the river that evening."],"Object Features":"Unknown","City":"Waurika","Latitude":"34.167037","Longitude":"-97.997536","Sighting Duration":"Undisclosed","Tags":"City","Viewing Distance":"Over 1 Mile, Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/9496.html.txt","/var/www/straped/mufon/org/9496.html"],"Object Shape":"Star-like","Disposition":"Unknown","Weather Factors":"Unknown","Date Submitted":"05/31/1972 12:00 UTC","Object Flight Path":"Path with directional change,Path then hovering","Date of the Event":"05/31/1972 12:00 UTC","trends":["There have been no other sightings in Waurika","This sighting has never been favorited."],"Region":"Oklahoma","map":"<A HREF = \"http://maps.google.com/maps?q=34.167037,+-97.997536(9496)&iwloc=A&hl=en\"> mufon case (9496) map </A>","Case Number":"9496","Source":"MUFON"}