{"Object Features":"Other","Object Flight Path":"Path with directional change","Region":"Virginia","files":["/var/www/straped/mufon/html2text/9497.html.txt","/var/www/straped/mufon/org/9497.html"],"Longitude":"-78.653424","Tags":"City","Weather Factors":"None","trends":[],"Sighting Duration":"00:00:20","Source":"MUFON","divs":["Sighting DetailsAt 5:10 PM I was leaving work, walking out to my car. It was an exceptionally clear day. My office is located about 4 miles north-west of Dulles airport and as I walked out to my car I always look at the planes flying over head. I turned back towards the office (I was facing east) and saw a plane flying east away from me. I would say the plane was about 5000 feet up and app. 45 degrees from the horizon. Trailing behind the plane was an object. The object was approximately one-third the size of the plane, and following a plane's length behind. The plane might have been a 747 (I think I recall four engines, but on this I am not entirely certain.) The object, which I first mistook for a puff of cloud, followed the planes' heading and velocity. After the half second of thinking it was a cloud, I then thought it was a fighter jet closely tailing the larger plane. My thought after that was, \"No, no fighter jet would trail a commercial jetliner that closely. Is the plane dragging something?\" I then concentrated on the object, cause at this point I was really puzzled. This needs some set-up. The sun was setting behind me, so the jet that the object was following was lit rather bright from beneath. I could detect no markings or detail on the plane, but it was essentially a large, washed-out white jet shape. The object that was following it was darkish grey in the middle going towards lighter grey at the outside, almost like a cloud. And like a cloud, I believe that the object had indistinct edges. I am doubting myself on this point cause it seems a bit wacky, but I could not really discern a distinct shape to the object... The object followed the jet perfectly the entire 15-20 seconds it was in view. The object did not fall behind, or change its position, behind and slightly to the right of the plane. I grabbed my cell phone, opened it, and snapped a picture. I should have taken my time, cause I only got clear blue sky. (yes, I am hating myself right now.) There was a slight shading difference in the center of the object, so it was not a perfect oval or sphere or disk. It seemed to have a hard edge or seam down the middle. The jet started to bank to the north, \"evasive maneuvers\" I thought, \"the plane knows its being tracked.\" And then, I lost the plane and the object behind the roof of my office building. I then ran backwards towards my car, to try and track the plane and object a little further, but I could not get them back into view. As I said before, this was literally right above Dulles International Airport. The air traffic in the area is extremely heavy. I cannot believe that someone else did not witness this event, either from the control tower, from other planes in the air or from elsewhere on the ground."],"Disposition":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02082008-0008","map":"<A HREF = \"http://maps.google.com/maps?q=37.434353,+-78.653424(9497)&iwloc=A&hl=en\"> mufon case (9497) map </A>","Summary":"Object trailing large jet above Dulles airport","Latitude":"37.434353","Object Shape":"Oval","City":"Undisclosed","Date of the Event":"02/08/2008 12:00 UTC","Country":"United States","Case Number":"9497","Date Submitted":"02/08/2008 12:00 UTC"}