{"Longitude":"-74.139033","Case Number":"9498","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.853148,+-74.139033(9498)&iwloc=A&hl=en\"> mufon case (9498) map </A>","files":["/var/www/straped/mufon/html2text/9498.html.txt","/var/www/straped/mufon/more/9498_submitter_file1__P5220146.jpg","/var/www/straped/mufon/more/9498_submitter_file2__P5220147.jpg","/var/www/straped/mufon/org/9498.html"],"Date Submitted":"05/22/2007 10:00 UTC","Source":"MUFON","trends":["There have been no other sightings in Stone Ridge","This sighting has never been favorited."],"Date of the Event":"05/22/2007 10:00 UTC","Latitude":"41.853148","Object Features":"Undisclosed","Tags":"City","Sighting Duration":"Undisclosed","Log Number":"US-02082008-0009","Disposition":"Hoax","Region":"New York","Viewing Distance":"Unknown","City":"Stone Ridge","Summary":"Feeling as if I was being watched","divs":["Sighting DetailsI did not see objects in sky at the time I took these photos. I was in Stone Ridge, NY on May 22, 2007, roughly around 10 am. While I was waiting for a fellow landscape design crew to show up at our clients home, I felt like I was being watched. I didn't think much of it at the time because the location I was at was a weekend home for this particular client, and the neighbors (whom I assumed where home due to multiple cars in the shared drive) might not have recognized my vehicle. When the crew showed (approximately 10:20 am) we proceeded to walk the front yard (as noted in these pictures) I was taking the photos for reference for future landscape plans myself, the other team and the clients had. When I downloaded the pictures I noticed that there were strange objects in the sky. The two photos I have sent are taken one right after the other just moving slightly right of the first. The first photo shows three objects one very close and then getting progressively further away, in a perfect triangle formation. The second image (taken immediately after the second just to the right of the first) shows a saucer. Stone Ridge is near the Shawangunks, as I believe you can see the ridge rising in the images to the left. The clients live just on the border of Stone Ridge and High Falls. Beyond this area perhaps 10 miles is Accord, NY."],"Object Shape":"Cylinder, Disc","Country":"United States","Object Flight Path":"Undisclosed"}