{"Date of the Event":"02/06/2008 09:03 UTC","Latitude":"34.098809","files":["/var/www/straped/mufon/html2text/9502.html.txt","/var/www/straped/mufon/org/9502.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.098809,+-118.324201(9502)&iwloc=A&hl=en\"> mufon case (9502) map </A>","Case Number":"9502","Date Submitted":"02/06/2008 09:03 UTC","Longitude":"-118.324201","Object Features":"Unknown","Region":"California","Object Shape":"Sphere, Other","Sighting Duration":"Undisclosed","Log Number":"US-02082008-0013","Viewing Distance":"501 Feet - 1 Mile","City":"Los Angeles","Summary":"A sphere/circle shaped object followed by a bright green comet like tail","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around February 6th 2008"],"divs":["sighting detailsi was driving headed south down la brea in medium traffic. out of the corner of my eye i saw a bright moving light, i though it was some type of comet or star or something, but once i looked i realized that it was not. i looked up, and was shocked to see a moving orb\\sphere followed by a bright green comet like tail, but much larger (same shape that a comet tail would be). the color of the green tail was very similar to a green light on a stop light, but was darker at the edges and lighter in the center. the orb\\sphere moved across the sky from east to west very quickly, followed by the comet like tail, and then stopped, and took off up (or out of the atmosphere), and everything dissapeared all at once, the comet like tail was there until the orb moved out of the atmosphere. at first i though the orb was just shrinking in size, but then realized it was moving up - giving an apperance of shrinking in size because it was moving away. i watched it until it was what appeared to be out of the atmosphere, and the orb and tail had both dissapeared at the same time. i was very excited after seeing it, and realizing it was a ufo, and called my dad, who told me he had seen something just like what i had described about a week earlier. very exciting, it was my second sighiting, but my first was not nearly as bright, or destinct."],"Disposition":"IFO","Weather Factors":"Unknown","Country":"United States","Object Flight Path":"Path with directional change,Path then hovering","Source":"MUFON","Tags":"City"}