{"Sighting Duration":"Undisclosed","Source":"MUFON","Weather Factors":"None","trends":["There have been 40 other sightings in Flint","There were no other sightings in Flint on or around July 31st 1975"],"divs":["Sighting Details My friend Ron and I, were collecting money from his paper route. It was summer time, after sundown and I believe it was the year before I started high school, which would make it 1975. We had parked our bikes at a bridge (privately owned walk over bridge) that crosses a creek seperating two front yards on Maple Road in Flint, Michigan. We had stopped there to smoke a cigarette. There was a thick tree line at the rear of the back yards and a very large field with numerous stands of trees beyond that. We were on the south side of Maple Road about a quarter mile west of Fenton Road, looking in a southerly direction. We had both noticed a very bright light that resembled a star in the sky but we could tell it wasn't a star because it was clearly not that high up in the sky. No physical shape could be seen, just a very bright light. Within a minute or two of spotting the light and questioning each other what it could be, the light intensified dramatically. It was not like an artificial light (spotlight or such) but radiating. There was no sound at all. We were wondering what it might be but discounted helicopter or plane as there was no noise. It had started to decend on about a 45 degree angle towards the west very slowly and stopped in a short distance, perhaps 50 to 100 yards. It stopped for a few seconds and then decended at an angle toward the east for about the same distance. Again it stopped momentarily. It then decended straight downward slowly. It went downward to the point that we could no longer see the light directly but could see the huge glow radiating over the height of the trees in the back yards. We could tell it was within a mile, between Maple Road and Hill Road which runs east and west and between Fenton Road and Van Slyke Road, both running north and south. We were excited. No sooner did one of us say something to the effect of \"I wonder if it is landing in the field?\", when the object shot upward at an angle towards the east and into space as far as our eyes could see, beyond the stars. It was gone in less than a 2 seconds. It gave me goose bumps. My friend Ron said, \"I'd like to take a ride on that!\" I told him it gave me the willies and I was ready to get the hell out of there. We finished collecting and I don't recall if we had ever spoke of it afterward. I was thinking about it a few years ago after watching a show on TV where a Navy Commander and several others had witnessed a very bright light during Military Excercises at sea. (I don't remember when the show aired or the details) I only know that the way the Commander explained their sighting, it was as if they had seen exactly the same type of light Ron and I saw. It prompted me to call Ron, who lives in Florida now. I told Ron I wanted to tell him what I remembered and see if it was what he remembered. He verified that the story pretty much summed it up."],"Country":"United States","Object Flight Path":"Hovering then path","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02082008-0015","Longitude":"-83.683816","Region":"Michigan","Date of the Event":"07/31/1975 08:00 UTC","Case Number":"9504","Disposition":"Insufficient Data","Object Features":"None","Object Shape":"Star-like","map":"<A HREF = \"http://maps.google.com/maps?q=43.020627,+-83.683816(9504)&iwloc=A&hl=en\"> mufon case (9504) map </A>","Tags":"City","files":["/var/www/straped/mufon/html2text/9504.html.txt","/var/www/straped/mufon/org/9504.html"],"Summary":"A very bright object that decended slowly at an angle then shot into space in an instant.","Latitude":"43.020627","Date Submitted":"07/31/1975 08:00 UTC","City":"Flint"}