{"map":"<A HREF = \"http://maps.google.com/maps?q=29.768663,+-95.36727(9505)&iwloc=A&hl=en\"> mufon case (9505) map </A>","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around February 8th 2008"],"Object Features":"Undisclosed","Longitude":"-95.36727","Weather Factors":"Unknown","Disposition":"Unknown","Country":"United States","Tags":"City","Object Shape":"Star-like","Date of the Event":"02/08/2008 06:10 UTC","Object Flight Path":"Undisclosed","files":["/var/www/straped/mufon/html2text/9505.html.txt","/var/www/straped/mufon/org/9505.html"],"Case Number":"9505","City":"Houston","Summary":"I saw a star in the southwest sky over Houston, TX, 2-8-2008, then it moved through the sky straight then a little zig then a zag","Log Number":"US-02092008-0001","divs":["sighting detailsi'm standing in my driveway about 6:10am, in houston, tx, harris county, 2\\8\\2008, getting ready to go to work on a very beautiful clear cold morning, looking up skyward and wondering if i will ever see a ufo. i look up towards the northwest sky and i see a star, then it moves! i blink and think my eyes are acting up. it moves again and through the sky straight towards the southeast and makes a quick little zig then a quick little zag, i mean very quickly! like a twitch in your eye quick. it goes straight again a little ways then a very quick zig zag again. it does it again. i'm thinking maybe it's a plane, but it's way to high in the sky and going too quickly. it still looks like a star, can't be a plane. it keeps going straight towards the southeast, quick little zig zags now and then, until it goes past a big star (planet? not sure) in the southeast sky. it passes the big star in the southeast about a quarter past it, the moving star just disappeares straight upwards, into the heavens. never to be seen by my eyes again! very interesting event in my life! never have i saw anything like that, ever! i've always wished i would see a ufo in my life time. do you guys think that's what i saw? i'm happy with this! a lower to earth, ufo would be great too! very thrilling! god bless us all!"],"Source":"MUFON","Latitude":"29.768663","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Date Submitted":"02/08/2008 06:10 UTC","Region":"Texas"}