{"trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around July 31st 2001"],"Date of the Event":"07/31/2001 08:17 UTC","Object Flight Path":"Stationary","Case Number":"9509","City":"Austin","Latitude":"30.274643","divs":["Sighting DetailsI was driving home through the Texas Hill Country outside of Austin, Texas (USA)and saw a very large disc-like object in the sky. Its shape reminded me of the object featured in the Close Encounters movie but the one I saw was smaller and it had more red than blue. It also did not have the height of the fictitious one in the movie. The object I saw had a top section and a bottom level that was at least twice the diameter of the top section making it more like a two-level birthday cake except with a rounded, curved sides. It was perhaps a mile away and so big and bright that I thought it was someone's idea of an expensive joke or perhaps some promotional scheme but as far as I could tell, there was no banner or sign anywhere close to it. The object was entirely lit up like a Christmas tree. There was white, red, blue, yellow, green light and perhaps some other colors but it was not at all garish or tacky looking. I have to say that despite the presence of thousands of lights in so many colors, they all complemented each other and it really was the most marvelous sighting. The object remained stationary in the sky and the lights on it were twinkling, not flashing. My next reaction was to note the time. I wished very much that I had something to capture the sighting but I had no camera or phone with me. It was the brightest, most spectacular thing I've ever seen. I then thought that I was going crazy and had to pinch my arm. I was not under the influence of anything: all of my life, I've been allergic to cigarette smoke and cannot even drink alcohol or tolerate medication like ibuprofen so there was nothing impacting my visual or mental acuity at the time of the sighting. Then I wished that there was someone else around to corroborate what I was seeing. I thought for sure that something so big and bright would be seen by many and I felt that maybe someone would have taken a picture of it by that time and I could see it again in a photo and know it was for real. I wanted to stay in that spot and just observe what might happen next but I had a sick pet waiting for me at home and I needed to give him his medicine. I remember continuing my drive, hoping that I wasn't making a mistake by leaving. The whole sighting took only a few minutes (no more than five). Because I was driving away, I lost sight of it very shortly after leaving that spot. I was certain that the newspaper would report it the next day but I found absolutely nothing in the Austin American Statesman, Austin's daily newspaper. I really haven't spoken about this incident except to one relative and two friends. I had been concerned about being an object of derision if I were to come out more openly with this information. I just wish I had some photo to prove what I had seen. I decided to submit this report because in the last year, I've been diagnosed with a serious illness and I don't want this miraculous sighting to just die with me. I would like to know if someone else has seen it. My profession has been in the fields of marketing research and consulting and I usually believe things when I can substantitate with numbers and fact-based research. However, I cannot explain the presence of what I saw with empirical research nor will I try to. There are times when I question the veracity of what I had seen but I do know what I saw. I consider myself extremely fortunate to have seen it at all. I only wish that I had been able to share it with someone else."],"Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02092008-0005","map":"<A HREF = \"http://maps.google.com/maps?q=30.274643,+-97.737461(9509)&iwloc=A&hl=en\"> mufon case (9509) map </A>","Weather Factors":"Unknown","Country":"United States","Object Shape":"Cylinder, Disc","Summary":"The most beautiful thing I've ever seen in the sky","Object Features":"Dome","Date Submitted":"07/31/2001 08:17 UTC","Longitude":"-97.737461","Source":"MUFON","Sighting Duration":"00:05:00","Tags":"City","Disposition":"Unknown","Region":"Texas","files":["/var/www/straped/mufon/html2text/9509.html.txt","/var/www/straped/mufon/org/9509.html"]}