{"divs":["Sighting DetailsI could not sleep, got up to go to bathroom and looked out window into back yard. I live in the country on four acres. The back fence and the neighbors field adjoining goes up into a slight slope. On the other side of slope is a bunch of trees. I saw a bright orange almost red orange in middle of trees. My first thought was the moon and I realized there was no moon. My second thought was someones' home on other side of hill might be burning. Watched for a couple of seconds and light started to climb. It cleared the trees and appeared to be moving to the east. It appeared to stop and brightness of orange seemed to change to a lighter orange, almost white light. It appeared to stand still, and instead of moving east, the light seemed like it was moving straight toward my house. It sat there for a second and instead went in a south eastern direction. As it progressed along the top of the hill the light appeared to lose some of the bright orange and more white light. It continued along a straight, steady speed across the horizon, not fast. When the object started a southeastern track, it appeared to get longer instead of a circle as it first appeared. I watched until I lost view. I called the police department in Campbellsville and they said it was a plane. Please tell me what type of plane looks like solid orange and where was the flashing lights? I've seen, well really not seen, but heard planes at night and seen the flashing lights. There was neither. I would love to have someone tell me what this was. I had never seen anything like it before. I am a 64 year old, educated woman and I am not prone to seeing things unexplainable. Contrary to the police department, it was not an airplane."],"Sighting Duration":"Undisclosed","Summary":"large circular, bright orange object in south eastern sky","Case Number":"9514","Source":"MUFON","Longitude":"-85.341907","Viewing Distance":"101-500 Feet","Region":"Kentucky","Object Features":"None","Latitude":"37.343397","map":"<A HREF = \"http://maps.google.com/maps?q=37.343397,+-85.341907(9514)&iwloc=A&hl=en\"> mufon case (9514) map </A>","Date Submitted":"02/09/2008 03:55 UTC","Object Shape":"Circle, Cylinder","files":["/var/www/straped/mufon/html2text/9514.html.txt","/var/www/straped/mufon/org/9514.html"],"City":"Campbellsville","trends":["There have been 5 other sightings in Campbellsville","There were no other sightings in Campbellsville on or around February 9th 2008"],"Weather Factors":"None","Log Number":"US-02092008-0009","Object Flight Path":"Hovering then path,Path with directional change","Tags":"City","Disposition":"Unknown","Date of the Event":"02/09/2008 03:55 UTC","Country":"United States"}