{"Summary":"Oval Silver Red lights!","Object Features":"None","Region":"New Jersey","Date of the Event":"02/10/2008 05:10 UTC","Case Number":"9526","trends":["There have been 3 other sightings in North Arlington","There were no other sightings in North Arlington on or around February 10th 2008"],"Tags":"City","City":"North Arlington","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","files":["/var/www/straped/mufon/html2text/9526.html.txt","/var/www/straped/mufon/org/9526.html"],"Longitude":"-74.126029","Object Shape":"Oval","Country":"United States","Source":"MUFON","Latitude":"40.795264","Date Submitted":"02/10/2008 05:10 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=40.795264,+-74.126029(9526)&iwloc=A&hl=en\"> mufon case (9526) map </A>","Disposition":"Unknown","Log Number":"US-02102008-0009","Object Flight Path":"Straight-line path","Weather Factors":"None","divs":["Sighting DetailsIt was 5:10am and I was dropping my friend Rosie off at her house. We pulled in her driveway which is on the left side of the house.. soo the view in front of us was between 2 houses with some trees.. we looked up and saw a large oval craft tilted slightly so we could partially see the underneath of the craft. It was Silver and had lots of big red lights. It passed between the view of the 2 houses and disappeared behind her house. We estimated the craft to be maybe a block away. I said \"What the F was that?\" and she immediately said I think we just saw a UFO! so we backed up and pulled around the block to see where it went.. it literally took maybe 30seconds to get around to where it should have been in view but could not find it. We even tried calling the nearby airport to inquire if there were any low flying planes in the area at that time.. the first time she was told they did not have that info and when I called back a few minutes later I was put on hold until I eventually hung up. we proceeded to drive around for the next hour in search of the craft. We thought we saw something in the next town but can't be sure if that was a plane or not.. we did see some low flying planes which were clearly planes.. this just reinforced our initial sighting seeing the difference between the two."]}