{"Disposition":"Insufficient Data","divs":["Sighting DetailsLooking for shooting stars after 9pm on Feb 9 '08. Saw something, sort of like a planet but it moved. Thought it was a plane, far away, but it changed speed and direction quickly and randomly. Went from small and far away to very much closer. Sometimes round, with big red and white lights. Sometimes with a tail with red and white lights. Resembled the way a helicopter would behave but there is no reason for there to be helicopters That high up in altitude and still so big yet, especially over the blank desert where this happened at night. Other times over this are there have been giant fireballs which light the night sky up like daytime for 4 seconds. Those might be meteors perhaps. And it is easy to say this was just the sighting of Arcturus. It was in the same part of the sky. But it would have to be some crazy angle of declination madness for this to make just one star appear to rise, fall, zip left or right, make u-shaped maneuvers and generally weave around in the sky. I made someone look with me. They said I was wrong but then they saw it too. We were shouting back and forth hey do you see it, did you see that? It was pretty cold and eventually the mystery didn't seem worth standing outside being cold so we went in and stopped looking."],"Weather Factors":"Unknown","Log Number":"US-02102008-0010","map":"<A HREF = \"http://maps.google.com/maps?q=40.651622,+-119.356768(9527)&iwloc=A&hl=en\"> mufon case (9527) map </A>","Object Features":"Unknown","Source":"MUFON","Object Flight Path":"Hovering then path","City":"Gerlach","trends":["There has been one other sighting in Gerlach","There were no other sightings in Gerlach on or around February 9th 2008"],"Tags":"City","Longitude":"-119.356768","Sighting Duration":"00:40:00","Case Number":"9527","Latitude":"40.651622","Summary":"moved like a gigantic helicopter, circle with a tail behind, changed shapes","Viewing Distance":"Over One Mile","Object Shape":"Other","Country":"United States","Region":"Nevada","files":["/var/www/straped/mufon/html2text/9527.html.txt","/var/www/straped/mufon/org/9527.html"],"Date Submitted":"02/09/2008 09:35 UTC","Date of the Event":"02/09/2008 09:35 UTC"}