{"Disposition":"Unknown","Country":"United States","files":["/var/www/straped/mufon/html2text/9529.html.txt","/var/www/straped/mufon/more/9529_submitter_file1__UFOphoto.JPG","/var/www/straped/mufon/more/9529_submitter_file2__UFOdrawing.png","/var/www/straped/mufon/more/9529_submitter_file3__HogbackDrawing.png","/var/www/straped/mufon/more/9529_submitter_file4__HogbackPhoto.jpg","/var/www/straped/mufon/more/9529_submitter_file5__Contour.png","/var/www/straped/mufon/org/9529.html"],"Weather Factors":"Unknown","Object Features":"Unknown","divs":["Sighting DetailsEarly Friday morning I had just filled my second cup of coffee, and wondered out on my back deck to gaze at the stars noticing how beautiful Venus and Mars look in their morning cycle. It was getting cold so just as I started to head in I gazed directly overhead noticing a rather large triangular \"something\" cruising through the sky's. It had three bright lights on each corner, and no stars were visible with in the triangle, telling me what I was seeing is a solid craft. I then quickly grabbed my camera, and as I headed back out side I saw the craft quickly jog to the north, then stop. That's when I saw a smaller triangular craft rise up from behind a hill. It trailed some kind of plasma exhaust as it rose to meet the larger Craft. Just then the larger craft shot a beam towards the smaller craft. This lasted about 9 seconds when the smaller craft shot off into the night unbelievably quick. Almost at the same time the larger craft disappeared. To my surprise when I examined my snapshot I had captured the event. There has been strange events happening over the skies of Evergreen for two weeks prior to this event. Lights appearing in locations, disappearing, and appearing in another spot. Lights hovering then slowly drifting around to then disappear. All along in the back of my mind, I'm saying to my self, \"What's going on\"? Then my event occurred. It left a strange felling over me, not knowing what next to do. So now I have an excellent digital picture for your examination. that is if I can send you an e-mail attachment. Make sure you zoom in, there you'll see a trailing exhaust from the smaller craft, plus a weird looking beam. Chad Eckdahl"],"Tags":"City","Longitude":"-105.21838","Region":"Colorado","Object Flight Path":"Straight-line path,Path with directional change,Path then hovering","Summary":"Larger triangular flies over, meets up with smaller UFO that lifted off ground behind hill. Energy beam from larger UFO hits smaller UFO. After about 9 mins. smaller flys off, larger disappears.","Object Shape":"Triangle","Date of the Event":"02/08/2008 05:10 UTC","Log Number":"US-02102008-0012","Case Number":"9529","trends":["There have been 28 other sightings in Golden","There were no other sightings in Golden on or around February 8th 2008","This sighting has never been favorited.",""],"City":"Golden","Sighting Duration":"00:13:30","Date Submitted":"02/08/2008 05:10 UTC","Source":"MUFON","Latitude":"39.759213","map":"<A HREF = \"http://maps.google.com/maps?q=39.759213,+-105.21838(9529)&iwloc=A&hl=en\"> mufon case (9529) map </A>","Viewing Distance":"101-500 Feet"}