{"Case Number":"9531","Latitude":"33.49681","Summary":"Comet like UFO descended downward then flew horizontally","Log Number":"US-02102008-0014","Weather Factors":"None","Object Features":"Unknown","divs":["Sighting DetailsI was driving down Interstate 26 South towards Charleston, SC this morning, 10 Feb 08, at 10:10 am, when I saw what appeared to be a comet. It was about a mile away to my left and ahead of me, across the interstate and about 1000 feet above the earth. My first thought was, \"What the heck is that?\" And then, \"No one is going to believe me when I tell them I saw this strange thing.\" I really wished I had my camera with me but I didn't. I thought at first it was a plane crashing but it was coming almost straight down with such a forceful trajectory that I thought maybe it was a comet. So I pulled over to watch it and it came to a stop and appeared to hover and then sped down going south above the tree line along I-26 until I lost sight of it; about 3 - 4 minutes later. It was a clear beautiful day, sunny blue skies. What caught my eye about this thing was the \"tail\" behind it - energy trail or whatever. It was definately not an airplane or helicopter. It was something I've never seen before, can not describe its shape - only to say it may have been round. It traveled very fast when it came to a horizontal point above the tree line and was out of sight in about 3 or 4 minutes as I stated above. I felt nothing out of the ordinary during the siting - just called my best friend during it and my mom afterwards to tell them what I saw. Way off in the distance, at the same time I first saw this comet like thing, I saw what looked like the contrail of one of our military jets. A few minutes after this UFO disappeared, again, way off in the distance, I saw 2 contrails which looked like to be from 2 of our own military jets."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.49681,+-80.848228(9531)&iwloc=A&hl=en\"> mufon case (9531) map </A>","Disposition":"Unknown","Longitude":"-80.848228","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Bullet, Missile, Fireball, Unknown","trends":["There have been 2 other sightings in Orangeburg","There were no other sightings in Orangeburg on or around February 10th 2008"],"City":"Orangeburg","files":["/var/www/straped/mufon/html2text/9531.html.txt","/var/www/straped/mufon/org/9531.html"],"Region":"South Carolina","Sighting Duration":"Undisclosed","Country":"United States","Date of the Event":"02/10/2008 10:10 UTC","Source":"MUFON","Tags":"City","Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"02/10/2008 10:10 UTC"}