{"Summary":"This is NOT a first-hand account. Just FYI!","Log Number":"US-02112008-0001","Longitude":"-80.417699","Case Number":"9532","Tags":"City","trends":["There have been 3 other sightings in Jane Lew","There were no other sightings in Jane Lew on or around February 10th 2008"],"files":["/var/www/straped/mufon/html2text/9532.html.txt","/var/www/straped/mufon/org/9532.html"],"Sighting Duration":"Undisclosed","Country":"United States","Weather Factors":"Unknown","Date of the Event":"02/10/2008 12:00 UTC","Latitude":"39.125104","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=39.125104,+-80.417699(9532)&iwloc=A&hl=en\"> mufon case (9532) map </A>","Disposition":"Insufficient Data","Object Features":"Undisclosed","Viewing Distance":"Unknown","City":"Jane Lew","Object Flight Path":"Undisclosed","divs":["sighting detailsas stated in the tagline, this is not a first-hand account. it is more like a third-hand account. i am currently located in westmoreland co. pa. my sister called me from weston, wv earlier today to inform me that she and other members of my family were en-route to i-79 near jane lew to check out a ufo that was being reported over the police scaner. according to her, the object was described by callers as being \"large and round with a lot of lights.\" it was described (presumably by police and other officials as a \"suspicious aircraft\" the event, according to my sister, had gone on for nearly an hour before they decided to check it out. by the time my family arrived at the scene, the incident was over. again, i was a state away at the time. i just wanted to give you a heads up! it's a small area, so it should not be to hard for an investigator to track down info, witnesses and any photos\\recordings. a good place to start would be with the newspaper that covers the area, the weston democrat. tell them that their former sports editor sent you. here's some interesting info about the general area in which the sighting appearently occurred: in the summer of either 1993 or 1994, a ufo was sighted in the area (within a few square miles). the incident resulted in a wv state police trooper wrecking his cruiser while en-route to the area. video of the object supposably exists (or, rather, existed at the time). i have not, however, seen the vidoe\\photos. the general area was also the home of ufo investigator gray barker and saucerian books. chad samples"],"Object Shape":"Undisclosed","Region":"West Virginia","Date Submitted":"02/10/2008 12:00 UTC"}