{"Region":"Texas","trends":["There have been no other sightings in Duffau, tx","This sighting has never been favorited."],"Weather Factors":"None","Date of the Event":"06/30/1970 08:00 UTC","divs":["Sighting DetailsLinda Derrick and I lived on 1200 ac in Duffo Texas we had nothing to do and put chairs out in the front of the house and watched the stars in the sky we noticed a light hovering over the tree line in front of the property and it moved around there for about 20 min. it then took of and headed straight up and began to move from one side of the horizon to the other flashing colored lights like a strobe or ---- ---- from the distants it looked like a long cigar. it came close to the house and then moved in the sky for an hour giving us a show. i saw a plane moving the in sky and it moved in toward it and flew with it for some time and then came back to our house i told linda lets try to communicate with it so i started to use the porch lite and turned it on and off two short one long two short. it did not take long for it to notice us and flew over the house as close as the lite pole was next to the house it was silent and its shape was like a triangle and black... it was so exciting. My father John L Fererro was a marine and built airplanes and he also worked for nasa and built the engins on the space shuttle... So I know aircraft this was not the new stealthy plaines they have now because they dont hoover or fly with out any sound... anyway the craft flew over the property and did this for a long time i told linda i cant see our goverment using there aircraft on us and use so much fuel for so long of a time. It desided to land in the back of the house and when it did the 4 dogs we had and all the cows and other animals began to go crazy screeming about what was happening. I began to think to myself as I watched it in the back Im going to have a heart attack Im so scared. I assumed if whatever was flying it was comming out and trying to come to the house when we heard a gun shot and then we heard a scream that i have never heard before then it took off fast and we watched it move to a star and position itself in front of it and stayed the star pattern was shaped like a kite.. we watched the sky for an hour and noticed small orb like objects moving in formation and all over the place. When all this happended we thought to ourselfs if they had of visited we only had coffie to offer them no drug wish we were on drug so we could explain to ourselfs we were stoned out of our minds and what we saw... the next day a car pulled up and some one got out wearing a hot pink silk shirt did not stop to talk to use drove off. cowbows dont were silk hot pink silk shirts. dont know about that... only told friends about what happend not to long after that i joined the navy and moved to pensacola florida and photography school in 74. in 2000 was again in pensacola and met the man that had taken photos of a ufo while working at the tiki house motor lodge. use to think about a friend that lived in phoinex ar a lot and the ufo lites were seen there. and now in jan 1 lost my sister she hung here self in arlington tx and heard that the ufo were seen over stevenville tx. I think about the ufo we saw all the time and think they are trying to communicate with us i use the porch lite and they noticed ... thats about all i can say that happened to use hope you can use my experience to communicte with them as I did"],"City":"Duffau, tx","Case Number":"9535","Viewing Distance":"20 Feet or Less","Sighting Duration":"05:00:00","Object Shape":"Diamond","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Latitude":"32.082115","Longitude":"-98.019005","files":["/var/www/straped/mufon/html2text/9535.html.txt","/var/www/straped/mufon/org/9535.html"],"Summary":"no sound lots of lights colors triangle shape","Tags":"City","Object Features":"None","Disposition":"Unknown","Date Submitted":"06/30/1970 08:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=32.082115,+-98.019005(9535)&iwloc=A&hl=en\"> mufon case (9535) map </A>","Source":"MUFON","Log Number":"US-02112008-0004","Country":"United States"}