{"trends":["There have been 148 other sightings in San Antonio","There was one other sighting in San Antonio on or around January 3rd 2008","This sighting has never been favorited.",""],"Weather Factors":"Fog, Light","map":"<A HREF = \"http://maps.google.com/maps?q=29.427982,+-98.485818(9542)&iwloc=A&hl=en\"> mufon case (9542) map </A>","Disposition":"Unknown","Object Features":"Unknown","Object Shape":"Circle, Disc","City":"San Antonio","Country":"United States","Date of the Event":"01/03/2008 04:30 UTC","Object Flight Path":"Stationary,Hovering then path","Tags":"City","Longitude":"-98.485818","Sighting Duration":"Undisclosed","Region":"Texas","Summary":"Very large object in the sky, hovering with very bright green and red lights","Latitude":"29.427982","divs":["Sighting DetailsI was driving home from work about 4:30 a.m. heading north on Loop 410 after I passed Pearsall Rd. in the far distance I noticed what at first appeared to be a helicopter in the distance hovering over a neighborhood. As I drove closer I noticed it was still and not moving. It was hovering over the houses outside Loop 410 between Medina Base Rd. and Valley Hi Dr. right outside the military base there. It was hovering very low about 200 ft. in the air. It had very bright dark green lights on the top then it would change to deep red lights on the bottom. On that day there was a fine mist in the air and you could see how large this disc was because when the top green lights would slowly turn on the mass of this object would block the light from shining down and the same thing with the red lights it had under it the body of this object would block the light from going up. The size was about the size of a blimp but disc shaped. I slowed down to look at it and noticed that all the other drivers on the highway also slowed down to about 20 mph. It hovered for a couple of minutes then slowly moved away. I know it was not a plane or jet because it was still. I also am sure it was not a helicopter because of the size of the object, to big to be a police news or airlife helicopter. I hope some of you other drivers who also saw it come out and hopefully have other details on this object, Whether it be one of our aircraft or not. I would just want to find out what it was."],"Case Number":"9542","Date Submitted":"01/03/2008 04:30 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02112008-0011","files":["/var/www/straped/mufon/html2text/9542.html.txt","/var/www/straped/mufon/org/9542.html"],"Source":"MUFON"}