{"Summary":"Cylindrical with 3 or 4 lights on it, otherwise black.","Longitude":"-95.36283","divs":["Sighting DetailsMy girlfriend and I were standing outside the university of St. Thomas' dorms smoking a cigarette when we looked up and thought we saw a satellite. It was much too low though to be a satellite and was moving too quickly. It made no noise whatsoever and appeared to be drifting across the sky seemingly without any form of thrust or means of propulsion. We brushed it off as something we simply couldn't make out against the night sky, but with the reports about another UFO being sighted in Texas on the same night I'm not so sure about what we saw. I have just read the wikipedia news article about the response of the Air force and would like to point out that it is very unlikely that the object we saw was an F-16. I've seen fighter jets fly overhead before and have never seen anything move like this unless floating in space. The lights could possibly have matched up, but the silence and the movement were uncharacteristic of a fighter plane. I've always hoped to see something cool like this, but was always skeptical of reports until I actually saw it for myself. This is largely why I have not told anyone until I read the article."],"trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around January 8th 2008"],"Latitude":"29.766793","City":"Houston","Object Shape":"Cylinder, Square, Rectagular, Other","Object Features":"None, Unknown","files":["/var/www/straped/mufon/html2text/9552.html.txt","/var/www/straped/mufon/org/9552.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.766793,+-95.36283(9552)&iwloc=A&hl=en\"> mufon case (9552) map </A>","Weather Factors":"None","Country":"United States","Region":"Texas","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:15","Date Submitted":"01/08/2008 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Log Number":"US-02122008-0006","Source":"MUFON","Case Number":"9552","Disposition":"Unknown","Date of the Event":"01/08/2008 12:00 UTC","Tags":"City"}