{"Summary":"High in the sky, looked like a star, bright white light, at times red","Latitude":"31.986995","divs":["Sighting DetailsMy husband and I were spending two days at our ranch in Hico on Hwy 6 to go hunting with our son (38) and grandson (9). We awoke early, having coffee on the porch at 4 am. It was a very clear morning. In the Northeast sky, over Cleburn or maybe Ft.Worth, we noticed a brilliant star larger than the North Star. We had never seen a star of this magnitude in that part of the sky before. Suddenly it dropped straight down (about a quarter inch in our eyesight). We thought we were witnessing a plane falling until it went straight back up to it's original location. Pausing for a second it went down at an angle to the right. It was very high in the universe so it's movements had to be travelling thousands of miles per hour. It traversed in every direction well over an hour, never leaving it's location in the sky. A couple of times, for only a second, it became solid red. It remained bright at all times. We called our son and grandson to come quickly from their home a few hundred yards away and we all witnessed it's movements for well over an hour until the sun rose and it became invisible. I tried to capture it with my digital night lens, but it didn't develop. This was not a star or a plane or anything men could design that would travel at such speed. We told our friends about the incident, but didn't report it until the happenings in Stephenville, which is close by. I'd like to say we were astounded and all the other emotions involved in spotting a UFO, but this is the second sighting for us, and far less dramatic.The other was about 40 yrs ago when we witnessed a gigantic UFO hovering closly over trees while we were driving on Hwy 635 at 1 am in Dallas. It traveled at tremendous speed as it sped away. We reported it to the news, our congressman and friends, but after considerable ridicule and disbelief by everyone, we decided this time we wouldn't report this incident. My husband and I are highly respected successful business owners in Dallas. We feel privileged to have witnessed UFOs twice in our lifetime and know that whoever is sharing our hemosphere are far more advanced than we humans and are no doubt more considerate of our space than we would be of theirs given the same capabilities."],"Longitude":"-98.024945","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Case Number":"9555","Source":"MUFON","Log Number":"US-02122008-0009","Object Shape":"Circle, Star-like","trends":["There have been 7 other sightings in Hico","There were no other sightings in Hico on or around November 17th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.986995,+-98.024945(9555)&iwloc=A&hl=en\"> mufon case (9555) map </A>","Weather Factors":"Unknown","City":"Hico","Country":"United States","Region":"Texas","files":["/var/www/straped/mufon/html2text/9555.html.txt","/var/www/straped/mufon/org/9555.html"],"Viewing Distance":"Unknown","Date of the Event":"11/17/2007 04:59 UTC","Date Submitted":"11/17/2007 04:59 UTC","Disposition":"Unknown","Tags":"City","Sighting Duration":"Undisclosed"}