{"Sighting Duration":"Undisclosed","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Object Features":"Unknown","Latitude":"33.921318","Object Shape":"Star-like","trends":["There have been 12 other sightings in Wichita Falls","There were no other sightings in Wichita Falls on or around February 6th 2008"],"Date of the Event":"02/06/2008 10:15 UTC","divs":["Sighting DetailsMy friend, Ashley K., and I got into my car at 10:15 PM on February 6, 2008. I remarked about how much brighter the stars were at her house (she lives in a newer developement area so there aren't a lot of city lights). I opened my moon roof so we could look up at the sky, and that's when we noticed one particular \"star\" that seemed slightly larger and had an orange hue as opposed to the other bluish stars. Ashley said, \"That star just moved!\" And I looked at the \"star\" and watched it for a moment. It sort of curved around in a dipping motion. \"Did you see that?!\" She asked me. \"Is it just our eyes playing tricks on us?\" We loked around at the stars near it and tried to focus on them. They didn't move. Meanwhile, the object displayed a total range of motion and speed. It would make complete circles, zigzags, move up, down, left, right. At one point, the object would zoom from left to right and back again, almost like it was breaking, turning around, and hitting the gas. Then we noticed that there were teeny mini versions of the object that were also flying around. We watched them get really close together and then they'd back a good deal away from each other. We could see tiny red blinking lights on the objects. I believe there were 3 objects total. We watched this for about 45 minutes before I had to go (I was terribly late getting home already). We are totally amazed and convinced. It wasn't a satellite, a star, or Mars...UFO? We hope so!!! :)"],"Disposition":"Unknown","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=33.921318,+-98.488587(9557)&iwloc=A&hl=en\"> mufon case (9557) map </A>","Country":"United States","files":["/var/www/straped/mufon/html2text/9557.html.txt","/var/www/straped/mufon/org/9557.html"],"Case Number":"9557","Region":"Texas","Source":"MUFON","Weather Factors":"None","Viewing Distance":"Over One Mile","City":"Wichita Falls","Summary":"It was the size of a star but had an orange glow to it, which would alternate between dim and bright. At first we though it was Mars but then we noticed a tiny red light blinking on the object.","Date Submitted":"02/06/2008 10:15 UTC","Log Number":"US-02122008-0011","Longitude":"-98.488587"}