{"files":["/var/www/straped/mufon/html2text/9559.html.txt","/var/www/straped/mufon/org/9559.html"],"Tags":"City","Object Flight Path":"Path with directional change,Other","Disposition":"Unresolved","Longitude":"-126.199638","divs":["sighting detailsdecember 13th, 2007. in the evening at about dinner time, my daughter called and asked me to drive her down to the restaurant. the night sky was clear as a bell and very starry. i drove over to pick her up . both her and her b\\f were standing outside pointing up in the sky (south). i watched as two crafts were zipping around following each other. blue and red lights. we watched them as we drove to the restaurant. after the b\\f came out of the restaurant we continued to watch three crafts flying by the moon. i saw a man outside doing something near a shed and i told the b\\f to yell at him and tell him to look. the man couldn't hear us so i drove over to him and pointed. he came over and i told him to look at the space ships and he looked and said, \"oh ya, we see them all the time around here.\" he also said that he has seen more things than he wanted to at times. i said \"omg, thank you, then it's not just us.\" after we got home i looked above our house and noticed these strange stars above. they were in the shape of an octagon. they were there for about ten minutes and then one at a time they disappeared. the fog started in but only where you would walk."],"Object Features":"Unknown","Viewing Distance":"Over 1 Mile, Unknown","Summary":"several objects zipping around in the sky chasing each other","Latitude":"54.886725","Weather Factors":"None","Case Number":"9559","Date of the Event":"12/13/2007 06:00 UTC","Object Shape":"Unknown","Log Number":"CA-02122008-0013","Region":"British Columbia","Sighting Duration":"00:35:00","Country":"Canada","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=54.886725,+-126.199638(9559)&iwloc=A&hl=en\"> mufon case (9559) map </A>","Date Submitted":"12/13/2007 06:00 UTC","City":"Granisle","trends":["There have been 14 other sightings in Granisle","There were 2 other sightings in Granisle on or around December 13th 2007"]}