{"map":"<A HREF = \"http://maps.google.com/maps?q=54.888575,+-126.199218(9563)&iwloc=A&hl=en\"> mufon case (9563) map </A>","Object Shape":"Disc, Unknown","Latitude":"54.888575","files":["/var/www/straped/mufon/html2text/9563.html.txt","/var/www/straped/mufon/more/9563_submitter_file1__Orbspic1.jpg","/var/www/straped/mufon/org/9563.html"],"Tags":"City","Case Number":"9563","Source":"MUFON","Date of the Event":"12/14/2007 08:00 UTC","Country":"Canada","Longitude":"-126.199218","Region":"British Columbia","Date Submitted":"12/14/2007 08:00 UTC","trends":["There have been 14 other sightings in Granisle","There were 2 other sightings in Granisle on or around December 14th 2007","This sighting has never been favorited.",""],"Weather Factors":"None, Fog","City":"Granisle","Object Features":"Unknown","Viewing Distance":"21-100 Feet","Summary":"Dark figure & black objects above","divs":["Sighting DetailsI made a mistake on the time of this report when I submitted it. I was talking to my husband on msn and telling him about the noises in the house and he insisted that I go up to my moms to stay until he could get home the next day. I promised I would. My son came running in. It was about 8pm. He was very upset and told me that he saw a small midget-like thing run across the road in front of him. It was black and ran on 2 legs and had two arms. It ran down the trail to the lake. He was very afraid when he saw it and yelled. He said it was 3' tall. We went to my moms. Shortly after my brother came up and I took him for a drive to the lake with the headlights out. We could see the light dimming and getting bright across the lake. (described in another report) We sat for maybe 5 minutes when he looked above the truck and saw a saucer shape (black), no lights. We jumped out I saw one and it zipped away so fast. Then it returned and then zipped away as soon as you could see it. At some point after midnite the dogs needed to go outside and one of them took off up to the water tower. My son took several pictures outside and especially in the fog there are orb-like things could be seen everywhere. The fog would climb around the house and disappear very fast and then return. Very odd. There were also many \"meteorites\". I am attaching 3 photos taken within seconds of each other. The ones I am talking about on this night were somehow deleted. These were taken a few nights later. Same thing. These see through orbs were all through out our house too, but you only allow 3 picture uploads. The 3 photos I am attaching are just depicting the kind of thing that went on all through December. There were also solid orbs which I have photos of. We did everything to try to check our camera. This occurred on several camera's. The orbs would come and go very quickly. These orbs appeared to turn our neighbours automatic porch light on and off."],"Object Flight Path":"Hovering then path","Sighting Duration":"00:30:00","Log Number":"CA-02122008-0017","Disposition":"Unresolved"}