{"divs":["Sighting DetailsWitness awoke early, went out on patio deck to smoke a cigarette. When looking at his feet he noticed a slight illumination of his feet. He looked up to see a very brilliant light, almost florescent. The object was apparently quite high and directly overhead at the initial sighting. The object was moving quite rapidly from west to east. The object appeared to be one large sphere tethered by a cable a second, but smaller sphere. The apparent relative sizes of the spheres were described as the difference between a softball and a golf ball. The spheres and the cable were aligned in the direction of travel. Both spheres were described as emitting very brilliant light as opposed to reflected sunlight. The event took about 6 to 8 seconds, with the object moving very rapidly to the eastern horizon (towards the east side of Lake Tahoe). Due to the brightness, the witness could not determine any structure other than the spherical shape. There was no sound or contrail left by the object. The witness estimates that the apparent size of the object was such that it would be covered by half of his thumb nail held out at an arm's distance. The witness states that his girlfriend saw the same object at the same time at her residence fifteen miles away. (her statement to be filled in - her observation will apparently corroborate much of his description). The witness called local TV stations in Reno but was told that no one else had reported this object. The witness expresses familiarity with the numerous commercial and military aircraft that fly over the Lake Tahoe area. The unknown object moved much more rapidly that jet aircraft."],"Longitude":"-120.128244","Country":"United States","Date Submitted":"10/22/2007 06:15 UTC","files":["/var/www/straped/mufon/html2text/9564.html.txt","/var/www/straped/mufon/org/9564.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.067407,+-120.128244(9564)&iwloc=A&hl=en\"> mufon case (9564) map </A>","Disposition":"Unknown","Region":"California","City":"Tehoma, California","Latitude":"39.067407","Case Number":"9564","Object Shape":"Sphere","Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","Sighting Duration":"00:00:08","Viewing Distance":"Over One Mile","Log Number":"US-02122008-0018","Date of the Event":"10/22/2007 06:15 UTC","Summary":"Very bright object looking like tethered spheres","Object Features":"Appendage(s)","Weather Factors":"None","trends":["There have been no other sightings in Tehoma, California","This sighting has never been favorited."]}