{"Object Features":"Unknown","Disposition":"Unresolved","Weather Factors":"None, Fog","files":["/var/www/straped/mufon/html2text/9568.html.txt","/var/www/straped/mufon/org/9568.html"],"Sighting Duration":"Undisclosed","City":"Granisle","Log Number":"CA-02132008-0002","Date of the Event":"12/16/2007 07:00 UTC","divs":["Sighting DetailsDecember 16th, 2007 We took more pictures of the house next door and even peered into the window in the daylight and have come to the unanimous agreement that the shape of the alien in the photo cannot be explained away by reflections or anything else. There is nothing in the space the shape occupied. They are out in full force tonight December 16th. starting around 7 pm. We ran out the door, me in my bare feet so didn't even look at the time. There were 4 smaller ones that we could see very plainly zipping around and up and down and all around and they go VERY fast at times, but they swayed like attached by a string from side to side when they were more stationary. They were saucer shape and had orange lights. We also saw the big ship (jet sounding) Flew over us and then a while later coming another way and stopped then disappeared then again looked as if it was coming toward us and then disappeared. Very loud. I was talking to my husband who left this afternoon for logging camp. He said that he was followed all the way to Topley by a craft. It flew along side him at quite a distance. Now as he sits in his bunk house there is banging and crashing going on and something on the roof. He is the only one in there as it is Sunday and the rest of the guys don't come till Monday. We have such useless camera's. It is so dark, when you try to capture the objects, they don't show up in the lense. Next time I am just going to start shooting and see if anything shows up."],"Date Submitted":"12/16/2007 07:00 UTC","Summary":"Four searching objects and one flying above","Viewing Distance":"501 Feet - 1 Mile, Unknown","Object Shape":"Disc, Other","Latitude":"54.892915","Region":"British Columbia","Source":"MUFON","trends":["There have been 14 other sightings in Granisle","There were 4 other sightings in Granisle on or around December 16th 2007"],"Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=54.892915,+-126.202298(9568)&iwloc=A&hl=en\"> mufon case (9568) map </A>","Longitude":"-126.202298","Country":"Canada","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Case Number":"9568"}