{"divs":["Sighting DetailsDecember 19th, 2007 It is the last week before xmas and I haven't even begun to xmas shop. We have had the tree up for a couple of weeks and all the lights and decorations. It really doesn't seem like xmas at all. My brother got some excellent video footage and photographs of what he thought was just a bright light above Babine lake. It turned out to be a lot more than that. He shot this footage just outside his door about a block from the lake. First he got a photo of a bright white light above the lake. Then an explosion of bright light and solid orbs. Then there is a saucer or disc. It is white with a black square on the side that moves around the disc and something that appears bright red and triangular hanging from the it. He also got footage and photos of a capsule like thing and there is a rocket like flame coming from the under it. There appear to be markings all around this thing. He got this on his cell phone and we are trying to find ways to upload the images to our computer. I video taped the cell phone video and then uploaded that onto the computer. Very nice video. I still can't make out the markings but they seem to be geometrical shapes or something. He hasn't given me permission to show the photos or video yet but I did make a drawing of it the best I could."],"Log Number":"CA-02132008-0006","Object Shape":"Cylinder, Disc, Flash, Triangle, Other","Weather Factors":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=54.891655,+-126.197358(9572)&iwloc=A&hl=en\"> mufon case (9572) map </A>","Tags":"City","Date Submitted":"12/19/2007 02:00 UTC","Viewing Distance":"Unknown","Object Features":"Undisclosed","City":"Granisle","Country":"Canada","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9572.html.txt","/var/www/straped/mufon/more/9572_submitter_file1__ufodrawing1.jpg","/var/www/straped/mufon/org/9572.html"],"Longitude":"-126.197358","Object Flight Path":"Undisclosed","Disposition":"Unresolved","Date of the Event":"12/19/2007 02:00 UTC","Source":"MUFON","trends":["There have been 14 other sightings in Granisle","There were 2 other sightings in Granisle on or around December 19th 2007","This sighting has never been favorited.",""],"Latitude":"54.891655","Region":"British Columbia","Case Number":"9572","Summary":"Disc with video of it along with a capsule looking object"}