{"Country":"Canada","City":"Granisle","Date Submitted":"01/12/2008 06:00 UTC","files":["/var/www/straped/mufon/html2text/9573.html.txt","/var/www/straped/mufon/org/9573.html"],"Tags":"City","Case Number":"9573","Region":"British Columbia","Summary":"Huge glowing light out of place","Object Features":"Undisclosed","Longitude":"-126.205478","Viewing Distance":"Unknown","Object Shape":"Cylinder, Other","Log Number":"CA-02132008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=54.889035,+-126.205478(9573)&iwloc=A&hl=en\"> mufon case (9573) map </A>","divs":["Sighting DetailsJanuary 12th My husband and I went down to the landing for dinner. On our way back, as we drove by the fisheries we saw a very large glowing light at the end of the Fulton Lake Rd. The glow was the same as what we saw above the water tower only it didn't appear to be moving. We decided to take a drive down to see what it was. It was very dark and kind of eery driving down it. As we just about reached the end and the light was growing brighter, a coyote came running fast toward the truck. My husband tried to stop but, not in time. The coyote ran right under the front bumper, obviously scared of something it was running from. It didn't get hurt and took off into the bush. We parked at the end of the road facing the lake. Trees were covering the area that the glow was coming from. I wanted to go down the trail to see what it was, but at the same time I was a little freaked out. We stayed for about 10 minutes waiting for the light to rise up, and it didn't. We left the area. I was trying to think of what it might be. I was thinking lamp posts or something, but the light was very big and my husband said it was coming from quite a distance. In that case there would be nothing out there that could do this because it is all thick forested area and lake. January 13th. My husband and I drove down to Fulton during the day to see if there were any lights that would have made the huge glow. We walked down the trail and although there were two buildings close to where we parked, there were no lights that we could see on the outside of them. Also, the glow would have been coming from much further down the lake. January 14th. One of my sons friends told him that he saw a huge glow far back in the trees on his way home from his girlfriends out of town. This was in the evening. My son asked him if it was near fulton and looking a little suprised he said it was. January 15th. My daughter and I took a drive down to the fisheries this evening and tried to see if there were any lights coming from Fulton. There were none. The glow was no longer there."],"Weather Factors":"Unknown","Disposition":"Unresolved","Source":"MUFON","Sighting Duration":"Undisclosed","Object Flight Path":"Undisclosed","Date of the Event":"01/12/2008 06:00 UTC","trends":["There have been 14 other sightings in Granisle","There were no other sightings in Granisle on or around January 12th 2008"],"Latitude":"54.889035"}