{"City":"Granisle","map":"<A HREF = \"http://maps.google.com/maps?q=54.890375,+-126.205858(9574)&iwloc=A&hl=en\"> mufon case (9574) map </A>","Object Flight Path":"Undisclosed","Source":"MUFON","Region":"British Columbia","Disposition":"Unresolved","Country":"Canada","Weather Factors":"Unknown","Latitude":"54.890375","Tags":"City","Log Number":"CA-02132008-0008","trends":["There have been 14 other sightings in Granisle","There were no other sightings in Granisle on or around January 17th 2008"],"Sighting Duration":"00:30:00","Case Number":"9574","Object Shape":"Cylinder, Other","Longitude":"-126.205858","divs":["Sighting DetailsJanuary 17th. My daughter and I decided to go down to the lake to \"star\" watch before dark. We wanted to see the sky just as it was turning dark. Between 5:30 pm and 6:00 pm. We watched the first stars forming. As we did this we saw a light in the sky moving fast. It flew over us and then did a u-turn and parked itself beside a star. It stayed there for the duration we were watching.as stars. Across the lake, as usual we watched as a very large orange looking ball of light came up at the east from behind the trees and pulsed. It rose up and then to the right until it got smaller and looked like a planet. The colors in it are orange, blue, red, white and green. These ones are an every night thing. I don't know if they are planets but there are approximately 8 or more of these each night surrounding the town. Each night lately at about 5:30 pm. we go out to watch night fall and see one or more objects (star size) move across the sky quickly and stop only to look like a star sitting still. Do satellites stop and look starlike then move again. I am not sure."],"files":["/var/www/straped/mufon/html2text/9574.html.txt","/var/www/straped/mufon/org/9574.html"],"Date Submitted":"01/17/2008 05:45 UTC","Date of the Event":"01/17/2008 05:45 UTC","Summary":"Stars that move and planets that move quick and pulse","Object Features":"Undisclosed","Viewing Distance":"Unknown"}