{"Region":"British Columbia","Date of the Event":"01/25/2008 01:45 UTC","Tags":"City","Sighting Duration":"00:15:00","Object Flight Path":"Stationary","Log Number":"CA-02132008-0010","Disposition":"Unresolved","Country":"Canada","trends":["There have been 14 other sightings in Granisle","There were no other sightings in Granisle on or around January 25th 2008"],"divs":["Sighting DetailsJanuary 24th My son and I were driving out of Granisle and he saw a very bright red light above the trees on the left sitting still. Less than two minutes later we saw the most beautiful red lights fly across the sky. There were either three different craft or we saw one three times. I didn't get to see the shape but the red was the brightest and deepest I have ever seen. My son was looking through the binoculars and said it was triangular. The first one which was the closest to us could very well have been a conventional aircraft I thought, except for the fact that we heard no sound and the red was like nothing I had ever seen before. It was also out of place. Also it was flying much lower than any jet I had seen in the area before, which are rarely noticed. Later, I finally witnessed one of the huge \"planets\" move significantly. It was the size of a dime and it moved noticeably fast. January 25th At 1:45 am this morning as I looked out our living room window I saw a white light flashing above the big mine area. I called my son to look and he got the binoculars. He said it was like a mother ship. We went out on the deck to look. Sure enough, looking through the binoculars you could see it! There were red and white lights blinking all around it. Red, white, red, white, red, white. It was like a strobe light and you could tell the lights were going all around it. My son says triangular but I thought circular. It just hovered there at the edge of and above the hill and over the lake. I attempted to get a photo but it was just too far for my camera to pick up. I didn't have my daughters video camera. It is really strange how we watched it for a few minutes got cold and then we both went in the house to carry on with whatever we were doing before that. I think we have just seen so much lately. We never saw it leave."],"Weather Factors":"None","Summary":"Strobe lights of a hovering object over a mine.","Object Features":"Undisclosed","City":"Granisle","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=54.887425,+-126.204458(9576)&iwloc=A&hl=en\"> mufon case (9576) map </A>","Viewing Distance":"Over One Mile","Latitude":"54.887425","Longitude":"-126.204458","Case Number":"9576","files":["/var/www/straped/mufon/html2text/9576.html.txt","/var/www/straped/mufon/org/9576.html"],"Object Shape":"Other, Unknown","Date Submitted":"01/25/2008 01:45 UTC"}