{"Tags":"City","Source":"MUFON","trends":["There have been no other sightings in Bad Axe","This sighting has never been favorited."],"Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=43.801959,+-83.000777(9584)&iwloc=A&hl=en\"> mufon case (9584) map </A>","Disposition":"Unknown","Region":"Michigan","Date Submitted":"02/11/2008 07:45 UTC","divs":["Sighting Detailsat approx: 1945 hrs. I was heading south on M-24 from Caro, MI. while on M-24 near Cass City Road I noticed to the north-east a very bright yellow light high in the sky. In a matter of a few seconds another light appeared very close to the first. these lights seemed to be a great distance away from me at the time. never did I observe the lights move. I was only able to see these lights for approx: 1-2 minutes before both lights disappeared at the same time. I kept looking to the northeast on my way home, but never saw the lights again. At Approx: 2045 hrs I was driving on Sebewaing rd. toward Bad Axe, MI with my brother. shortly after leaving the house my brother stated that on his way home from work (in Bay City, MI) he observed a single light to the north east for approx: 5 minutes. I then mentioned that I saw 2 lights in the same area. My brother described the light he saw as a yellowish tinted light that seemed to stay in one place, then disappear. my brother then pointed out the area where he saw the lights, as we both looked to that area we saw what seemed to be a very different formation of lights in the same area. this time there were 4 dimmer lights lined up in a strait line, but tilted at about a 45 degree angle in the sky. these lights were observed for approx: 1 minute before the lights disappeared. this time the lights went out one by one, and completely disappeared in about 5-6 seconds. at that time I looked at the clock to get a time. the clock stated it was 2045 hrs."],"Case Number":"9584","Object Shape":"Other","Viewing Distance":"Over One Mile","Date of the Event":"02/11/2008 07:45 UTC","Summary":"observed large object in northern sky at two seperate times 1 hour apart // was observed by two persons","files":["/var/www/straped/mufon/html2text/9584.html.txt","/var/www/straped/mufon/org/9584.html"],"Log Number":"US-02132008-0018","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Weather Factors":"Unknown","Latitude":"43.801959","City":"Bad Axe","Longitude":"-83.000777","Country":"United States"}