{"Log Number":"IR-02132008-0021","Sighting Duration":"Undisclosed","City":"Tehran","Date of the Event":"09/19/1976 01:00 UTC","Viewing Distance":"Over One Mile","Case Number":"9587","Source":"MUFON","Object Features":"None","trends":["There have been 2 other sightings in Tehran","There were no other sightings in Tehran on or around September 19th 1976"],"Region":"Tehran","Latitude":"35.696111","Tags":"City","Date Submitted":"09/19/1976 01:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=35.696111,+51.423056(9587)&iwloc=A&hl=en\"> mufon case (9587) map </A>","Object Shape":"Oval, Square, Rectagular","Disposition":"Unresolved","Longitude":"51.423056","divs":["sighting detailshi: i lived in teheran from 1975 through 1977 and personally witnessed this event! i can confirm segments of this event. see other links for reference: http:\\\\www.fufor.com\\case760919.htm http:\\\\brumac.8k.com\\iranjetcase\\iranian%20jet%20case%5b1%5d.pdf http:\\\\www.nicap.org\\tehrandir.htm http:\\\\images.google.com\\imgres?imgurl=http:\\\\www.mufon.com\\bob_pratt\\iran.jpg&imgrefurl=http:\\\\www.mufon.com\\bob_pratt\\classic.html&h=192&w=250&sz=10&hl=en&start=4&sig2=use3ykeqoh4irfsdpuuuia&tbnid=q58s9kudbfpagm:&tbnh=85&tbnw=111&ei=bjezr-g0moo4iagsj-mkcq&prev=\\images%3fq%3dufo%2biran%26gbv%3d2%26hl%3den%26sa%3dg i went to iranzamin high school - graduated in spring 1977. my dad was an ex-pakistan air force officer, living and working in iran for iran air. he worked at the airport and when he got to the office the next morning, he also talked to many witnesses at the airport that saw the same and told me of the scrambling of the f4's and that the instrumentation was jammed. i saw the f4 drop in the sky when it got close to the ufo.. very exciting for a 16-year old! i lived in the mid-central part of the city - about 4.5 miles east of the commercial airport,. near 24-esfand square (the heart of the city). right next to the teheran university. i lived in a high-rise flat with my dad and was studying at late night for school exam (between 12:30am and 1:00am) when i heard the engines of fighter airplanes (phantom(s))streak across the sky. having been an ex-air force officer kid, i have always been fascinated by aircraft and know the distinctive sounds of fighters, i knew these were likely f4-phantoms. i knew this as i have lived next to air bases all my life, and knew that these were phantoms and they were flying very low - too low and too fast. so, something was up! i immediately went to the rooftop of the flat and witnessed the part of the event, after the f4's (both) were in the sky. from when they tried to \"fire on the ufo, and got jammed\". i saw the light (bright, rapidly alternating glows\\colors from white, to red, to blue, orange) basically 'toy' with the aircraft! zipping left and traveled up and down the roofs of homes across the city towards the south of my vantage point (looking downhill, visibility was perfest as it was a very clear fall night and i could see for 30-40 miles for sure without obstruction because of the downhill grade of the land moving gradually away from the teheran mountain range). i watched the event for about 10 minutes towards the end i saw the smaller object exit the large craft far in the distance and go towards the ground it was in a se direction from teheran. i lost sight of the craft after it deposited the smaller craft towards the ground, it traveled away from that location and then moved slowly away, then all of a sudden it zipped across the sky at a very high rate. like a fast meteor! but in reverse back up towards the sky. there was no doubt in my mind at that time that this was a fantastic object not of this earth! later the next day, my dad heard the rest of the facts from people at the airport as i noted above, and all the pieces then made sense. i am so glad to see this information now available to the public as i know what i saw and about 9 years ago i heard of someone on art bell talking about it and they wanted more people to verify the event. i was unable to call in then, but i am glad this is as well documented and confirmed as i saw now - thanks to the internet for making this happen."],"Summary":"Teheran, Iran - Two F4 Phantoms Intercept a UFO over the City","files":["/var/www/straped/mufon/html2text/9587.html.txt","/var/www/straped/mufon/org/9587.html"],"Weather Factors":"Unknown","Object Flight Path":"Path with directional change","Country":"Iran"}