{"map":"<A HREF = \"http://maps.google.com/maps?q=42.52617,+-70.895236(9590)&iwloc=A&hl=en\"> mufon case (9590) map </A>","trends":["There have been 5 other sightings in Salem","There were no other sightings in Salem on or around May 31st 1972"],"Source":"MUFON","Date Submitted":"05/31/1972 12:00 UTC","Date of the Event":"05/31/1972 12:00 UTC","Log Number":"US-02142008-0002","Tags":"City","files":["/var/www/straped/mufon/html2text/9590.html.txt","/var/www/straped/mufon/org/9590.html"],"Object Features":"Undisclosed","Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Shape":"Cigar","divs":["Sighting DetailsSince 1972 I had hoped that others would have submitted a report to MUFON, but since none have been forthcoming I figure this report might jar other peoples memories. It was a big event and was reported in the local newspaper as \"Stange object seen over North Shore.\" (Salem, MA June 1972) Early evening I was driving with my friend when I noticed a bright object in the sky just above the tree tops. I got out of the vehicle and watched the oject move very slowly through the night sky. It was cigar shaped with square windows and round spot lights between the square windows. There was also the shape of a form moving inside one of the square windows but I could not make out the form clearly. The object was approximately 100 feet wide and made no sound and was moving very slowly above the tree tops. I watched the object for a few more minutes and decided to head to another viewpoint. When I got to a higher overlook in the direction the object was moving I got out of my vehicle to locate the object again. I did not locate the object a second time but the police arrived and asked me what I was doing there. When I told them what I witnessed they told me they had followed the object from the other side of town. The next day there was an article in the paper which I had cut out and brought to school to share with my friends. I have never forgotten about what I witnessed that night in the sky.I reported the event to a UFO investigator a few years back (2005) and was dismayed about their efforts in helping me document the sighting. They could never locate the article in the newspaper and I had about given up trying to promote it any longer without the article. Since I now live in Oregon I gave it one more shot and called the Salem Public Library. The librarian said they couldnt send me their collection but would make a personal effort to help me find the article. A few weeks later I got some great news about the sighting. The librarian sent me the newspaper article and another article written from a Mr. Katz who also witnessed the sighting. His article was amazing to read because he describes exactly what I had seen that night. Mr Katz tried to share his sighting to make it as public as possible and goes on to describe how he got a call from a government official that told him to \"drop it.\" Which is also documented in his article. Hundreds of people witnessed the sighting that June in 1972. At least that is what the newspaper said. I called the UFO investigator a short time after I received the article and his reply was surprising. He told me I was at the end of the road with the sighting. He stated, \"What I witnessed was a slow moving aircraft carrying a lit sign.\" This is no way what I had seen moving so close above the trees. To this day I feel the response from the investigator is suspicious. Just like Mr. Katz was told to drop his story, I have to wonder why the investigator sounded so sure I was only watching a slow moving aircraft carrying a lit sign. I think it's time for me to put my sighting to rest and thank MUFON for letting me get my story out. Mr Katz, I hope you will report your sighting here. Or anyone that seen what was in the sky that night please report it. One more interesting point I found out from MR Katz's article was that the electric power was interrupted to homes in the area where the object was seen."],"Country":"United States","Summary":"many people witnessed this event","Region":"Massachusetts","City":"Salem","Object Flight Path":"Undisclosed","Case Number":"9590","Disposition":"IFO","Longitude":"-70.895236","Latitude":"42.52617"}