{"Country":"United States","files":["/var/www/straped/mufon/html2text/9591.html.txt","/var/www/straped/mufon/org/9591.html"],"Region":"Texas","Sighting Duration":"Undisclosed","Summary":"Observing night sky with Gen3 NightVision Goggles viewed flying object invisible to naked eye and silent followed by fixed wing aircraft","divs":["Sighting DetailsI was out on the ranch this warm, clear night, the stars were bright so I was going to view them through my telescope and recently acquired NV optics. The Navy trainers (NAS Kingsville) were both up there, but this time I noticed something different - there was a third fixed wing jet flying in long cirlces around the two and there was a prop plane awac-like flying even further out long circles - I viewed them through my telescope - the two jets were flying lower than normal and were sticking together, they usually split up, this time they were one in front and on top of the other. I then viewed the sky with my NV optics - Gen3 - mil.spec type stuff and I saw clearly a large triangular black object that these jets were following and flying around. There was no jet propulsion or heat signatures registering on my NV, I saw what looked like interior or cockpit lights emanating from the object. There were no exterior lights on this object, to the naked eye it was not visible, even with the aid of good field glasses. I thought it might be some large helicopter doing drug interdiction, but it just moved oddly and then seemed to seperate into three objects instead of one, so i thought it was a formation of helicopters, but they moved with precision and symmetry I had never known or guessed possible and in directions and angles that didn't jibe with my view of physics and aeronautics, so I sought a second opinion and asked someone else to \"look up there and tell me what you see\", then with the aid of binoculars and a telescope, then with the night vision, my friend, was amazed, thought helicopters too but one big black one. We could clearly see the shape of the object on the night sky and what looked like cockpit lights. I went in to get a camera and came back and they were gone, but the jets lingered a few minutes, then they were gone."],"Case Number":"9591","Object Shape":"Triangle","map":"<A HREF = \"http://maps.google.com/maps?q=27.360595,+-98.123615(9591)&iwloc=A&hl=en\"> mufon case (9591) map </A>","City":"Premont","Disposition":"Unknown","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Date Submitted":"04/04/2007 08:30 UTC","Weather Factors":"Does Not Apply","Longitude":"-98.123615","Tags":"City","Latitude":"27.360595","Log Number":"US-02142008-0003","Object Features":"Window(s)","Date of the Event":"04/04/2007 08:30 UTC","trends":["There have been no other sightings in Premont","This sighting has never been favorited."],"Viewing Distance":"501 Feet - 1 Mile, Unknown"}