{"Date Submitted":"11/18/2006 03:12 UTC","files":["/var/www/straped/mufon/html2text/9592.html.txt","/var/www/straped/mufon/org/9592.html"],"Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"3 Disc Shape UFO - PHX AZ","Latitude":"33.451677","City":"Phoenix","Case Number":"9592","trends":["There have been 417 other sightings in Phoenix","There was one other sighting in Phoenix on or around November 18th 2006"],"Object Shape":"Disc","Object Flight Path":"Undisclosed","Region":"Arizona","Disposition":"Unknown","Country":"United States","Source":"MUFON","divs":["Sighting DetailsSaturday November 18, 2006... It was a nice day, cool, bright and cloudless. My wife decided we should have lunch outdoors at the Oso Park in West Phoenix. After getting snacks and drinks at the Food City supermarket on 91st Ave and Thomas Rd we headed to the park. It was 2:45pm, there was a lot of families at the park and all the benches and trees close to the basketball and volleyball courts were already taken, so we headed towards the South side of the park, and picked a tree Southeast of the amphitheater... We laid on the grass a blanket we had with us, and after taking care of the snacks, we laid on the blanket facing up the blue sky, my feet were oriented to the East. I was admiring the nice blue sky, when all of the sudden I saw a bright metallic round shape object appeared up high in the sky; I told my wife \"Look, there's something up there\", after seeing the object, she said \"It must be a hot air balloon\" - I replied, \"No way, that's too high\". The object started to move North in a straigh line and steady speed. I told my wife \"Look, it's moving North\", and she said \"There must be some air blowing up there\"... After several seconds, the object switched direction now going South at the same speed, it didn't make a U-Turn, it just stopped and headed South. I told my wife, \"It's going South now\"; she replied, \"The air must have changed course up there\". The UFO continued moving South, when it pass the point where it first appeared, I noticed a second one further above, it was descending. I said \"There's two of them now\"; my wife didn't say anything. The first UFO continued moving South, when it travelled close to the same distance it had travelled North, it suddenly changed directions again. It went North a high rate of speed, the second UFO joined it and both flew North very fast. To my amazement, a third UFO descended in the same spot where the first two had appeared, and without wasting time, it follow up the other two at an incredible speed... Conclusions: Aproximate altitud 60,000 feet; drifting speed of first UFO was around 1000 mph; final speed 10,000 mph; UFOs size over 300 feet in diameter; The color was aluminum. The animation reflects exactly what I saw. I don't smoke, I don't do prescribed or illegal drugs, I'm not an alcoholic drinker. My mind was completely lucid... It was a great day!"],"map":"<A HREF = \"http://maps.google.com/maps?q=33.451677,+-112.070417(9592)&iwloc=A&hl=en\"> mufon case (9592) map </A>","Log Number":"US-02142008-0004","Viewing Distance":"Unknown","Tags":"City","Weather Factors":"Unknown","Date of the Event":"11/18/2006 03:12 UTC","Longitude":"-112.070417"}