{"map":"<A HREF = \"http://maps.google.com/maps?q=38.596572,+-121.295998(9593)&iwloc=A&hl=en\"> mufon case (9593) map </A>","Viewing Distance":"Unknown","trends":["There have been 18 other sightings in Rancho Cordova","There were no other sightings in Rancho Cordova on or around February 13th 2008"],"divs":["Sighting Detailsi've been noticing a lot of strange lights in sacramento's skies lately...i've always watched the skies at night and never have i seen the activity i've seen this past week. this particular night i had already seen a light similar to the one i'm about to describe. they seem like plane lights, but there are no blinking lights, in fact, it is like one big bright light. and it doesn't fly the same or make any sound, like a plane would. so my boyfriend and i were on a drive and we got off I-50 on sunrise going north...as we turned facing north i looked up and saw one of the bright lights i've been seeing...so i decided to just watch it and see what it would do. it was flying towards us...with some speed, not as much as an airplane might...then it got over a big building, i *think* it was a hotel, but i'm not positive...well, as soon as it got over the building. it stopped. it was so abrupt, at first i wondered if i was actually sure which direction it was moving in...except that i realized it wasn't moving the opposite direction either. just hovering. after about a minute and a half of hovering, it disappeared. i have to say, this object wasn't far from where i was viewing it. we were on an overpass and the hotel was to the right of us on the other side of the overpass..."],"Latitude":"38.596572","files":["/var/www/straped/mufon/html2text/9593.html.txt","/var/www/straped/mufon/org/9593.html"],"Date of the Event":"02/13/2008 11:11 UTC","City":"Rancho Cordova","Object Features":"Undisclosed","Sighting Duration":"00:04:00","Date Submitted":"02/13/2008 11:11 UTC","Object Flight Path":"Undisclosed","Region":"California","Object Shape":"Star-like, Other","Tags":"City","Country":"United States","Weather Factors":"Unknown","Case Number":"9593","Log Number":"US-02142008-0005","Source":"MUFON","Disposition":"IFO","Longitude":"-121.295998","Summary":"aircraft lights hover unlike any aircraft i've ever seen...."}