{"Object Shape":"Flash, Saturn-like, Star-like","Date of the Event":"02/12/2008 07:00 UTC","City":"Undisclosed","Longitude":"-119.411762","Case Number":"9598","Log Number":"US-02152008-0003","Object Features":"Undisclosed","Source":"MUFON","Date Submitted":"02/12/2008 07:00 UTC","Summary":"faint star-like object moving across night sky went extremely bright and turned into faint light with red light orbiting it","Object Flight Path":"Undisclosed","Weather Factors":"Unknown","divs":["Sighting DetailsMy two adult sons and myself were in the back yard around 7 pm, and my youngest son who has excellent vision saw a faint light (equivalent to low magnitude star)moving across the night sky, appearing to be a satellite, although in a roughly south to north direction. My other son and myself took a few seconds to find it and then all of us observed an immediate intensification of the light to a venus or greater brightness and then after a second the light went back to the original faint point of light that it was originally. The track of the light was not straight, appearing to be curving slightly, as it was approximately 70 to 80 degrees above the horizon. After a few seconds it once again intensified in brightness, although only about half of the brightness of before. It did this one more time after another few seconds of observation, and then the really bizarre event happened - the light diminished with a distinct small single point of white light with a small red light appearing to orbit it; creating a halo effect around the white light. This all was happening while the light continued to move across the sky, and only for a second. We all saw this and watched the single white light diminsh in intensity and fade away into the night sky."],"Viewing Distance":"Over One Mile","trends":[],"Region":"California","files":["/var/www/straped/mufon/html2text/9598.html.txt","/var/www/straped/mufon/org/9598.html"],"Country":"United States","Sighting Duration":"Undisclosed","Disposition":"IFO","Latitude":"36.780251","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.780251,+-119.411762(9598)&iwloc=A&hl=en\"> mufon case (9598) map </A>"}