{"Log Number":"US-02152008-0004","Longitude":"-120.798546","Date Submitted":"02/14/2008 07:15 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.729625,+-120.798546(9599)&iwloc=A&hl=en\"> mufon case (9599) map </A>","Weather Factors":"None","Country":"United States","Tags":"City","files":["/var/www/straped/mufon/html2text/9599.html.txt","/var/www/straped/mufon/org/9599.html"],"Source":"MUFON","Summary":"An opaque oval object travelled across the sky from west to east.","City":"Placerville","divs":["Sighting DetailsI was sitting i our hot tub last night around 7pm for the sole purpose of relaxing and looking at the stars. It was a crystal clear night with quite a bit of light from the moon, so I purposely did not turn any lights on in the hot tub or in the immidiate area. We are in what is known as the pine belt area of the Sierras we are not quite foothills but not fully in the mountains, but we are rather remote and there is very little city light to obstruct out view of the night sky. I was just enjoying looking at the stars, and noticed yet another plane coming from the general area of the Sacramento airport, which is quite a distance from us. (about 50 miles as the crow flies). I was watching the plane which was to far west of me and something to my east caught my eye. I gave my fuull attamnetionto the area where the movement was and saw a very weird thing happen. It appeared that an oval \"chunk\" of the sky was moving. The only way I can think to describe it was as if something were flying over head with a \"cloaking\" device for lack of a better descriptor. It was like whateverit was was projecting an image of the nightsky on its underside to cover tiself, but since it was moving the edges of the stars were distorting. It looked like it was not that far over head, it was oval shaped and took about 5 seconds to cross over head from west to east. I have a fairly large view of the night sky where I live and was able to watch it for a long stretch but then it just blended in as it got further out of my range. My reaction was very strange as well. I found myself laughing and said out loud to no one, \"So that's how they do it.\"."],"Date of the Event":"02/14/2008 07:15 UTC","Case Number":"9599","Region":"California","Latitude":"38.729625","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Features":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Oval","trends":["There have been 5 other sightings in Placerville","There were no other sightings in Placerville on or around February 14th 2008"],"Object Flight Path":"Straight-line path"}