{"Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Disposition":"Unknown","Object Features":"Undisclosed","Tags":"City","Log Number":"US-02162008-0003","Weather Factors":"Unknown","trends":["There have been 188 other sightings in Austin","There was one other sighting in Austin on or around February 14th 2008","This sighting has never been favorited.",""],"divs":["sighting detailswe witnessed two ufo fly-overs the evening of 2\\14. one at 8:30pm and another at 9:09pm. i recorded almost 5 minutes of digital video and the results are spectacular to say the least. it's easy to mistake these ufos for conventional aircraft because they can, and do, mimic not only the appearance, but also the sounds of conventional aircraft. i've attached a picture captured from video of a ufo that could easily be mistaken for a helicopter but in reality is a triangle-shaped craft seen almost side-on. these ships are made up of seven or more \"orbs\" of coherent, laser-like light which allows them to appear solid yet shape-shift instantaneously. they can even disguise themselves as a jet or some other craft and the only way you'd know is if you took a picture. the \"jet\" or whatever, won't show up in the photo -- only an orb of light. truly amazing. these ships have been patrolling the austin skys for almost two weeks and if i hadn't seen them with my own eyes i wouldn't believe it was possible. but now i have detailed video and it is a proven fact that these objects exist. i've worked many hours to assemble a video and i'd like to sell it to one of the news organizations. seeing is believing. p.s. these things are not \"silent\". if you hear a loud aircraft where you wouldn't expect to hear one then take notice -- and if you see what you think is a conventioanl aircraft take a good look at its lights. the ufo lights are far more saturated and brilliant than ours."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.271923,+-97.740401(9604)&iwloc=A&hl=en\"> mufon case (9604) map </A>","Country":"United States","Date of the Event":"02/14/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/9604.html.txt","/var/www/straped/mufon/more/9604_submitter_file1__heli.ufo.3.jpeg","/var/www/straped/mufon/org/9604.html"],"City":"Austin","Case Number":"9604","Object Shape":"Triangle","Object Flight Path":"Undisclosed","Date Submitted":"02/14/2008 12:00 UTC","Latitude":"30.271923","Longitude":"-97.740401","Summary":"Fantastic Fly-Over!","Region":"Texas","Source":"MUFON"}