{"divs":["Sighting Details I am reporting this for Jane Yeager who has no personal e-mail access at home. She is a bank manager and her computer would be monitored at work. She sent me a written description of the events, as well as talked to me about them in depth. I am reporting what she gave me here. I lived in the same developmentlater on after more homes were built and the sightings stopped. Strangely, Jane reported that the UFOs seemed to be doing something in the area where our home was later built. There was a beautiful, positive energy on the land where we lived and many people experienced and commented on it. One person said it felt like the first rung on the ladder to heaven!! Silverware stored in a hutch in the dining room did not tarnish during the 10 years that we lived there! (It does tarnish now!!) There was a guest bedroom over the dining room that we called the healing room, because of the way it felt. Numerous guests who slept in that room reported sleeping like they had never slept before. One guest reported watching a Civil War phantom cross through the room and out through the wall. He didn't know that there was a creek across the road called Soldiers' Branch - - named after a Civil War sqirmish that happened there!! Whether the energy on the land had anything to do with the numerous sightings my friend saw in that area before the house was built, I don't know, but thought I would mention it: Ellen Ferguson 919-477-4040 Jane's Story: 1989 - 1992 Angier, NC We lived in a rural development known as Neills Creek Farms, in a small rural community. Our home was the third home built there in the first phase of the development. The second phase was totally undeveloped at the time of the sightings, and was where we saw most of the craft. We thought at the time that what we were seeing was experimental aircraft from Fort Bragg & Pope Air Force Base which wasn't too far away. On many occasions we watched boomerang shaped craft come and move around the area. They would hover and stand perfectly still just above the tree tops at times. There was absolutely NEVER any sound associated with the craft. They were able to raise, lower, speed back and forth effortlessly. There was pasture land in front of us that was slightly hidden by trees. In oher words, you could clearly see into the pasture. Some of the trees had already been cleared in anticipation of future home construction. There were cattle in the pasture most of the time. The craft usually appeared just before dusk. We turned off our lights and watched them from our front porch for what seemed like 10-15 minutes,only to discover that 2-3 hours had passed. We would hurry back into the house to get ready for the next day. We always thought they must be working or experimenting with the craft before heading back towards the base. They appeared to be doing something with the cattle as they shot the light down on them. The bright light came from the middle of the craft as it shot down toward the ground. There were crystal aqua colored lights around the bottom of the craft. The cattle seemed unfazed by their presence. We had company on one occasion and the craft appeared while they were visiting us. The couple refused to visit after that because they thought something was strange about it, first of all, seeing the craft and losing time. They were spooked and refused to talk about it again. So we didn't. We once saw a craft that looked like a tank but most of the craft were boomerang shaped with a heavy middle. The boomerang craft were the size of a football field. My ex-husband said they looked similar to an AWAC (?) We thought it strange that on one occasion helicopters appeared and seemed to be chasing the craft; the craft were gone in an instant,making not one sound in the process. My daughter and I each found a scooped out place on the back of our leg that we didn't connect with the craft, since at that time we thought they had to be terrestrial. On another occasion, someone pointed out a group of dead animals in the woods. I remember 2 cows, several deer, foxes and numerous dead birds on the ground. Again, at the time we didn't put it together with the UFOs. There was no sign of injury on the animals. A friend overheard a man in the grocery store telling someone about seeing a UFO take up a cow!! I don't know if this was related. We never saw them actually take a cow. I hope this is helpful. I feel it is a major sighting although I had absolutely no idea at the time what they might be. Feel free to contact me for further details. Jane Yeager"],"Disposition":"Unknown","Case Number":"9606","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=35.780546,+-78.634204(9606)&iwloc=A&hl=en\"> mufon case (9606) map </A>","Weather Factors":"None","trends":["There have been 31 other sightings in Raleigh","There were no other sightings in Raleigh on or around November 30th 1988","This sighting has never been favorited.",""],"Log Number":"US-02162008-0005","Tags":"City","Object Flight Path":"Path then hovering","Date Submitted":"11/30/1988 12:00 UTC","Country":"United States","Date of the Event":"11/30/1988 12:00 UTC","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Summary":"Multiple sightings of craft that hovered and shot down light on cows. Had missing time.","Longitude":"-78.634204","City":"Raleigh","files":["/var/www/straped/mufon/html2text/9606.html.txt","/var/www/straped/mufon/org/9606.html"],"Source":"MUFON","Object Shape":"Boomerang, Other","Latitude":"35.780546","Region":"North Carolina"}