{"trends":["There have been no other sightings in Marion and Newton","This sighting has never been favorited."],"Object Shape":"Square, Rectagular, Other","Region":"Kansas","Weather Factors":"Unknown","Latitude":"37.025431","Case Number":"9607","Longitude":"-94.335964","Summary":"paced for approx 40 miles on way to work.","Viewing Distance":"501 Feet - 1 Mile","Object Flight Path":"Straight-line path","Object Features":"Unknown","Source":"MUFON","divs":["Sighting DetailsI know I waited too long to report this weird event and I'm not even sure of the exact date, so I'm just approximating it. I am a retired U.S. Marine, and have worked on aircraft since I was 18. I was on my way to work one morning, I usually left at around 4:15 a.m. for my 1 hour drive to work at one of the aircraft manufacturing companies, in Wichita. I was approximately 1 mile south of Marion, when I saw four white flashing lights, like the ones you would see on two radio towers that were side-by-side, off to the east maybe a quarter to half a mile away from me. The lights were not really bright, but they were flashing. I would guess that they were about 60 to 75 feet apart in a square shape. I know where the radio towers around Marion are located, and there are none where I saw these lights. The radio towers are pretty much to the west of town and to the north of where I was, near the county airport. Anyway, I continue driving south on this road, and I kept looking to the east and those lights are still there, like they are pacing me off to the side. I then get to the end of the road which ends at highway 50, and turn right heading west. I just shook it off as strange and continued driving to work. 25 miles later, I merged onto interstate 135 south in Newton, I looked over to the west, and there they are again, still pacing me. After I was about 8 miles south of Newton, I didn't bother to look anymore. Needless to say, I got to work on time, so I didn't have any missing time, which was okay with me."],"Log Number":"US-02162008-0006","files":["/var/www/straped/mufon/html2text/9607.html.txt","/var/www/straped/mufon/org/9607.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.025431,+-94.335964(9607)&iwloc=A&hl=en\"> mufon case (9607) map </A>","City":"Marion and Newton","Country":"United States","Date Submitted":"04/23/2002 04:25 UTC","Disposition":"Unknown","Date of the Event":"04/23/2002 04:25 UTC","Sighting Duration":"Undisclosed","Tags":"City"}