{"divs":["Sighting DetailsAt approx. 9:15PM my husband arrived home from work and yelled for me to come outside. Directly above our home was a HUGE \"ring\" around the moon. We could see the moon through it. At first we were very puzzled and decided to walk a bit and watch it. It dawned on us very quickly that, as hard as it is to explain, it WAS an object...a solid object, I cannot explain how we could see through it. It is difficult to describe this as it's so beyond \"normal.\" It got bigger and appeared to be \"lowering.\" Again, we could only see the ring of the outer perimiter of it. We took pictures and the flash of the camera seemed to make it approach faster. We decided quickly to stop that. (Pictures show nothing, it was pitch black out.) We went inside to make sure our children were OK as we'd been outside at least 20 minutes. Then we came back out, it had moved FAR \"up.\" It was not nearly as close. There were at least 3 beams of light going across it, this did allow us to notice that it was rotating. I wish I could give more detailed info. but it was so...hard to discribe. As it was only minutes ago we will be going back out momentarily - I wanted to make a report AS IT HAPPENED. I honestly don't want to see it again. I am BLOWN AWAY that noone else seemed to notice, it was MASSIVE. It left in an upward and slightly west direction. When it was gone from sight is was basically still overhead...by that I mean it was moving west, but SLIGHTLY. Feel free to contact with any questions or if I can answer anything. I feel very uneasy about this right now. Thanks for reading."],"Case Number":"9609","Object Shape":"Circle","Disposition":"IFO","Weather Factors":"Unknown","trends":["There have been 9 other sightings in Hendersonville","There were no other sightings in Hendersonville on or around February 16th 2008"],"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=35.326438,+-82.459883(9609)&iwloc=A&hl=en\"> mufon case (9609) map </A>","Latitude":"35.326438","Object Features":"Undisclosed","City":"Hendersonville","Summary":"Strange VERY LARGE sphere hovering overhead. Moving slowly and beams of light.","Sighting Duration":"Undisclosed","Date of the Event":"02/16/2008 12:00 UTC","Object Flight Path":"Hovering then path","Viewing Distance":"Unknown","Region":"North Carolina","Tags":"City","Country":"United States","Date Submitted":"02/16/2008 12:00 UTC","Longitude":"-82.459883","Log Number":"US-02162008-0008","files":["/var/www/straped/mufon/html2text/9609.html.txt","/var/www/straped/mufon/org/9609.html"]}