{"trends":[],"Disposition":"Hoax","Object Shape":"Star-like","Log Number":"US-02172008-0005","Sighting Duration":"Undisclosed","divs":["Sighting DetailsIn reference to the prior Florida sighting that was seen in Florida on Feb 16th I too saw a very luminus starlike object speeding fastly through the sky on a direct path that appeared to me mostly westward towards Gulf Of Mexico with a slight nothern path. In contrasts to the prior sighting in which said their luminous object which was moving slow towards the north. This may or may not be related depending on the prior persons sighting time and location. Anyhow the sighting I saw was roughly between 9:30-10:30 pm if this helps the previous Florida reporter. I live in Pasco county which is near tampa only 15 miles away. I've seen many shooting stars and falling stars and this was much different. The main different was the steady brightness and the perfect horizontal N.W path in which it flew. The speed was phenominal and cannot be described in words. I've been extremely facinated with this topic all my life and especially much more recently because of all the sightings that has created a mass awareness to the public. Over the last few weeks I've been constantly looking up more then normal but have never seen anything until just last night.One would have to physically see it to understand as we are to use to the speeds of our conventional man made airplanes. If I had to guess the speed probably 200,000 plus mph. It flew across the entire sky from east to northwest in 2 seconds before it became out of my visual range. I have mixed feelings on this ufo phenomena as we call it. I guess you can sum my feelings up in both fearful and excited at the same time. Trying to process the real truth and to know if we are still at the top of the food change is still unknow until their intentions and our own governments set the truth free to the world so we know if these ET's Or UFO's are either malevolent or benevolent."],"Region":"Florida","Source":"MUFON","Object Features":"Undisclosed","Summary":"In reference to the prior Florida sighting","Tags":"City","Latitude":"27.674187","Case Number":"9616","Date of the Event":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=27.674187,+-81.510924(9616)&iwloc=A&hl=en\"> mufon case (9616) map </A>","Date Submitted":"02/17/2008 07:40 UTC","files":["/var/www/straped/mufon/html2text/9616.html.txt","/var/www/straped/mufon/org/9616.html"],"Object Flight Path":"Undisclosed","Longitude":"-81.510924","Country":"United States","Viewing Distance":"Unknown","City":"Undisclosed","Weather Factors":"Unknown"}