{"Date of the Event":"05/31/2004 12:00 UTC","Tags":"City","Latitude":"40.016306","map":"<A HREF = \"http://maps.google.com/maps?q=40.016306,+-105.269286(9621)&iwloc=A&hl=en\"> mufon case (9621) map </A>","trends":["There have been 30 other sightings in Boulder","There were no other sightings in Boulder on or around May 31st 2004"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","Log Number":"US-02182008-0001","files":["/var/www/straped/mufon/html2text/9621.html.txt","/var/www/straped/mufon/org/9621.html"],"divs":["Sighting DetailsBoth of these sightings are quite old; I've just recently discovered this way to report it. The first sighting was in the Summer of 2004, the second was the Summer of 2007. (That's about as accurate as I can get, sadly.) Both sightings were in Boulder, Colorado. Both times it was raining with very low cloud cover, and both times I was on my apartment balcony, facing north (which is more coincidence than anything, no doubt). During both incidents, I happened to be looking at the cloud formations when I would catch sight of a very small, moving speck of reddish-orange light. At first I thought it was a small bird, as it looked to be about that size. But I then noticed that it was moving in a perfectly straight trajectory, and certainly faster than a bird. I'd be hard-pressed to guess the exact speed, but I'd guess it to be the average speed of a moving car. This was, however, little more than a point of light from what I could see, and it seemed to be skimming the base of the cloud cover, moving in a perfectly straight line. I seem to recall that in both instances, the objects were moving northeast. It wasn't a particularly frightening experience, but it was certainly like nothing I had ever seen or could explain. I watched the object for quite some time, and both times attempted to call my wife out onto the balcony so she could see it, but by the time she got there it had moved out of sight. Since the last sighting I have looked on line at both commonly-reported UFO sightings as well as weather phenomena that would explain this, and I have not found anything. I would be very interested in learning if this has been reported by others, and if it has been explained. Thank you."],"Object Shape":"Unknown","Case Number":"9621","Region":"Colorado","Object Features":"None","City":"Boulder","Longitude":"-105.269286","Summary":"Small, fast-moving speck of light","Disposition":"Unknown","Date Submitted":"05/31/2004 12:00 UTC","Viewing Distance":"501 Feet - 1 Mile","Country":"United States","Source":"MUFON"}