{"Log Number":"US-02182008-0002","Sighting Duration":"00:10:00","Summary":"Triangular object approx. 7mi away hovering then making unorthodox movements before disappearing","Tags":"City","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change","map":"<A HREF = \"http://maps.google.com/maps?q=44.662442,+-83.289659(9622)&iwloc=A&hl=en\"> mufon case (9622) map </A>","Object Features":"Other","Weather Factors":"Unknown","Date of the Event":"08/10/2002 12:00 UTC","Source":"MUFON","Date Submitted":"08/10/2002 12:00 UTC","Longitude":"-83.289659","Case Number":"9622","divs":["Sighting DetailsI was standing watch on a freighter approximately 7mi off shore from Harrisville, MI. It was slightly before sundown when I noticed a black object hovering several hundred feet in the air. It was trianglar in shape with red and white lights at all corners. It remained stationary for a few minutes. I viewed it with binoculars. It was triangular and black. The texture was looked rough or scored, like it had shapes cut into it. It also did not appear on radar when I checked. I called my wheelsman up to the pilothouse to see the object as well. Shortly after he arrived on the bridge the object began moving in our general direction. It slowly gathered speed and passed our ship astern by a few miles. The object never made a sound as it went by. Both of us watched as the craft picked up speed and began moving more erratically and unconventionally. It was changing directions in 90degree turns before it stopped and flew straight up into the air. It disappeared from site shortly thereafter. The wheelsman and I just stood there in shock for a few minutes, not really saying a word. We both eventually got around to talking about it but couldn't quite believe what we saw and even wondered if we had seen anything at all."],"Disposition":"Insufficient Data","files":["/var/www/straped/mufon/html2text/9622.html.txt","/var/www/straped/mufon/org/9622.html"],"Country":"United States","City":"Harrisville","trends":["There have been 3 other sightings in Harrisville","There were no other sightings in Harrisville on or around August 10th 2002","This sighting has never been favorited.",""],"Viewing Distance":"Over One Mile","Object Shape":"Triangle","Latitude":"44.662442","Region":"Michigan"}