{"Object Features":"Unknown","City":"Gautier","Viewing Distance":"21-100 Feet","Region":"Mississippi","divs":["Sighting DetailsI was visiting Gautier, MS for the summer in the late 70's and I remember there was alot of talk in the media about a comet (Or possibly meteor) that would be visible early one morning between 2-3am. Being a curious person I set my clock to wake up so I could witness this celestial event. I went outside that morning and within a few minutes I did see some heavenly body streak across the sky. Just before I was about to go back inside to bed, I saw something else that I've never seen the likes of before or since. In the not too distant night sky I saw a disc shaped object floating slowly towards me. It was very brightly colored (the lights alternated red, blue, green and orange in a circular pattern around the object. I was transfixed by this sight as it inched towards our house. Over the next twenty minutes it floated closer and closer to the yard where I was standing. After about ten minutes of observation it was clear to me that this object was approaching and would soon be directly over head. I would estimate the disc at about 500ft in diameter anf flying about 500ft in the air. There were times when it appeared to come to a dead stop and simply hover, then begin floating slowly closer. The flickering alternating colorful lights were the most striking thing about it and I remeber wondering what government technology could produce such an object. At about the 20 minute mark in the sighting, the object was nearly directly over my head and I remember a strong fear coming over me. I was afraid of being spotted by this craft and went back inside the house. From various windows inside I continued to watch the object as it flew over the front of the house and I ended up in my bedroom watching it pass over the back yard. The object never made a sound. There were a bunch of trees behind the house a few hundred yards away; once the object glided over those trees it appeared to descend further. I watched it hover just above those trees for another 10 minutes or so before it ascended and quickly flew out of sight. No airplane, weather balloon, or helicopter that I know of could account for that sighting. I will never forget what I saw that night and I have come to believe that others have seen the same thing as well."],"map":"<A HREF = \"http://maps.google.com/maps?q=30.385755,+-88.611685(9623)&iwloc=A&hl=en\"> mufon case (9623) map </A>","Log Number":"US-02182008-0003","files":["/var/www/straped/mufon/html2text/9623.html.txt","/var/www/straped/mufon/org/9623.html"],"Date of the Event":"06/30/1978 12:00 UTC","Summary":"I witnessed a large circular object approx 500 ft in diameter & approx 500 ft in the air with bright flashing multicolored lights flying slowly and hovering for approx 30 minutes 1 night in MS.","Longitude":"-88.611685","Source":"MUFON","trends":["There have been no other sightings in Gautier","This sighting has never been favorited."],"Latitude":"30.385755","Weather Factors":"None","Disposition":"Unknown","Object Shape":"Circle, Sphere","Tags":"City","Case Number":"9623","Date Submitted":"06/30/1978 12:00 UTC","Country":"United States","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering"}