{"Region":"Indiana","Source":"MUFON","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Log Number":"US-02182008-0009","divs":["Sighting DetailsWe were driving home from Merrillville on US route 2 when right outside of Valparaiso we saw MANY bright strange lights in the distance. My son and boyfriend were present at the time. Objects looked like they were hovering off in the distance some not moving some seemed to be connected to one another then split off. We watched one moving stopped in midair then did a u turn off sorts! At first we thought it was about 15 planes flying low in a pattern as one got closer it was noticeable that it was NO plane! It was huge and made no sound very low and very weird bright lights, flying very slow! As we were driving I rolled my window all the way down and stuck my head and body out the window to watch it fly over the car. The moon was behind it and emitted enough light that I got a very clear picture of it's shape! It was no plane it was triangular and had 3 very bright lights at the points! The weirdest thing was the underneath! Many lights then one red light in the middle! My son watched it go over out the back window and he saw this as well. I was scared and I told my boyfriend to rush home to our other children. We were all scared to even turn on the radio! I was worried about what we'd here on the news!! I am not joking! Also as it flew off in the distance it kept changing it's light patterns until they looked more like that of a plane? Then it disappeared!"],"Tags":"City","Sighting Duration":"Undisclosed","Object Shape":"Triangle","City":"Valparaiso","Longitude":"-87.055311","Summary":"We watched it hover (fly) right over our car VERY LOW, no sound STRANGE LIGHTS!","Country":"United States","Disposition":"Unknown","Latitude":"41.481385","map":"<A HREF = \"http://maps.google.com/maps?q=41.481385,+-87.055311(9629)&iwloc=A&hl=en\"> mufon case (9629) map </A>","trends":["There have been 9 other sightings in Valparaiso","There were no other sightings in Valparaiso on or around February 16th 2008"],"Object Features":"Undisclosed","Date of the Event":"02/16/2008 06:05 UTC","Case Number":"9629","Viewing Distance":"101-500 Feet","files":["/var/www/straped/mufon/html2text/9629.html.txt","/var/www/straped/mufon/org/9629.html"],"Weather Factors":"None","Date Submitted":"02/16/2008 06:05 UTC"}