{"City":"Oak Lawn","Object Flight Path":"Undisclosed","Tags":"City","Longitude":"-87.753508","Viewing Distance":"Unknown","Region":"Illinois","files":["/var/www/straped/mufon/html2text/9631.html.txt","/var/www/straped/mufon/org/9631.html"],"Case Number":"9631","divs":["sighting detailswhen i arrived home i pulled into my driveway. my car was facing north. as i started to exit my car i was facing west to get out to unload my groceries when i saw a large white orb hovering next to a large evergreen tree in our neighbors yard. it was probably 150 feet from the ground. this orb was almost almond shaped. it was the size of 2 large beachballs. i as looked it just disappeared into thin air. i started to unload my car and just kept looking over to this area and saw nothing for about 5 minutes. as i came back out to my car in the driveway i again saw the same white orb in the same location by the evergreen tree. i also saw a few feet away from this orb to what i can only describe as a solid metal ball that was pewter colored and it was as big as a baseball.it looked to be flying down to the ground with great speed followed by what looked to be a black\\silver mist trail behind it. it was probably only 300 feet up in the air when i saw it coming at such a great speed. i just watched as both objects just disappeared into thin air. about 15 minutes later as i went outside and saw the beautiful moon in the east sky. two very large amber lights were seen under the moon hovering low in the sky and iam not sure if those where planets. it was still not dark out yet and it just did not look normal because i didnt see any other type of stars or planets showing themselves yet."],"Object Shape":"Circle, Sphere","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.712256,+-87.753508(9631)&iwloc=A&hl=en\"> mufon case (9631) map </A>","Country":"United States","Latitude":"41.712256","Object Features":"Undisclosed","Log Number":"US-02182008-0011","Disposition":"Unknown","Summary":"Large white orb hovering followed by a falling small orb with a black/silver mist trail.","trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around February 15th 2008"],"Source":"MUFON","Date Submitted":"02/15/2008 05:25 UTC","Date of the Event":"02/15/2008 05:25 UTC","Weather Factors":"Unknown"}