{"Source":"MUFON","Case Number":"9640","Object Flight Path":"Stationary,Hovering then path,Other","Date Submitted":"02/18/2008 03:15 UTC","Tags":"City","Latitude":"61.226756","City":"Anchorage","Sighting Duration":"Undisclosed","trends":["There have been 24 other sightings in Anchorage","There were no other sightings in Anchorage on or around February 18th 2008","This sighting has never been favorited.",""],"Log Number":"US-02192008-0004","Region":"Alaska","Date of the Event":"02/18/2008 03:15 UTC","Object Features":"None","divs":["Sighting Detailsmy cousin and I were driving down the highway and I was looking towards the inlet when I saw this very thin line in the horizon. at first glance I thought it was an airliner but i did a double take and noticed that it was wider than a plane, maybe 1 and a half 747s, no wings, so thin that it looked like it could cut the sky. it was hovering in one spot just looking malicious and that is when i noticed the color of the craft. it was a very dark and... i want to say rich purple with a hint of a royal blue and the sun was reflecting off the top of the craft and at that point, amidst me trying to get my cousin to look at it and ignore the road, the thing darted about a half mile up and to the right of its original position and thats when i seriously believed that what i saw was in fact a ufo and that i need to make a report about it. at that point, the thing had just completely vanished. I reported the incident to the Ted Stevens Int Airport which is relatively close to where i saw it and they recorded my report then transfered me to the FAA who did the same and noone that i talked to seemed to doubt me which makes me think that they had gotten another report of it or that they already knew about it. One Hell of a scary experience for me. I would appreciate if someone looked into this because up here in Alaska, this sort of thing is unheard of."],"Object Shape":"Disc","Viewing Distance":"Over One Mile","Longitude":"-149.897618","Summary":"saw a large, thin, dark purple disc hovering near airport for 15 sec then dart half mile away stayed still then disappear","Disposition":"Unknown","Country":"United States","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=61.226756,+-149.897618(9640)&iwloc=A&hl=en\"> mufon case (9640) map </A>","files":["/var/www/straped/mufon/html2text/9640.html.txt","/var/www/straped/mufon/org/9640.html"]}