{"files":["/var/www/straped/mufon/html2text/9644.html.txt","/var/www/straped/mufon/org/9644.html"],"City":"Newark","Latitude":"40.739237","map":"<A HREF = \"http://maps.google.com/maps?q=40.739237,+-74.169617(9644)&iwloc=A&hl=en\"> mufon case (9644) map </A>","Case Number":"9644","Longitude":"-74.169617","Date of the Event":"02/18/2004 12:00 UTC","Weather Factors":"Unknown","Date Submitted":"02/18/2004 12:00 UTC","divs":["Sighting DetailsAs I was watching disc 3 of the DVD set titled, \"The Sopranos, The Complete Fifth Season\" (Home Box Office Inc, 2004). This was the episode titled \"Cold Cuts.\" The time code on my Quick Player reads 43:24-43:27 during this occurrence. It was the scene right after Christopher leaves the farmhouse in the morning. He's driving back, feeling badly hurt that Tony Soprano and Tony B. were picking on him during breakfast. During the scene when he is driving back, I could see through the back seat window a distinct, red, disc shaped object apparently hovering a few hundred yards off (based on the trees that pass in front of it from the perspective from inside the vehicle and based on how slowly the object moves out of view due to the motion of the vehicle.) This scene takes place in a wooded area and the object is no longer visible as the car continues forward. Christopher's head blocks the object from view after that. Then the scene cuts to directly in front of his face, and that's it. When I first saw the object I couldn't believe my eyes because it looked exactly like other UFO's that I have seen on tv in the past. I googled \"Sopranos UFO\" and could find nothing on this. If you can refer to this scene yourselves I would greatly appreciate if you could explain what it is."],"Summary":"Disc-shaped object on Season 5 of Sopranos","Region":"New Jersey","Disposition":"Insufficient Data","Sighting Duration":"00:00:10","Country":"United States","trends":["There have been 27 other sightings in Newark","There were no other sightings in Newark on or around February 18th 2004"],"Log Number":"US-02192008-0008","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","Object Features":"Undisclosed","Object Shape":"Disc","Source":"MUFON","Tags":"City"}