{"Weather Factors":"Unknown","Object Shape":"Triangle, Other","Summary":"Large Triangle/Shifted into Multiple Formations and also Stationary in Sky for 2+ hours","map":"<A HREF = \"http://maps.google.com/maps?q=40.170607,+-105.098358(9648)&iwloc=A&hl=en\"> mufon case (9648) map </A>","trends":["There have been 30 other sightings in Longmont","There were no other sightings in Longmont on or around February 19th 2008"],"Country":"United States","files":["/var/www/straped/mufon/html2text/9648.html.txt","/var/www/straped/mufon/org/9648.html"],"Latitude":"40.170607","Viewing Distance":"Over 1 Mile, Unknown","Date of the Event":"02/19/2008 06:35 UTC","City":"Longmont","Log Number":"US-02202008-0004","Disposition":"Hoax","Region":"Colorado","Sighting Duration":"Undisclosed","Longitude":"-105.098358","divs":["sighting detailsat 6:40 pm, on tuesday 2\\19, 3 very bright golden circular lights where seen in the eastern sky in a triangle formation above longmont. the 3 lights slowly shifted into a diagonal line across the sky and sat stationary. they proceeded to shift into a horizontal line across the horizon and then slowly spread apart. for the next hour, the three lights seem to move in a large rotation across the sky but sat stationary for long periods. i placed high powered binoculars on one of the lights and it was a very bright golden color with a little red. the light i was observing was absolutely stationary in the middle of the sky close to the horizon. as the three lights where slowly rotating over a large area of the sky, one rose straight up in the sky with an enormous white beam below it. the beam was so large that it spanned a great deal of the sky as the light rose. the light rose up and gradually disappeared. the stationary lights also seem to be rotating in place-they glowed very bright at times. two of the lights remained stationary in the night sky along until 8:15pm when they were gone. at about 8:30pm, i observed a large oval shaped white light moving slowly across our window--a window at the apex of our vaulted ceiling it passed slowly moving west towards the mountains. we live at the corner of hover and hwy 66 in longmont, colorado."],"Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","Source":"MUFON","Case Number":"9648","Tags":"City","Object Features":"Undisclosed","Date Submitted":"02/19/2008 06:35 UTC"}