{"Longitude":"-75.925515","Summary":"white light,app.5',silent,but did not emit light as in an flashlight","Region":"Pennsylvania","files":["/var/www/straped/mufon/html2text/9658.html.txt","/var/www/straped/mufon/org/9658.html"],"Disposition":"Insufficient Data","Source":"MUFON","Sighting Duration":"Undisclosed","Date Submitted":"07/12/2002 03:30 UTC","Latitude":"40.345158","Case Number":"9658","map":"<A HREF = \"http://maps.google.com/maps?q=40.345158,+-75.925515(9658)&iwloc=A&hl=en\"> mufon case (9658) map </A>","Object Flight Path":"Path then hovering","Country":"United States","Date of the Event":"07/12/2002 03:30 UTC","divs":["Sighting DetailsOn Fri.,July 12,2002 I was just completing my work as a truck driver at approximatley(0320).I completed my paper work and cleand up the vechile before I locked up the truck. As I was walking into the building I ran into the driver for the Baltimore truck. We were talking small talk about work and fire business (me being a retired Phila. Fire Fighter and Jim being a volunteer fire fighter in the area) when a small plane flying low went past our company parking lot. I said he's pretty low, and Jim said ther was an incident on Rt.422 just before he came to work(0300)that needed helicopter assistance, I told him that was not a helicopter and we laughed about it. About 15 seconds later a bright light appeared over our building and I said to Jim,(WHERE THE HELL IS HE LANDING) then it stopped in midflight about 250' ft. away from us (as I said,it was a bright light, but it did not omit light.)Jim & I looked at it for about 15 seconds (the object was hoovering along until it spoted Jim & I).The objet stayed ther for about 15 seconds as I said,then it moved towards the sky,not at a missle type pace but as a controled asscent but very rapidly. It was there and within 6 seconds was in the heavens. I don't know what the hell it was but like I stated before I'm a retired Phila. Firefighter and a combat Vietnam vet and when this thing flew away I said to Jimmy, \"THAT'S THE DAMNEST THING I EVER SEEN IN MY LIFE\". I don't know what the that object was,but I know Ford,GMC,or Chysler did not produce it."],"Object Features":"None","City":"Reading","Log Number":"US-02212008-0001","Object Shape":"Other","Weather Factors":"None","Viewing Distance":"101-500 Feet","Tags":"City","trends":["There have been 42 other sightings in Reading","There were no other sightings in Reading on or around July 12th 2002"]}