{"divs":["Sighting DetailsMy husband went out front. it was a very cloudy day. he said to my two sons and me, \"come out here and look at this stealth.\" well i am not so sure if that is what it was. it seemed so spherical and i've seen stealths in pics and they are not round. so i ran into the house and snapped several pictures. it was going so slow that i had time to go back in the house and change the batteries on my camera and then go in the back yard and take more pics. we live very close to an airport (savannah, hilton head intl) and i see alot of planes and military jets. we also live very close to two military bases. it seemed as if was just floating along like a hot air balloon, but it was soooo high and black. it just seemed very unusual. i have pictures. i will attach a few. it was very high so i don't know if you can get much detail out of them. one is interesting. it seems blurred out. i don't know if that is just a trick of the lens of the camera or not though. if you have questions or answers(!) do not hesitate to contact me. sincerely, nicole willett 912-660-1233 willett44@hotmail.com i have several more pics, if you send me an e-mail link i will forward all of them"],"Case Number":"9662","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","City":"Savannah","Tags":"City","Object Features":"Unknown","Date of the Event":"01/28/2008 03:15 UTC","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=32.086071,+-81.091034(9662)&iwloc=A&hl=en\"> mufon case (9662) map </A>","Object Shape":"Circle","Weather Factors":"None","Date Submitted":"01/28/2008 03:15 UTC","Region":"Georgia","Sighting Duration":"Undisclosed","Source":"MUFON","Country":"United States","trends":["There have been 20 other sightings in Savannah","There were no other sightings in Savannah on or around January 28th 2008","This sighting has never been favorited.",""],"Log Number":"US-02212008-0005","Summary":"in front yard black sphere slooooowly crossing the sky took pictures","Latitude":"32.086071","files":["/var/www/straped/mufon/html2text/9662.html.txt","/var/www/straped/mufon/more/9662_submitter_file1__ufoflatsarahrandom115.jpg","/var/www/straped/mufon/more/9662_submitter_file2__ufoflatsarahrandom116.jpg","/var/www/straped/mufon/more/9662_submitter_file3__ufoflatsarahrandom117.jpg","/var/www/straped/mufon/org/9662.html"],"Longitude":"-81.091034"}