{"Date Submitted":"02/20/2008 07:00 UTC","trends":["There have been 128 other sightings in Fort Worth","There were 2 other sightings in Fort Worth on or around February 20th 2008","This sighting has never been favorited.",""],"Weather Factors":"None, Does Not Apply","Date of the Event":"02/20/2008 07:00 UTC","Sighting Duration":"03:00:00","Log Number":"US-02212008-0006","Region":"Texas","Object Features":"Unknown","City":"Fort Worth","map":"<A HREF = \"http://maps.google.com/maps?q=32.728589,+-97.31308(9663)&iwloc=A&hl=en\"> mufon case (9663) map </A>","Source":"MUFON","Disposition":"Unknown","Tags":"City","Case Number":"9663","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","Object Shape":"Bullet, Missile, Circle, Cylinder","Summary":"dancing, stationary, zig-zagging white lights in southwest sky","Viewing Distance":"Unknown","Latitude":"32.728589","files":["/var/www/straped/mufon/html2text/9663.html.txt","/var/www/straped/mufon/org/9663.html"],"divs":["Sighting DetailsLast night we were observing lunar eclipse from in front of our house. After all of the recent events in Stephenville and after reading that the Mexican Air Force observed ufos through their infra-red cameras, I decided to try the infra-red camera that my husband has in his work as an engineering test pilot. I pointed the camera toward the southwest sky. We live in Burleson, close to Joshua on acreage. There were intermittent clouds. At first we thought the bright, white lights were meteors.But meteors obey the laws of physics. We observed these lights, usually one or two at a time, zig-zag, some just stopped then changed direction,some made spiral movements and one moved in circles, some just seemed to zip through the sky upward or downward,like a game of ping pong. My three daughters also observed this on the 8 in x 8 in. screen for the infra-red camera. Soon it was too cloudy to see and it was about 10 p.m. We will try again another night when the clouds go away. My husband is going to connect the camera to a video-recorder and tripod. Has anyone else seen the same thing using infra-red. It was compelling!"],"Longitude":"-97.31308"}