{"Sighting Duration":"00:15:00","Tags":"City","City":"Salt Lake City","Disposition":"Unknown","Weather Factors":"Light","Country":"United States","Case Number":"9665","files":["/var/www/straped/mufon/html2text/9665.html.txt","/var/www/straped/mufon/org/9665.html"],"Object Flight Path":"Hovering then path,Path with directional change","Source":"MUFON","Longitude":"-111.884777","Summary":"driving to a casino on the nevada/utah border between salt lake and border city off the hwy. app. 300ft above and off hwy. no noise so close i thought i could throw a rock and hit it...got out of my car watched it it flew south about 30-40 miles in sec.","Viewing Distance":"101-500 Feet","Date Submitted":"06/15/1996 09:15 UTC","divs":["Sighting Detailsdisc shaped no noise was about 300 feet from the road and about 300 feet in the air..no electrical malfunctions to my car or radio etc..watched it for about 3-5 minutes it..circular lights on the bottom going round and round totally silent..it went due south approximately 30-40 mile in seconds..stopped again being in the desert it was very plain to see even at distance..I watched it about 3-5 more minutes, it then went due west about 30-40 miles once again in seconds, stopped all the while with the flshing lights below going round and round.. finally it went straight up and out of sight in dissapeared in seconds.....this was the first time I saw anything like this and I lived in vegas around military installations and saw all kinds of aircraft..also because I was in the military myself....the next time I saw a craft ..actually 2 out side las vegas about the year 1997 above lake meade one at.. i worked for the national serat this time. and was on my way back to park from vegas.. was dropped off by a friend a couple of friends and would walk or wait for someone to pass by because on this road it is the only road to enter the park from this area... about 8pm the sun just set it just got dark after they dropped me off I looked towards the lake and over lake meade at both end of the lake I noticed 2 triangle shaped objects about 3-5 miles from me I was far enough to look left and right and the two craft were brightly lit they looked just like the old rubics cubes....not the first ones..that were square but the newer ones that were triangular and very brightly lit ....no noise once again ...to my back about is nellis air force base ..many times I saw many jets and other aircraft take off and land after flying above on manuvers both day and night time and even from way farther away I could always here them...I then heard a prop plane take off the base on its wings there were pylons with strobe lights at this time not on...no visable lights either the plane approached the one ufo circled about halfway then turned on its strobe lights the ufo wnet crazy with lights flashing backand forth almost like the two were sending messages ...I heard the pane but not the ufo after totally circalling the craft the air force plane took the lead and the craft folloed and they flew due south and out of sight all this took about 15 minutes... the plane was a military plane the ufo who knows.. I then looked to the other end of the lake for the other but it had dissapeared... I was picked up by another park employee and told them and many others about this event..."],"Object Features":"Window(s)","Log Number":"US-02212008-0008","Object Shape":"Disc","Latitude":"40.766119","Region":"Utah","map":"<A HREF = \"http://maps.google.com/maps?q=40.766119,+-111.884777(9665)&iwloc=A&hl=en\"> mufon case (9665) map </A>","Date of the Event":"06/15/1996 09:15 UTC","trends":["There have been 73 other sightings in Salt Lake City","There were no other sightings in Salt Lake City on or around June 15th 1996"]}