{"Disposition":"Unknown","Date Submitted":"08/01/1986 10:00 UTC","Latitude":"35.965952","map":"<A HREF = \"http://maps.google.com/maps?q=35.965952,+-75.620402(9669)&iwloc=A&hl=en\"> mufon case (9669) map </A>","Country":"United States","Longitude":"-75.620402","Case Number":"9669","Region":"North Carolina","City":"Nags Head","trends":["There have been 3 other sightings in Nags Head","There were no other sightings in Nags Head on or around August 1st 1986"],"Source":"MUFON","divs":["Sighting DetailsSorry to report this so late after the date (1986). I am currently 35 years of age, professional telecommunications Systems Engineer. I was 14 at the time and was with my parents who also witnessed the event. My mother and I are in complete agreement as to what we saw. It was the first week of August 1986. We vacationed for 2 weeks every year at the Outer Banks, NC (Nags Head, Kill Devil Hills). One night the stars were out and there was good visibility of the night sky. We were sitting out on a picnic bench facing the ocean. The ocean was calm as a lake. From the south moving very slowly north were 2 very extremely long triangular craft flying. I couldn't give you an estimated altitude. They flew in parallel with the coastline. Each point was marked by a red light. The red light was not exceptional - what incredible was the size of blackness that blocked out the night sky. I can't quite put enough emphasis on how huge the \"footprint\" of these craft was in the night sky. There was nothing else in terms of colors, lights, etc. The triangle was acute and much longer than wide. There was no point of reference but we had an unobstructed view of these things. These craft were both silent. BUT, I do remember sort of a very low frequency hum that was felt more than heard. It is very difficult to explain how the low frequency sound was barely audible and you could easily have not heard it if you were not paying attention to what was happening. But, in terms of any other sounds or noises the craft were completely silent. These two craft very slowly worked their way north and that was it. I mean we sat there for an hour pointing at and talking about these two craft and we spent all of the time just trying to understand what it was we were looking at. We didn't have cell phones back then or even a phone in the beach cottage we rented so we were at a loss in terms of reporting it. Well, I wanted to report this. Of my 35 years this was my one UFO sighting. I keep my eyes on the sky but have not seen one since. I am not a pilot nor have any special training at looking at or understanding objects in the night sky. But, I thought this might be of value for your records. Hopefully, maybe someone else will come forward with their report to MUFON that will corroborate my report. Thank you, Jason"],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-02212008-0012","Summary":"2 very long black triangles (each one at least 1 mile long)","Object Flight Path":"Straight-line path","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9669.html.txt","/var/www/straped/mufon/org/9669.html"],"Object Shape":"Triangle","Tags":"City","Object Features":"None","Date of the Event":"08/01/1986 10:00 UTC"}