{"Source":"MUFON","City":"Indianapolis","Region":"Washington","files":["/var/www/straped/mufon/html2text/967.html.txt","/var/www/straped/mufon/org/967.html"],"divs":["Sighting Details (you can type over theseinstructions.)Please limit your narrative to 500 words (equivalent to 1 typedpage).We were on top of a microwave tower near Mt.St. Helens we were notdistracted by the lights they appeared as stars we did notice a car racing upthe mountain they made it to the top as we scurried down as we were going downwe all noticed the lights shoot into a forested valley no access except trails ,the car at the bottom we feared were sprint personal or sheriff we thought wewere in trouble they seperated us asked what we saw they idenified themselves asairforce observers and allowed us to leave , we all conveied what they asked usit was the same q26a we did not know know untill that point that we all experienced that samething including disbelief , now this year oct 10th we all got together and reexamined the event and concured we did see and obsess over the event personallyand privetlly telling our girlfriends and wives only over the years we do allagree that one Lee Gamelguard of Hazeldell was in fact present with Myself , Ed, And Howard Gehrke , along with the said Airforce persons 2 that greeted us atthe bottom of the tower."],"map":"<A HREF = \"http://maps.google.com/maps?q=39.926932,+-86.079292(967)&iwloc=A&hl=en\"> mufon case (967) map </A>","Disposition":"Unknown","Country":"United States","Summary":"near mt st helens we saw a group of ufos and air f","Object Flight Path":"Unknown","Date Submitted":"04/30/1979 11:30 UTC","Object Shape":"Undisclosed","Viewing Distance":"501 Feet - 1 Mile","Latitude":"39.926932","Sighting Duration":"00:30:00","Weather Factors":"Unknown","trends":["There have been no other sightings in Indianapolis","This sighting has never been favorited."],"Object Features":"Undisclosed","Case Number":"967","Longitude":"-86.079292","Log Number":"","Date of the Event":"04/30/1979 11:30 UTC","Tags":"City"}