{"Source":"MUFON","Tags":"City","City":"Gualala/Point Arena","Viewing Distance":"501 Feet - 1 Mile","Date of the Event":"12/22/1999 04:00 UTC","Log Number":"US-02212008-0015","Object Shape":"Cigar, Cone, Circle, Cylinder, Disc, Fireball, Star-like","Longitude":"-123.529407","files":["/var/www/straped/mufon/html2text/9672.html.txt","/var/www/straped/mufon/org/9672.html"],"Object Features":"Dome","Latitude":"38.761561","Case Number":"9672","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=38.761561,+-123.529407(9672)&iwloc=A&hl=en\"> mufon case (9672) map </A>","Object Flight Path":"Hovering then path,Straight-line path,Path then hovering","Disposition":"Unknown","Weather Factors":"None","Country":"United States","Region":"California","trends":["there have been no other sightings in gualala\\point arena","This sighting has never been favorited."],"divs":["Sighting Details I was employed as a health care aide. I was working a twelve hour shift caring for an elderly woman in her home. The house is located along the ocean up on a bluff with a wonderful view of the Pacific Ocean from every room in the house. The night was crisp, cold, and clear. The ocean was very still and also calm.It almost seemed like I was looking at a lake. Out side the house looking over the ocean is a magnificent small island of clifs and rocks. In the winter the island is home to hundreds of sea lions. The noise is ear splitting and incedible at the same time. This was the last full moon of 1999. the entire night I kept look out at the wonderful sight. The night was so bright it was almost like day light. I first noticed the then star shaped object in the sky. It kept shinning and spinning with colors of red,white,greenand blue. I kept watching it through out the evening In fact, it seemed I could not help noticing how much it was twinkling. From about 9:00 p.m. to midnight I was awake then I slept until 4:00a.m. I woke up to help my patient to the restroom I helped her back to bed and then I sat on the edge her bed and looked out at the view.So once more the star shaped object was there spining out the window in the sky. The whole time when I observed this star spinning shape I would squint at it the shape would change to a cigar shape form. So in my mind I looked at it as if it was far away and by squnting I brought it closer. So at some point I thought O.K.\"Your are not a star show me your stuff.\" Amazingly the object did respond as if I caught it in the act. So sure enough this sphere started spinning and then it slowly started moving out over the ocean. At this moment I realized watching the cigar shape was closer than it appeared earlier. So this star ship proceeded to continue going slowly out over the ocean. Then It seemed to stop and a cone shaped light showed down on the ocean and it seemed like there were small round orb like objects comming and going from the big ship. Then it would glide over the ocean and shine another cone shape light over the ocean. Then proceed out farter At this time it seemed the moon was starting to set and the sky was getting lighter. What I observed next was a very fire red round orb came out of the ship and seemed to be comming back over to where the Sea Lions were and the red orb disappeared behind the rock island. At this point it seemed like I had watched for maybe two hours. I guess I was a little freaked out that the red light was comming back my way and I had had my fill for the night. So I went back to bed and I went to sleep. Afterword I have felt that who ever was on this ship made me think this UFO was way more interested in the ocean and maybe the sea lions. I felt honored to have wittnessed this sight and it made me wonder if we some how are allowed to see other dimentions if we slow down enough at 4:00 am."],"Summary":"I wittnessed a UFO over the Pacific Ocean on the last full moon of 1999.","Date Submitted":"12/22/1999 04:00 UTC"}