{"Object Shape":"Circle, Disc","Object Flight Path":"Undisclosed","Longitude":"-98.489058","Summary":"Set up my camera with fish eye scope and caught ufo","Case Number":"9674","Weather Factors":"Unknown","Disposition":"Unknown","Sighting Duration":"Undisclosed","divs":["sighting detailsset up my camera with fish eye scope to take pictures of strange clouds around 12 noon, took these pictures around 12:30 and noticed strange bright light in cloud, kept camera fixed on it and it seemed to lower itself and turn a blackish color as it descended. it made no noise and when i checked the lens for debris,there was none and took picture immediately afterwards showing dark orb. looked at with naked eye and although it was smaller was still visable and non moving but had slight haze around it,no lights blinking but alternated between black and silver color before becoming smaller and disappearing(i believe it ascended). i had reported seeing these things to mufon before with pictures and close up shots taken since november. when i would do a certain old special prayer it would show up within minutes. i stopped after having very bad nights of feeling being watched and\\or looked at late in evening and during sleep. i am hoping it does not start up again, but i have to let people know to look up. again i do not care if anyone believes me or not, i just want there to be documentation if something happens."],"Country":"United States","Date Submitted":"02/21/2008 12:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=29.430682,+-98.489058(9674)&iwloc=A&hl=en\"> mufon case (9674) map </A>","City":"San Antonio","Latitude":"29.430682","Log Number":"US-02222008-0001","files":["/var/www/straped/mufon/html2text/9674.html.txt","/var/www/straped/mufon/org/9674.html"],"trends":["There have been 148 other sightings in San Antonio","There were no other sightings in San Antonio on or around February 21st 2008","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Region":"Texas","Tags":"City","Date of the Event":"02/21/2008 12:30 UTC","Object Features":"Undisclosed"}