{"Sighting Duration":"Undisclosed","Tags":"City","Log Number":"US-02222008-0008","Object Flight Path":"Stationary,Path with directional change","Object Shape":"Triangle","Region":"Illinois","Country":"United States","files":["/var/www/straped/mufon/html2text/9681.html.txt","/var/www/straped/mufon/org/9681.html"],"Date Submitted":"02/22/2008 12:00 UTC","Weather Factors":"Unknown","Summary":"Large,the size of a jet. Triangular brightly lit. Silent , red strobe, stationary then started to move N.E.","Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=40.575779,+-89.637798(9681)&iwloc=A&hl=en\"> mufon case (9681) map </A>","Date of the Event":"02/22/2008 12:00 UTC","Disposition":"Unknown","City":"Pekin","Source":"MUFON","Latitude":"40.575779","Object Features":"Patterned Surface","Longitude":"-89.637798","Case Number":"9681","divs":["Sighting DetailsMy husband and I turned left from the mall road on Towerline Road going south. A brightly lit large light in the sky low in the sky. Just above these tall electrical towers. Hung in the sky stationary. Then started to move North East. Huge bright bright undercarriage lights. Red strobe light, center appeared metalic. One solid triangular piece. We rolled down our windows traveling slow could not hear any sound. We went south and then turned around on a side road to watch it continue North East across the top of Pekin, Illinois. By that time it should have been over Lake Arlan on the south side of Pekin. There was a police officer parked going north at the side of the road helping a stranded motorist. Surely he saw it. Had to have. Also there were a line of cars behind us who shoud have seen it. It was truly awesome. Now we live in central Illinois and in this area the people here truly don't like to talk about this sort of thing. Only wish I had my camera with me. My feelings on this, I've had my own experiences but this time my husband was with me as a witness. He kept saying what is that. Doesn't look like a plane to me. Then he got excited. He said he was a little jealous that I always see things and this time he got to have his own sighting.This all lasted about 5 minutes."],"trends":["There have been 7 other sightings in Pekin","There were no other sightings in Pekin on or around February 22nd 2008"]}