{"Longitude":"-71.362414","divs":["Sighting DetailsMy friend and I were leaving the gym in seekomk mass and were droping of his cousin in an apartment complex in east providence r.i. when leaving the two of us noticed what we at first thought was a blinking red light on a water tower.I noticed a light moving and when we got to the street the light was in front of us and that shocked us because we thought that it was a new tower that maybe they had just built. we could\"nt believe what we were seeing so we started to follow this light. we were on Broadway and it was flying over the trees.we kept on chasing this thing in and out of all different side streets as it was flying over the houses. After we got on to vetrans parkway thats when it flew over the water. At the same time there were a lot of police racing towards riverside.We continued in and out of streets and end back on to broadway and stopped to see where it went and it was gone so we drove on broadway and then we saw it again and chased the blinking red light for another 10 min.Then we decided to go home but all of a sudden it was in front of us and started to follow us. At first we were excided and wanted someone other than us to see this so I called my friends at the bowling ally on newport ave. but they didn't believe us.We thought that maybe it would follow us ther and I told my friends to come outside to see this light , This light always stayed in front of us. As we wre turning into the parking lot we lost sight of it so we parked and were going to go in and get our friends to see this. When we got out of the car we were looking for it and then we saw in the sky a white light and started to come over the lanes. thats when I saw that it was a golden bronze submarine shaped object with a sort of big hump on the top. As we were walking toward the doors all of a sudden both of us thought that we would just go back t the car which we did. When we got into the car we were both so tired and fell asleep. when we woke up we left the parking lot to go home. On the way we stopped and both of us had to vomit. Our friends were coming by and saw us vomiting and thought that maybe we were drinking but we weren't."],"Source":"MUFON","Date Submitted":"11/30/1997 12:00 UTC","Date of the Event":"11/30/1997 12:00 UTC","files":["/var/www/straped/mufon/html2text/9683.html.txt","/var/www/straped/mufon/org/9683.html"],"Tags":"City","Case Number":"9683","trends":["There have been 11 other sightings in East Providence","There were no other sightings in East Providence on or around November 30th 1997"],"Latitude":"41.817282","Object Features":"Undisclosed","Weather Factors":"Unknown","Log Number":"US-02222008-0010","Disposition":"Hoax","Region":"Rhode Island","Sighting Duration":"Undisclosed","Object Shape":"Other","Object Flight Path":"Undisclosed","Viewing Distance":"Unknown","City":"East Providence","Summary":"followed us and saw a golden bronze looking submarine shape ufo","map":"<A HREF = \"http://maps.google.com/maps?q=41.817282,+-71.362414(9683)&iwloc=A&hl=en\"> mufon case (9683) map </A>","Country":"United States"}