{"Summary":"Long cyclinder w/ forward appendage(illuminated). Rear of craft illuminated.","Object Features":"Appendage(s)","map":"<A HREF = \"http://maps.google.com/maps?q=43.42887,+-83.948547(9686)&iwloc=A&hl=en\"> mufon case (9686) map </A>","Country":"United States","Case Number":"9686","Region":"Michigan","Object Flight Path":"Straight-line path","City":"Saginaw","Sighting Duration":"Undisclosed","trends":["There have been 20 other sightings in Saginaw","There were no other sightings in Saginaw on or around February 20th 2001"],"files":["/var/www/straped/mufon/html2text/9686.html.txt","/var/www/straped/mufon/org/9686.html"],"Log Number":"US-02232008-0002","Longitude":"-83.948547","Viewing Distance":"Unknown","Object Shape":"Cylinder","Date of the Event":"02/20/2001 10:05 UTC","Tags":"City","Weather Factors":"None","Source":"MUFON","Date Submitted":"02/20/2001 10:05 UTC","Latitude":"43.42887","divs":["Sighting Details I was in front of our house at approx. 10:00pm, watching the total lunar eclipse through my binoculars. I noticed to the east, a very bright light appear on the low horizon. I glanced at it through the binoculars, seeing an array of colors emmitting. As it drew closer, my girlfriend came out to see the eclipse. I told her to watch the light in the eastern sky. We both continued to observe the light as it drew closer. I looked at it through the binoculars repeatedly. It had a bright light in the front and one behind. I estimated it's altitude to be approximately 8 to 10,000 ft. It made NO sound. As it flew directly overhead, I say again, it made NO sound. there is an airport near and jets fly over frequently. Even at higher altitudes, the jets are audible. This craft proceeded in a direct east to west path. As it was overhead, I looked at it and focused my binoculars. I could see the shape of this craft. It was a long cylindrical shape, with a rear glowing area, and a glowing appendage in front, kind of cresent shaped. This was not an airplane, jet, helicopter, sattellite, star, bird, or any kind of meteor. Even my girlfriend was puzzeled as we discussed the lack of sound from the craft. I asked her later to draw a picture of what she saw. I did as well, and our recollections were extremely close. There weren't any of the FAA required green and red marker lights whatsoever. No strobes. The lights were a constant glow, very bright with varying color. I was am still convinced that this wasn't any craft known. The part that reaaly gets me, as well as my girlfriend, is that it made NO sound. No sound at all. It just smoothly glided over. The craft just flew in a western direction and disappeared, just as it appeared. Very strange. I must say, that I was very excited at this sighting. I've often seen strange things in the sky, but this was the best view I've ever encountered. Now, the next day, I was watching the morning local news. There was a report that on that night, people had witnessed strange lights over the Saginaw Bay, out a ways over the ice...above the ice. They reported the lights to the local Coast Guard post in Essexville, MI, but the Coast Guard found nothing. It still rides heavy in my mind, this sighting. I know what I saw, as well as what my girlfriend witnessed. We both agreed to what we witnessed as being real, not an illusion. It was as real as the lunar eclipse itself. I hope that I see this again. I do believe that we are being visited, but like many others, need proof to solidify the belief. I think I have my proof. Duff Tinglan Hemlock, MI"],"Disposition":"Unknown"}