{"Sighting Duration":"00:02:28","Longitude":"-78.868758","Source":"MUFON","trends":["There have been 20 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around October 11th 2006","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=35.060014,+-78.868758(9688)&iwloc=A&hl=en\"> mufon case (9688) map </A>","Disposition":"Hoax","Case Number":"9688","Tags":"City","Date of the Event":"10/11/2006 10:48 UTC","Date Submitted":"10/11/2006 10:48 UTC","Object Features":"None","Latitude":"35.060014","Object Shape":"Sphere","Weather Factors":"None","Object Flight Path":"Path with directional change","Region":"North Carolina","Viewing Distance":"21-100 Feet","Country":"United States","City":"Fayetteville","divs":["Sighting DetailsI was about to get in my vehicle heading to work about 10 min. to 11p.m. when I notice to bright lights through the trees coming from the east heading to the west coming straight over my home. At first, because I live close to a Military base, Ithought it was the new Apache Helicopters withthe advanced whisper mode engaged, but as the objects cleared the tree tops over my home there was no sound at all, and if you know anything about whisper mode on the apache there is still quit a bit of noise. And if you know anything about optics you know the difference in search lights and a shear glow, but none of this was obvious until they cleared the trees into open sky! The objects (two) were approx. 5 to 8 meters in diameter and approx. 15 meters above the trees. Relative speed was about 25 knots until they made a slow escillon movement to the south and in a split second they vectored 90 degrees straight up into space much faster than any mach number we've ever achieved! No human could survive such exceleration, at least not at our present state of knowledge! My feelings about this? Amazed and disappointed. Amazed at the knowledge required to create a machine which could do this. Disappointed because they didn't stick around. I mean, they could either stop to make contact or either attack, didn't matter to me was prepared for either! But I just don't think they came all this way to pick a fight! I think they were just surveying. The one thing I do believe though is that there had to be a mother ship in space possibly on the dark side of the moon, because the two craft although very agile and fast I do not believe they were large enough to produce enough enery for interstellar travel. Enough to travel to Mars and back in an hour but not to reach our nearest star which is about 4 light years away!"],"files":["/var/www/straped/mufon/html2text/9688.html.txt","/var/www/straped/mufon/more/9688_submitter_file1__UFOslarge.jpg","/var/www/straped/mufon/org/9688.html"],"Summary":"Two bright spheres flew over my home then turned 90 degrees straight up into space at incredible speed!","Log Number":"US-02232008-0004"}