{"trends":["There have been 2 other sightings in North Miami","There were no other sightings in North Miami on or around October 10th 1970"],"Object Flight Path":"Straight-line path","City":"North Miami","Sighting Duration":"Undisclosed","Latitude":"25.897895","Date of the Event":"10/10/1970 10:30 UTC","Summary":"30'dia. polished silver, glowed red from center, flame from bottom, teattered at 10mph.","Source":"MUFON","Object Features":"None","Region":"Florida","Tags":"City","divs":["Sighting DetailsThere were six of us in the parking lot of Neba's Rest. on 163rd st.&Collins Ave. We were sitting in a 56 Chevy in the parking lot when we saw it about 40'ft. in the air glowing red from the center and flying like it had a gyroscope inside it. We got out and ran up to a security guard patrolling the lot to try and stop any drug dealing going on, when we pointed it out to him and said to call the police or air force he looked at it as if he saw it all the time and said \"No way\" because they would think he was crazy. Collins Ave. is a four lane road with a median strip in the center which is where it was flying over, there was bumper to bumper traffic and I noticed a couple walking down the sidewalk so I ran up to them and pointed it out and that's when it really got strange because they looked at it and just said, \"Oh yea\" and kept on talking to each other and walking. That's when I knew something weird was going on so I ran back to my friend's standing by the guard and decided to look at it closely because I thought this may be the only time I would get to see something like this and I better stare at every detail because I might never get to see one again (which turned out to be true by the way) so because I'm an artist I did just that and that picture will be in my mind forever because it was way too perfect to be built by us, especially in 1970. I have painted it several time's now, it took a long time to get the facts that no one would believe me or my friend's either, but I finally did and know for sure we are not alone in this universe..."],"Weather Factors":"None","files":["/var/www/straped/mufon/html2text/9689.html.txt","/var/www/straped/mufon/org/9689.html"],"Log Number":"US-02232008-0005","Country":"United States","Date Submitted":"10/10/1970 10:30 UTC","Object Shape":"Disc, Oval","Viewing Distance":"101-500 Feet","Disposition":"Unknown","Longitude":"-80.185584","Case Number":"9689","map":"<A HREF = \"http://maps.google.com/maps?q=25.897895,+-80.185584(9689)&iwloc=A&hl=en\"> mufon case (9689) map </A>"}