{"trends":["There have been 579 other sightings in New York","There were no other sightings in New York on or around February 16th 2008","This sighting has never been favorited.",""],"Sighting Duration":"Undisclosed","Region":"New York","Viewing Distance":"Over 1 Mile, Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=40.723533,+-73.997833(9691)&iwloc=A&hl=en\"> mufon case (9691) map </A>","Object Features":"Unknown","divs":["Sighting DetailsWe photographed and video filmed a oval object hovering and moving around the sky while walking on Rockaway Beach,New York on Feb 16th,2008 at 3:30PM. It was beautiful clear day and the almost full moon was larger than normal and very visible in the daytime which was unusually visible,that drew my attention to a circluar object flying near the moon.It my camera and my girlfriend also had her camra so we started takin photos! It dissapeared for a while then came back. JFK airport is very close and the airplanes land in the same area as the ufo was flying,I have adozen phots detailed photos one has the UFO and an Airplane in the same shot! This object was watched by me and my girlfriend for abot 20 minutes before it went out of the atomsphere. This is important: I reasearched on youtube and someone else had witnessed a ufo in the same area months before my sighting,I believe it is the same UFO. Please research on Youtube.com UFO FOOTAGE AT JFK AIRPORT. Keep in mind the ufo this fellow filmed was 7minutes after takeoff which will bring the sighting over Rockaway Beach, Queens! Important: Research on google UFO sighting at Rockaway Beach,New York...And yet another person from 2005 has spotted a ufo ,but they have no photos. one more thing the UFO we saw and filmed looks like the one on youtube.com search Diamond Shaped UFO! Please look at this and see the idenity.. YOU NEED TO ZOOM IN ON THESE PHOTOS I HAVE 2 VIDEOS AND A DOZEN MORE PHOTOS IF YOUR INTERESTED IN SEEING THEM I WILL SEND THEM!"],"Disposition":"Unresolved","Date of the Event":"02/16/2008 03:30 UTC","City":"New York","Object Shape":"Circle, Diamond, Disc","Case Number":"9691","Weather Factors":"None","Summary":"Saturday afternoon stroll on the ach takin photos of each other then spotted a UFO","Log Number":"US-02232008-0007","Latitude":"40.723533","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9691.html.txt","/var/www/straped/mufon/more/9691_submitter_file1__067.JPG","/var/www/straped/mufon/more/9691_submitter_file2__070.JPG","/var/www/straped/mufon/org/9691.html"],"Date Submitted":"02/16/2008 03:30 UTC","Object Flight Path":"Hovering then path,Path then hovering","Longitude":"-73.997833","Tags":"City","Country":"United States"}