{"Latitude":"29.766633","Weather Factors":"Unknown","Date of the Event":"02/23/2008 11:52 UTC","Object Features":"Undisclosed","Viewing Distance":"Unknown","Source":"MUFON","Object Flight Path":"Undisclosed","Disposition":"Unknown","divs":["Sighting DetailsAt first I thought it was just a high flying plane, but then I realized it was moving far too quickly to be a plane because of how high it appeared. It had at least 3 different colored light on the front of the craft that could be positioned differently (known only because one appeared to shine in our direction and became very very bright for a short time.) It took no more than a second or two to start at the western edge of the sky to as far east as I could see. As it passed us the 3 brighter lights faded away and all we could see was a red-ish light on the back of the craft. It moved all the way across the sky and then came to a complete halt. The red light appeared like a star off in the distance and had I not seen it just previously move I wouldn't have known the difference. It stayed there for a long while. At first we all thought it had completely stopped moving, but I kept my frames of reference and noticed it was slowly rising off in the distance. We went inside when a cloud covered it only to come back out an hour later and see it much higher in the sky. While watching it we noticed 2 planes fly overhead that shared none of the characteristics of the object we had seen. They were headed towards Hobby Airport (which was at an angle of NW towards SE while the craft moved directly from West to East.) The planes were loud and easily identified as airliner jets as we could see them clearly because of all the light from the near full moon."],"files":["/var/www/straped/mufon/html2text/9694.html.txt","/var/www/straped/mufon/org/9694.html"],"Object Shape":"Unknown","Longitude":"-95.35969","Case Number":"9694","Date Submitted":"02/23/2008 11:52 UTC","Sighting Duration":"Undisclosed","Region":"Texas","Summary":"Quick moving lights brightened then came to a dead stop and slowly rose.","City":"Houston","trends":["There have been 173 other sightings in Houston","There were no other sightings in Houston on or around February 23rd 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.766633,+-95.35969(9694)&iwloc=A&hl=en\"> mufon case (9694) map </A>","Log Number":"US-02242008-0002","Country":"United States","Tags":"City"}