{"Case Number":"9699","Log Number":"US-02242008-0007","Object Shape":"Star-like","Latitude":"32.228696","Sighting Duration":"Undisclosed","Longitude":"-98.194403","Region":"Texas","Tags":"City","Source":"MUFON","trends":["There have been 74 other sightings in Stephenville","There were no other sightings in Stephenville on or around February 24th 2008"],"Object Features":"Unknown","City":"Stephenville","Country":"United States","divs":["Sighting DetailsI took my dog out in the front yard to go to the bathroom just after 7 pm and as always, scanned the sky to check out the stars. I saw a really bright white star, almost as bright as Jupiter in the southern sky about 45 degrees above the horizon. As I watched the southern sky, I detected some movement in this star so I watched it closer and it seemed to be moving a bit faster now but still very slow. It was moving due north. I was beginning to think maybe it was a very slow moving satellite when I saw it start turning to the west. It appeared to be very high in the sky and had no blinking lights, just a steady bright, white light, much like a bright star. The next thing I knew, it turned red! I thought wow, what is that? I have never seen anything do that before. It was as if a red visor was pulled down over it suddenly. I could not tell for sure because it was so far away but it seemed to have a fiery glow. In other words, the red light appeared to move like flames instead of being a steady light. This reminded me of descriptions I had read in the paper a few weeks ago about UFO's reported in the Stephenville, TX area so I ran into the house and got my son's video camera and went back to see if I could get anything on film. I scanned the sky for about 10-15 minutes but never saw anything else moving. I just wanted to report what I saw since it sounded similar to other reports I had read and I certainly have never seen anything like it before. I always watch the sky when I am out at night. I have seen satellites come into view, travel across the sky and turn a dim reddish color before fading out of site. Of course, this was a little like that but a satellite can not make a left turn like this. Anyway, I was raised on a remote farm and have watched the sky a lot but I have never seen anything quite like this. The only thing I could guess is maybe someone is trying to create UFO reports by flying a plane without the normal flashing lights and somehow changing the colors. I never heard any sound with this light, but it did appear to be pretty far away. Maybe others saw this and I just wanted to report it in case it helps solve what people are seeing around here. As always, I will continue to watch the skies."],"Object Flight Path":"Path with directional change","Date of the Event":"02/24/2008 07:05 UTC","Date Submitted":"02/24/2008 07:05 UTC","Summary":"Bright white light moving slowly and changed directions and then turned red.","Weather Factors":"None, Does Not Apply","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9699.html.txt","/var/www/straped/mufon/org/9699.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.228696,+-98.194403(9699)&iwloc=A&hl=en\"> mufon case (9699) map </A>","Viewing Distance":"501 Feet - 1 Mile"}