{"files":["/var/www/straped/mufon/html2text/9703.html.txt","/var/www/straped/mufon/org/9703.html"],"divs":["Sighting DetailsI was driving with my aunt in car around Rigby Idaho. It was the 4th of July in 1976. We were returning to Idaho Falls from Menan to join family for fireworks. As we drove along, we noticed this bright light above the road - a light that was not there when we had passed the opposite direction only 20 minutes before. As we passed under it, the car slowly stopped like when the battery runs out until we just coasted. As we emerged the other side of the object, the car automatically started again. I remember the radio and the sound it made as the power was \"sucked\" away. I recall never being so afraid and awestruck at the same time. For a farm girl of only 8, it was the strangest most exciting thing I had ever seen. I am sure I cried for a moment. I also remember asking my Aunt Trish to re-start the car and get out of there. The object itself was huge - massive. It was a disk but not round more geometric in shape. I remember different colored lights flashing in sequence. As I look up at the bottom (as we were coasting under), I remember seeing more detailed geometric shapes along the entire surface- each segement had shape - it was not smooth. I might even describe it as having small buildings only upside down. The object was almost motionless except that it was rotating very slowly. I also recall there was absolutely no sound. None.... The wind coming in the windows was instantly silent. There was no noise until we passed out under the shadow of the object. As we continued down the road, neither of spoke for a few minutes and neither of us looked back. I remember how we both finally said at the same time, did that really happen? We were almost giddy with excitement by that time. We realized we did see the same thing. We immediately told our family about it upon returning to Idaho Falls. They all laughed at us and told us we were nuts. Ever since that night, I have had several strange experiences relating to obects in the night sky. Local rumors of the Roberts, Menan, Rigby, and the Menan Butte area were that there have been sightings for quite some time but no one wants to talk about them. Of course, when I tell people about what I saw, they all laugh and roll their eyes. I know what I saw and I will never forget it."],"Object Shape":"Disc, Square, Rectagular, Triangle","Viewing Distance":"20 Feet or Less","Log Number":"US-02242008-0011","Disposition":"Hoax","Country":"United States","City":"Rigby","Summary":"Object over roadway - car lost power and slowed to a stop","Object Features":"Patterned Surface, Appendage(s)","Date of the Event":"07/04/1976 12:00 UTC","Date Submitted":"07/04/1976 12:00 UTC","Region":"Idaho","Case Number":"9703","Latitude":"43.672412","map":"<A HREF = \"http://maps.google.com/maps?q=43.672412,+-111.914968(9703)&iwloc=A&hl=en\"> mufon case (9703) map </A>","Source":"MUFON","trends":["There have been no other sightings in Rigby","This sighting has never been favorited."],"Weather Factors":"Unknown","Tags":"City","Sighting Duration":"Undisclosed","Object Flight Path":"Stationary","Longitude":"-111.914968"}