{"Log Number":"US-02242008-0012","Tags":"City","divs":["Sighting DetailsI was standing on my back porch testing out night vision goggles. I put the goggles down and started looking up at the stars, since it was such a clear beautiful night. I immediately saw something that looked like a star (but smaller)traveling at a fast rate of speed among the stars in the sky. It was traveling south southeast and was too high in the sky to be any type of a plane. My husband made it on the porch in time to witness and did not know what the object was. He use to be a skeptic until now. He confirmed for me that it was not an airplane and that it did not have any other lights. Was more of a steady glowing white light shaped like a ball or may have been oval, traveling in a straight line. It soon disappeared into no where. I called my sister who lives next door and she did not get a chance to see the first one. While we were standing outside in the yard, we saw another one and it too moved very fast among the stars and disapeared. Also, it was not following the same path as the other one. We continued watching the sky and saw another one within 15 minutes. We decided to call it a night. Next time I will have my camcorder charged up and ready for the unknown."],"Date of the Event":"02/24/2008 07:22 UTC","Longitude":"-94.367418","Latitude":"32.544871","Date Submitted":"02/24/2008 07:22 UTC","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Marshall","There were no other sightings in Marshall on or around February 24th 2008"],"Object Flight Path":"Undisclosed","Region":"Texas","Disposition":"Unknown","Case Number":"9704","files":["/var/www/straped/mufon/html2text/9704.html.txt","/var/www/straped/mufon/org/9704.html"],"City":"Marshall","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Weather Factors":"Windy, Light","Country":"United States","Summary":"In Marshall, TX (SOUTH). We saw 3 objects within 30 minutes that looked like small stars traveling south and south east at a vey high rate of speed. It was not an airplanes, nor was it a shooting star. It did not have a tail, nor colorful lights.","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.544871,+-94.367418(9704)&iwloc=A&hl=en\"> mufon case (9704) map </A>","Object Shape":"Star-like"}