{"Latitude":"39.935602","Object Flight Path":"Unknown","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Log Number":"US-02252008-0003","Object Shape":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=39.935602,+-91.409873(9707)&iwloc=A&hl=en\"> mufon case (9707) map </A>","Case Number":"9707","trends":["There have been 7 other sightings in Quincy","There were no other sightings in Quincy on or around September 21st 1970"],"divs":["Sighting DetailsI am writing of this encounter just to document it. I cant give exact dates or even the year as a fact. I do recall the event very clearly, but it is something that my family and I have never spoken of. Well, a couple of years ago I did ask my mother some things about that night, but she has no memory of it. There is really not a lot to tell about the actual sighting but I will do my best to explain my encounter. I will also mention facts I do remember to help substantiate my gaps in memory. It was about 6:30 pm when my family and I were going into Quincy,Il. We were coming from Fowler, N.E. of Quincy. We drove west down U.S. 24 to Neikamps corner where we turned South. We traveled south to Ellington Road where we turned and headed west again. We traveled about 200 feet west when the encounter began. We were going into Quincy to go to church, we were going to a revival meeting. This being said, helps me to establish the time and approximate date. The revival meetings started at 7:00pm and the location of the encounter is about a 15 minute drive to the church. We were always early to the meetings as my dad was an usher and had duties before services would begin. This also helps me get a rough idea of the year. I actively attended church with my family from about 1968 to 1972. I want to say the encounter was in 1970 but I can't jog my memory enough to state that as a fact.I do know we were riding in a white 1964 Chevy station wagon. Since my father has died no one remembers when we owned that car. We were heading west, just in front of the WGEM radio towers. I was setting behind the driver looking south out the window. The sky began to become very bright. It was very dark out at 6:30 in the evening so it must have been late fall. As the sky brightened I became very afraid, I thought it was the end of the world. I remember looking to the sky to see something but there was nothing to see. I then turned and looked north towards the radio tower and saw the brightest blue white light I have ever seen in my life. The next thing I can remember we were headed south on Columbus road, just coming up to the KHQA radio tower. No one said a word about anything, we just kept going towards Quincy. We arrived at 16th and Locust in Quincy, without ever talking about the light. Everything looked normal at church when we arrived. I could see the people shaking hands and greeting each other as they always do. We got out of the car and went in and began to socialise as usual when we found out we were late. The services were over and everyone was going home. This would make the time be around 9:30 or 10:00, services always lasted that long, or even later. We talked for a bit and then returned home. We missed the whole church service, went back home and never said one word to one another about it. I have often wondered over the past 38 years or so what happened. Roughly 3 hours of time are gone and not one of us has said anything about it. I have mentioned it to friends and family a few times, but I have never offered an explanation. I have no idea what happened in the 3 hours but I do know I takes less than 5 minutes to drive from the WGEM towers to the KHQA tower. These towers may be gone now I haven't lived in Illinois for about 20 years now."],"Country":"United States","Summary":"Bright blue/white light and lost time","Object Features":"Unknown","Region":"Illinois","Source":"MUFON","Date Submitted":"09/21/1970 06:30 UTC","files":["/var/www/straped/mufon/html2text/9707.html.txt","/var/www/straped/mufon/org/9707.html"],"Tags":"City","Longitude":"-91.409873","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Date of the Event":"09/21/1970 06:30 UTC","City":"Quincy"}