{"City":"Fort Collins","Object Shape":"Sphere","Summary":"# UFO's around Horsetooth Reservoir","divs":["Sighting DetailsFrom 8:00 PM on Saturdat the 23rd I watched 2 UFO's start their evening routine, as I have for the past 3 weeks. They start in the hills to the north of Horsetooth, and slowly travel seperately south. They are bright, look to be at least 50' in diameter, and have a swirl of colored lights on top( only visable when the bottom lights are obscured.) They will sit motionless in a space between 2 hills for quite sometime, then slowly start to travel to the south east. I first noticed them 3 weeks ago as 1 was trying to shield itself with the ridge. I thought it was a car, and watched in curiosity because I didn't realize any roads were up that high and so close to the edge. Then this bright, large light slowly drifted across the gap in mid air. Then as it drifted behind the south ridge the bottom lights were covered enough to see the swirl of color on top. That's when I told myself something was messed up with that. It drifted north back into the gap and stopped for about 20 minutes. It started moving southwest, at the same time it's bright light dimmed, and colored lights were noticable. I have watched this for 3 weeks each weekend because I wanted to make sure I was seeing what I was seeing. It's the most bizarre thing I've ever seen. Also last Saturday just by happenstance I noticed another object about 400 feet in the air traveling west from west Fort Collins over Horsetooth. I also noticed that a car had stopped on the road on the lake directly in the path of the objest. It was obvious that they were watching the same thing. This happened I believe around 9:30, or so. Anyhow, I would just like to talk to someone about these, and 2 other sightings I had around 5 weeks ago, also on a weekend. Could someone please call me at the # provided. I think you all might be interested. Thanks."],"Sighting Duration":"03:50:00","Case Number":"9711","Date of the Event":"02/23/2008 10:59 UTC","Log Number":"US-02252008-0007","Tags":"City","Date Submitted":"02/23/2008 10:59 UTC","Latitude":"40.59367","Weather Factors":"Unknown","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9711.html.txt","/var/www/straped/mufon/org/9711.html"],"Viewing Distance":"Unknown","Region":"Colorado","Longitude":"-105.075813","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.59367,+-105.075813(9711)&iwloc=A&hl=en\"> mufon case (9711) map </A>","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around February 23rd 2008"],"Country":"United States","Source":"MUFON","Object Features":"Undisclosed"}