{"Region":"Oregon","Longitude":"-118.788597","Country":"United States","Date of the Event":"02/20/2008 07:45 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.672075,+-118.788597(9714)&iwloc=A&hl=en\"> mufon case (9714) map </A>","trends":["There has been one other sighting in Pendleton","There were no other sightings in Pendleton on or around February 20th 2008","This sighting has never been favorited.",""],"Latitude":"45.672075","Object Features":"Undisclosed","Summary":"Shape of house, square door that opened with what looks to be alien like beings, 10 shot photo, can actually see her head moving, symbol on the UFO,","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/9714.html.txt","/var/www/straped/mufon/more/9714_submitter_file1__02202008moonnightshots023.JPG","/var/www/straped/mufon/more/9714_submitter_file2__02202008moonnightshots024.JPG","/var/www/straped/mufon/more/9714_submitter_file3__02202008moonnightshots025.JPG","/var/www/straped/mufon/org/9714.html"],"Object Flight Path":"Undisclosed","Tags":"City","Case Number":"9714","Date Submitted":"02/20/2008 07:45 UTC","City":"Pendleton","Source":"MUFON","Log Number":"US-02252008-0010","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","Object Shape":"Other","Weather Factors":"Unknown","divs":["Sighting DetailsI was taking a shot of the luner eclips moon that night, I always take a 10 shot picture because I have several other pictures of what looks to be space craft pictures. My camera has a lense that shoots a long ways away. In these pictures you can see the outline of the house next door, the moon, and what looks to be a blue shpere, then everything goes black, no stars nothing, then the picture of what looks to be a house with lights under it, above it and then the space craft itself. There are NO houses in my neighborhood that remotely look like this thing. I have seen several things in the night sky and even come up with an explaination as to how they hide themselves from the naked eye. I believe they have thousands of reflector panels and they reflect the color of night. The reason I say this is because one night I saw one come out from behind a cloud and it looked as though it had thousands of reflector panels on it and it reflected the orange fog caused by the street lights after it had rained and got foggy. It was a very upclose sighting and I watched it for several minutes. I am a very avide sky watcher and have several pictures, I just never knew who to call until now. I am very excited about these pictures because I feel I have a shot of what looks to be a mother and a baby but in alien form. I feel very stupid telling someone else about this because most of the time people would think your nuts but I assure you I am very normal just a bit excited to have someone else tell me they are real and not something my camera decided to do to make things look different. I should tell you I never saw this thing by the naked eye this night but only in my pictures when I put them on my computer. When they showed up all I could say was \"what the hell\" and showed many other people who could only say the same. I will try to put them in order they came and if you click through them fast you can see the alien mother turning her head back one way then another. Also if you bring them up close you can see there black eyes. Please let me know you got this, and any explaination you have. I also have other pictures. PS I do not know how to send a folder with the pictures and you only have 3 spots for me to put single photo's so I could not send you the 10 picture shot I have of this thing. Thank you Kim"]}