{"Date of the Event":"07/10/2007 07:10 UTC","Country":"United States","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9716.html.txt","/var/www/straped/mufon/org/9716.html"],"Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","Longitude":"-116.961427","Case Number":"9716","divs":["sighting detailsthis event occured a little after 7 pm at my home in el cajon ca. my mother and father were with me on the porch talking and my back was to the road facing my parents. i live in a semi-rual area in between two hills with a road in front also between the two hills. for reasons unknown to me i turned around and looked to the south-west. about an eighth of a mile away down the road i saw a pitch black object against the sky, thats why it was so noticible because it was still light out but this thing was very black. it was only about 50-60 feet above the road and moving in a delibbrate couse following the road. when it got closer it was apparnt to my parents, who had took notice as well, and i that this was not normal. the shape was hard to discribe but it was a bit bigger than a large car but no taller than 4-5 feet. the front of the craft came to a sloping point as well as the rear except stung out further. the craft made absolutely no noise did not have any props or signs of propulsion. the craft was moving about 10-15 miles an hour whitch gave my father and i time to run up closer to the craft. this is the part that freaked us out. when we got with-in thowing distance of the thing the frount part of it turned in our direction while continuing its course. thats when i saw a green thin circle where an eye would go if the front was its head. that thing looked at us when we got close to it. it turned back and we followed it as far as we could on foot untill it turned and went out of sight. what we thought was a once in a life time experience occurred again last thursday 02\\21\\2008 only a few miles north-east at my fathers house in alpine ca. he witnessed the same object behaving in the same way only this time it was about 100-150 feet off the ground. this thing had awareness and was unlike anything we have ever seen in our lives. my father is a recreational piolit, my mother is an lvn (nurse), and i served in the usmc. we are very curiouse to know if anyone else has seen or heard of this kind of sighting. thank you."],"Date Submitted":"07/10/2007 07:10 UTC","trends":["There have been 41 other sightings in El Cajon","There were no other sightings in El Cajon on or around July 10th 2007"],"Object Flight Path":"Path with directional change","Region":"California","Disposition":"Unknown","Log Number":"US-02252008-0012","Object Features":"None, Unknown","Tags":"City","City":"El Cajon","Latitude":"32.804373","Summary":"Daylight sighting at home with 3 witnnesses. Object within 50 feet.","map":"<A HREF = \"http://maps.google.com/maps?q=32.804373,+-116.961427(9716)&iwloc=A&hl=en\"> mufon case (9716) map </A>","Object Shape":"Cigar, Other","Weather Factors":"Unknown"}