{"Longitude":"-81.511864","Object Flight Path":"Undisclosed","Region":"Florida","Weather Factors":"Unknown","Object Features":"Undisclosed","Latitude":"27.668397","Tags":"City","Sighting Duration":"Undisclosed","City":"Undisclosed","Date Submitted":"02/25/2008 12:00 UTC","Date of the Event":"02/25/2008 12:00 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=27.668397,+-81.511864(9717)&iwloc=A&hl=en\"> mufon case (9717) map </A>","Log Number":"US-02262008-0001","Object Shape":"Star-like, Triangle","files":["/var/www/straped/mufon/html2text/9717.html.txt","/var/www/straped/mufon/org/9717.html"],"Summary":"After the above words were said thru my inner-monologue I looked directly above me and I noticed a clear and beautiful starlit night. My vision was drawn to a very noticeable moving object what appeard to be a white star very high up.","Disposition":"Insufficient Data","Country":"United States","Case Number":"9717","Source":"MUFON","Viewing Distance":"Unknown","divs":["Sighting DetailsTonight was my second sighting in the last week and my second sighting in my entire lifetime. Only because of my recent and first sighting on Feb 17 2008 would I have enough prudent mind to ask anything so outlandish as I did tonight. since Last week from my first ufo sighting I've been looking up dayly and nightly ever since with hopes to see even more. As I walked outside to my pool area I said a few sincere words to the sky above. To the best of my recollection I said the following; \"Please show me a sighting if you are for real and so that I and the world can really know for sure that you exist.\" Out of shear coincedence or maybe what I witnessed somehow knew I was calling for them. After the above words were said thru my inner-monologue I looked directly above me and I noticed a clear and beautiful starlit night. My vision was drawn to a very noticeable moving object what appeard to be a white star very high up. It was so noticeable I ran inside to get my mother-inlaw for a second witness. As she exited our house I pointed up to the moving starlike ufo. Eventhough I was very excited and amazed and couldn't take my eye off this moving starlike object, I firmly beleive this somehow startled my mother-inlaw and she went inside and wished to see no more. I anxiously watched this object move directly eastward toward two other stars. After this object traveled quite a distance it came to rest in triangle formation with the other two stars. I watched this object for one hour solid after it came to rest with the other two. Evewnthough the other two stars it joined never moved I did notice one of them change a drastic orange like color. My friend came over about 2 hours later after it's initial movement and it was still in the triangle formation. I know this sounds very insane and quite outlandish but I think somehow I really did summons a sighting. Even if it was just a coincedence I feel extremely fortunate just to see something. I'm putting it out there for all to try. Remember inner monologue needs not to be heard by ears but is said inside. Try it, worst case nothing happens and you see nothing and the neighbors will not think you're talking to invisable people and insane. But what if? I would like to know if this is something everyone can harness. We won't know unless we all start trying. I would attest the truth to the above said on a bible and would not waist a person's valuable time nor make an idiot amongst his family, friends, and neighbors."],"trends":[]}