{"trends":[],"Region":"Colorado","Source":"MUFON","Date Submitted":"02/26/2008 04:15 UTC","Object Features":"None","Weather Factors":"None","Case Number":"9721","Date of the Event":"02/26/2008 04:15 UTC","Disposition":"Unknown","Longitude":"-105.775517","Latitude":"39.558431","Sighting Duration":"Undisclosed","Summary":"Silver sphere orb seen flying over field on Quebec, 1/4 mile north of Hampden","Log Number":"US-02262008-0005","files":["/var/www/straped/mufon/html2text/9721.html.txt","/var/www/straped/mufon/org/9721.html"],"divs":["Sighting DetailsWe were driving south on Quebec from Florida Ave on our way to pick my daughter up from school. A large park sits on the right side of the road between Yale and Hampden. I was in the passenger's seat and looked out the passenger's window and saw a large, silver sphere orb flying through the sky. My fiance slowed down the vehicle and leaned over to look out the window and she, too, saw the large flying object. We watched for a few seconds as it appeared and disappeared from the sky while flying south. Within seconds of the object disappearing we saw 4 fighter jets flying in a tight attack formation right above the park. The jets were flying so low I could actually see the pilots in the cockpit. I watch a lot of programs on the History and Military Channels and was able to identify the jets as being F-18 fighter jets flying in attack formation. The closest base is miles away from the area of the UFO sighting, and though we see fighter jets in the Denver area on occassion, we have never before seen jets flying this low. The fact that the jets were seen so closely to the UFO leads me to believe something is going on here that the government is trying to hide. This is not the first time we have seen UFO's in the Denver area, but it was the first time I have ever seen fighter jets in attack formation flying around the sighting area."],"Country":"United States","Object Flight Path":"Path with directional change","Object Shape":"Sphere","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=39.558431,+-105.775517(9721)&iwloc=A&hl=en\"> mufon case (9721) map </A>","Viewing Distance":"Over One Mile","City":"Undisclosed"}