{"Longitude":"-92.135924","Date of the Event":"09/15/2006 12:00 UTC","Object Shape":"Disc","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile","Summary":"3 Disc shaped objects in perfect side by side formation","files":["/var/www/straped/mufon/html2text/9722.html.txt","/var/www/straped/mufon/org/9722.html"],"Tags":"City","divs":["Sighting DetailsI saw what appeared to be 3 lenticular clouds equally spaced, side by side, like aircraft in formation and about half a mile ahead of me as I was driving west on US Hwy 80 approximately 8 miles to the east of Bossier City, LA. As I had never seen anything like this before, I wanted to get a picture of it and started looking for a place to pull off the highway. Before I could find a parking area, a group of trees came between me and these very unusual clouds. When I had cleared the trees and pulled off the highway the 3 clouds had moved to what appeared to be about 10 miles distance, but remained in a perfectly spaced formation. I did get that picture, but the skeptics would eat me alive if I claimed it to be anything but clouds. At 12 power magnification they were rather small by the time I took the photo. There was no noise and no contrails. When I first spotted them, the typical disc shape was apparent, but appeared to have a fuzzy surrounding about each of them. They continued to move slowly toward the southeast until they disappeared from sight. It was a 'bluebird' day and no other cloud formations were visible. Nothing appeared in any of the local media and I have not encountered anyone who admits to seeing it. I am familiar with cloud formations and have seen many lenticular clouds, but have never seen any that were in formation or that moved as these did. Still, if someone had shown me the picture of these objects without telling me the circumstances, I would swear that they were just clouds. William E. Ray MSGT USAF Ret. Private pilot Retired Boeing Technician"],"map":"<A HREF = \"http://maps.google.com/maps?q=31.248473,+-92.135924(9722)&iwloc=A&hl=en\"> mufon case (9722) map </A>","Object Features":"Dome","City":"Undisclosed","Weather Factors":"None","Region":"Louisiana","Sighting Duration":"Undisclosed","Source":"MUFON","trends":[],"Disposition":"Unknown","Country":"United States","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path then hovering","Latitude":"31.248473","Log Number":"US-02262008-0006","Date Submitted":"09/15/2006 12:00 UTC","Case Number":"9722"}