{"divs":["Sighting DetailsI was at home watching tv with the volume rather loud. I heard something overhead seemingly as though it were taking forever to go past my house. After a couple minutes I got up and looked outside and saw an extremely low flying object with extremely bright white lights. I thought to myself, \"it's so low where could it possibly land over here? there are no airports even close to here\" Two seconds later it was gone. I sat down to watch tv and about 2 minutes later my phone rang and it was my mom, who lives about 5 minutes from me. she said \"I think I just saw a ufo, I'm pulled over here on the side of the road to see if I can see it again\" . (at this point she sounded legitimately shaken). she said it looked like the front of an airplane with bright clear (yes clear, not white) lights, but the object was moving sideways. She said \"it was so low it looked like it was going to land but there's nowhere around here for it to land\" ..\"it was flying forward , I think, but then suddenly it looked like the object quickly slid sideways and flew that way but I could still see the lights in the same pattern.\" the lights were as bright as the lights on the poles on the baseball fields. My mom and I were down cape cod one day a couple years ago on the highway and we looked into the sky at the same time and we both are to this day convinced we saw a ufo. We pulled over on the side of the highway and sat and watched, jaws dropped in amazement. My mom's feelings were \"startled when I saw it because I thought it was going to crash then I was in total shock when I realized it was going away from me.\" \"I was in more shock when it suddenly just slid to the side, that's when I pulled over\". I lost sight of the object when it slid to the right and descended into the trees.\""],"Latitude":"41.638874","Object Features":"Unknown","Date Submitted":"02/26/2008 07:00 UTC","Viewing Distance":"21-100 Feet, 101-500 Feet","Summary":"low flying object ..string of lights","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=41.638874,+-70.896049(9723)&iwloc=A&hl=en\"> mufon case (9723) map </A>","Case Number":"9723","Log Number":"US-02262008-0007","Country":"United States","Disposition":"IFO","Date of the Event":"02/26/2008 07:00 UTC","Weather Factors":"Rain","Sighting Duration":"Undisclosed","Object Shape":"Circle, Triangle","Longitude":"-70.896049","Region":"Massachusetts","Object Flight Path":"Path with directional change","Source":"MUFON","trends":["There have been 2 other sightings in Fairhaven","There were no other sightings in Fairhaven on or around February 26th 2008"],"files":["/var/www/straped/mufon/html2text/9723.html.txt","/var/www/straped/mufon/org/9723.html"],"City":"Fairhaven"}