{"files":["/var/www/straped/mufon/html2text/9726.html.txt","/var/www/straped/mufon/org/9726.html"],"Sighting Duration":"Undisclosed","Disposition":"Unknown","Latitude":"32.35965","Log Number":"US-02262008-0010","Region":"Texas","trends":["There have been 18 other sightings in Tyler","There were no other sightings in Tyler on or around February 25th 2008"],"Date Submitted":"02/25/2008 12:00 UTC","Tags":"City","Country":"United States","Viewing Distance":"501 Feet - 1 Mile","City":"Tyler","Case Number":"9726","Source":"MUFON","Longitude":"-95.298262","map":"<A HREF = \"http://maps.google.com/maps?q=32.35965,+-95.298262(9726)&iwloc=A&hl=en\"> mufon case (9726) map </A>","Object Flight Path":"Hovering then path,Path with directional change","Summary":"Two white lights, like aircraft. The smaller one had a blinking red light. The white lights merged and flew upward as one unit towards high altitude.","Weather Factors":"Unknown","Object Shape":"Other","divs":["Sighting DetailsOur home is 5 miles south of a small airport. Our house is on a hill and our view is towards the airport. I am accustomed to the lights and the patterns of the commercial flights. There are also small private aircraft that pass nearby, but they rarely fly at night. Occasionally there are private jets that pass over our home at night on their way to land at the airport. There are also helicopters that pass by. These are typically CareFlights going on an east-west axis to the hospitals in town. As I am falling asleep or whenever I can't sleep, I look out the window at the trees and stars. This past weekend, on either Saturday night, Feb 23 or Sunday night, Feb 24, I was in bed and woke up and looked out at the night sky. I saw two white lights, like aircraft, in the sky. They were maybe 2000 feet up, or about twice as high as a plane on approach to the airport. I thought they were helicopters, but they were a little high for that. One of the lights, on the right - or more to the north - was bigger - maybe twice as big, as the other light, on the left. Both were white lights. The bigger one wasn't moving, and I guess that's why I thought it was a helicopter. The smaller one had a blinking red light on it. The smaller one with the red light moved on a diagonal path to the bigger one and connected with it, and they seemed to become one unit (two white lights and the blinking red light) and then the whole unit moved quickly straight up into the sky. It left my line of sight when it went too high up for me to see out the window. It was not logical for one aircraft to hover and for another aircraft to run right into it - and then for the two of them to go straight up in the sky. So I am reporting it."],"Date of the Event":"02/25/2008 12:00 UTC","Object Features":"Unknown"}