{"Object Shape":"Star-like","trends":["There have been 127 other sightings in San Francisco","There were no other sightings in San Francisco on or around November 10th 2007","This sighting has never been favorited.",""],"Case Number":"9727","Latitude":"37.77863","Disposition":"IFO","Date of the Event":"11/10/2007 12:00 UTC","Viewing Distance":"Unknown","Longitude":"-122.410046","Tags":"City","Sighting Duration":"Undisclosed","Summary":"Dancing star-like objects in the sky all the time captured on digital camera","Object Flight Path":"Other","map":"<A HREF = \"http://maps.google.com/maps?q=37.77863,+-122.410046(9727)&iwloc=A&hl=en\"> mufon case (9727) map </A>","files":["/var/www/straped/mufon/html2text/9727.html.txt","/var/www/straped/mufon/more/9727_submitter_file1__IMG_0195.JPG","/var/www/straped/mufon/more/9727_submitter_file2__IMG_0198.JPG","/var/www/straped/mufon/more/9727_submitter_file3__IMG_0200.JPG","/var/www/straped/mufon/org/9727.html"],"Weather Factors":"None","divs":["Sighting DetailsSince last August, I have been seeing what appears to be star-like objects moving or zigzagging up and down or side to side but staying within their own dusty looking atmosphere. I call them the 'dancing stars!' I finally decided to try and capture an image of a few of them when I couldn't get to sleep one night in November. The three images I've included is the outcome of my endeavor, which my boyfriend thought came out like they did because of the way I had my camera settings set up. Lately however, at different UFO websites, I have been reading reports and seeing very similar types of images which have been referred to as 'exterrestrial symbols.' I'd sure like to know if what I've captured are being made by UFOs because they are in different heights and distances all around the sky over my house all the time. Every night the sky is clear, I go outside right after it gets dark to wave at a few of them and when I do, each one will start dancing around like crazy. Be sure to enlarge each image for a better view!"],"Object Features":"Unknown","Log Number":"US-02272008-0001","Region":"California","City":"San Francisco","Country":"United States","Source":"MUFON","Date Submitted":"11/10/2007 12:00 UTC"}