{"Viewing Distance":"Unknown","Sighting Duration":"Undisclosed","trends":["There have been 151 other sightings in San Diego","There were 8 other sightings in San Diego on or around February 26th 2008"],"Latitude":"32.564436","Object Features":"Undisclosed","Tags":"City","Disposition":"IFO","Date Submitted":"02/26/2008 06:01 UTC","Object Shape":"Star-like, Other","Country":"United States","City":"San Diego","Weather Factors":"None","divs":["sighting detailsexcept for today all other previous time there are two lights in perpendicular \\ position one lower toward the left side and the higher up toward the right side. these from a distance facing east or south east depending on what side of the us\\mexico border you are. they are like two dots on a horizontal or when the light is coming at dawn you can see two very small dots of light. i usually wait until the first day of light is in because of the daylight you can hardly see them. today there was only one light but because it was a later time than the one on yesterday, tuesday 02\\27\\08. as a concluding point these lights seem to be on a stationary basis since from the last three months when i decided to look into the sky and on my way to the border i happen to see them; and they are very distinctly specially at that hour you just can't miss it. that it if you pay attention to them which is not very difficult to do. i even questioned a newspaper vendor a young girl and she did agreed to me that she has seen them. needles to say i have always been very much interested in everything related to ufo's since i was an adolescent. the image seem to be like an stationary base because it does not shine like a star. it's like a station like glow. i tried to take a photo with my digital camera but it did show on the hp screen, but i have the images from tne shopping center on this side of the border but again you can't see the lights from here. but i can tell you distinctly where the lights were at the time. i will go to target and get those to you.i need you address to mail them to you since i am writing from a public computer and can't feed the data into the hard drive from here."],"Log Number":"US-02272008-0002","Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=32.564436,+-117.043963(9728)&iwloc=A&hl=en\"> mufon case (9728) map </A>","files":["/var/www/straped/mufon/html2text/9728.html.txt","/var/www/straped/mufon/org/9728.html"],"Source":"MUFON","Summary":"I already reported this sigt and a gentleman from San Diego called me but I do not have a record. He called me Monday 02/25/at night and request ed from me to report him again if I saw the UFO. I checked it this morning @ 06:00 AM and sure enough there it","Case Number":"9728","Date of the Event":"02/26/2008 06:01 UTC","Region":"California","Longitude":"-117.043963"}