{"City":"Garden Grove","Date of the Event":"08/31/1993 10:50 UTC","Summary":"It came up to me and stopped. Its speed when it went was astounding.","Object Flight Path":"Undisclosed","Object Shape":"Other","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around August 31st 1993"],"Region":"California","Sighting Duration":"Undisclosed","Viewing Distance":"Unknown","divs":["Sighting DetailsAs I was walking home at night along a main street I saw to my left ahead of me a large white light at a very low altitude. As I walked through an apartment complex, and trees I saw the light at times. W#hen I got to the preschool on my street I saw it, and it stopped. I was near the street sidewalk looking northward, as the object was hovering silently over the preschool playground. The large bottom of it was painted white, and 16 feet in diameter. There was a tower in the middle of it made of dark bubbled glass. It was dark inside, as there was no light emanant. In the front of it where it was painted white was two high beam car headlights. They were close together. After viewing this object for about 2 and a half minutes it budged a foot northward then took off with amazing speed. The only way I was able to determin it path of departure was by the tracer its headlights left. It went northward at 20% from the horizon. I was most amazed by its speed. It really did not look like it could go very fast, and it looked kind of junky. It took off a couple of seconds after I thought that probably teenage aliens are flying it, and that it does not go very fast being that it related to a busted up car. Actually it was in pretty good condition. The paint looked pretty fresh, and its bubble glass tower was made in panels about 6 feet high. The tops of each panel was cut flat on top, and then angled on each side. I still think that the panels would not be able to stay in place with such acceleration. Or that they would greatly slow down the object. Thank you. I have many more sightings to share with you. I do not know why I had so many of them. Orbs of different sort have been in my area since 1986. I have 8 hours of DVD footage on them that I took. I wish I can share it with you, but I do not have the software to upload it, and I do not know how to. Is there a snail mail address for MUFON where I can copy my DVDs to VHS, and send it to you? I filmed some saucers, and some other interesting, unexplained anomulous objects. Also I was abducted twice (when I was 4 and 26). Are you interested in abduction, and alien encounter experiences? I have it all written down. To do one at a time on your form would be too much work. Unless I send them by pasting. Thanks again."],"Log Number":"US-02272008-0007","Longitude":"-117.938518","Latitude":"33.777055","map":"<A HREF = \"http://maps.google.com/maps?q=33.777055,+-117.938518(9733)&iwloc=A&hl=en\"> mufon case (9733) map </A>","Disposition":"IFO","Case Number":"9733","Date Submitted":"08/31/1993 10:50 UTC","files":["/var/www/straped/mufon/html2text/9733.html.txt","/var/www/straped/mufon/org/9733.html"],"Tags":"City","Object Features":"Undisclosed","Country":"United States","Source":"MUFON","Weather Factors":"Unknown"}