{"Date Submitted":"02/18/2008 11:50 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=45.808611,+-96.143333(9737)&iwloc=A&hl=en\"> mufon case (9737) map </A>","Viewing Distance":"Over One Mile","Latitude":"45.808611","Longitude":"-96.143333","Weather Factors":"Unknown","Source":"MUFON","Log Number":"US-02272008-0011","Object Features":"Other","files":["/var/www/straped/mufon/html2text/9737.html.txt","/var/www/straped/mufon/org/9737.html"],"trends":["There have been no other sightings in Herman","This sighting has never been favorited."],"Date of the Event":"02/18/2008 11:50 UTC","Sighting Duration":"Undisclosed","City":"Herman","Country":"United States","Tags":"City","Object Shape":"Fireball, Flash, Star-like, Teardrop","Region":"Minnesota","divs":["Sighting DetailsI was on my way over to check my livestock I was talking to my neighbor and parked in front of the barn. I hung up the phone and as I reached for the door handle the handle turned super bright with light. Then I noticed the entire north side of the barn was reflecting this light. I quick ran to the north so I could see where this bright light was coming from the east. As I looked there was the brightest light I had ever seen fling across the horizon. It was white to whitish geen and pulse three to four times and shot a trail of goldish orange light out the back side. It looked like fire and was moving at a terrific speed. After the orange glow substance shot out it was gone. It was moving from the south to the northeast. My hair stood straight up on the back of my head. My neighbor was four miles to the west at home in his yard and he called me and said \"did you see that\". We were both in amazement and shocked. We then talked for a while. We decided to call local sherriffs office and asked if anybody else had seen the light. It was wittened up to 12 miles away ans was also seen by into police as well."],"Case Number":"9737","Disposition":"Unknown","Object Flight Path":"Straight-line path","Summary":"Bright light flying across horizon"}