{"Case Number":"9742","Country":"United States","files":["/var/www/straped/mufon/html2text/9742.html.txt","/var/www/straped/mufon/org/9742.html"],"trends":["There have been 151 other sightings in San Diego","There were 8 other sightings in San Diego on or around February 27th 2008"],"Object Features":"Unknown","divs":["Sighting Detailsi was driving down Denver towards Clairamnt Drive when I saw 5 or 6 lights moving oddly, i thought they could be helicoptors, but it looked weird. Anyways i kept looking when suddenly 4 of the light headed downward quickly, much faster then a helicopter, and turned into this fire ball , flame, something like you see on tv in a metor show..orange and white colored and disappered. only to reappear a split second later. i called a friend and said look out your window at this strang light, he did but there was nothing!!! then he said oh there it is. the light was white there one split second then gone! he said it must be airplanes tring to land at the airport that they turn there light son and off while waiting to land... umm hello airplanes do not stay complety still in the sky? anyhow driving home there was a lot of activity in the sky light seemed to align up, they moved quickly back and forth up and down, like stright up and down without hesitation.. i'm not saying it's visitors from another plant i thought there was some goverment testing of aircrafts or a metor shower. I really can't say what it was only that it was odd and not a helicopter and it wasn't a plane. if anyone else saw this please let me know..."],"Longitude":"-117.197114","Latitude":"32.832844","map":"<A HREF = \"http://maps.google.com/maps?q=32.832844,+-117.197114(9742)&iwloc=A&hl=en\"> mufon case (9742) map </A>","Date of the Event":"02/27/2008 06:00 UTC","Object Flight Path":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","City":"San Diego","Tags":"City","Weather Factors":"None","Log Number":"US-02282008-0002","Object Shape":"Fireball, Star-like","Date Submitted":"02/27/2008 06:00 UTC","Disposition":"IFO","Summary":"many lights in sky, then sudden fall of 4 lights turned to a fire tail like a metor?","Region":"California","Source":"MUFON","Sighting Duration":"06:29:00","Viewing Distance":"501 Feet - 1 Mile"}