{"Date Submitted":"01/01/2008 01:00 UTC","files":["/var/www/straped/mufon/html2text/9743.html.txt","/var/www/straped/mufon/org/9743.html"],"Object Shape":"Circle, Sphere, Star-like","Case Number":"9743","divs":["sighting detailswe were (i was) driving home from a new years eve party about 12:30-1:00am n\\b on i-5 n\\of balboa ave. (rose canyon area). my wife pointed out several lights in the sky that looked strange. we saw numerous lights (similar to aircraft landing lights, except they were singular, not flashing, blinking or changing intensity, as aircraft landing lights do) in the sky to the n\\e. they appeared to be stationary or moving very slowly. we thought it was aircraft (helicopters) from the local mira mar air station. the lights stayed in the same area, appearing to be stationary and we lost the sighting only by driving out of the area. tonight i just saw a news story on our the local fox news. they reported that other people saw them too, but said they were probably small hot air ballons. if they were hot air baloons, the color would have been more amber or yellow, not a bluish white, and would have been dimmer and smaller. i am a recently retired chp (california highway patrol) officer and have worked that area of the i-5 for 13 years, so i am familar with the area. my wife is a city official, we both had just a few drinks earlier in the evening, i had 2 drinks over 3 hours prior to the sighting, so we were not intoxicated. i would be curious to know what the lights were."],"trends":["There have been 151 other sightings in San Diego","There were 2 other sightings in San Diego on or around January 1st 2008"],"Viewing Distance":"501 Feet - 1 Mile","Object Features":"Unknown","Tags":"City","Latitude":"32.717889","Date of the Event":"01/01/2008 01:00 UTC","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=32.717889,+-117.150795(9743)&iwloc=A&hl=en\"> mufon case (9743) map </A>","Sighting Duration":"Undisclosed","Log Number":"US-02282008-0003","Longitude":"-117.150795","Source":"MUFON","Summary":"5-8 round white/blue lights in formation","Region":"California","Object Flight Path":"Stationary,Hovering then path,Straight-line path","Disposition":"Unknown","City":"San Diego","Weather Factors":"Unknown"}