{"Object Flight Path":"Undisclosed","Region":"California","Date of the Event":"01/07/2008 06:15 UTC","divs":["Sighting DetailsDriving home from work, it was dark, but not for long (abt 6pm-ish). Many regular lights (cars, street lights, lights from side of freeway, as usual. A light drew my attention upward flying over the freeway directly above me going east directly west out to ocean. It was a cigar shaped \"glow\"(cliche, I know, but it was!) and it looked as though a helicopter might (same height)be flying over, but, through clouds or fog... (the light looked cloud or fog-shrouded). I know it made me look up because it was bright enough, yet, odd enough to look toward it. It moved at the speed a helicopter might at about 500 ft. but was so oddly clouded and oddly shaped it made me think \"what it that?\" it had steady light, no blinking light. It moved at a swift pace (maybe 50-100mph) twrd the sea. I remember looking at the sky to see if it was cloudy on the coast... and it was perfectly clear. That's when it kind of freaked me out. I really don't go for the UFO thing...but this was really weird. I told my family about it when I got home... and they thought I may have work too many hours! Not like me.... but it was worth telling. Anyway, saw your story on the news tnite and felt compelled after listening to the college kids (but could not definitely say my sighting was near the same time as theirs.) I will say, just like those kids, I would not write this unless I felt I actually saw something worth telling. What those college boys described sounded like what I may have witnessed going out to sea over Cardiff. I still wonder if anyone else saw what I saw .... it was fast, but still very obvious. I also feel very odd writing about this. I hope it helps!"],"Sighting Duration":"Undisclosed","Longitude":"-119.408922","City":"Undisclosed","Source":"MUFON","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=36.782441,+-119.408922(9746)&iwloc=A&hl=en\"> mufon case (9746) map </A>","Summary":"cloud like (clear sky) moving east-west ovr hwy5 at Manchestr-helicprtr hi","Case Number":"9746","Log Number":"US-02282008-0006","trends":[],"Country":"United States","Date Submitted":"01/07/2008 06:15 UTC","Viewing Distance":"Unknown","Object Shape":"Cigar, Oval","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9746.html.txt","/var/www/straped/mufon/org/9746.html"],"Tags":"City","Disposition":"IFO","Latitude":"36.782441"}