{"Region":"California","Summary":"Observed pulsating spherical light high in the sky--stationary, then moved","map":"<A HREF = \"http://maps.google.com/maps?q=32.716909,+-117.155155(9749)&iwloc=A&hl=en\"> mufon case (9749) map </A>","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Disposition":"Unknown","Latitude":"32.716909","divs":["Sighting DetailsI was in my back yard looking into the early night sky for satellites, as I often do. On that night, November 13th, 2007, at about 8:30 p.m., I observed an orange, spherical, pulsating light that appeared to be about the same distancd in space as satellites, which I have seen on many occasions. At first it was stationary, but because it was too big to be a star and it was definitely not a satellite, I fully expected it to move, which it did. In fact, within a few seconds after I first saw it, it began to move in a southerly direction. It only took a few seconds for it to move a distance of about 18 inches with reference to the tips of my fingers at the end of my extended arms. Then it stopped, all of the time emitting, not reflecting, a pulsating, orange light. I called for my wife to join me, which she did. We both watched it in the stationary position for a short time, perhaps a minute, when it moved to the west, then back to the north, finally returning to about the same place where it had moved on its first stop, then it moved to the east and disappeared. Later, my wife went to look for it again. It had moved further to the west. She called me to come, and I observed it for the second time as well, but only for a few seconds, and it disappeared. It is hard to believe that this object, whatever it was, was not under the control of some intelligent being, either by an occupant or by some remote power source. Interestingly, I later went to the Google site and entered: \"UFO San Diego November 13 2007\", and got several reports of others who made similar sitings that night, and two girls in San Diego had videoed a siting at around 8 p.m."],"files":["/var/www/straped/mufon/html2text/9749.html.txt","/var/www/straped/mufon/org/9749.html"],"Log Number":"US-02282008-0009","Case Number":"9749","Tags":"City","Longitude":"-117.155155","Country":"United States","Date Submitted":"11/13/2007 08:30 UTC","Date of the Event":"11/13/2007 08:30 UTC","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Object Shape":"Flash, Sphere","Source":"MUFON","Viewing Distance":"Over One Mile","City":"San Diego","Object Features":"Unknown","trends":["There have been 151 other sightings in San Diego","There was one other sighting in San Diego on or around November 13th 2007"]}