{"trends":["There have been 151 other sightings in San Diego","There were 8 other sightings in San Diego on or around February 27th 2008","This sighting has never been favorited.",""],"Disposition":"IFO","Case Number":"9750","Longitude":"-117.150995","City":"San Diego","Country":"United States","Tags":"City","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Source":"MUFON","Object Features":"Unknown","Region":"California","divs":["sighting detailsmy girlfriend and i were driving in her car on our way to her house around 7:20 7:25 p.m. 2\\27\\08. she was driving; as we came close to the golf course near my house i noticed directly infront of us (around 1500 feet in the sky) 2 distinct objects descending at an alarming rate. both of the objects had what looked to be a fire trail. objects had a circular head and comet like fire tail. the head looked like a bright perfectly round light with trail following. at first look i actually thought they were missles descending. we stopped the car and watched the objects disappear instantly in their descent. then as fast as they were gone multiple circular intense huge lights lit up in unisen were the comet like objects disapeared...there was 5 or 6 of them spread out in a loose cluster. they remained hovering in their prospective positions, and in the same fashion they lit up out of no where...they extinguished in unisen. then 2 maybee 4 seconds passed and the the objects re lit in the same area but slightly different positions and remained hovering. the extinguishing and re lighting of these objects huge lights occured 3 times that i saw.....each time the objects remained hovering and reappeared in different positions all in a loose cluster. after the third time....the lights did not re ignite. during this whole event there was a helicopter circling the area were event was taking place.....the size of each light compared to the helicopter was that of a softball compared to a golf ball....these lights were huge, brilliant, and steady no flashing or blinking. no mistaking them for anything other than ufo's simply amazing event; im just glad my girlfriend witnessed it as well. when we got home we were hoping there would be a report on the local news. there was a ufo sighting report on our local news channel which showed video of objects like we witnessed; however the sighting was from january 6 '08 no report on the sighting we witnessed that night. ironic and strange....but to be expected."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.722799,+-117.150995(9750)&iwloc=A&hl=en\"> mufon case (9750) map </A>","Summary":"multilple large brilliant spheres appearing and disappearing in loose cluster.....5 or 6 seperate spheres","Object Flight Path":"Stationary,Path then hovering","Date Submitted":"02/27/2008 07:25 UTC","Log Number":"US-02282008-0010","Object Shape":"Circle, Fireball, Sphere","Date of the Event":"02/27/2008 07:25 UTC","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/9750.html.txt","/var/www/straped/mufon/more/9750_submitter_file1__ufo001.jpg","/var/www/straped/mufon/org/9750.html"],"Latitude":"32.722799"}