{"Weather Factors":"None","Case Number":"9751","files":["/var/www/straped/mufon/html2text/9751.html.txt","/var/www/straped/mufon/more/9751_submitter_file1__stoutplanewithnolightorsound.jpg","/var/www/straped/mufon/org/9751.html"],"divs":["Sighting DetailsI'm unsure of exact date and time as it happened about week ago or perhaps a bit more...around Feb 17th 2008 plus a day or two or minus a week or so???...I live between Goshen and Wakarusa Indiana out in the country. I had fallen asleep on the sofa and awoke (probably 2-2:30-ish a.m.?) and almost immediately saw outside our wide west window and near the very top a dark ,STOUT, HEAVY-BODIED \"airplane-looking thing\" moving across my field of view from north to south...total view time was maybe 2 seconds if that...more like glided by or floated...not enough speed to be flying like normal planes do...not a typical plane either at all...wings connected fully along body and all looked WAY too stout...no lights...too slow...heard no sound...It appeared pretty large (best guess is somewhere between largest cessna-type to small commercial size) as it seemed to be quite close to the house and probably 100-400 feet off ground at most???......It appeared to be very similar to an airplane but just ODD!!! (too Heavy-looking) ...LARGE TALL VERTICAL TAIL FIN...going quite SLOW, NO LIGHTS OR SOUND...bizarre! Very dark looking and basically silhouetted against a bit less dark sky...The closest thing it resembled too me would be if you kinda squashed a f117 nighthawk flat for the basic shape, put on a full traditional jetliner fuselage shape, and then stood a tail fin up really stout, big and tall. (Tried to kinda draw it in \"paint\" but I'm not an artist...fuselage was kinda tall looking and was more rounded and normalish than shows on my drawing.) Craft was rather short-bodied and stout...NOT long and sleek like something that would fly well...looked like it was too fat almost to be flying but not quite. I thought perhaps I was still half asleep (guess I could have been but don't think so) As it happened right after the point of awakening so I still leave room a tiny bit that I just imagined it...but my gut tells me I did see it as I was actually awake for a couple seconds first and focused on it and stared right at it as it went slowly across my field of view. I heard nothing from inside the house. I suppose it could have made a small sound outdoors but if it made any noise, it was next to none as it was very close and I heard absolutely nothing. Any plane at that close distance would have sounded like it was gonna take the roof off and would have probably scared me outta my wits. ???????????????????????????? (and no drugs or drinking for me~ever...just a regular joe)"],"trends":["There have been 6 other sightings in Goshen","There were no other sightings in Goshen on or around February 17th 2008","This sighting has never been favorited.",""],"Source":"MUFON","Country":"United States","Date of the Event":"02/17/2008 12:00 UTC","Tags":"City","Disposition":"Unknown","Sighting Duration":"00:00:02","Date Submitted":"02/17/2008 12:00 UTC","Summary":"Dark,Stout heavy-bodied airplane look...large vertical tail fin... SLOW, NO LIGHTS OR SOUND","Log Number":"US-02282008-0011","Object Shape":"Triangle, Other","Longitude":"-85.828048","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"Indiana","Object Features":"Wings","map":"<A HREF = \"http://maps.google.com/maps?q=41.590812,+-85.828048(9751)&iwloc=A&hl=en\"> mufon case (9751) map </A>","Latitude":"41.590812","City":"Goshen","Object Flight Path":"Straight-line path"}