{"Weather Factors":"None","Date of the Event":"02/27/2008 12:00 UTC","Object Shape":"Circle, Fireball, Star-like, Teardrop","Latitude":"32.724679","Country":"United States","Tags":"City","City":"San Diego","Object Flight Path":"Stationary,Hovering then path,Path with directional change,Path then hovering","Object Features":"Undisclosed","Log Number":"US-02282008-0014","Sighting Duration":"Undisclosed","Source":"MUFON","trends":["There have been 151 other sightings in San Diego","There were 8 other sightings in San Diego on or around February 27th 2008","This sighting has never been favorited.",""],"Region":"California","files":["/var/www/straped/mufon/html2text/9754.html.txt","/var/www/straped/mufon/more/9754_submitter_file1__UFO.jpg","/var/www/straped/mufon/org/9754.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=32.724679,+-117.154685(9754)&iwloc=A&hl=en\"> mufon case (9754) map </A>","Case Number":"9754","Summary":"5 lights zig zagging then disappear, 2 minutes later 2 more lights","Longitude":"-117.154685","Date Submitted":"02/27/2008 12:00 UTC","Disposition":"IFO","divs":["sighting detailsalot of planes fly over my business, at about 7pm on 2\\27\\08 my partner and i were having a conversation outside my shop. i looked up because i heard a plane and noticed 5 lights falling down from the sky, they were falling straight down and i thought it was a meteor shower but then they stopped in the sky for about 30 seconds and then started zig zagging before they disappeared. at this point all of the patron from my business and the neighboring businesses were outside because they saw my partner and i pointing at the sky and also our reactions. as we were telling everyone what we saw two more light suddenly appeared in the sky again falling, then stop and hold for about 30 seconds and then zig zagging in the sky before disappearing. everyone was amazed and could not believe it. i would say atleast 15 people saw it. i attached one photo of one of the lights. it is the little dot in the sky that looks like a star above the big burst of light which is from the lightpost. this was something that everyone could not believe. please feel free to contact me with questions."],"Viewing Distance":"Over One Mile"}