{"Object Shape":"Triangle, Unknown","Country":"United States","Case Number":"9755","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Latitude":"28.542246","Weather Factors":"Windy, Lightning, Rain, Light","map":"<A HREF = \"http://maps.google.com/maps?q=28.542246,+-81.370196(9755)&iwloc=A&hl=en\"> mufon case (9755) map </A>","Tags":"City","Log Number":"US-02282008-0015","Date of the Event":"02/26/2008 11:30 UTC","Source":"MUFON","City":"Orlando","Summary":"There were half a dozen elongated crafts and one triangle shaped one.","Object Flight Path":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","Longitude":"-81.370196","trends":["There have been 112 other sightings in Orlando","There were no other sightings in Orlando on or around February 26th 2008"],"Date Submitted":"02/26/2008 11:30 UTC","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Region":"Florida","divs":["Sighting DetailsI was picking up my roommate from work. He works only a few miles north of the Orlando Airport. We were driving away from the airport on 436 heading towards the 408. My roommate first noticed something hovering in the air. I thought at first it was a huge military helicopter, and my roommate thought it was a blimp. However, the weather was severe. There was lightening, some rain, and very strong wind gusts. There were blinking lights on the craft and we could almost make it out because the sky was light (even though it was 11:30pm). The craft hovered for awhile, then moved forwards and backwards and up and down. We started to notice that there were multiple crafts in the area. We pulled the car over to watch the crafts and realized that they were neither helicopters or blimps (at least none that we had seen), and the inclement weather did not appear to have any effect. We started driving again, and then noticed a huge triangular craft with lights outlining the entire craft. At first I thought it might be a stealth bomber, but it did not quite fit that description either. It also hovered and could move back and forth without being effected by the windy stormy weather. We pulled the car over again. This event was approximately 15 minutes in total. We drove further down the road and noticed more of the elongated crafts. We probably saw six of those in total, and one of the triangular shaped crafts. The crafts seemed to be staying in that stretch of land between the airport and the 408 on 436, but we did not stay until they left. We continued driving down the road to see if we encountered any more of the unusual aircraft. We tried to call the Orlando Aviation Authority to inquire, but the office hours were long closed. We watched the news for any military activity, but none was reported. We looked on the internet, and did not see anything that really resembled the enlongated crafts, but the triangular shaped one seemed to be a common sighting. I was referred to this site by an uncle that is an avid UFO enthusiast. This is the first time that I have seen aircraft that I could not identify. We were very excited by the entire experience, and extremely perplexed. Unfortunately, we did not take pictures of the event. We were too pre-occupied trying to understand what was going on."],"files":["/var/www/straped/mufon/html2text/9755.html.txt","/var/www/straped/mufon/org/9755.html"]}