{"trends":["There have been 14 other sightings in Kennewick","There were no other sightings in Kennewick on or around June 13th 1997"],"Longitude":"-119.131024","City":"Kennewick","Source":"MUFON","Summary":"3 entities in my house","Date of the Event":"06/13/1997 02:00 UTC","files":["/var/www/straped/mufon/html2text/9756.html.txt","/var/www/straped/mufon/org/9756.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=46.217856,+-119.131024(9756)&iwloc=A&hl=en\"> mufon case (9756) map </A>","Weather Factors":"Unknown","Latitude":"46.217856","Case Number":"9756","Date Submitted":"06/13/1997 02:00 UTC","Country":"United States","Object Shape":"Other","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Region":"Washington","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Log Number":"US-02282008-0016","Tags":"City","divs":["Sighting DetailsI don't know if this is the place to put this but here goes... one early morning around 2 and 3 am my Rotty was laying next to my bed when I was awaken by her growling I reached for her in a sleepy stooper and she kept growling at the door. I rubbed my eyes and then looked at the door way and saw 3 heads there one took his hand and lifted it up and slowly brought it down all of a sudden my dogs stopped growing and she went to sleep and when I looked back up at them they blinked and did the same hand jester and I went to sleep... later that morning I woke with a very very bad head ache my Dog was very Quite and would not come out of my room... I had a small circle wound on my calf but I dont know how it got there... and that is all I remember on that, but after that encounter I have seen many sitings of UFOs to many to recall all of them... I do remember this one it was in the summer of 2001 I was in our Pool it was an over cast day, something made me feel like I needed to look up and when I did an oval shaped mettle object appeared from the clouds. The cloud cover was very low that day so the object was not very high so and I could see windows that went from one side to the other it made no sound, and it was moving very slowly between the clouds."],"Sighting Duration":"00:05:00"}