{"Date Submitted":"03/20/1982 09:00 UTC","Disposition":"Unknown","trends":["There have been no other sightings in Iredell","This sighting has never been favorited."],"Country":"United States","Longitude":"-97.871974","Summary":"About 30 feet long and 20 feet wide","Object Features":"Unknown","Object Flight Path":"Hovering then path,Path with directional change,Path then hovering","Sighting Duration":"00:15:00","Region":"Texas","Source":"MUFON","Case Number":"9758","files":["/var/www/straped/mufon/html2text/9758.html.txt","/var/www/straped/mufon/org/9758.html"],"divs":["Sighting DetailsWe were hazing some pledges for our fraternity, the Silver Keys of Tarleton State University, on the Bosque River near Iredell. We had the pledges in the water and a bonfire on the bank. There was some drinking going on, but the members were not drunk. At one point during the hazing, a large object, probably oval shaped but dark, came slowly up the river towards us. It began flashing all different colors of lights all over it, but not in any pattern I can recall. It stopped about 30 feet above us. There was absolutely no wind or noise or any other disturbance coming from the thing. All of us stood in silence looking up at it for at least a full minute. II thought we were mesmerized and it was almost as if there was some amount of lost time or something. Then it suddenly shot off at an angle upward and disappeared. We seemed to stand silent for another minute, then broke out in screams and yells. The strangest thing about it seems to have been forgetting about it for a couple of days immediately after that night. It wasn't that we actually forgot about it, but our minds didn't register that it happened I guess. It is hard to explain. Then one day we were sitting around talking about the pledging of that night when someone said something about the UFO. We all burst out in excitement talking about it and what it could have been, like our memories had come back. We concluded that it was some sort of military secret weapon or government experiment. Many years later I read something about how so-called abductees recall their experiences. I hope nothing like that happened, and I don't think it did, but something was going on. As far as I know, none of the 20-25 of us who witnessed the event have ever come forward. It has been over 25 years now. I spoke with two of the witnesses that I managed to find. Both are successful business owners in the DFW metroplex and will not go on record. Both remember almost exactly what I do. They said people will call them crazy or drunk, so they won't come forward. One said he would go on record anonymously maybe. I don't know where all the others are these days. I am a city councilman now and running for Mayor. The recent event in Stephenville here has prompted me to come forward. Most of the people who witnessed our event in 1982 are now reputable folks not given to flights of fancy, as are many of the recent event witnesses. Please let me know if I can do anything else. I would be willing to undergo controlled hypnosis, assuming that it would work on me. If there are any Silver Keys out there who were at the water rally of 1982, please step up and talk."],"Latitude":"31.985149","Date of the Event":"03/20/1982 09:00 UTC","Viewing Distance":"21-100 Feet","map":"<A HREF = \"http://maps.google.com/maps?q=31.985149,+-97.871974(9758)&iwloc=A&hl=en\"> mufon case (9758) map </A>","Tags":"City","City":"Iredell","Log Number":"US-02282008-0018","Weather Factors":"None","Object Shape":"Oval, Unknown"}