{"map":"<A HREF = \"http://maps.google.com/maps?q=32.770379,+-117.018284(9760)&iwloc=A&hl=en\"> mufon case (9760) map </A>","divs":["Sighting DetailsI was driving home from work one evening on Highway 8, it was still light out but dusk. I was about four exits from Fletcher Parkway exit I needed to take off. I saw a spaceship looking thing in front of me on the right hand side of the highway. I couldnt believe I was seeing this lighted think that looked just like you see in the movies. I questioned myself and looked at the cars next to me all around to see other peoples reactions to see if anyone else was seeing what I was....yet turning back to see ...yep ..it was still there. Didnt see that anyone else was seeing next to me anyhow. I watched it hover in the same spot without moving...then when I came to my exit it was right there over the bridge, same spot the whole time I was watching it. Still in shock I looked around again to see if anyone else was looking to see if they were looking and saw what I was seeing as I took my exit. No one was responding in shock like I was but evidently not. When I turned my head back...it was gone! I couldnt believe I saw a UFO! As soon as I got home I had to tell people ..and of course they thought I was losing it...but I know what I saw! Never really went further to tell many as I knew they wouldnt believe me ...but I know what I saw. Wish they had cell phones then I would have had no problem taking a picture of it. Thanks wanted to share ...cause it was sooooooooooo true...and unbelievably shocking...will never forget it. A statement in my head and vision forever...ya know. Feels good to finally tell someone that knows its the truth!!!! THANK YOU"],"Object Shape":"Oval","Case Number":"9760","Region":"California","Longitude":"-117.018284","Tags":"City","Source":"MUFON","Viewing Distance":"21-100 Feet, 101-500 Feet","Object Features":"None","Object Flight Path":"Stationary","Summary":"On my way home from work on Hwy8, it was hovering over the Fletcher Pkwy exit one evening","City":"La Mesa","Latitude":"32.770379","Weather Factors":"Unknown","Log Number":"US-02282008-0020","Country":"United States","Sighting Duration":"Undisclosed","trends":["There have been 13 other sightings in La Mesa","There were no other sightings in La Mesa on or around August 24th 1992"],"Date of the Event":"08/24/1992 12:00 UTC","Disposition":"Unknown","Date Submitted":"08/24/1992 12:00 UTC","files":["/var/www/straped/mufon/html2text/9760.html.txt","/var/www/straped/mufon/org/9760.html"]}