{"Country":"United States","files":["/var/www/straped/mufon/html2text/9763.html.txt","/var/www/straped/mufon/org/9763.html"],"Source":"MUFON","Object Flight Path":"Stationary,Path with directional change,Path then hovering","Sighting Duration":"Undisclosed","Date Submitted":"06/15/1980 12:00 UTC","Region":"Michigan","Disposition":"Unknown","divs":["Sighting DetailsI was driving south on a summer night in the late 1970s (not sure of the date anymore) on Orchard Lake Road, and had just approached the overpass for highway 696 (east-west highway). I spotted a triangular aircraft just above the treeline of the residential neighborhood just south of 696, across from the Farmington Hills campus of Oakland Community College. It was dark but the night sky has an incandescence to it in this semi-urban area, so I immediately noticed the craft as it moved back and forth, as if scanning. I stopped my car on the overpass and opened my window. Two other cars did the same, and I and one other driver got out of our cars to watch and comment. The aircraft was zipping back and forth over the semi-wooded area, east-to-west, changing direction instantly, without banking. It was very low, very fast and completely silent, without any lights. I was stunned by its speed, instant changes in direction and silence. I thought perhaps it was a test run of some new hight-tech military aircraft, or even some sort of weapon, from Selfridge. I returned to my car and continued to head south on Orchard Lake Road and home, sneaking glances at it as I passed the area. After about 7 or 8 minutes I reached Grand River Avenue. I stopped for the light and looked around, passenger window still down. I glanced up and saw a huge triangular craft hovering just over the roof of the gas station and pumps at the corner, to my left. The craft was large, the length of at lest two vehicles, absolutely silent and absolutely still, as if suspended in the air. It had a light at each corner - one red, one green and one white, non-blinking. I looked out my window and realized I was also under it. It was so close I could see intricate details in what appeared to be a metallic surface, as if to accomodate for wiring or piping within the base of the craft. The light changed and I had to drive off, in shock, wondering what I'd seen that night. I've never had an experience like that before or since. Nor have I ever forgotten it."],"Latitude":"42.482822","Date of the Event":"06/15/1980 12:00 UTC","Summary":"Black metallic triangle with red, white and green lights","Tags":"City","trends":["There have been 5 other sightings in Farmington Hills","There were no other sightings in Farmington Hills on or around June 15th 1980"],"City":"Farmington Hills","Case Number":"9763","Viewing Distance":"20 Feet or Less","Longitude":"-83.418382","Object Features":"Other","Log Number":"US-02282008-0023","map":"<A HREF = \"http://maps.google.com/maps?q=42.482822,+-83.418382(9763)&iwloc=A&hl=en\"> mufon case (9763) map </A>","Object Shape":"Triangle","Weather Factors":"Unknown"}