{"Object Features":"None","Summary":"5 bright lights in the sky very close together","Object Flight Path":"Hovering then path","map":"<A HREF = \"http://maps.google.com/maps?q=32.641064,+-117.081356(9765)&iwloc=A&hl=en\"> mufon case (9765) map </A>","divs":["Sighting DetailsI was in my car driving northbound on the I-805 in the national city area. It caught my attention to see about 5 bright lights in the sky on the west side. The lights where far away and would move together very close and then disappear one by one and again reappear in a different area within 3 seconds. I wondered if it could be a plane show. But I have never seen a plane move such a long distance in just 3 seconds. when they reappeared again they turned off one by one then re appeared again in a different location. They kept getting lower and lower. Then I could no longer see them. This all happend in about a minute. I was driving and found myself almost getting in an accident from being so distracted from the lights in the sky. I kept looking in the sky to find the lights to see if they would come back, but nothing. I thought I had just experienced a UFO sighting. But somehow I thought it had to be some kind of a light show. It was very strange to see that, I have never seen anything like it before. Later that night I watched the news and they where talking about UFO sightings and they showed a clip of one that looked exactly the same as what I had seen earlier that night. I thought that finally I was going to have an answer. But the clip was from a different date not from that same day. I was waiting for the report on the strange lights in the sky and figured someone else out there had to of seen this and reported it. It was never mentioned on the news. I know someone else had to of seen this out there. I dont know how long it was actually going on but I caught about a minute of it. It was kind of exciting to think that I could of seen ufo's."],"Disposition":"IFO","Viewing Distance":"Over One Mile","Tags":"City","trends":["There have been 11 other sightings in Chula Vista","There were no other sightings in Chula Vista on or around February 27th 2008"],"Log Number":"US-02282008-0025","Case Number":"9765","Date of the Event":"02/27/2008 06:30 UTC","Region":"California","Latitude":"32.641064","Sighting Duration":"Undisclosed","Date Submitted":"02/27/2008 06:30 UTC","files":["/var/www/straped/mufon/html2text/9765.html.txt","/var/www/straped/mufon/org/9765.html"],"Source":"MUFON","Object Shape":"Fireball","Weather Factors":"Unknown","Longitude":"-117.081356","City":"Chula Vista","Country":"United States"}