{"Region":"California","Source":"MUFON","Object Features":"Undisclosed","trends":["There have been 2 other sightings in National City","There were no other sightings in National City on or around February 27th 2008"],"City":"National City","Longitude":"-117.099197","Log Number":"US-02282008-0038","Date Submitted":"02/27/2008 06:30 UTC","Sighting Duration":"Undisclosed","Summary":"unknown bright lights appearing in the western part of the sky","files":["/var/www/straped/mufon/html2text/9778.html.txt","/var/www/straped/mufon/org/9778.html"],"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=32.678108,+-117.099197(9778)&iwloc=A&hl=en\"> mufon case (9778) map </A>","Weather Factors":"Unknown","Object Shape":"Unknown","Date of the Event":"02/27/2008 06:30 UTC","Latitude":"32.678108","divs":["Sighting DetailsMy daughter and I was driving on our way to church we were leaving our home in Chula Vista. I had Just gotten off of the 805 north and connected unto the 94 west when all of a sudden my daughter said mommy what are those lights up in the sky. I looked toward the sky there to my surprise was 4 very bright circular lights these lights did not blink I said maybe they are airplanes my daughter said no the lights are to close together to be airplanes. She kept starring at the lights while I would take quick glances because I was driving. my daugher said mommy I think it is a UFO The lights must have been shining bright for a good minute when suddenly the lights went off came back on quickly and then there was only 3 shining lights with in 10-20 secs later all of the light had dissapeared into the sky. When we finally reached the Church one of the members was just getting out of her car and witnessed the same thing. I was glad of that because I did not want us to be the only one to have witnessed the unknown lights in the sky. Every since I saw those lights I can get it out of mind because I know it was not a helicopter, airplane or blimp. The lights did not blink and they were stationary and very bright."],"Country":"United States","Disposition":"IFO","Tags":"City","Object Flight Path":"Undisclosed","Case Number":"9778"}