{"City":"Undisclosed","Longitude":"-82.897413","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","Object Shape":"Undisclosed","Latitude":"32.165025","Log Number":"US-02292008-0006","Case Number":"9785","Date of the Event":"Unknown","divs":["Sighting DetailsMarch 1, 2008 Hi UFO Researchers, I am fascinated by what I see on TV concerning UFO sightings and I must say that I am incline to believe that there are Allen beings investigating our planet. From what I see on TV, I am getting the impression that there may be two distinct types of mechanical devices roaming the earth. One would be Allen occupied and the other operated by some sort of remote control. The Allen occupied devices seem to be those large to very large items that seem to hover, submerge and, accelerate away at a very high rate of speed without making any type of quick erratic motions of seventy percent angles or less. The second devises then, would be the remote control machine types, the smaller items that are very quick and can stop on a dime, hover, scan, dart about and, make jerky type movement up or down, right or left, diagonally and or, that split up into several pieces as though control by some type of joy stick. Items that fly in formation could be either device. May I suggest reviewing the documented information and chacterize the sightings by either of the two groups mentioned above? This type of logging, I believe, may help us to learn a little bit more about the forces behind the sightings especially, concerning items that seemed to be operated by some sort of, joy stick, remote. Perhaps the controlling element might be hovering somewhere in shallow space where we can't see it by eye. If we are less occupied with just seeing a UFO and start identifying it by its behavior, we may be able to take fast action and ask space agencies if one of our satellites can see anything higher up in the sky near the sightings that are being seen in real time. Things that are operated by remote have a limited line of control. Just a thought, P.S. I will accept a suggestion award donation. I am really broke. Thomas Gilliard P.O. Box 1272 Redan, GA 30074-1272"],"Viewing Distance":"Unknown","Disposition":"IFO","map":"<A HREF = \"http://maps.google.com/maps?q=32.165025,+-82.897413(9785)&iwloc=A&hl=en\"> mufon case (9785) map </A>","Weather Factors":"Unknown","Country":"United States","trends":[],"files":["/var/www/straped/mufon/html2text/9785.html.txt","/var/www/straped/mufon/org/9785.html"],"Tags":"City","Object Flight Path":"Undisclosed","Source":"MUFON","Summary":"change focus","Region":"Georgia","Date Submitted":"02/29/2008 06:56 UTC"}