{"Date of the Event":"12/16/2005 06:30 UTC","Viewing Distance":"Unknown","Region":"California","Country":"United States","Weather Factors":"Unknown","divs":["Sighting DetailsFor two years I have been filming orbs in my area with a Samsung camcorder. I filmed mostly down my street at a culdesac. When I was about done filming, collecting 8 hours of footage, I was filming an orb in the east. When I turned around I was confronted with a big bright, white and round light. It was about 8 feet in diameter, as it hovered. When I first saw it I said, \"What the hell is that?\" Then I lifted the camera, and started filming it. Then a telepathic presence came over me on me, except down the middle of my back. Then while filming I became aware somehow of three greys in the object. One was a doctor, and the other two were workers. They were viewing me in a small monitor. The doctor alien said, \"What is he doing?\" Then the object retracted further out, until it looked like a dot of white light. It stopped at about 45& from the horizon, hovered for a couple of seconds then moved on northward. The telepathic presence on me quickly subsided. My film shows the object having a round metalic bottom, and at first looking like an upside down umbrella without a handle. I was very excited to experience this, and I surprisingly did not shake very much while filming. Thank you."],"Source":"MUFON","Object Flight Path":"Undisclosed","Object Features":"Undisclosed","Longitude":"-117.936038","Disposition":"IFO","Log Number":"US-02292008-0009","Tags":"City","Case Number":"9788","trends":["There have been 27 other sightings in Garden Grove","There were no other sightings in Garden Grove on or around December 16th 2005"],"City":"Garden Grove","Object Shape":"Disc","Summary":"I turned around and there it was 30 yards away from me.","map":"<A HREF = \"http://maps.google.com/maps?q=33.775805,+-117.936038(9788)&iwloc=A&hl=en\"> mufon case (9788) map </A>","Latitude":"33.775805","Date Submitted":"12/16/2005 06:30 UTC","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9788.html.txt","/var/www/straped/mufon/org/9788.html"]}