{"Longitude":"-119.409912","Country":"United States","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=36.781571,+-119.409912(9789)&iwloc=A&hl=en\"> mufon case (9789) map </A>","Object Flight Path":"Other","Case Number":"9789","Weather Factors":"Unknown","Log Number":"US-02292008-0010","Object Shape":"Disc","Disposition":"IFO","divs":["Sighting DetailsI was leaving work on February 27th and going on the 94 W towards downtown. Right as I turned on the freeway I saw three lights glowing in the sky. You could not miss it, the sky was very clear that night. The lights were white with yellow around it. They were as bright as headlights in the sky. I knew right away it was not a plane. The height was airplane level (or at least level to airplanes about to land by downtown. I thought at first it was a firework but I didn't see any more right after it and they were moving too slow to be a firework. I thought maybe it was a shooting star, but there were three. Maybe a meteor broke up into three pieces? It was moving too slow for a shooting star also. Then they got brighter and dissappeared. They dissappeared just as a shooting star or firework would dissappear. I knew it wasn't a plane for sure, I saw a plane right next to it and it was giving off nowhere near the intensity of illumination as what I saw. There was also no clouds or fog to disappear into.I thought it was strange but didn't really think anything of it. Then about 10 seconds later I saw the three lights appear again but in a different location, it was more to the left of my view and in the same triangular positioning. When I saw this I knew 100% that it was not a firework or shooting star. It did not come from the ground up like a firework and it was not falling from the sky down. It was already there and lighted itself up. I was completely mesmerized. The three lights got brighter and then dimmed and then got brighter again before they dissappeared. Once they disappeared I thought to myself,why I didn't take a picture. I was so confused and focused on these unkonown objects that I missed my 5 N freeway also. At this time, I am in downtown and I saw one more UFO, much lower than the three that just dissappeared. I figured that there were four but this one was blocked by buildings earlier. I grabbed my camera phone and took a picture. I realized that there are so many lights in downtown it probably wouldn't turn out. I took it anyway and when I zoomed in the picture I saw 4 objects, not just one. I was really tripped out, I still am, because the three had already disappeared but yet they are captured in my picture in the same location and positions where they were before they disappeared. After reading other reports, I noticed the times and some sighting were an hour later. I wonder if these UFO's are invisible and flash their lights once in a while. Maybe they are here more often than we think???"],"Date Submitted":"02/27/2008 06:34 UTC","Summary":"3 lights disappear and 4 reappear 10 seconds later a little to the left","Source":"MUFON","trends":[],"City":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"02/27/2008 06:34 UTC","Latitude":"36.781571","Object Features":"Unknown","Viewing Distance":"Unknown","files":["/var/www/straped/mufon/html2text/9789.html.txt","/var/www/straped/mufon/org/9789.html"],"Region":"California"}