{"divs":["Sighting DetailsTuesday night we decided to go up to Laughlin to the UFO Congress so we could touch base with Leo Sprinkle. We dropped the dogs off in Peoria and took I 17 to 74 to 93. While driving on 93 I noticed an unusually high number of lights in the sky, too numerous and too concentrated to be aircraft. We did notice a couple at least three jets, because of the lights on them were typical aircraft lights and not as bright. The UFO lights were brilliant white with a blue hue to them. They appeared to \"jump\" and maneuver erratically. We also saw three to four flares to the east of these lights. I told Paul these were not planes, and for a while he disagreed with me, until he also saw them \"jump\" then they got into a formation and formed a perfect circle and all blinked on their lights at the same time for only a split second while in the circle formation, but it was very visible and apparent. There were at least 15-20 lights in the circle. After this they seemed to disappear for a while. This sighting continued for about two hours from about 9:00 PM to 11:00 PM.until we got to I 40 in Kingman. We were not surprised by this as we have seen this before. We called George Parks and gave him the information and we are passing this along to you. Hopefully someone else saw this also. Christine and Paul Dickey"],"Summary":"muliple craft and jets in pursuit (?) as well as flares","Tags":"City","Disposition":"Unknown","Source":"MUFON","Country":"United States","City":"Phoenix","files":["/var/www/straped/mufon/html2text/9792.html.txt","/var/www/straped/mufon/org/9792.html"],"Date Submitted":"02/26/2008 12:00 UTC","Sighting Duration":"Undisclosed","Object Flight Path":"Path with directional change,Other","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"Arizona","trends":["There have been 417 other sightings in Phoenix","There were no other sightings in Phoenix on or around February 26th 2008"],"Weather Factors":"Unknown","Date of the Event":"02/26/2008 12:00 UTC","Log Number":"US-03012008-0003","map":"<A HREF = \"http://maps.google.com/maps?q=33.451657,+-112.067667(9792)&iwloc=A&hl=en\"> mufon case (9792) map </A>","Latitude":"33.451657","Longitude":"-112.067667","Case Number":"9792","Object Shape":"Circle, Flash, Star-like"}