{"Country":"United States","Object Shape":"Disc","divs":["Sighting DetailsMade no noise, as I walked my roomates dog it appeared to be hovering yet moving slowly like it was looking to take something or as someone would act if they were going to steal something or prey on someone.I grew up with planes, have ridden in helicopters, even lived right by an airport, never seen anything like this or been so sure about anything. I could have ran after it to see it a little longer, did not seem worth the risk to me I told myself as it disappeared behind the trees. I thought I might see something on the news the next day but people are so stupid in Florida combined with the fact everyone locks themselves in their house at night and the only time they come out is to smoke a cigarette and then go back in.I don't smoke cigarettes but I notice the old smokers do not even seem to look in the sky and the young kids are only interested in each other or the opposite sex so they do not look up.Thus a 32 year old male without a hot woman gets a kick out of looking in the sky almost the entire time I walk the dog late at night. I want to remain anonymous and do not want to impress anybody, also I don't want to deal with the bullchit that would come along with it. I do not care if anyone believes me but would love to hear what some other people think that visit this site about my stock channel CNBC and all the reptilian eyes the guests seem to have like art laffer,during the day and usually on the lunch hour, also certain guests get close ups while others they never give a closeup of the eyes,I just want to know, I know they are blurring out some peoples eyes but are they purposely making other guests eyes look reptilian or like reptile eyes, opening and closing sideways in the pupil instead of like normal human eyes do. I have heard rumous of aliens or reptilians in our house and senate and running secret societys like the illumanati,federal reserve and most of the United Nations and CFR but that scares the hell out of me a hell of alot more then spacecraft unless we were cloned to be their food supply or slaves as many theorists believe.Above the lights and below the lights had an area that had room for beings but was not as wide as the light source.Wish I had a camera, would have needed a nice zoom lense like the paparazzi use and could have gotten the perfect shot."],"Date Submitted":"02/08/2008 11:03 UTC","Region":"Florida","Summary":"lights all the way around it with no spaces, red, green,yellow,orange","Object Features":"Patterned Surface","Disposition":"Insufficient Data","trends":["There have been 27 other sightings in Bradenton","There were no other sightings in Bradenton on or around February 8th 2008"],"Source":"MUFON","Tags":"City","Object Flight Path":"Straight-line path","Case Number":"9796","map":"<A HREF = \"http://maps.google.com/maps?q=27.507038,+-82.566879(9796)&iwloc=A&hl=en\"> mufon case (9796) map </A>","Date of the Event":"02/08/2008 11:03 UTC","files":["/var/www/straped/mufon/html2text/9796.html.txt","/var/www/straped/mufon/org/9796.html"],"Latitude":"27.507038","Log Number":"US-03012008-0007","City":"Bradenton","Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Viewing Distance":"501 Feet - 1 Mile","Longitude":"-82.566879"}