{"Country":"United States","Object Flight Path":"Hovering then path","City":"Maple Heights","Date Submitted":"06/13/1987 09:45 UTC","Tags":"City","Object Shape":"Unknown","files":["/var/www/straped/mufon/html2text/9798.html.txt","/var/www/straped/mufon/org/9798.html"],"Disposition":"Unknown","Log Number":"US-03022008-0002","Object Features":"Unknown","trends":["There has been one other sighting in Maple Heights","There were no other sightings in Maple Heights on or around June 13th 1987"],"divs":["Sighting DetailsIt was 9:45pm in the summertime and I was laying on my living room floor watching television with the front door open. As I was watching t.v., a bright white light in the sky caught the corner of my eye through the doorway. It was so bright that it was distracting. But I just assumed it was a star. Five minutes later I heard my mom yell from the kitchen, which had direct view of the front doorway, \"What is that bright light in the sky!\" We went outside and stood there watching it. It just looked too bright to be a star, but it wasn't moving and it didn't make a sound. We stood there for about 5 minutes, and then all of the sudden an amber ball of light lowered from the bottom of it. At first I thought maybe it was two helicopters and one was coming from behind the other. But there was no sound, and the white light had been hovering for ten minutes. After the amber light lowered, it hovered below the white light. Then, green and yellow lights started blinking on what now appeared to be the bottom of a craft with a bright white light at the front. The green and yellow lights were on either side of the front white light and they went back at an angle. And then the white light, with green and yellow blinking lights, zipped away fast. 2 minutes later, the amber light followed. The whole time not a sound was heard, and the night was so still you could hear a pin drop. It didn't make sense to me, and there was nobody I could talk to about it, so I just blew it off. But my mom wrote it in her diary. It wasn't until I saw Out of the Blue, that I heard about an amber ball of light coming out of a UFO. That's when I felt a cold chill down my back. It was the reality that I could have witnessed a UFO. It was 20 years ago but I remember it in detail like it was yesterday. We never told anybody about it. We only realized this when we brought it up to the rest of the family a week ago and they never heard us mention it before. Probably because telling about it doesn't nearly capture the feeling of actually being there and seeing it."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=41.415331,+-81.565956(9798)&iwloc=A&hl=en\"> mufon case (9798) map </A>","Summary":"Bright white light hovered in sky approximately 10 minutes, Then amber light lowered from the bottom of it. Both lights hovered one above the other for about 5 minutes. White light, with blinking green and yellow lights, took off fast. Amber followed","Longitude":"-81.565956","Region":"Ohio","Weather Factors":"Unknown","Source":"MUFON","Case Number":"9798","Viewing Distance":"Unknown","Latitude":"41.415331","Date of the Event":"06/13/1987 09:45 UTC"}