{"Date Submitted":"03/01/2008 09:00 UTC","divs":["Sighting Details Last night I was playing WoW (raiding kara) when my mom and younger brother told me there were UFO's outside. I did not believe them, so my mom grabbed the camera and took some really poor quality footage. Nonetheless, it piqued my interest so I stepped outside to look. I almost fainted, it was quite shocking. I called for my fiance, and the 4 of us (mom, brother, me, fiance) stood outside for about 5 minutes and then went inside. The objects appeared to be circular and lit up. There was heavy cloud cover, and the light generated by the objects is what made them visible below the clouds. No, there were no beam of lights going upward, these objects were definitely not caused by anything on the ground. They flew in a strange pattern... each object would go out to a separate corner, then fly back in and meet in the middle. kinda like 1 2 x 3 4 yes I have a video, and on the camera you can kinda see but if I upload it, you can barely see anything. it is about 30 seconds long."],"trends":["There have been 8 other sightings in Loveland-Madeira Corridor","There were no other sightings in Loveland-Madeira Corridor on or around March 1st 2008","This sighting has never been favorited.",""],"Viewing Distance":"Unknown","Longitude":"-84.263826","Log Number":"US-03022008-0004","Case Number":"9800","Region":"Ohio","Date of the Event":"03/01/2008 09:00 UTC","Object Features":"Unknown","Country":"United States","Disposition":"IFO","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9800.html.txt","/var/www/straped/mufon/org/9800.html"],"Summary":"4 strange lights moving in pattern","City":"Loveland-Madeira Corridor","map":"<A HREF = \"http://maps.google.com/maps?q=39.268948,+-84.263826(9800)&iwloc=A&hl=en\"> mufon case (9800) map </A>","Object Shape":"Circle","Object Flight Path":"Path with directional change","Weather Factors":"Unknown","Tags":"City","Latitude":"39.268948"}