{"City":"Fort Collins","Case Number":"9801","Date of the Event":"02/29/2008 08:45 UTC","Date Submitted":"02/29/2008 08:45 UTC","Source":"MUFON","Latitude":"40.59405","Longitude":"-105.077303","Disposition":"Insufficient Data","Log Number":"US-03022008-0005","Country":"United States","Object Shape":"Triangle","Tags":"City","Viewing Distance":"Unknown","Object Features":"Unknown","Region":"Colorado","files":["/var/www/straped/mufon/html2text/9801.html.txt","/var/www/straped/mufon/org/9801.html"],"divs":["sighting detailswe were sitting in our backyard in the hot tub when we saw 6 triangle shaped objects in a orange\\yellow glow pop up through the trees, three at first then three more. we thought they were firecrackers, until we realized they were silent. they traveled from north to south, not straight up like firecrackers. thier movment was too fast for a balloon but not fast enough for a plane they seemed to float rather than fly. they were orangish\\yellow in color. from our backyard it would have taken a hand to cover the whole group from arm length. we noticed the object because we were stargazing while enjoying the evening hot tub, the objects were too bright and too big to be stars and they were moving. not the normal twinkling lights of airplanes at night. we were in awe and amazement during the sighting. could not believe what we were seeing. after the sighting we felt still in amazement and a little bit frightened, even though no aggressive action from the objects occurred. the objects simply disappeared over the horizon as the glow became dimmer. unfortunately, we did not take any photos because we were too amazed."],"Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.59405,+-105.077303(9801)&iwloc=A&hl=en\"> mufon case (9801) map </A>","Summary":"Objects flew from N to S over our backyard","Weather Factors":"Unknown","Object Flight Path":"Straight-line path","trends":["There have been 65 other sightings in Fort Collins","There were no other sightings in Fort Collins on or around February 29th 2008"]}