{"map":"<A HREF = \"http://maps.google.com/maps?q=38.583386,+-90.406785(9808)&iwloc=A&hl=en\"> mufon case (9808) map </A>","divs":["Sighting DetailsI was cooking dinner at my house in st louis for my roomates, like i do every sunday, and while i was making a tomato sauce i heard somthing like a very large waterfall, like the niagra, outside. It did not sound like a plane so i went outside to check it out. In the southwestern sky, heading southwest, I saw about 9 dull red lights that were all perfectly spaced apart, not more than 100 yrds.I thought that they could be planes, i'd never seen planes fly like that, but they did not have lights like a plane and they seemed to be attached to each other. They were moving together like they were attached to a larger superstructure. If they were then the craft had to have been over a mile long. I called my girlfriend out to see it and she said that the lights could in no way be planes. I concured. The lights were low flying, below 2000 feet, and were moving very slowly in comparrison to a plane. They were all moving in a straight line as well. After the lights past, about 10 min, we went back inside. I was thinking that st Louis had its own stephensville type sighting, that is what it reminded me of. My girlfriend thought it wass pretty crazy to see something like that but she really doesn't get excited about that much, since she is pregnant, i on the other hand felt exhilirated and in wonderment. After a couple of minutes i heard the same thing again and went outside and it was another one with only 3 lights but with all the same characteristics. I watched that one fade away and then went back to cooking, really weirded out."],"Object Features":"None","Viewing Distance":"501 Feet - 1 Mile","Latitude":"38.583386","Summary":"i was cooking. heard something like a waterfall outside. went to look and saw about 9 very low flying red lights perfectly spaced apart moving very slow together in a line.","Log Number":"US-03032008-0003","Longitude":"-90.406785","Case Number":"9808","Object Shape":"Cigar, Cylinder, Other","Tags":"City","City":"Kirkwood","Weather Factors":"None","Date Submitted":"03/02/2008 07:03 UTC","Country":"United States","Region":"Missouri","Object Flight Path":"Straight-line path","trends":["There have been 3 other sightings in Kirkwood","There were no other sightings in Kirkwood on or around March 2nd 2008"],"Disposition":"Unknown","Source":"MUFON","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9808.html.txt","/var/www/straped/mufon/org/9808.html"],"Date of the Event":"03/02/2008 07:03 UTC"}