{"Log Number":"US-03032008-0004","Viewing Distance":"Unknown","Summary":"Venus-like object hovering over July 4th fieworks","Longitude":"-74.169611","Object Flight Path":"Undisclosed","Country":"United States","divs":["Sighting DetailsFrom my parent's front porch we could see, from years past, the sky fireworks from the City of Paterson a few miles away. The family gathered around while waiting for the sun to set, we casually noticed a bright Venus-like object slowly rise over the horizon and appearing to move towards us and appeared to grow somewhat larger as it approached. After awhile, it appeared to have stopped dead in the sky in our clear view (I would estimate at about a 15 to 20 degree angle from our vantage point). My older uncle was insisting that the object was \"shivering\", but being younger and more contrary at the time, I insisted that it was due to the atmosphere. As the darkness set, the fireworks started. After about 45 minutes to an hour, the display ended and we continued to sit on the porch. We then noticed that the object appeared to be floating away, back in the return direction from which it came. Now sensing that this was no ordinary object, I ran inside to get my 35mm still camera with telephoto lens. By this time it was night, and even with bracing the camera on top of one of our cars, the best photo result was a pin point. I estimate that from the time we first noticed the light, and the the time it finally disappeared, was probably about two hours."],"Tags":"City","Object Shape":"Star-like","Sighting Duration":"Undisclosed","City":"Paterson","map":"<A HREF = \"http://maps.google.com/maps?q=40.919965,+-74.169611(9809)&iwloc=A&hl=en\"> mufon case (9809) map </A>","trends":["There have been 9 other sightings in Paterson","There were no other sightings in Paterson on or around July 4th 1973"],"Latitude":"40.919965","Date Submitted":"07/04/1973 12:00 UTC","Source":"MUFON","Object Features":"Undisclosed","Case Number":"9809","files":["/var/www/straped/mufon/html2text/9809.html.txt","/var/www/straped/mufon/org/9809.html"],"Weather Factors":"Unknown","Date of the Event":"07/04/1973 12:00 UTC","Region":"New Jersey","Disposition":"Unknown"}