{"Tags":"City","Viewing Distance":"21-100 Feet, 101-500 Feet, Unknown","Case Number":"9810","Log Number":"US-03032008-0005","Summary":"Witnessed several lights landing in neighbors woods/field area,went outside to look,3 more triangled things flew very slow & low over my head","Weather Factors":"Windy","files":["/var/www/straped/mufon/html2text/9810.html.txt","/var/www/straped/mufon/org/9810.html"],"divs":["sighting detailsat approx. 1:30am, my dogs started barking like they were upset over something, so i look out my living room window to see about them.they were barking out towards my neighbors field\\woods area,then above them in the background i saw lights,several lights,in 3's ,coming from across the road at very high altitude,as fast speed and declining into the woods area at my neighbors,very fast.i couldn't believe that air craft would come in and land so fast.(the normal flight pattern for commercial\\passengers planes in our area,is not this direction,)so i knew something weird is happening,i also noticed that the crafts lights seem to be rotating in a circular pattern,red,green,blue, & yellow colors,then upon landing the lights switched to a bright beam of white light.i put on my shoes and coat after seeing 3 sets of 3 craft swoop in and land out there somewhere. i grabbed my binoculars & headed out to the front yard,to watch the 4th set of 3,as i could see them coming...as i'm standing there looking thru binoculars & getting them in my sights, i can hear this turbulant swish sound above me , so i tilt my head up to the sky above me,binoculars still on my eyes,and to my great surprise, directly above my head\\yard was a craft with the same circular lights right there!all i could see in the binoculars was the lights,it was that close...so i move them away from my face and watch 3 of these things fly right over me, i think they were so low they must have barely cleared the top of my pine tree! i don't know where these 3 went,i just can't recall...i think i was in shock,& i duct in on my porch because suddenly i was very scared for some reason.i came in & looked out the window again,but saw nothing else going on after that.i can't even say that the last 3 i went out to watch coming in , actually landed...which is stupid because i'm very interested in ufo's and had encounters before and was able to keep my witts, & this time i just forgot my purpose of being out there after seeing those 3 go right over my head.(and, by the way , i couldn't see a shape to the sets landing out there, but the ones that flew over me , definately black,definately triangular,but had smoothed corners,not pointed .and rotating,flashing lights of many colors."],"Date Submitted":"02/28/2008 01:30 UTC","City":"New Middletown","Disposition":"Unknown","Object Shape":"Triangle, Unknown","trends":["There has been one other sighting in New Middletown","There were no other sightings in New Middletown on or around February 28th 2008"],"Date of the Event":"02/28/2008 01:30 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.163958,+-86.050802(9810)&iwloc=A&hl=en\"> mufon case (9810) map </A>","Region":"Indiana","Object Flight Path":"Straight-line path,Other","Country":"United States","Longitude":"-86.050802","Latitude":"38.163958","Source":"MUFON","Object Features":"Unknown","Sighting Duration":"Undisclosed"}