{"City":"Dunnellon","Case Number":"9812","Date Submitted":"03/03/2008 05:11 UTC","Weather Factors":"None","Longitude":"-82.460933","divs":["Sighting DetailsWe were on our pontoon boat going up the Withalacochee River a short distance away from where the Withalacoochee River meets the Rainbow River. We were probably 1 mile or so up from that point. My boyfriend stopped the boat and dropped anchor. I looked into the cypress trees along the river to my right because I was seeing moving, floating orbs the size of basketballs. They flashed on for 2 seconds and then off for 2 seconds, their location moving all the while. I told my boyfriend \"Do you see those orbs at the top of the trees in front of us on the right side?\" He joked that I must be crazy. I waited for a minute till he finished setting the anchor, and then the lights began appearing on the left side of the river in front of us as well. I asked my boyfriend' \" look...now do you see them?\" Now he saw them too. As we watched the moving flashing orbs were multiplying. I even noticed 1 orb moving into the woods, away from the river, guiding itself AROUND the trees as though it had an intelligence to its direction. The orbs continued to multiply. I don't remember if it was 12 or 18 or 20....i was in shock. My boyfriend said \"Let's get out of here, this is how bad movies start!\" We lifted anchor and left at full speed. A short distance away the motor died! I sat on the boat frozen in fear. My boyfriend massaged the fuel line quickly and added a little more gas. The boat engine finally started up again and we went back to our motel room at the Angler's Family Resort, a dive motel for fishermen. The next day we mentioned what happened to the owners of the river motel. They intimated we must have been high or are crazy. It was strange but we avoided discussing it further for a few days...as though it maybe didn't really happen....like a sort of voluntary amnesia."],"Date of the Event":"Unknown","Object Shape":"Circle, Sphere","Summary":"Multiple, moving flashing orbs (white and orange) moving in and among trees along the Withalacochee River","Country":"United States","Source":"MUFON","Tags":"City","Region":"Florida","Log Number":"US-03032008-0007","Latitude":"29.049143","files":["/var/www/straped/mufon/html2text/9812.html.txt","/var/www/straped/mufon/org/9812.html"],"Object Flight Path":"Path with directional change","Sighting Duration":"Undisclosed","Viewing Distance":"21-100 Feet","Disposition":"Insufficient Data","trends":["There has been one other sighting in Dunnellon","There were no other sightings in Dunnellon on or around"],"map":"<A HREF = \"http://maps.google.com/maps?q=29.049143,+-82.460933(9812)&iwloc=A&hl=en\"> mufon case (9812) map </A>","Object Features":"Unknown"}