{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.066373,+-86.226106(9820)&iwloc=A&hl=en\"> mufon case (9820) map </A>","Latitude":"43.066373","Object Flight Path":"Undisclosed","trends":["There have been 9 other sightings in Grand Haven","There were no other sightings in Grand Haven on or around March 4th 2008"],"Date Submitted":"03/04/2008 12:00 UTC","Date of the Event":"03/04/2008 12:00 UTC","divs":["sighting detailsit was perfectly clear tonight with hardly any wind. no noise from the road or any other source. my friend and i went out to look at the stars\\planets with a new telescope. i was setting up the scope when my friend yelled look at that what is that? do you see that? i responded yes. it looked sort of like a satelite moving through the sky but about 5-10 times the speed. it was dimly lit but visiable to the naked eye. i saw a dim star like object but my friend says it looked like a boomerang. we are living right on lake michigan so when we saw it the object was slight east of the lake and direcly south moving north at a very very high rate of speed. so fast that it moved from south to north in a matter of 10-15 seconds. as it passed over our heads it did a 90 degree turn and headed out towards the lake viering northwest. at this point we still had a good vantange point but the object completely dissapeared. it made no noise and had no flashing or blinking lights of any kind. the only color it had would be a dull yellow\\white. we both were conviced that it had to be a ufo. we ruled out the possiblity of a satelite or aircraft due to velocity and the lack of sound. either way we have both been star gazzers from the shores of lake michigan for many years and this was the strangest thing we have ever seen."],"Sighting Duration":"Undisclosed","Region":"Michigan","Country":"United States","Log Number":"US-03042008-0003","Object Features":"Undisclosed","Tags":"City","Case Number":"9820","Viewing Distance":"Unknown","Weather Factors":"Unknown","Longitude":"-86.226106","Summary":"Moving round maybe boomerang shaped object very fast","City":"Grand Haven","Object Shape":"Boomerang, Star-like","Disposition":"Unknown","files":["/var/www/straped/mufon/html2text/9820.html.txt","/var/www/straped/mufon/org/9820.html"]}