{"Disposition":"Unknown","divs":["Sighting Detailsmy future wife and I were sitting on the front porch of her old house in dawson,mn at approx. 8ish at night when we spotted a set of, what appeared to be retangular lights in a triangular pattern, moving from the east to the west. When it was directly above us, I noticed that I could see an outline of a triangular object that literally blocked all stars in between the set of lights. It moved very fast and very quietly. I ran out into the street to get a better view and by the time I really was able to comprehend what I was seeing, it had gone over the house and was gone from view. I was in awe, I couldnt believe what I was seeing. I estimate that it was roughly severaly hundred feet off the ground and was massive in size. Estimated guess would put tailend of the craft at aprrox. 150' in length. I knew right away what I was looking at, I know what I saw. I've served in the U.S. Navy in San Diego and have seen many kinds of specialized aircraft and what I saw that night was something that I had never seen before or anything like since. The wife tried to say it was a tri-pod(3 meteorites fall in sync), something I had a very hard hard time accepting. It left no trails, wasn't a fireball and lights were to symmetric to be an anomaly. To this day, I am still baffled by what we saw that night."],"Date Submitted":"04/27/1996 12:00 UTC","Case Number":"9824","Summary":"huge black mass w/ 3 rectangular lights in a triangular pattern","Source":"MUFON","Object Features":"None","map":"<A HREF = \"http://maps.google.com/maps?q=44.931111,+-96.055(9824)&iwloc=A&hl=en\"> mufon case (9824) map </A>","Object Shape":"Triangle","Viewing Distance":"101-500 Feet","Date of the Event":"04/27/1996 12:00 UTC","Latitude":"44.931111","Log Number":"US-03042008-0007","trends":["There have been no other sightings in Dawson","This sighting has never been favorited."],"Region":"Minnesota","Sighting Duration":"Undisclosed","Country":"United States","City":"Dawson","files":["/var/www/straped/mufon/html2text/9824.html.txt","/var/www/straped/mufon/more/9824_submitter_file1__triangle.jpg","/var/www/straped/mufon/org/9824.html"],"Longitude":"-96.055","Object Flight Path":"Straight-line path","Tags":"City","Weather Factors":"None"}