{"map":"<A HREF = \"http://maps.google.com/maps?q=35.120927,+-120.582395(9827)&iwloc=A&hl=en\"> mufon case (9827) map </A>","Case Number":"9827","Object Flight Path":"Path with directional change","Object Features":"Unknown","Region":"California","Weather Factors":"None","Tags":"City","Disposition":"Unknown","Source":"MUFON","Date Submitted":"03/02/2008 08:30 UTC","trends":["There have been 2 other sightings in Arroyo Grande","There were no other sightings in Arroyo Grande on or around March 2nd 2008"],"Latitude":"35.120927","Sighting Duration":"Undisclosed","Log Number":"US-03042008-0010","Date of the Event":"03/02/2008 08:30 UTC","Longitude":"-120.582395","Object Shape":"Star-like","divs":["Sighting DetailsI was visiting a friend at Black Lake Village in the Nipomo, CA area when I decided to take my two dogs out for a short potty break. I was on my way back to the house when I stopped to let the dogs sniff around. While they were occupied, I looked up at the stars, enjoying the evening. I looked for the big dipper, found it, then started to look for other constellations. I was trying to remember which star in the big dipper was supposed to point to the little dipper and started going out from each side of the dipper to see if I could find it. When I looked out to the northwest, I saw a very high star-like object moving across the sky from east to west. I watched it for a couple of minutes trying to decide what it was. It was too high to be a plane. It was right up there as high as some of the stars. I thought about a satellite, but the satellites I have seen from this area did not follow that path, but travelled from west to east. I was puzzled. It had to be a satellite, I thought, because it was so small and so high. Just then it abrubtly reversed its course---it simply stopped as though it had hit a wall and went straight back--no turns or change in path involved. Right then I knew it wasn't a satellite. I continued to watch and it went forward again, then suddenly went straight up in the air vertically, then straight down vertically, then back to its original path. It continued doing these same manuevers as I watched for another minute or so. I could not believe what I was seeing. No plane or satellite that I was aware of could do that. I was very close to the front door of my friend's house and, although I was afraid I would lose sight of it, I really wanted someone else to see what I was seeing, so I ran to the front door and called my friend to come out. He did, but when I got back to look for it and show him, it was not visible. I watched for a three or four more minutes, but could not find it. I went in the house and did not look any more because everyone else teased me and was skeptical."],"City":"Arroyo Grande","files":["/var/www/straped/mufon/html2text/9827.html.txt","/var/www/straped/mufon/org/9827.html"],"Viewing Distance":"Over One Mile","Summary":"Starlike moving across sky, able to stop and reverse, go straight up and down rapidly","Country":"United States"}