{"Object Flight Path":"Undisclosed","Longitude":"-105.584931","Country":"United States","divs":["sighting detailsi spent the summer if 1981 with a rancher by the name of pat mcguire in laramie. we were working for black cat fireworks out of rawlins. we spent a couple of weeks shipping fireworks all over the state. on the evening of 7\\2\\81 about 11:30 we left rawlins and headed for laramie with a pick up truck loaded with fireworks. my five year old son was sleeping on the passenger seat with his legs on the floor of the truck and his head resting on the seat. about a half an hour out of rawlins, i looked up and saw three very bright, large objects lined up in a row. i said to pat, \"look at those stars!\" i had no sooner said that when the center object descended at a incredible rate of speed and came straight for our windshield. i screamed and yelled, \"it's going to ram us!\" i kept thinking that that thing did not have air brakes! as soon as i said that the object stopped and descended slowing to the pavement less than 100 ft from our truck. we were stopped by that time on the side of the road. all traffic on interstate 80 stopped and all head lights went out. one of the obects was to the north of us by that time and was being pursued by a jet, i assume out of warren afb in cheyenne. there was also an object to the south of us and it was keeping equal distance at all times from the ground, which was very hilly. i started to get out of the truck and was stopped by pat. he said wait until you are invited. i thought to myself that this was an invitation. i looked back to the object that was to the north of us and the jet was still chasing it. all of a sudden it looked as if the jet had just stopped in midair! then i realized that the object picked up speed and left the jet behind. the object that had landed on the highway in front of us was as big as a house. all i could see was a brilliant light. i could not see past the light. then all of a sudden the object disappeared in front of our eyes. it did not take off that i could see, it just disappeared. i felt a terrible loss when this event ended. i really did want to go with them, even though i was afraid at first. the whole event seemed to take only about 20 minutes, but when we got to laramie about 1-1\\2 hours from rawlins it was almost 3:00 am already. i started having dreams about the incident shortly after and did recall being inside the object. this incident was reported to leo sprinkle, phd after the event had happened and also has been included in a book written by tim beckley, inner light publishing and myself. after the event ended traffic on interstate 80 had returned to normal. i do not know if anyone else has reported this incident or not."],"Latitude":"41.315567","Date of the Event":"07/02/1981 11:30 UTC","Weather Factors":"Unknown","Sighting Duration":"Undisclosed","Region":"Wyoming","Case Number":"9828","City":"Laramie","Object Features":"Undisclosed","trends":["There have been 5 other sightings in Laramie","There were no other sightings in Laramie on or around July 2nd 1981"],"Summary":"Three UFOs about 40 degrees, center one descended and landed on Interstate 80 east","Date Submitted":"07/02/1981 11:30 UTC","Viewing Distance":"Unknown","Object Shape":"Sphere, Star-like, Other","map":"<A HREF = \"http://maps.google.com/maps?q=41.315567,+-105.584931(9828)&iwloc=A&hl=en\"> mufon case (9828) map </A>","Source":"MUFON","Disposition":"Insufficient Data","Log Number":"US-03042008-0011","Tags":"City","files":["/var/www/straped/mufon/html2text/9828.html.txt","/var/www/straped/mufon/org/9828.html"]}