{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=33.217871,+-97.124988(9835)&iwloc=A&hl=en\"> mufon case (9835) map </A>","Object Flight Path":"Path with directional change","Sighting Duration":"00:00:01","Object Features":"None","Viewing Distance":"Over One Mile","Log Number":"US-03052008-0004","City":"Denton","Country":"United States","Tags":"City","Case Number":"9835","divs":["Sighting DetailsAs the founder of the Denton Area Paranormal Society, three others and I had returned to the location where a fellow investigator, Bob, had eyewitnessed an \"alien\" crossing a rural road on January the 21st, 2008. While on location where this incident had taken place, Bob repeatedly expressed feelings of being watched. None of us present saw anything obvious in evidence to cause this. However, something I can't put my finger on literally gave me the willies; hair raising, a unexplained gut feeling of something strange, a rare thing in my book. When I left, my odd sensation of something unexplained going on held on until I pulled into an Exxon a couple of miles away for a cup of coffee. An unusual chill nagged at me, which I can't solely contribute to the cool weather, but I shook it off as I drove the 5 miles home. Yet, the capper of the evening happened after I pulled into my driveway and parked. As soon as I got out of my car, and looked into the clear, starry, Northern sky, I was surprised to see a fast, glowing, diffuse light appear. Approximately 45 degrees up from the horizon, it travelled East to West, in a slight arc that appeared to take it a little further away and downward from my perspective. It was there and gone in a second. What made this so truly amazing to me, is that this sighting was strikingly similar to the previous sighting my wife and I had on January 20th, 2008, which we now know occured hours before Bob's sighting of what I've named the Creature of Copper Canyon! It was hard for me to believe, let alone admit, sighting another object in the same area, since no one was with me when I saw it flying by. It's just my word, but it did happen. Perhaps someone else in Denton happened to be looking North the same time it was here and gone. Thanks, Lance Oliver, Founder Denton Area Paranormal Society www.dapsghost.com"],"Object Shape":"Chevron","Weather Factors":"None","Longitude":"-97.124988","Disposition":"Unknown","Region":"Texas","Date Submitted":"03/04/2008 09:45 UTC","trends":["There have been 22 other sightings in Denton","There were no other sightings in Denton on or around March 4th 2008"],"Date of the Event":"03/04/2008 09:45 UTC","files":["/var/www/straped/mufon/html2text/9835.html.txt","/var/www/straped/mufon/org/9835.html"],"Latitude":"33.217871","Summary":"Northern sky, a fast, glowing, diffuse light , approximately 45 degrees up from the horizon, travelled East to West!"}