{"Date of the Event":"03/05/2008 05:40 UTC","divs":["Sighting DetailsAt about 5:45 am, my 17 year old daughter woke me in an excited state. While eating breakfast, she and her 15 year old sister noticed lights out of the window low on the western horizon just above the line of rooftops. By the time I was up and out there, one had disappeared, but two were distinctly visible. At arms length, each about the size of a peanut, perhaps slightly larger. One was higher than the other, but both still below my own roofline. They both hovered about 5-10 minutes, with steady lights of blue, green and red. By green, I mean a light turquoise. As I watched, trying to set up a telescope, but was unsuccessful in spotting them before they began to move off, one seemed to grow smaller and turn orange and began to move to my right. At first I thought it was moving directly away from my position as if it were moving off into the distance, but then I realized that it was moving in a straight line, slowly on a horizontal plane. I ran around to the front of my house and could watch it moving further until it disappeared from view behind rooftops. The other light disappeared as I was watching this one. They both told me that they had watched it for 3-5 minutes before waking me. The first had a dark, saucer shaped silhouette and had descended below the rooftops before re-emerging. They described the lights' patterns as an x shape of 5 lights. I thought it more as a diamond pattern. There was absolutely no sound. Later, about 20 minutes later, I actually saw another set of lights, but conventional colors and could easily hear the sound of a helicopter. The helicopter was not in the same quandrant of the sky and did not seem to be related. The point being that I could hear this one clearly and not the other two at all."],"Disposition":"Unknown","Case Number":"9838","Longitude":"-95.36366","Latitude":"29.767523","Log Number":"US-03052008-0007","files":["/var/www/straped/mufon/html2text/9838.html.txt","/var/www/straped/mufon/org/9838.html"],"Object Shape":"Cross, Diamond","Date Submitted":"03/05/2008 05:40 UTC","Sighting Duration":"Undisclosed","Source":"MUFON","Tags":"City","Viewing Distance":"Over One Mile","Weather Factors":"Unknown","Summary":"three distinct multi-colored groupings (red, blue, green)","map":"<A HREF = \"http://maps.google.com/maps?q=29.767523,+-95.36366(9838)&iwloc=A&hl=en\"> mufon case (9838) map </A>","trends":["There have been 173 other sightings in Houston","There was one other sighting in Houston on or around March 5th 2008"],"Object Features":"Unknown","Object Flight Path":"Hovering then path","Country":"United States","City":"Houston","Region":"Texas"}