{"Log Number":"GB-03052008-0008","Summary":"30-50 ft black triangular craft illuminated at each corner","trends":["There have been 11 other sightings in Bristol","There were no other sightings in Bristol on or around November 24th 2004","This sighting has never been favorited.",""],"divs":["Sighting DetailsFrom a discussion group I posted to the morning following my sighting: \"I believe I saw a black triangle craft last night... Last night I was driving my son to his karate class. It was 18:10 and dark. We were waiting at some traffic lights in town when my eye was caught by a low-flying plane crossing the road ahead and disappearing to the right behind some buildings. 'Wow!' I said to my son. 'That plane's really low'. It seemed to be only 60 or 70 feet or so off the ground. We watched where it had gone for a moment and it suddenly came back into view as though it had just turned around, right where it was. 'Must be a helicopter' we thought - it was still very low and manouvreing like a helicopter. We continued to watch it until the traffic lights turned to green and we moved forward. It wasn't until we were about 100 yards or so closer that we realised it wasn't a helicopter. This object was basically triangular in shape though its corner points were missing and it had various coloured lights - I distinctly remember red, white and green along it's edges. Unlike aircraft lights which flash, these lights were pulsing slowly lighter and darker as though 'breathing' over a two to three second period. I know that many reports of black triangle craft describe them as huge, football-field sized craft (for example, those described by Colm Kelleher, previously of the National Instiutute for Discovery Science organisation [NIDS] in America), but the craft my son and I were observing would only have been about 30 feet on each side. We watched astounded as it weaved its way around, approx 60 feet above ground level, at a distance of about 100 yards from us. We continued to move with the traffic and my son watched as we moved. I kept an eye on this thing in my door mirror (that's how low it was). Eventually it moved over the roof of a B&Q hardware centre and went out of sight. On our way back home an hour or so later, I looked over to this centre. It was unusual in that it had large illuminated light panels in its roof and a large illuminated canopy over its gardening section. Of all the buildings in the vicinity, this was the only structure that actively directed light upwards and so may have 'attracted' the craft. The centre also had a tall, 20 feet raor-wired compound area. I noticed a strobe-alarm light had been set off inside. Additionally, I noticed there was a power pylon immediately behind the store. We last saw the craft moving towards this pylon.\" We lost sight of the object when the traffic lights changed and we moved forward with the traffic turning into Taunton Road, losing sight of the object behind buildings. I attach a digital sketch I made of how the craft looked from where we sat in the traffic"],"Case Number":"9839","Object Shape":"Triangle","Region":"England","Date Submitted":"11/24/2004 06:10 UTC","Weather Factors":"Rain, Light","Date of the Event":"11/24/2004 06:10 UTC","Viewing Distance":"101-500 Feet","Longitude":"-2.58485","Country":"United Kingdom","files":["/var/www/straped/mufon/html2text/9839.html.txt","/var/www/straped/mufon/org/9839.html"],"Disposition":"Unresolved","Tags":"City","City":"Bristol","Object Features":"Unknown","Sighting Duration":"00:03:00","Source":"MUFON","Object Flight Path":"Path with directional change","Latitude":"51.461013","map":"<A HREF = \"http://maps.google.com/maps?q=51.461013,+-2.58485(9839)&iwloc=A&hl=en\"> mufon case (9839) map </A>"}