{"divs":["Sighting DetailsSomebody I know emailed me the picture of that recent thing posted here from out west, don't remember which state. This object floated above the river for maybe less than 30 seconds, rotating slightly then winking out. My wife freaked out because we were still about 40 minutes from takeout and had know where to go. we paddled over to the side and sat in the woods for about 20-30 minutes, but the mosquitos were eating us alive, so we got back in the water. I got one photo off before it dissapeared. About 10 seconds before it dissappeared another circle thing seemed to pop out of the center, which is when my wife started screaming at me to take a picture, and that's what you see. I really don't want to know what it was, because to this day it gives us the creeps, but since I saw the other one my wife thought it might be best to share the experience. I'm not going to mention the name of the river because our cabin is near there."],"Latitude":"46.545854","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/9840.html.txt","/var/www/straped/mufon/more/9840_submitter_file1__2002-07-2600012.jpg","/var/www/straped/mufon/org/9840.html"],"Object Features":"Wings, Other, Unknown","Case Number":"9840","Region":"Michigan","Object Flight Path":"Other","City":"Marquette","Date of the Event":"07/26/2002 12:00 UTC","Longitude":"-87.391757","Sighting Duration":"Undisclosed","Summary":"Weird shaped object sighted while tubing down river","Disposition":"Insufficient Data","Source":"MUFON","Date Submitted":"07/26/2002 12:00 UTC","Object Shape":"Circle, Cross, Other, Unknown","trends":["There have been 12 other sightings in Marquette","There were no other sightings in Marquette on or around July 26th 2002","This sighting has never been favorited.",""],"Tags":"City","Weather Factors":"Unknown","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=46.545854,+-87.391757(9840)&iwloc=A&hl=en\"> mufon case (9840) map </A>","Log Number":"US-03052008-0009"}