{"Source":"MUFON","trends":["There have been 11 other sightings in Laguna Niguel","There were no other sightings in Laguna Niguel on or around February 16th 2008"],"City":"Laguna Niguel","files":["/var/www/straped/mufon/html2text/9841.html.txt","/var/www/straped/mufon/org/9841.html"],"Case Number":"9841","Object Shape":"Star-like","Date of the Event":"02/16/2008 06:26 UTC","Object Flight Path":"Straight-line path","Object Features":"None","Summary":"Very Bright Star-like","Date Submitted":"02/16/2008 06:26 UTC","Disposition":"IFO","Viewing Distance":"Unknown","Log Number":"US-03052008-0010","Tags":"City","Region":"California","Longitude":"-117.707553","Sighting Duration":"00:00:45","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=33.522526,+-117.707553(9841)&iwloc=A&hl=en\"> mufon case (9841) map </A>","Weather Factors":"Unknown","divs":["Sighting DetailsMy brother Dalton and I were walking out to my car when we witnessed a bright object in the Eastern sky moving South. Object was more luminescent than any other object currently in sky which made it very obvious and easily caught our attention. The object was visible for about 30 seconds and moved about 15 to 20 degrees in all until it started to dim, and eventually vanished altogether over about 7 seconds. Upon further thought, it is possible the object was in fact moving Southeast instead of South, at a very high rate of speed which would explain the dimming and vanishing. I have had experience as a student pilot and have been watching aircraft my whole life. The object had NO strobe, NO winglights, NO red beacon on tail, and the intensity of the light was much brighter than any military aircraft would logically have installed on their planes. Of the high volume of commercial aircraft that regularly fly overhead the area from John Wayne Airport, this object shared nothing in common with them. On an extra note, it is impossible for the object to be a meteor or other space-debris, I am also an ametuer star-gazer and don't mistake celestial objects with mechanical vehicles."],"Latitude":"33.522526"}