{"Object Flight Path":"Undisclosed","Latitude":"37.469449","Object Shape":"Unknown","Viewing Distance":"Unknown","Disposition":"Unknown","Tags":"City","Weather Factors":"Unknown","Source":"MUFON","Date of the Event":"06/11/2007 01:30 UTC","divs":["Sighting DetailsA friend and I were awakened by a loud thump on the back bumper of the car at 1:30am. We were parked off of county road 12 a couple miles past Smith Res. on a dirt road running across a small piece of land that I own there. Upon waking, I realized that I needed to \"relieve\" myself and dreaded getting out of the car as I imagined the wind must really be blowing to cause all the tumbleweeds to be hitting the car as, after waking, we had heard several more \"knocks\" on various parts of the car. I opened the car door and there was not the slightest bit of wind blowing. I quickly shut the door and had to think hard as to whether or not I wanted to get out of the car without knowing what was around the car. I used a flashlight and car lights to try to distinguish the location of the noise. During this time, there was what sounded like something giving the antanne on top of the car a thump with subsequent twang noise. As we could see nothing and I still needed to relieve myself, I went on ahead and got out and squatted very close to the car to take care of business. There were not any sounds while I was outside and I actually used telepathy on the outside chance that I was dealing with \"another\" entity and asked that \"whomever\" not scare me while I was out of the car. I stated that I have a heart condition and that a fright could literally kill me. The noises did not start again until I got back in the car. None as loud as the original noise but persistant -- every 15 seconds to a minute in between. The noises were all over the car. I listened for scratches from claws but heard none and ruled out grasshoppers as some of the noises were too loud to be attributed to that. When I got up the next morning, I immediately got out of the car and checked the fine sand all around the car and found no tracks of any kind. I did spot what appeared to be raccoon tracks off of the road but nothing discernable around the car. My friend stated that she thought it might be the car cooling down but we had been parked since about 7:30 that evening and I've camped in the car before and have never experienced anything like that. I will, of course, be car camping there again in the future and will let you know if I discover anything. There was also a female written about in the book \"That Crazy Lady Down the Road\" that had a similar experience. The UFO phenomena has been a subject of interest to me for years and if you've heard of others who have had a similar experience, I would appreciate knowing."],"Longitude":"-105.870021","Region":"Colorado","Case Number":"9852","Log Number":"US-03052008-0021","files":["/var/www/straped/mufon/html2text/9852.html.txt","/var/www/straped/mufon/org/9852.html"],"Sighting Duration":"Undisclosed","Date Submitted":"06/11/2007 01:30 UTC","Object Features":"Undisclosed","Summary":"unknown sounds like tumbleweeds being blown onto the car","trends":["There have been 6 other sightings in Alamosa","There were no other sightings in Alamosa on or around June 11th 2007"],"map":"<A HREF = \"http://maps.google.com/maps?q=37.469449,+-105.870021(9852)&iwloc=A&hl=en\"> mufon case (9852) map </A>","Country":"United States","City":"Alamosa"}