{"Object Flight Path":"Undisclosed","Date of the Event":"03/06/2008 12:26 UTC","Viewing Distance":"Unknown","City":"Lindenhurst","Weather Factors":"Unknown","Country":"United States","Object Shape":"Unknown","Tags":"City","trends":["There have been 3 other sightings in Lindenhurst","There were no other sightings in Lindenhurst on or around March 6th 2008"],"Log Number":"US-03062008-0001","Case Number":"9853","Sighting Duration":"Undisclosed","Region":"New York","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=40.686767,+-73.373455(9853)&iwloc=A&hl=en\"> mufon case (9853) map </A>","Source":"MUFON","Latitude":"40.686767","Summary":"bright low flying object turned from going south to going north quicker than a plan usually does.","Disposition":"Unresolved","files":["/var/www/straped/mufon/html2text/9853.html.txt","/var/www/straped/mufon/org/9853.html"],"Date Submitted":"03/06/2008 12:26 UTC","Longitude":"-73.373455","divs":["Sighting DetailsI was on my way home with a friend, and I saw what I assumed was a plane, and jokingly said it was a UFO. It was moving slower than a most planes do, but figured it was nothing. The object was moving south-southwest. I Turned down a street and the object was now going northeast, and looking in my reaview mirror, I could've sworn it stopped for a few seconds. Noting this, I immediatly turned around and sped in the direction of teh object. At this point, both the object and me and my friend, in ym car are going north. I follwed it for about 5 blocks, and now it the object was going north-northwest. As far as I know the street I was on is almost perfectly north to south. I lost sight of the object when I got to the elevated train tracks. This object turned faster than I know planes to be able to, and it was flying lower than most planes usually do. I also thought about it being a helicopter, but the placement of the lights was wrong. I know there is a small airport a few towns over, but the shape, speed, and altitude seemed all wrong for it to be a small plane or helicopter."]}