{"Country":"United States","Source":"MUFON","Case Number":"9857","Tags":"City","Date of the Event":"11/25/2005 06:20 UTC","files":["/var/www/straped/mufon/html2text/9857.html.txt","/var/www/straped/mufon/org/9857.html"],"Region":"North Carolina","City":"Mt Airy","Object Flight Path":"Straight-line path","Longitude":"-80.607286","divs":["Sighting DetailsIt was 6:20 PM on November 25, 2005. My Ex-Wife and I were at the Bright Leaf Drive-In in Mt. Airy, North Carolina waiting for the movie to start. We heard a sound in the distance louder than a jet. It sounded like the ocean was in the sky. We looked up and coming from the East was a Huge Egyptian Pyramid (Like the one on the back of the one dollar bill). It was fling 2000 miles an hour stright towards us. It had the outline of a Jelly Fish (Picture a Jelly Fish 200 ft high, 500 ft long with a Egyptian Pyramid inside the front part of it). The Pyramid had this outline around it and it pulsated Light Pink to Bright Red. This was no human craft of any kind. It stopped to our left and out my driver side window it hung there in the air and did not move, but the outline of the craft (The Jelly Fish) looked like it was swiming slowly in stationary position with this object. The tintagles of the Jelly Fish would turn Blue and would make something like electronic sparks. This was somekind of sheild that protected the craft. I looked stright into the Pyrimid as it was stopped now and it had indivisual Black Stones stacked one atop the other. I could see the lines of the stones so clearly. This craft looked just like the one on the back of the one dollar bill, except the cap stone was connected on this craft. I stared stright into it and and felt the presence of something completly EVIL!!! I tried to get out of the car, but I could not move nor could she. Then all of a sudden this craft started backwards toward the NORTH and it took it less than 30 seconds to completly disappear from our sight. A minute later an Air Force Jet came from the West on the exact same heading that the craft had came in on. This jet slowed down as it approched the same air space where the craft had been, which told me they had it on RADAR, because he was fling so slow he was like \"Where did it go\"? What was it? Let me put it this way, Bush Sr. has said when it comes to UFOs \"we don't no the half of it\". We have all these satelites pointing into space because we are tring to find life somewhere out there in the universe. These UFOs are only 25,000 ft off of the ground here on earth. If they wanted to make contact with us, why don't they just answer AIR TRAFFIC CONTROL? If you believe the BIBLE, it makes it very clear. GOD exists and his Angels, The Devil exists and his Angels, YOU and I are here and there isn't anybody else according to the BIBLE. Do you know why the Government is keeping all this a secret? They have to because the truth cannot be made known until the time appointed. The object that landed in Kecksburg, PA in December of 1965, when the Government and NASA reveal what it was, it will be a lie and a MAJOR deception. Life on other planets? As long as they can keep you looking into space for that, you can't see what is going on right under your nose."],"Object Shape":"Triangle","Summary":"Egyptian Piermide with outline of a Jelly Fish pulsating Ligt Pink to Bright Red","Date Submitted":"11/25/2005 06:20 UTC","Weather Factors":"Unknown","Disposition":"Hoax","Log Number":"US-03062008-0005","trends":["There have been no other sightings in Mt Airy","This sighting has been favorited 1 time."],"Viewing Distance":"501 Feet - 1 Mile","map":"<A HREF = \"http://maps.google.com/maps?q=36.499301,+-80.607286(9857)&iwloc=A&hl=en\"> mufon case (9857) map </A>","Sighting Duration":"00:05:30","Object Features":"Unknown","Latitude":"36.499301"}