{"City":"Springfield","Disposition":"Unknown","Viewing Distance":"Unknown","Object Shape":"Triangle","Region":"Massachusetts","Log Number":"US-03062008-0007","map":"<A HREF = \"http://maps.google.com/maps?q=42.102483,+-72.582161(9859)&iwloc=A&hl=en\"> mufon case (9859) map </A>","files":["/var/www/straped/mufon/html2text/9859.html.txt","/var/www/straped/mufon/org/9859.html"],"Case Number":"9859","Source":"MUFON","Object Features":"Undisclosed","Sighting Duration":"Undisclosed","Date of the Event":"11/30/1982 12:00 UTC","divs":["Sighting DetailsI was lying in bed, I was only around 10 or 11 at the time. I woke in the middle of the night and heard a deep pulsating sound. Not really noisy or loud, just this low deep sound that I'll never forget but am at at a loss to really describe, maybe something like noises from a power plant or something, like electricity??? And it may have been imagination but it sounded like a rotating sound?? We had some woods and a park directly in back of my backyard and I remember thinking it had something to do with the street lights that were in the park or something. Anyway, I just remember laying in bed and listening to it for a while, and I just remember it scaring me, but not really knowing why, and just waiting for the noise to go away and trying to make myself go to sleep. The next morning I woke to my mom yelling for me to come to the back porch and look at the yard, she was all excited. When I looked outside there were three circular places on the grass that were like matted down. One in the front nearer toward my house and two behind that one- they were in a triangular formation. It totally freaked me out. My mom was going on about how aliens had landed and was joking about it and I told her what I had heard that night while in bed, and I started getting really scared. She basically just teased about it and told me it was nothing and not to worry about it. Well, she basically put me at ease, because that was the age when my mom was still right about everything and could protect me from anything. Anyway, years later, when I started hearing about crop circles, etc, this whole incident came back to me and now of course it freaks me out thinking about it. I was just talking about it today, and we were wishing it had happened during this time of digital cameras."],"Weather Factors":"Unknown","Country":"United States","trends":["There have been 21 other sightings in Springfield","There were no other sightings in Springfield on or around November 30th 1982"],"Summary":"Sound of Object/Shapes in Lawn","Tags":"City","Object Flight Path":"Undisclosed","Longitude":"-72.582161","Latitude":"42.102483","Date Submitted":"11/30/1982 12:00 UTC"}