{"Object Features":"Unknown","Object Flight Path":"Path then hovering","divs":["Sighting DetailsOn Tuesday, March 26th around 9:30 P.M.,I was driving into my driveway in rural north Florida, when I noticed a beautiful,golden orb that looked much like a large Venus, or Saturn or star, standing in the south sky. It was a clear stary night and I could see many stars and planets, but this was about 5 times the size of the largest stars visable. I quickly jumped out of the car to get a better view of the magnificent sight! As I stood perfectly still watching this golden orb, it made a quick short horizontal movement back and forth. Then to my astonishment, another beautiful orb exactly like this one came zipping out of nowhere and stood next to the other orb. For a few seconds neither of them moved, then suddenly they both began to move quickly back and forth in a rocking movement much as if they were dancing with each other. With another quick movement the one to the right zipped out of sight. The movement was much faster then that of a shooting star and I barely caught a glism of a light trail for a split second. I quickly ran inside to call my family out to see the awesome sight, but when we came back out, both golden orbs were gone!"],"files":["/var/www/straped/mufon/html2text/9861.html.txt","/var/www/straped/mufon/org/9861.html"],"Case Number":"9861","trends":["There have been 3 other sightings in Live Oak","There were no other sightings in Live Oak on or around February 26th 2008"],"Viewing Distance":"Over One Mile","Summary":"Two golden star like spheres standing still for a moment, then rapidly rocking back and forth","Log Number":"US-03062008-0009","Weather Factors":"Unknown","Object Shape":"Saturn-like, Star-like","Sighting Duration":"Undisclosed","Country":"United States","City":"Live Oak","Source":"MUFON","Region":"Florida","Tags":"City","Longitude":"-82.98402","Date Submitted":"02/26/2008 09:30 UTC","Latitude":"30.294946","map":"<A HREF = \"http://maps.google.com/maps?q=30.294946,+-82.98402(9861)&iwloc=A&hl=en\"> mufon case (9861) map </A>","Date of the Event":"02/26/2008 09:30 UTC","Disposition":"Unknown"}