{"Longitude":"-154.490502","divs":["Sighting DetailsSIGHTING 1: Tintagel area. big object, very noisy, and low. sounded like a plane but moved very slowly, couldnt make out its exact shape but what i did find strange was the lighting. one white light at the front and 8-12 lights on what would be the rear edges of the wings running the width of the object in a perfectly straight line. all lights were in white apart from the one on the right which was red. none of the lights pulsated or flashed. no tail light which seemed to give it a triangular shape. i would estimate the size about the same as a military hercules type plane and could have been just that, but i have never seen these illuminations on a plane before. was moving approx north then banked west. not sure if it was a plane or not so i thought best to mention it. SIGHTING 2: late sept 2007. St.Teath. out watching the stars at about 11.30 pm, saw a single ball of high intesity white light heading in my direction. very fast, silent and very near to the ground. it made me instictively duck down as it got near. i would estimate 25-30 feet from the ground. scared the life out of me. about the size of a large beachball, no idea what it was. sighting lasted only a few seconds. clear sky, good weather. headed north out towards the sea, went out of sight in seconds and i had a long field of view from where i was standing SIGHTING 3. St. Kew. as above but early eve in march (10th or 11th?) 2007 at about 6.45pm. sighting lasted under 10 seconds. nice weather, very little cloud, about 1 hour before sunset at a guess. 2 white balls of light side by side appeared to be touching each other but only just. looked just like what i saw later in the year (in sighting 2) but heading west, again low and very fast, no noise. these two objects seemed to fade out and dissapear as i watched them. left me very confused. i cant express how bright these balls of light were, they reminded me of firework intensity only more constant and much more pure. really hard to put into words. anyone else in the southwest seen them? please contact me at davecat440@aol.com as i would love to know what is going on."],"Date Submitted":"03/06/2008 07:55 UTC","Weather Factors":"Unknown","Viewing Distance":"Unknown","City":"cms/tg n/a","files":["/var/www/straped/mufon/html2text/9862.html.txt","/var/www/straped/mufon/org/9862.html"],"Date of the Event":"03/06/2008 07:55 UTC","Case Number":"9862","Sighting Duration":"Undisclosed","trends":["there has been one other sighting in cms\\tg n\\a","there were no other sightings in cms\\tg n\\a on or around march 6th 2008"],"Country":"United States","Object Features":"Undisclosed","Region":"Alaska","Object Flight Path":"Undisclosed","Latitude":"63.595863","Disposition":"IFO","Summary":"3 sightings in cornwall uk over the last year","Log Number":"US-03062008-0010","Tags":"City","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=63.595863,+-154.490502(9862)&iwloc=A&hl=en\"> mufon case (9862) map </A>","Object Shape":"Unknown"}