{"Date Submitted":"03/06/2008 12:00 UTC","Log Number":"US-03062008-0012","divs":["Sighting DetailsI had just finished repairing the brakes on my girlfriends mom's car. My girlfriend and I went for a test drive down the road. I was going north down 250 E in Jasper County Indiana about 1 mile from my house. We turned around to head back home after test driving the brake repair. As soon as I turned the car around to head south, we stopped and were overwhelmed by what we seen in the Eastern sky. There were 3 sets of orange lights in a triangle pattern. Each set of lights had 3 lights in a horizontal row, totalling 9 lights. Each set of 3 lights were perfect spheres that had even distance between them. Almost immediately the lights started dimming and going away, starting with the 3 lights at the top point. They dimmed from left to right one at a time. Then the bottom left point of the triangle started dimming in the same process, left to right one at a time. Finally the right point of the triangle started dimming one at a time left to right. This process lasted under a minute. The lights were very bright, definatly orange, and perfectly spaced between the three points of the triangle. The size of the triangle patter was very large. I would say each point of the triangle was at least 100 yards apart. It was way to massive to be one craft and I assumed it was 3 different crafts aligning to form a perfectly shaped triangle. It was truely an amazing sight. At this point we pulled the car off the side of the road and sat there to discuss what we had just seen. We were nervous, excited, and a little frightened from what we had seen. Never had we seen anything even close to this before. As we sat there we then seen a small cluster of dim white lights in the sky twinkling and almost seemed to be chasing each other around. They were to the southeast of where we seen the triangle pattern of lights. These lights also dimmed and disappeared. A few minutes later another set of three orange lights appeared to the south of the spot where the triangle pattern of lights was and it dimmed and disappeared. Almost as soon as it dimmed another orange set of three lights appeared to the east of that one and then dimmed and disappeared. This went on between these two sets of orange lights about 5 times in about 10-15 minutes. After sitting for about an hour total, we went on home since the lights seemed to have stopped. This is by far the most pecuilar thing both my girlfriend and myself have ever seen in the sky. I have nothing to compare it too. I will be continuing to watch the sky over the next few nights to see if I can catch any other unexplainable lights like these in the area."],"Tags":"City","Object Flight Path":"Stationary,Other","Summary":"Three Groups of Three Orange Lights in a Triangle Pattern","Object Shape":"Sphere, Triangle","Disposition":"Unknown","Latitude":"41.080595","Source":"MUFON","Longitude":"-86.891963","Viewing Distance":"Over One Mile","Object Features":"None","City":"Medaryville","Case Number":"9864","Weather Factors":"None","map":"<A HREF = \"http://maps.google.com/maps?q=41.080595,+-86.891963(9864)&iwloc=A&hl=en\"> mufon case (9864) map </A>","Date of the Event":"03/06/2008 12:00 UTC","files":["/var/www/straped/mufon/html2text/9864.html.txt","/var/www/straped/mufon/org/9864.html"],"Region":"Indiana","trends":["There have been no other sightings in Medaryville","This sighting has never been favorited."],"Country":"United States","Sighting Duration":"Undisclosed"}