{"Sighting Duration":"Undisclosed","Longitude":"-82.853952","Log Number":"US-03072008-0001","Object Shape":"Disc","files":["/var/www/straped/mufon/html2text/9865.html.txt","/var/www/straped/mufon/org/9865.html"],"Date Submitted":"07/10/2003 09:20 UTC","Source":"MUFON","Country":"United States","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Disposition":"Unknown","trends":["There have been 2 other sightings in Chiefland","There were no other sightings in Chiefland on or around July 10th 2003"],"Date of the Event":"07/10/2003 09:20 UTC","Region":"Florida","Summary":"We saw it hovering just above the pine trees. It was approx. 50 ft. accross with square windows.","Viewing Distance":"Unknown","Case Number":"9865","divs":["Sighting DetailsMy husband and I were returning to Cedar Key, Flo. in a rental car . We had been to near Atlanta, Georgia cking to see if our Lumina Van was fixed yet.It wasn't. It was about dark ( approx. 9;20 pm)and we were not far down CR347 headed toward Cedar Key and toward Fowlers Bluff. We saw a UFO hovering just above the pine trees. My husband said do you see what I see? I said yes, a UFO! I couldn't believe my eyes. I could see plainly that it had square windows accross it approx. 5 or 6 and it was foggy inside or like it was lite with floresent lights but I didn't see any body in the windows. I can't tell you how scared I was as we went under it. My husband turned off the headlights and then turned them back on again and it lite up with colored lights and came down behind us and appeared to land on the road. My husband asked me to turn around in the seat and look back to confirm it was there because he saw it in his rear view mirror too, but I could see it in my rear view side mirror and I was scared stiff and couldn't move, He yelled so hard at me that I turned around and looked and it was there. He drove like a mad man, doing way over the speed limit to Fowlers Bluff where we took the circle drive around and back to the road again. We saw a truck flying past from the way we had come and we proceded to follow it, feeling theres safety in numbers, but we couldn't even catch up. I am certain they saw it too. I tried to use my cell phone I called my son in Indiana and the answering machine came on, I heard some peeps sort of like SOS sounds and then lots of scratchy interference, I felt I was being monortered by someone, I left a message but it cut me off. The next day when I reached my son he said he heard all those odd sounds and just erased it. I wish he had kept it . Well thats it."],"City":"Chiefland","Tags":"City","Latitude":"29.482302","Object Features":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=29.482302,+-82.853952(9865)&iwloc=A&hl=en\"> mufon case (9865) map </A>"}