{"Object Shape":"Circle, Oval, Sphere","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9870.html.txt","/var/www/straped/mufon/org/9870.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=39.985051,+-86.112294(9870)&iwloc=A&hl=en\"> mufon case (9870) map </A>","City":"Carmel","Country":"United States","Tags":"City","Region":"Indiana","Object Flight Path":"Hovering then path","Date Submitted":"03/06/2008 08:06 UTC","Summary":"My wife and I saw several redish/orange lights moving and fadind in and out.","Viewing Distance":"101-500 Feet","Longitude":"-86.112294","Latitude":"39.985051","trends":["There have been 10 other sightings in Carmel","There were no other sightings in Carmel on or around March 6th 2008"],"Weather Factors":"None","Date of the Event":"03/06/2008 08:06 UTC","Sighting Duration":"Undisclosed","divs":["sighting detailsmy wife and i were going out to feed my horses on march, 06, 2008 at 8:06 pm and as we were driving through the country i saw three redish\\orangish lights above a field. i said to my wife what in the world is that? she said stop and let's watch, i stopped and the lights were there and then they faded off. we continued to watch with the car turned off and they reappeared but this time they were seperated from each other. then they faded off one at a time and a few seconds later they reappeared all three together again. we continued to wathe them and they seperated again and would fade on and off one by one and appeared to be moving away to the north. we decided to continue to my horses and they are about 5 miles east of the area of the sightings. we were almost at the farm where my horses are and my wife screemed for me to stop. i stopped and the light had reappeared again only closer. i remembered that she had her cell phone with a camera and i said take a picture! she was trying to get the camera ready and the lights were three together with white lite this time and one off to the left taht was just reddish\\orangish, as we were watching the lights went from a horizonital pattern to an angle and started to move towards us and my wife got scared and screamed go! go! they are coming towards us! i didn't move i sat there watching and the stopped and hovered in one spot then faded off slowly and the the one to the left faded off. when i use the term faded i'm not referring to fading like moving away i'm talking about like when you use a dimmer switch and dim the lights slowly. we continued to wath the lights continue to come and go until the finally got to far off and faded off. the whole thing lasted about 40 minutes long and left us really excited and a little freaked out. i know what we saw and they were not planes or hot air or weather baloons."],"Object Features":"Unknown","Log Number":"US-03072008-0006","Case Number":"9870","Disposition":"Unknown"}