{"Region":"California","files":["/var/www/straped/mufon/html2text/9872.html.txt","/var/www/straped/mufon/org/9872.html"],"Case Number":"9872","Object Features":"Dome","Viewing Distance":"101-500 Feet","divs":["Sighting DetailsMe and two of my friends were heading back to montclair. It was 3 am, we were heading west on 4th st. It was january 1st, 1996. It was windy out. Very quiet night, not a soul to be found outside ( I noticed this since earlier). Lots of leaves blowing in the wind. We had our windows down, driving west on 4th st, approaching mountain avenue, which runs north and south. As u approach mountain there is a large strip mall named ontario plaza. On the south east corner. The way it used to look (since then it has been rebuilt and the layout of the place is now different). The parking lot was along 4th st and curved down on mountain st. so the parking lot was occupying the western most area of the southwest corner, this allowed us to see wat was going on, about a block down mountain before even getting to the light signal. Well as i was saying, We approached mountain and something caught our attention. Looking across the parking lot and across mountain (south bound side) there is a small fire station. Its seems like an old fashion building. brick and only big enough to hold maybe 2 trucks. We look above the firehouse to see a large disc shape object with a center metalic strip that wrapped around the main object. that strip had small circle lights that were slowly revovling with the strip around the main object. We continued thru the intersection at a very slow pace. (no other cars or people are any where to be seen). We cross the intersection and stop about 20 feet over the crosswalk line(we are looking south directly north from the object). we are in the left lane and all of us are speaking to eachother about if we are all seeing the same thing ,, and we all agreed what we saw was a ufo. we sat there for like 4 minutes. in that time it was just floating there immediately over the fire house, this thing was very low! If someone at the fire house seen it they could have actually thrown a rock and hit it, thats how low it was. looked like it was doing something or checking something out at that firehouse. It seemed like it didnt even care that we were staring at it. it had to have clear veiw of us. It had no noise. not one sound came out of it. no smoke, nothing! Then im pretty sure it saw us or something because we were all pretty freaked out and were screaming to eachother to figure out wat it was. It suddenly began to move across mountain heading east. it was over the parking lot now, heading southeast. we turned around and went south on mountain. we entered the parking lot of the ontario plaza, and continued to follow it. It kept in a southeasterly direction. once it floated over the buildings which were fairly small one story buildings, it started over the neighborhood. there are alot of trees and it went out of sight. it never once took off at a fast speed nor did it look or go in our direction. our observation of the lights is that it seemed like they were used as eyes of the object .. slowly scanning the area around its location. we were all pretty scared , we immediately new that we saw was not from our world. we were in disbelief! we drove home and promised eachother to never forget wat we saw."],"Summary":"silver disc with a rounded middle shape, circular lights wrapping around the center area, with the center slowly revolving in a circular motion around the disc","trends":["There have been 18 other sightings in Ontario","There were no other sightings in Ontario on or around January 1st 1996"],"Date Submitted":"01/01/1996 03:00 UTC","Tags":"City","Longitude":"-117.642928","Weather Factors":"Windy, Medium","City":"Ontario","Sighting Duration":"Undisclosed","Object Shape":"Circle, Disc","Object Flight Path":"Hovering then path","Disposition":"Unknown","Date of the Event":"01/01/1996 03:00 UTC","Latitude":"34.071314","map":"<A HREF = \"http://maps.google.com/maps?q=34.071314,+-117.642928(9872)&iwloc=A&hl=en\"> mufon case (9872) map </A>","Source":"MUFON","Country":"United States","Log Number":"US-03072008-0008"}