{"Object Features":"None","Sighting Duration":"Undisclosed","Disposition":"Unknown","Log Number":"US-03072008-0009","City":"Portales","Object Shape":"Disc","Country":"United States","Date Submitted":"12/31/1959 12:00 UTC","Viewing Distance":"101-500 Feet, 501 Feet - 1 Mile","Region":"New Mexico","Date of the Event":"12/31/1959 12:00 UTC","divs":["Sighting DetailsI do not recall this first hand; this was told to me by my brother in law, who is a retired Lt Gen (AF). I also was in the Air Force, and was a pilot for 14 yrs. Around 1960 E or NE of Portales, NM, a disc went down in a lake. It was reported to Cannon AFB, where my brother in law was stationed. It was retrieved and taken to a hangar there; he stated there was a \"black\" hangar there. He stated there had been other retrievals from the Western United States sent there; the final destination was to be either Groom Lake or Wright-Patterson AFB. Anyway, after some preliminary study before it was sent out, the disc suddenly flew out of the hangar and out of sight. I have searched for others who grew up in this area, as I had, to confirm the story from the civilian side. My brother in law, although not directly connected to the most famous incident in NM, did confirm to me the essentially accurate portrayal of the Roswell Incident. Of course this by itself does not mean much; added to the other witnesses statements it does build a stronger case. If anyone readint this can shed light on the 1960 incident please report on this site."],"Object Flight Path":"Path with directional change","Case Number":"9873","Longitude":"-103.327278","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9873.html.txt","/var/www/straped/mufon/org/9873.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=34.187332,+-103.327278(9873)&iwloc=A&hl=en\"> mufon case (9873) map </A>","Source":"MUFON","Summary":"Disc went down in lake in NM; retrieved by CAFB. Disc escaped days later","trends":["There have been 5 other sightings in Portales","There were no other sightings in Portales on or around December 31st 1959"],"Latitude":"34.187332","Tags":"City"}