{"City":"Austin","Viewing Distance":"101-500 Feet","Latitude":"30.271493","Object Shape":"Sphere","Source":"MUFON","Region":"Texas","Date Submitted":"03/04/2008 07:30 UTC","Case Number":"9875","Longitude":"-97.735851","map":"<A HREF = \"http://maps.google.com/maps?q=30.271493,+-97.735851(9875)&iwloc=A&hl=en\"> mufon case (9875) map </A>","Log Number":"US-03072008-0011","Date of the Event":"03/04/2008 07:30 UTC","Country":"United States","Sighting Duration":"Undisclosed","Tags":"City","Weather Factors":"Unknown","divs":["Sighting DetailsI was driving home from San Marcos, TX to Austin,TX on I35 North and noticed a very bright white pulsating light. It looked like a light from the top of a radio tower but it was not attached to a tower and it was moving. It actually gave me chills because I have never seen anything like it before. I first noticed it around Buda, TX and was actually able to keep an eye on it until I made it into Austin (about 10 minutes). Once I made it into Austin I pulled over to see if I could get a better view of it but it then disappeared behind a building and I could not find it again after that. It seemed to be moving pretty slow going South. I do not believe it was a plane because a plane passed near by the object and it looked completely different. It was flying at a higher altitude than the plane but from my perspective the object looked a bit larger than the plane so it had to be pretty big. The sphere would completely light up, this was very bright, and slowly dim back down to the point where it could not be seen until it lit up again. I have been hearing about all of the UFO sightings in Texas and figured I would report this because it was something I have never witnessed in Austin skies my entire life of living here."],"Object Flight Path":"Straight-line path","Summary":"Large sphere pulsating white light","trends":["There have been 188 other sightings in Austin","There were no other sightings in Austin on or around March 4th 2008"],"Object Features":"None","files":["/var/www/straped/mufon/html2text/9875.html.txt","/var/www/straped/mufon/org/9875.html"],"Disposition":"Unknown"}