{"Log Number":"US-03082008-0002","Object Shape":"Star-like","trends":["There have been 9 other sightings in Marshall","There were no other sightings in Marshall on or around March 5th 2008"],"Date of the Event":"03/05/2008 07:45 UTC","City":"Marshall","Case Number":"9877","divs":["Sighting DetailsI was out in the yard walking around my car and decided to look up. I have started looking up at the sky at night, because there is something definitely going on in the sky. It kinda makes you feel like you are going a little crazy if you are the only one who sees it and tries to convince someone else. I decided would be better to always have a witness near by. Anyway, I looked up and saw once again the star like objects. This time there were two of them and they appeared to be traveling parallel to each other heading east. On other occasions we (my family andI) have seen these strange objects travel south and southeast. I called my family outside once again to come and look, be a witness and they saw it and then the objects disappeared instantly. It is kind of hard to describe. The objects do in fact look like stars. Imaging looking up at the big dipper (by example) and then seeing two of the stars take off in same or different directions. I have been noticing these star like objects for the last two months now. I have other family members who stay in the same vacinity who have seen these objects and other things in the sky between 7pm and 4am. We all live in Northeast Tx and all are working professionals."],"Disposition":"Unknown","Viewing Distance":"Unknown","Country":"United States","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=32.553341,+-94.363848(9877)&iwloc=A&hl=en\"> mufon case (9877) map </A>","files":["/var/www/straped/mufon/html2text/9877.html.txt","/var/www/straped/mufon/org/9877.html"],"Tags":"City","Longitude":"-94.363848","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","Summary":"Two star like objects ran parallel traveling east and then just disappeared","Latitude":"32.553341","Object Features":"Undisclosed","Region":"Texas","Date Submitted":"03/05/2008 07:45 UTC","Weather Factors":"Unknown"}