{"files":["/var/www/straped/mufon/html2text/9878.html.txt","/var/www/straped/mufon/org/9878.html"],"Date of the Event":"03/07/2008 05:55 UTC","Object Flight Path":"Hovering then path","City":"Delafield","Log Number":"US-03082008-0003","Sighting Duration":"00:00:20","trends":["There has been one other sighting in Delafield","There were no other sightings in Delafield on or around March 7th 2008"],"Case Number":"9878","Viewing Distance":"Over One Mile","Country":"United States","Disposition":"Unknown","Source":"MUFON","divs":["Sighting DetailsI feel a little odd writing this, as I never thought that I would encounter anything of this type in my lifetime, but I am hopefully seeking others who may have legitimately witnessed this occurrence to prove the sanity of my wife and I both. At 5:55 PM CST my wife and I were walking when we saw what appeared to be a straight horizontal line at a 30 degree angle from where we stood emitting a bright white light with a soft red-like center. Initially we looked up because it simply looked like REALLY BRIGHT STARS linked together, while the sun was JUST starting to start to set. The sighting appeared to be within 5-10 miles of where we were at the time. Within the following 20 seconds we saw the item rise slowly into the sky yet diminish in size rather quickly, as if it were moving away from us. The object produced no audible sound, no smoke or trails. Within the 20 second duration the object simply vanished as if it left our atmosphere. The sky was clear without a single cloud in the sky. We stood there and simply couldn't believe what we saw."],"Summary":"CIgar Shaped Craft With BRIGHT lights seen leaving atmosphere at high rate of speed","Tags":"City","Weather Factors":"Unknown","Object Shape":"Cigar","Object Features":"None","Latitude":"43.060842","Date Submitted":"03/07/2008 05:55 UTC","Region":"Wisconsin","Longitude":"-88.403708","map":"<A HREF = \"http://maps.google.com/maps?q=43.060842,+-88.403708(9878)&iwloc=A&hl=en\"> mufon case (9878) map </A>"}