{"Disposition":"Unknown","City":"Portland","Summary":"7 or 8 floating flashing lights","divs":["Sighting DetailsThursday, March 6th at around 7:45 pm I was on my college campus with a friend of mine walking towards my car when I looked up to the sky towards the east and i noticed 7 or 8 slow moving objects low in the sky, it was a crystal clear night and i could see every star in the sky. At first I could not tell what the objects were at all, i wasnt sure if what i was seeing was the reflection of light off of birds in the distance or firefly's or what these things were, then again, ive never seen fireflys in march up in maine. But as the objects slowly came closer i realized that they were deffinetly some sort of craft in the sky that flashed white lights. There was no red lights or any other lights on these objects. I could not tell if they were small airplanes or helicopters, but they seemed to be relatively close to the ground, my best estimate would be somewhere around 5 or 10 thousand feet, but i am no expert on that. The objects made no type of formation in the sky and made no noise that we could hear at all. They seemed to be floating slowly along heading west. Im not sure if weather balloons or satelites can travel together, but whatever we saw in the sky was deffinetly a group of objects traveling together, making no noise, pulsating white, they seemed to be smaller in size, about the size of how a star looks but deffinetly in our atmosphere and fairly low to the ground. The whole event lasted about 4 or 5 minutes i would say and the objects simply went out of view over the tree line. I am 23 years old, and I have always been observant to airplanes and objects in the sky, and I have never witnessed or observed anything like this before. it was the strangest thing ive ever seen and i have been thinking about it since the time i witnessed this. I emailed our local news to see if they had any explanation for the phenomenon that my friend and I witnessed in the sky, they did not return my email and I have not heard anything else about this. There is a jetport about 5 miles away from my college as well as the maine medical center, so i am accustomed to seeing and hearing helicopters and airplanes fly over my apartment and college quite frequently, but these objects were different and seemed to be coming from the ocean and heading west, as i live in portland maine, right near the water. I am sure there must be some sort of explanation for this, but it was very creepy and they were certainly unidentified flying objects. I would be thrilled to find out what these things were."],"Country":"United States","Region":"Maine","Log Number":"US-03082008-0005","Latitude":"43.665921","Viewing Distance":"Unknown","Weather Factors":"Unknown","Object Shape":"Flash, Star-like, Unknown","files":["/var/www/straped/mufon/html2text/9880.html.txt","/var/www/straped/mufon/org/9880.html"],"Object Features":"Undisclosed","Date of the Event":"03/06/2008 07:45 UTC","Sighting Duration":"00:04:00","Case Number":"9880","Tags":"City","trends":["There have been 17 other sightings in Portland","There were no other sightings in Portland on or around March 6th 2008"],"Object Flight Path":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=43.665921,+-70.249706(9880)&iwloc=A&hl=en\"> mufon case (9880) map </A>","Longitude":"-70.249706","Source":"MUFON","Date Submitted":"03/06/2008 07:45 UTC"}