{"Date Submitted":"02/26/2008 08:55 UTC","Object Shape":"Flash, Star-like","Tags":"City","City":"Undisclosed","Sighting Duration":"Undisclosed","divs":["Sighting DetailsOn the evening of Feb. 26, 2008 at 8:55 in the evening MST, I was driving east bound near Sheridan Lake,Co ( near the Kans.- Co. border on Hwy96 ) when I saw a very bright yellow-orange light in the sky to the north-northeast of me.It was nearly the same color as the headlights on a car. It appeared to rotate toward me and then away (rotating from east to west),lasting for five seconds, and then disappeared. The pressence of anything that bright immediately got my attention. I checked the time, then used my hand held up to the driverside window to measure this lights exact elevation .It was two hands up from the horizon. Several minutes passed as I continued to seach the dark moonless sky for this strange light.Then as suddenly as it had appeared the first time, it was back in almost the same location for maybe two seconds. As soon as it disappeared, another light the same color appeared almost a finger length away to the east and was there for approximately five seconds when a series of five lights appeared one at a time in a straight line to where the first light had been. This series of lights were of the same color and appeared as flashes and had no rotation as the other lights had. At first I thought it could be a helicopter using a seach light but quickley ruled that out when I couldn't se any marker lights.I thought it could be an airplane doing cloud seeding, but there were no clouds and again there were no marker lights . I was going to Garden City, Ks from Golden ,Co. At least 20 times per year I make the same trip and have for at least 20 years. This is the first time I have ever seen anything comparable to this and would like to learn what it was and if any one else saw these lights."],"Weather Factors":"Unknown","Summary":"a yellow-orange light appeared followed by a second like -colored light with 5 rapidly appearing lights in a direct line to the first lightr","Log Number":"US-03082008-0006","Latitude":"39.555251","Disposition":"Unresolved","Case Number":"9881","trends":[],"Region":"Colorado","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.555251,+-105.778207(9881)&iwloc=A&hl=en\"> mufon case (9881) map </A>","Viewing Distance":"Over One Mile","Object Features":"None","Date of the Event":"02/26/2008 08:55 UTC","Source":"MUFON","Longitude":"-105.778207","files":["/var/www/straped/mufon/html2text/9881.html.txt","/var/www/straped/mufon/org/9881.html"],"Object Flight Path":"Path with directional change"}