{"Weather Factors":"Fog, Medium","Date of the Event":"01/10/2008 08:30 UTC","Country":"United States","files":["/var/www/straped/mufon/html2text/9882.html.txt","/var/www/straped/mufon/org/9882.html"],"Disposition":"Insufficient Data","Case Number":"9882","Log Number":"US-03082008-0007","Viewing Distance":"Unknown","Object Shape":"Blimp","Longitude":"-118.241195","Tags":"City","Object Features":"Unknown","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around January 10th 2008"],"Object Flight Path":"Hovering then path,Straight-line path","Summary":"Large object with colored lights moving slowly at a height lower then a helicopter would circle around","City":"Los Angeles","Date Submitted":"01/10/2008 08:30 UTC","divs":["Sighting DetailsI went out the backdoor of our house (located in La Mirada, CA) at about 8:30 PM on January 10, 2008 and to my left I noticed different colored lights on a very large object slowly moving past our house. I thought why is that blimp so low to the ground and it sure has a lot of colored lights. I only saw the last half of the object because our rooftop blocked the front part of the object. It was traveling from the west towards the east. Our 2 dogs were out in the backyard with me and one of them barked at this object but the other one did not notice. Well the object bothered me so I went back into the house but curiosity got the best of me and I went out the front door and on to the front porch. The object must have made a u-turn because it's heading towards our house. It had a very bright white light which appeared to be coming from the bottom of the object and it was scanning the ground like it was looking for someone or something. I thought how odd that this blimp was flying so low to the ground. It was using some sort of searchlight to find whomever. It got closer to our house to where it was almost overhead and the bright light was now shining on our front lawn. Just then a car coming down our street came to a complete stop just to the left of our house. I assumed that the driver must be seeing what I was seeing. I never heard any noise coming from the object and that was another reason why I thought it was a blimp. I was never able see the object's shape but by the placement of the different colored lights it appeared to take on the shape of a blimp. I saw it for probably 5 seconds when I was in the backyard and was initially taken back by the size of the object and the fact it was extremely low to the ground. When I was on the front porch my observation was probably about 15 to 20 seconds and the only thing that my eyes could actually focus on was that extremely bright white light. The closer the white light came towards the porch that was enough for me and I quickly went back into the house. I immediately went to my roommate's bedroom to tell her about the blimp and asked if she wanted to see it. She said that she was tired and was going to bed. I never went back outside that night because it bothered me alot. I'm now convinced that it was not a blimp nor a helicopter. What it was I don't know but I do wonder if I'll ever see it again. If I do, I hope someone else would be there to witness it with me."],"Sighting Duration":"Undisclosed","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=34.054094,+-118.241195(9882)&iwloc=A&hl=en\"> mufon case (9882) map </A>","Region":"California","Latitude":"34.054094"}