{"files":["/var/www/straped/mufon/html2text/9883.html.txt","/var/www/straped/mufon/more/9883_submitter_file1__discenhanced1.JPG","/var/www/straped/mufon/org/9883.html"],"Longitude":"-121.978394","Date of the Event":"03/06/2008 01:12 UTC","Viewing Distance":"101-500 Feet","Log Number":"US-03082008-0008","Case Number":"9883","Weather Factors":"None","Object Flight Path":"Hovering then path","Date Submitted":"03/06/2008 01:12 UTC","map":"<A HREF = \"http://maps.google.com/maps?q=38.360187,+-121.978394(9883)&iwloc=A&hl=en\"> mufon case (9883) map </A>","Sighting Duration":"00:03:00","Object Shape":"Circle","divs":["sighting detailsmy friend and i were driving south on california route 505 as we drove i noted an unusual light in the sky. the light was a soft gold\\white light that was stationary in the night sky. i mentioned the light to my friend and we discussed what it could be. as we neared the light we notice that it was in fact three circular gold\\white lights joined (more or less) together to form a circle. i stopped the car on the side of the road and the object was just stationary near the side of the road, but out in an open field. i looked at the car clock and it was 1:12 am. my friend had a digital camera so i told her to take a photo. she fumbled around looking for the camera in her purse, it was dark in the car, so i turned on the interior lights. she found the camera, but had trouble getting it turned on (she was a bit excited). she finally got ready, and as she opened the car door the object moved from where it was to over the car - we lost sight of it as she got out. when she was completely out of the car she said that the object was a long ways away, but i told her to take the picture anyway. she took one photo and the object disappeard into the night sky (it became a very small dot very fast). my husband is a mufon field investigator and was very excited about this."],"Region":"California","Latitude":"38.360187","Tags":"City","Source":"MUFON","Summary":"Three gold/white circular objects joined together","Country":"United States","City":"Vacaville","trends":["There have been 10 other sightings in Vacaville","There were no other sightings in Vacaville on or around March 6th 2008","This sighting has never been favorited.",""],"Disposition":"Unknown","Object Features":"None"}