{"divs":["Sighting DetailsIt was about 7:35 p.m. on 3-6-08. I was walking my dog in the Signal Hill neighborhood of Millard, a suburb of Omaha Nebraska. We had stopped for a moment and I looked up to see if the clouds were coming in. I could see the stars, and one of the \"Dippers\" (I'm not sure which one it was, Big or Little), and a small plane flying off in the distance. Just as I was looking at the sky, a perfectly sharp edged triangle shape with a distinct white border and completely filled in with individual white lights lit up for a moment then went black. This happened as quickly as someone flipping a light switch on and off, but after it went black I could still see smaller, dimmer lights at the three corners of the triangle, and could see the black outline of the object against the sky before I lost sight of it. I live very close to Offut Air Force Base and my first thought was that it was the Stealth, but I don't believe the stealth would be covered with numerous, individually discernible white lights (almost like LED's) with a solid white border. It was not moving, but appeared to remain stationary. My guess is that it was very large and very high up, maybe about the height a commercial airliner flies. It was not directly overhead, but was off in the distance, but the odd thing was that I could see it in such sharp detail. as I mentioned, when it lit up, I could see the dozens or more individual lights on it when it lit up, it wasn't just a solid glow. I wondered if the people in the small plane had seen it also. it happened so quickly that I didn't really have time to react. I lost sight of it when my dog pulled me on her leash. after that my dog and i just finished our walk and went home and I told my wife that I thought I might have seen a UFO, and told her about it."],"Sighting Duration":"00:00:30","Object Shape":"Triangle","Longitude":"-95.994668","Country":"United States","Object Features":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=41.258893,+-95.994668(9884)&iwloc=A&hl=en\"> mufon case (9884) map </A>","Log Number":"US-03082008-0009","Disposition":"Insufficient Data","Object Flight Path":"Stationary","Weather Factors":"Unknown","Summary":"triangular object in the night completely covered in individual white lights lit up momentarily then went black leaving a black outline","Source":"MUFON","City":"Omaha","Case Number":"9884","Tags":"City","trends":["There have been 83 other sightings in Omaha","There were no other sightings in Omaha on or around March 6th 2008"],"Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/9884.html.txt","/var/www/straped/mufon/org/9884.html"],"Latitude":"41.258893","Region":"Nebraska","Date of the Event":"03/06/2008 07:35 UTC","Date Submitted":"03/06/2008 07:35 UTC"}