{"Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.217912,+-86.422515(9885)&iwloc=A&hl=en\"> mufon case (9885) map </A>","Sighting Duration":"Undisclosed","Disposition":"Unknown","Object Shape":"Chevron, Other","trends":["There have been 5 other sightings in Culver","There were no other sightings in Culver on or around March 6th 2008","This sighting has never been favorited.",""],"Log Number":"US-03082008-0010","Case Number":"9885","Summary":"Weird lights/orbs in Northern Indiana","Object Flight Path":"Stationary","Viewing Distance":"Unknown","Latitude":"41.217912","Country":"United States","Object Features":"Undisclosed","Weather Factors":"Unknown","City":"Culver","Date of the Event":"03/06/2008 08:02 UTC","files":["/var/www/straped/mufon/html2text/9885.html.txt","/var/www/straped/mufon/more/9885_submitter_file1__9948_report_file2__MOAMap.jpg","/var/www/straped/mufon/more/9885_submitter_file2__100_0764.JPG","/var/www/straped/mufon/more/9885_submitter_file3__JKlineGraphic.jpg","/var/www/straped/mufon/more/9885_submitter_file4__100_0766.JPG","/var/www/straped/mufon/more/9885_submitter_file5__100_0780.JPG","/var/www/straped/mufon/org/9885.html"],"divs":["Sighting DetailsI was speaking to my husband on the cell phone as he was returning from work just shortly after 8pm. My husband yelled in the phone \"what is that? What the hell is that?\" Just by his emotions, I knew he was startled and asked him where he was. He stated just down the road from our house. I looked in my large south window (overlooking our driveway) to find 3 large amber looking orbs in a linear fashion just above tree top height that initially lasted approx 10 sec but then would disappear and reappear. Immediately after seeing the orbs I noticed just northwest there was a beautiful display of sequenced flashing white smaller lights. These lights lasted only about 30 seconds at the most and they looked to be much higher in altitude and consumed a large portion of the sky. These lights could not have been jets as they have several lights on the crafts. The lights that I saw were many singular separate bright lights that were indeed in some sort of sequence. I couldn't tell if the lights came from an extremely large craft or many smaller ones. My eyes then gravitated back to the tree line to later find more orbs returning. These orbs would fade and reappear sometimes in the same location. The total sighting lasted approx 30 minutes. My husband got to watch most of the episode outside but I was inside with my very scared and startled children. They witnessed this as well. I spoke to law officials and they told me that they were military jets dropping flares. We do not have an active base in our area and I almost never see military jets over our skies. Never seen or heard of this before. Later, I asked my husband what he saw on his way home and he said that he saw 3 bright lights in a \"V\" formation that hovered and was without any sound. He said that it looked to be the size of a house. Do flares hover and relight in the same location even minutes after they disappear? I'm confused and would love to know what I saw. This was such a surreal event, I'm still struggling to believe what I saw but I am convinced that what I saw was not from around here. Tried to capture this on my digital camera but did not pick up images very good."],"Date Submitted":"03/06/2008 08:02 UTC","Longitude":"-86.422515","Region":"Indiana","Tags":"City"}