{"Disposition":"Unknown","City":"Annapolis","Sighting Duration":"Undisclosed","Country":"United States","Log Number":"US-03092008-0002","Longitude":"-76.484583","Object Flight Path":"Hovering then path","Date of the Event":"02/21/2008 12:00 UTC","Region":"Maryland","Object Features":"Unknown","Tags":"City","Summary":"Silent square shape object moving slowly in the Shady Side area with four brilliant white lights on all four corners.","files":["/var/www/straped/mufon/html2text/9888.html.txt","/var/www/straped/mufon/org/9888.html"],"Viewing Distance":"21-100 Feet","Object Shape":"Square, Rectagular","trends":["There have been 14 other sightings in Annapolis","There were no other sightings in Annapolis on or around February 21st 2008"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.983625,+-76.484583(9888)&iwloc=A&hl=en\"> mufon case (9888) map </A>","Source":"MUFON","Date Submitted":"02/21/2008 12:00 UTC","Case Number":"9888","divs":["sighting detailsi was driving to my parents house in which they live about 2 minutes from my home. i saw a brilliant bright white light in the distance. as i drove for about 1\\2 mile the object was hovering above the tree line not moving or moving very slowly. as i stopped at the stop light at deale-churchton rd, the vehicle in back of me almost crashed into me, when i looked backed the man had his head out of his car looking at the same object i was looking at. when the light turned green we both took a left and drove no more than 1 mi an hour watching the object. at this time the object slowly flew over the road we were driving on with no sound whats so ever. after the object flew over us and disappeared we continued driving on. after stopping at my parents house and explaining what just happened, we were all in amazement. i then left their house and arrived back to my home. i went upstairs to my bedroom to go to bed. i have a sliding glass door in my master bedroom in which looks over shady side and the tree line towards churchton, where my parents live. i looked outside and in the distance i saw the same object hovering over the tree line almost in the same area where i originally saw it. i watched the object hover for about 5 minutes more and it started to descend into the tree line and disappeared. it was like nothing i had ever seen. after this happened, the following sunday 2\\24\\08 i was awakened by a bad dream about 1:00am, i shot up out of my bed and looked out the window, and there it was again. i know i wasn't going crazy, so i ran downstairs where my fiance was watching tv and told him it was outside again. we both ran outside and he got to see it for himself. we watched it for about 10 minutes and it descended into the tree line like the last time and disappeared."],"Weather Factors":"Unknown","Latitude":"38.983625"}