{"Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=46.50192,+-84.342367(9890)&iwloc=A&hl=en\"> mufon case (9890) map </A>","Summary":"Large oval with brilliant pulsing, strobe like, white light emindating from center in all directions.","Longitude":"-84.342367","Object Features":"None","Source":"MUFON","Disposition":"Unknown","Region":"Michigan","Case Number":"9890","Object Flight Path":"Stationary","Country":"United States","Sighting Duration":"Undisclosed","Date of the Event":"06/01/2007 11:40 UTC","trends":["There have been 6 other sightings in Sault Ste. Marie","There were no other sightings in Sault Ste. Marie on or around June 1st 2007"],"files":["/var/www/straped/mufon/html2text/9890.html.txt","/var/www/straped/mufon/org/9890.html"],"City":"Sault Ste. Marie","divs":["Sighting Details I go to bed quite late and was still up. I looked out my dining room window (towards the West) at exactly 11:40PM, on June 1, 2007, and saw a very large object which was an oval shape except that the bottom was straight across. It was a brilliant white, with very bright white light eminating from the middle of the oval similar to a strobe light. We have Canadian and Coast Guard helicopters fly by here regularly and this object was higher than their flight path but lower that the military and commercial airplanes usually fly. It was very large in comparison to the helicopters we see, I estimate it was at least three helicopters by 6 helicopters in size (I can't estimate by feet). When I saw it, it was hovering in the air and I watched it there for several minutes. I heard my husband get up and called for him to come and look at it. Right before he got to the window, I looked at him and when I looked back it was gone. About three weeks before that I had seen a very bright light above the tree line but at a greater distance. It was larger and brighter than the stars or the space station, which I have seen. Neither one appeared to be a durigable of any kind. I have finally decided to report this as I am sure that others must have seen this object because we are close to the International Bridge between here and Sault Ste Marie, Ontario. No one that I know here, heard anything about others seeing it, but I try to keep an open mind about UFO's."],"Date Submitted":"06/01/2007 11:40 UTC","Object Shape":"Oval","Weather Factors":"Unknown","Tags":"City","Latitude":"46.50192","Log Number":"US-03092008-0004"}