{"map":"<A HREF = \"http://maps.google.com/maps?q=38.958631,+-77.357003(9891)&iwloc=A&hl=en\"> mufon case (9891) map </A>","Object Features":"Unknown","Date of the Event":"03/09/2008 03:15 UTC","Case Number":"9891","trends":["There has been one other sighting in Reston","There were no other sightings in Reston on or around March 9th 2008"],"Region":"Virginia","Object Flight Path":"Straight-line path,Path with directional change","Viewing Distance":"501 Feet - 1 Mile","Tags":"City","files":["/var/www/straped/mufon/html2text/9891.html.txt","/var/www/straped/mufon/org/9891.html"],"Summary":"Two diamond shaped objects","Date Submitted":"03/09/2008 03:15 UTC","Log Number":"US-03092008-0005","Object Shape":"Diamond","City":"Reston","divs":["Sighting DetailsI was out walking my dogs and I looked up, as I'm near an airport, to see if there were any aircraft in the air. There were. I saw 2 passenger jets. But higher up I saw a light colored object flying. This object was moving quite rapidly, and it went behind the trees, so I had to change my position to see it. As best as I could tell it was light colored with a darker center. The reason I saw it was because sunlight reflected off of it. After I changed position I saw another object of the same description as well as the first. The first object was initially moving in a North by North West trajectory. The second object was moving as well, but I am not sure of the direction, as I only saw it for a short time. When both objects neared each other they veered to the North East. The sky was clear and bright. After observing for approximately 30 seconds, I lost them in the sun, and I also began to see bright spots reflecting. It was at that point that I made note of the time: 1515 or 3:15 EST. There was the sound of a jet present, but I do not believe that the objects were making that sound, I believe the passenger jet, or another aircraft from Dulles International Airport was responsible for that noise. I was in the Marine Corps, and am familiar with most types of aircraft. These craft did not appear to be anything that I have seen before. It is possible that they were birds-except for the fact that sunlight glinted off of the first object, which is what drew my attention in the first place."],"Sighting Duration":"Undisclosed","Weather Factors":"Unknown","Longitude":"-77.357003","Country":"United States","Source":"MUFON","Disposition":"Unknown","Latitude":"38.958631"}