{"City":"Bradford","Summary":"Very bright light moving in a continuous triangular motion behind the clouds at a very high speed","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=53.795984,+-1.759398(9895)&iwloc=A&hl=en\"> mufon case (9895) map </A>","divs":["Sighting DetailsI was outside the front of my house at about 07:30pm on Thursday 6th March to remove some rubbish sacks when two of my teenage neighbours (approx 13 and 14 years of age) asked me what I thought the strange light movements in sky immediately above us were. It was evening and very dark, and the cloud cover was quite thick, but a light movement coming from behind the clouds was very visible. At first I thought it might be a helicopter, but the movements were so fast and covering such a large distance that I realised that it was highly unlikely to be a normal aircraft of any type that I could think of. The light movements were very repetitive and in a triangular motion, they continued for some 15 minutes in roughly the same area before I decided to go back indoors. During the event, I made some joking remark to my teenage neighbours that it was a aliens, which they both appeared to not want to believe. I've seen this once before several months ago, again witnessed by many other people in roughly the same area."],"Object Features":"Undisclosed","Case Number":"9895","Source":"MUFON","Object Shape":"Flash","Sighting Duration":"Undisclosed","Date of the Event":"03/06/2008 07:30 UTC","Log Number":"GB-03102008-0003","Region":"England","Tags":"City","Object Flight Path":"Undisclosed","Longitude":"-1.759398","Weather Factors":"Unknown","files":["/var/www/straped/mufon/html2text/9895.html.txt","/var/www/straped/mufon/org/9895.html"],"Latitude":"53.795984","Date Submitted":"03/06/2008 07:30 UTC","trends":["There have been 3 other sightings in Bradford","There were no other sightings in Bradford on or around March 6th 2008","This sighting has never been favorited.",""],"Disposition":"Unresolved","Country":"United Kingdom"}