{"divs":["Sighting DetailsTraveling home on my motorcycle after work I took a side road to extend the ride a bit. Turned left onto Highway 63 heading south from East Calvert Hill Road. As I creasted the first hill I noticed what I believed to be a black bird to my left over the field riding an updraft. I refocused my attention on the rode when in my mind I thought, \"That didn't look like a bird.\" At that point I was parallel with it over the field and i looked at it closer. I noticed that it seemed to move like it was a puppet on a string instead of something using any type of aerodynamics. The movement was erratic. When I looked right at it I could tell it was not a bird, but did not know what it was. Again, I am riding down a major highway on a motorcycle at 60-70 mph and let off of the throttle, but did not brake to slow down. I was litterally having a hard time processing what I thought I was seeing. The object was black and somewhat cigar shaped. As I try to remember I believe it had fins similar to a submarine, but i could be trying to asimulate it to something I recognize. The front end was round like a globe. The middle was a bit smaller and the back end was cylindrical. The very end was flat like a flashlight end. I created what my minds eye sees when i try to remember it in the computer software microsoft paint. I drew this a couple of days after the event. I am ex air force and have seen many types of aircraft. This was nothing like any aircraft that I have ever seen. It moved like no other aircraft I have ever seen. As I continued to coast down the highway my mind was racing. I am not sure, but I beleive the object noticed me as well. The front of the object seemed to point in my direction and that is what made me think that it was under intelligent control. At this point i am well past the craft and begin to throttle again. There is no real safe turn around spot on this part of the highway for a motorcycle and so I proceeded on my way. The entire time I am trying to understand why I am not turning around to go back. It was wierd, but I just went on my way home."],"Object Features":"Appendage(s), Louvres, Wings","Disposition":"Unknown","trends":["There have been 38 other sightings in Columbia","There were no other sightings in Columbia on or around July 1st 2008","This sighting has never been favorited.",""],"Latitude":"38.960545","Case Number":"9896","Viewing Distance":"101-500 Feet","Tags":"City","Object Shape":"Bullet, Missile, Cigar","Sighting Duration":"00:01:00","map":"<A HREF = \"http://maps.google.com/maps?q=38.960545,+-92.326042(9896)&iwloc=A&hl=en\"> mufon case (9896) map </A>","City":"Columbia","Weather Factors":"None","Source":"MUFON","Log Number":"US-03102008-0004","Longitude":"-92.326042","Object Flight Path":"Stationary,Other","files":["/var/www/straped/mufon/html2text/9896.html.txt","/var/www/straped/mufon/org/9896.html"],"Date Submitted":"07/01/2008 05:30 UTC","Region":"Missouri","Summary":"Noticed black object floating as I was traveling on my motorcycle. It seemed to notice me as well.","Country":"United States","Date of the Event":"07/01/2008 05:30 UTC"}