{"Disposition":"Unknown","Weather Factors":"Windy","trends":["There have been 6 other sightings in Brick","There were no other sightings in Brick on or around March 8th 2008"],"Region":"New Jersey","map":"<A HREF = \"http://maps.google.com/maps?q=40.057516,+-74.110006(9897)&iwloc=A&hl=en\"> mufon case (9897) map </A>","Longitude":"-74.110006","Viewing Distance":"Unknown","City":"Brick","Latitude":"40.057516","files":["/var/www/straped/mufon/html2text/9897.html.txt","/var/www/straped/mufon/org/9897.html"],"Object Features":"None","Country":"United States","Date Submitted":"03/08/2008 08:30 UTC","Log Number":"US-03102008-0005","Object Shape":"Teardrop","Object Flight Path":"Straight-line path","divs":["Sighting DetailsIt had been pouring rain (in sheets) from Fri. afternoon (3-7-08)until Saturday night (3-8-08). When the rain finally stopped @8:15PM Saturday, the air warmed up but was still very windy. The sky though was exceptionally clear, brilliant with dozens of stars. I couldn't help but enjoy sky-watching in my sister's backyard. Orion was directly above the horizon but not directly above me. My eyes had fully adjusted to the night sky. Something in my peripheral vision to my right got my attention. About 7 - 10 very bright, yellowish yet hazy around the edges, teardrop shaped objects flased across the entire sky W to E. They were in random order, a couple of them stopped for a milisecond and then continued on. They were the shape of a teardrop according to your checklist but my first impression was they looked like tadpoles with wiggly tails (?). This took my breath away. I started to rationalize as to what I had just seen. Since I was down the shore, I know what spotlights or search beams of light look like coming from Lighthouses. I thought to myself, maybe that's what I saw? I doubted it, but was the only explantion that came to mind. But within 30 seconds, I caught something out of my peripheral vision again to the right (West). The same exact lights appeared again, only this time they were in a Vee formation, 20 - 30 of them, looking just like the first ones and going just as fast. They covered the night sky, streaking W to E in formation. My heart was pounding. I screamed for my sister. By the time she got to the backyard she missed the sighting. I was breathless. And described to her what I had seen. These objects disappeared to the East (Atlantic Ocean)horizon."],"Tags":"City","Date of the Event":"03/08/2008 08:30 UTC","Summary":"@8:30 PM sky crystal-clear, from W to E across sky - 20-30 blurred (hazy) but bright in Vee formation flashed across the entire sky to the East.","Sighting Duration":"00:00:20","Case Number":"9897","Source":"MUFON"}