{"Object Features":"Undisclosed","Log Number":"US-03102008-0010","Latitude":"43.050782","map":"<A HREF = \"http://maps.google.com/maps?q=43.050782,+-76.140634(9902)&iwloc=A&hl=en\"> mufon case (9902) map </A>","Date Submitted":"07/19/2006 10:30 UTC","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9902.html.txt","/var/www/straped/mufon/org/9902.html"],"Date of the Event":"07/19/2006 10:30 UTC","Disposition":"Unknown","Sighting Duration":"00:04:00","Longitude":"-76.140634","Case Number":"9902","Summary":"object silently floated above in clear skies showing a very slow, but steady movement towards the west, and when it reached about 12 o'clock high suddenly \"blinked\"out (disappeared).","Object Flight Path":"Undisclosed","City":"Syracuse","divs":["Sighting DetailsGoing outside to eat breakfast that morning was unexceptional other than the fact that my usual spot to recline by the shaded part of my house and have breakfast proved to be cooler than my liking that day. I slid my spring chair recliner about 15 feet into the warmer sunlight and took a seat. As I did, I was, by coincidence looking straight at a silvery-colored object in the clear blue sky. There was no sound at all coming from it like I would expect given the fact that I am located on the standard flight path of commercial aircraft that usually land at Hancock Field, Syracuse, some twenty five miles away. As I watched it I noticed that as the morning light bounced off the object I could see that the object reflected a curved panel-shaped side that was like polished aluminum and had more of an appearance of a do-nut than a frisbee overall. The object was probably 2000 feet from my position and its' apparant size looked to be the size of the tip of my thumb held at arms length. I sensed no fear or anxiety from the experience as I was torn between running into the house to get my digital camera and returning to take a photo or two and remaining there in the chair looking at the object as I noticed that it was actually moving due west towards our lake 6 tenths of a miles away. I continued my observations uninterrupted for a few more minutes. Its position changed from about 10 o'clock to 12 o'clock high overall at which point it simply disappeared in a blink. I recognize the fact that if I positioned my chair in any other place and had not been able to look in the object's exact direction when I sat back in it, the observation of the UFO would have been impossible. When it ended I became aware that I had seen something exceptional. When I first noticed the object I observed it for probably 15 seconds before I began to question whether or not this craft deserved more recognition than the standard aircraft that is so familar to me. Once it became clear that my observations were important to my personal curiousity, I never stopped observing it until it vanished as was described in my statement."],"trends":["There have been 20 other sightings in Syracuse","There were no other sightings in Syracuse on or around July 19th 2006"],"Viewing Distance":"Unknown","Tags":"City","Region":"New York","Object Shape":"Circle, Disc","Weather Factors":"Unknown","Country":"United States"}