{"map":"<A HREF = \"http://maps.google.com/maps?q=41.534469,+-87.252645(9906)&iwloc=A&hl=en\"> mufon case (9906) map </A>","Source":"MUFON","Case Number":"9906","Object Shape":"Disc, Square, Rectagular","Weather Factors":"Unknown","Object Flight Path":"Hovering then path","Summary":"Fluorescent yellow disc with multi colored square lights around the base, hovering just above the tree tops.","trends":["There have been 6 other sightings in Hobart","There were no other sightings in Hobart on or around August 31st 1977"],"Viewing Distance":"21-100 Feet","City":"Hobart","Latitude":"41.534469","Date Submitted":"08/31/1977 12:00 UTC","Date of the Event":"08/31/1977 12:00 UTC","divs":["Sighting DetailsI was in the 8th grade. I was just down the street from my home at my cousin's house. Her parents were out for the evening. I was working on my Math homework while my cousin Tami was in the kitchen talking on the phone. I saw her look out the kitchen window into the baseball field that was located directly across the street. She continued into the dining room looking out the windows. I asked her what she was looking at and she didn't reply, she just headed out the front door. I followed. We stood on the corner of the street, along with a handful of neighbors. Just above the tree tops, above the baseball field, hovering motionless (as if it were suspended in mid air) there was a huge yellow fluorescent(glowing) disc (typical saucer shape) with a dome (bubble) in the center. It had multi colored lights around the base (green, blue, red), traveling in a chase motion. There was no sound or exhaust coming from this object at all. I looked for windows or doors of any kind and I didn't see anything. It looked like it was going to land in the middle of the baseball field, it was that close! We all stood there in disbelief for what seemed to be at least 2-3 minutes. We all instinctively knew it wasn't something from this planet. I asked, \"What is it\"? A neighbor replied, \"Hell if I know\"! Just as he said that, in a split second, this object shot straight up into the sky and then shot across the sky in an easterly direction. It was gone! The neighbor jumped in his car as if to try and follow it. My cousin and I ran back into her house to call her parents. The phones would not work. Tami started to cry. Our adrenaline was pumping and we were scared to death! After a few minutes we were able to call the Fire Dept. to report it. I then ran down the street to my home to see if my parents had seen it. Unfortunately they didn't. The next day there was an article in the Post Tribune. Two women driving down Central Avenue (10-15 miles from where we were) had to bring their car to a stop. They described the exact object that we had seen. They stated that it looked like it was going to land in the middle of the street! Of course, the City tried to say it was the Art Hill Ford Advertising plane. I had seen and heard (extremely loud) that plane on several occasions. There was certainly no confusing that with the object that we had seen."],"Country":"United States","Object Features":"Dome","Region":"Indiana","Disposition":"Unknown","Tags":"City","Sighting Duration":"00:03:00","Longitude":"-87.252645","files":["/var/www/straped/mufon/html2text/9906.html.txt","/var/www/straped/mufon/org/9906.html"],"Log Number":"US-03112008-0001"}