{"map":"<A HREF = \"http://maps.google.com/maps?q=28.647774,+-96.892485(9912)&iwloc=A&hl=en\"> mufon case (9912) map </A>","Disposition":"Unknown","Date of the Event":"04/29/2008 07:05 UTC","divs":["Sighting DetailsI was at work walking out the back door of the lab and I heard geese honking close over head. I looked up to see them. They looked confused and were having trouble getting the \"V\" formation going, it looked like they were really honking loud and headed North. I smiled at the confusion of the birds trying to get in formation. Something bright & shiny above the birds a few hundred feet above them caught my eye. The sun was just coming up and the sun made the object bright. I freaked I couldn't hardly believe what I was seeing, I just froze and kept looking at it. The birds and the object were low, maybe 800 feet in the air the geese were flying just ahead of the object. The object didn't seem to move and no noise came from the craft, it was cylinder in shape with 4 big windows round & shiny, like mirror's, and almost the full lenght of the craft and almost as tall. I guess the lenght to be about 60 - 80 feet long and around 18-20 feet tall.The windows were round & bright and shiny but the craft was a more duller gray metalic color with both ends kinda round. No lights that I could see anywhere on the craft. Pretty smooth no seams, except the window were kinda strange and looked more like orb's. After watching it for about a minute I ran inside to tell my friend to come outside. I didn't tell him what I saw I just said come outside, he was on the phone and didn't come outside for over 3-4 minutes. I wanted someone else to see what I was seeing. This took less that 20 seconds then I ran back outside and nothing...no geese no craft nothing. My friend came out and I told him what I saw. We looked everywhere, no geese no craft, nothing. He said he believed me...I guess my expression and my tone of voice convinced him. I took off in the truck and headed North but I couldn't find it again. We both said that maybe we should just keep it between ourselves, because who would believe us. I called my wife and told her and she believed me and said who knows whats up there. She knows I don't lie. What ever it was it look like they were interested in the geese. I should at least of seen the geese but they were gone too. Well thats about it. I've worked at the plant for more that 27 years and once I saw the space shuttle past by coming in for a landing heading towards it's landing spot. That was cool but this craft was way too cool and I'll never forget what I saw. Every dimension is an estimation as close as I could remember. If you have any questions, you can call me. But I would like it to stay confidential, at least my name. Thanks for your time. Kind Regards,"],"Source":"MUFON","Weather Factors":"None","Country":"United States","Case Number":"9912","Tags":"City","Log Number":"US-03122008-0001","City":"Bloomington","Viewing Distance":"501 Feet - 1 Mile","files":["/var/www/straped/mufon/html2text/9912.html.txt","/var/www/straped/mufon/more/9912_submitter_file1__Save0021.JPG","/var/www/straped/mufon/more/9912_submitter_file2__Scan10003.JPG","/var/www/straped/mufon/more/9912_submitter_file3__Save0021.JPG","/var/www/straped/mufon/more/9912_submitter_file4__Scan10003.JPG","/var/www/straped/mufon/more/9912_submitter_file5__Scan10005.JPG","/var/www/straped/mufon/org/9912.html"],"Date Submitted":"04/29/2008 07:05 UTC","Object Shape":"Blimp, Cigar, Cylinder","Object Flight Path":"Stationary,Hovering then path","trends":["There have been no other sightings in Bloomington","This sighting has never been favorited."],"Latitude":"28.647774","Sighting Duration":"Undisclosed","Longitude":"-96.892485","Object Features":"Window(s)","Summary":"I heard geese honking I looked up and above the geese was an unknown object.","Region":"Texas"}