{"City":"Texarkana","Latitude":"33.425125","map":"<A HREF = \"http://maps.google.com/maps?q=33.425125,+-94.047688(9916)&iwloc=A&hl=en\"> mufon case (9916) map </A>","Longitude":"-94.047688","Tags":"City","files":["/var/www/straped/mufon/html2text/9916.html.txt","/var/www/straped/mufon/more/9916_submitter_file1__sketch.jpg","/var/www/straped/mufon/org/9916.html"],"Object Flight Path":"Stationary","Log Number":"US-03122008-0005","Weather Factors":"None, Does Not Apply","Sighting Duration":"00:02:00","Summary":"glowing amber triangle","Region":"Texas","trends":["There have been 9 other sightings in Texarkana","There were no other sightings in Texarkana on or around February 7th 2008","This sighting has never been favorited.",""],"Date Submitted":"02/07/2008 08:29 UTC","Case Number":"9916","Date of the Event":"02/07/2008 08:29 UTC","Object Features":"Other","Source":"MUFON","Country":"United States","divs":["Sighting DetailsI was driving home at night...coming down my facing street before turning into my driveway and up in the trees was an amber glowing triangle (it was almost the color of my street light but more amber) the bottom had what appeared as round disk lights about nine(9)that seem brighter than the rest of the body it also had 3 rounded corners not sharp as the pictures I have seen... it had substance as the sides seemed to curve around upward making it 3D not flat looking. I could not tell if it was moving or not as I was driving and trying pay more attention to that..tho I had not far to go to my driveway but when I turned into my driveway it was then to high and on my right side where the car roof blocked it and I was scared to stop and get out.I have looked again at night from the same vantage point and have seen it or any lights that I could mistaken it for. I had not had any drinks or drugs that could impair my sight of what I saw. I have not until now except my husband told anyone of this as I do not want to be called a nut etc. But after what I saw...I am really nervous now...I know what I saw it does not comply with what others have said except for the triangle part. Can someone give me an answer as to what it might have been and no I do not think it was one of ours."],"Viewing Distance":"101-500 Feet","Object Shape":"Triangle","Disposition":"Unknown"}