{"Latitude":"45.159964","trends":["There has been one other sighting in Hugo","There were no other sightings in Hugo on or around February 5th 1981"],"Country":"United States","Case Number":"9923","Longitude":"-92.993341","Summary":"3 star like objects appeared in the sky. Evenly spaced horizontally. They were stationary then 2 on the outside moved back & forth getting faster until 3 disappeared","Weather Factors":"Unknown","Region":"Minnesota","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=45.159964,+-92.993341(9923)&iwloc=A&hl=en\"> mufon case (9923) map </A>","Date Submitted":"02/05/1981 12:00 UTC","divs":["Sighting DetailsThis incident happened so many years ago but I remember it quite vividly. I was walking with a friend on a lake (Egg Lake in Hugo, MN) in the early evening on our way to her house. My house was on the lake and we would walk that way to her house in the winter when the lake was frozen. We were only a few houses away from mine when a older neighbor friend saw us and came down to the lake to see what we where doing. It was already dark and some would say it was not safe to be out on the lake alone that late. We just stood there talking for a bit. I happened to notice how clear the night sky was and pointed it out to my friends. Then I noticed 3 extremely bright \"stars\". At first I was a bit baffled because they seemed way to close to the earth for them to be stars. I pointed them out to my friends and thought they looked like the \"3 wise men \". They only appeared to be about as high as the clouds would be so we just kept watching them trying to figure it out. The 3 \"star like\" objects were much bigger than a star in the sky. They were lined up horizontally and were evenly spaced apart. All of a sudden the 2 on the outside started moving back and forth very slowly. I couldn't believe what we were seeing. We just stood there (kind of in shock) asking each other if they were seeing the same thing. Slowly the objects moved faster and faster. If my memory serves, I believe the middle light dimmed during this time. Finally, in a blink of an eye all 3 object seemed to shoot straight up and basically disappear. Before disappearing the objects were moving so fast back and forth it was like nothing a plane or helicopter could do. We were so scared that we all took off running. We talked of this incident many times and still couldn't believe what we had witnessed that night."],"Object Shape":"Star-like","files":["/var/www/straped/mufon/html2text/9923.html.txt","/var/www/straped/mufon/org/9923.html"],"Log Number":"US-03132008-0006","Date of the Event":"02/05/1981 12:00 UTC","Object Features":"None","Tags":"City","Viewing Distance":"Unknown","Disposition":"Insufficient Data","Object Flight Path":"Stationary,Other","City":"Hugo","Source":"MUFON"}