{"files":["/var/www/straped/mufon/html2text/9928.html.txt","/var/www/straped/mufon/org/9928.html"],"Case Number":"9928","Sighting Duration":"Undisclosed","Region":"Indiana","Object Features":"Unknown","Log Number":"US-03132008-0011","Weather Factors":"None","Latitude":"40.495147","divs":["Sighting DetailsI was driving home from my friends house. It was approximately 7:45 PM. (I was hurrying to get home so I could watch American Idol, so I am real sure about the time.) A flash of orange light caught my eye. It was off to the left of my car. I was traveling north on County Road 350 East in Howard County, between ST Rd 26 and Center Road. This was a dark stretch of road that had empty fields on either side of it. When I saw the flash of orange, I immediately saw two bright orange balls of light, low in the sky. In relationship to the horizon, one was at about 30 degrees the other about 40 degrees. The were about two inches (when I hold my hand up and measure with my fingers) apart. They were about the size of a large pea at arms length. I pulled over to the side of the road to watch them for a moment. I at first thought they must be some kind of light plane with some really crazy landing lights or something. I rolled the window down and heard NOTHING.. Not a sound and they were close enough to me that if they had a motor I would have heard it. Then, they started moving and I knew right away that there was no way this was a plane. IT was obviously TWO separate craft and they were moving very strangely. They kinda \"danced\" around each other. One bobbed up and the other bobbed down.. Then they both vanished in thin air! I sat there for a minute trying to absorb what I had just seen.. The light had a kind of sparkly glow about it that seemed unnatural. I felt very uneasy and as soon as they disappeared, I though, \"Damn! What just happened?!\" I check my clock for missing time but all was normal there. I raced home and excitedly found my husband when I got in the door, to tell him what I had seen.. I felt all tingly for about an hour after that I I felt VERY nervous! Paranoid almost.. like something was watching.. I had a REAL hard time falling asleep. Then, today, I am at my massage therapist and the first thing she says to me is, You are not going to believe what I saw the other day. I looked at her kinda funny and said, wait, don't tell me.. 2 orange balls of light in the sky? She about fell over. Yes, she said, but not just 2. She saw 4 and her timing was a little later than mine. She saw hers about 15-25 minutes after mine, but they were in the same western direction.. I am sure she would be glad to verify this is you want."],"Tags":"City","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.495147,+-86.132413(9928)&iwloc=A&hl=en\"> mufon case (9928) map </A>","Viewing Distance":"Over One Mile","Object Flight Path":"Hovering then path,Other","Disposition":"Unknown","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around March 11th 2008"],"Summary":"looked to west and saw two BRIGHT orange balls of light dancing in the sky at low altitude","Object Shape":"Circle","City":"Kokomo","Date of the Event":"03/11/2008 08:01 UTC","Longitude":"-86.132413","Date Submitted":"03/11/2008 08:01 UTC","Source":"MUFON"}