{"Object Features":"Dome, Window(s), Patterned Surface","Log Number":"US-03132008-0012","Tags":"City","Source":"MUFON","Disposition":"Insufficient Data","Date of the Event":"07/11/2005 01:00 UTC","Latitude":"40.548936","Weather Factors":"Does Not Apply","Country":"United States","Summary":"On this night my sister and I both witnessed this UFO sighting","Date Submitted":"07/11/2005 01:00 UTC","divs":["Sighting DetailsAround July 11th 2005 my sister and I were driving back from our mothers house. We were on St. Rt. 703 about 4-5 miles out from our home . We started up the hill toward the college and noticed this large object coming over the hill at the same time. We suddenly stopped and said to each other check the clock. As soon as we said that I looked at the clock and it was a little after 1 am. The object stopped directly above us.No more than 50 ft above us. It was oddly shapped. Shapped like a triangle with a point coming down from the center. The front glass window was clearly visable. It had 3 rectangle glasses and in the background you could see a light board. Kinda like a wall full of little flashing lights. I seen a shape but wasnt clear enough to see what it was. It was human form but larger head. The object stayed above us for approximately 15 minutes before it just left as quick as it came.It was like there was noone else around but us and the object. We seemed to be the only people on the earth at that time and that was a frightening. We immediatly went home and called the police department and asked if there was a report of an stelths in the area. The replyed no. From there we just sat there shivering in fear and wondering what it was we saw. To this day I still know what I saw and I know for a fact it was a UFO . Not sure what it was doing over us or what it wanted but I am still frightened when the thought comes up. I dont have a picture of this object all I have is memories but I will one day take my memories and put them to paper."],"Sighting Duration":"00:15:00","map":"<A HREF = \"http://maps.google.com/maps?q=40.548936,+-84.570234(9929)&iwloc=A&hl=en\"> mufon case (9929) map </A>","Region":"Ohio","Case Number":"9929","Object Shape":"Cone, Triangle","files":["/var/www/straped/mufon/html2text/9929.html.txt","/var/www/straped/mufon/org/9929.html"],"Viewing Distance":"21-100 Feet","trends":["There has been one other sighting in Celina","There were no other sightings in Celina on or around July 11th 2005"],"Object Flight Path":"Hovering then path","City":"Celina","Longitude":"-84.570234"}