{"Weather Factors":"Unknown","Object Features":"Undisclosed","Date Submitted":"12/28/2000 07:44 UTC","Country":"United States","Date of the Event":"12/28/2000 07:44 UTC","divs":["Sighting DetailsMy name is Richard R. Sylvester, J.D., Ph.D. (310) 391-2080, 4253BeethovenStreet, Los Angeles, CA 90066. My wifes name is Irene L.Sylvester.On Dec. 28,2000, my wife and I were driving North on Sepulveda Blvd, afew blocks north ofSunset Blvd. At 7:44 pm we saw a very bright greendiamond shape, moving veryfast, downward on a 45 degree angle,right toleft.The shape first became visableat the top of our windshield, andand was last seen just before the mountainsobscured further vision.The trajectory was a slight curve, from high straightahead to thehorizon,from right to left, travelling the total distance in about 2seconds.We heardno noise3B we saw no contrail. The sky was clear. By comparison,aircraftwere merepoints of light moving slowly, but this was very large,bright,26 fast.We reported our sighting to radio station KFWB 980 at about 8:30 pmthesame evening3B the person at the station said there were other reports ofthe same event,including a report from Woodland Hills, which is about20 miles Northwest fromwhere we saw the green fast-moving object in thesky.We were surprised to seesuch a clearly defined shape, and the color.By contrast, most celestial objectshave a warm color (yellow ororange), a round shape, and move very slowly."],"City":"Los Angeles","Object Shape":"Diamond","Log Number":"","files":["/var/www/straped/mufon/html2text/993.html.txt","/var/www/straped/mufon/org/993.html"],"Summary":"Bright green diamond shape, moving very fast,12/28","Viewing Distance":"Over One Mile","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=34.061854,+-118.237225(993)&iwloc=A&hl=en\"> mufon case (993) map </A>","Object Flight Path":"Unknown","Latitude":"34.061854","Longitude":"-118.237225","Sighting Duration":"00:00:59","Source":"MUFON","Tags":"City","Case Number":"993","trends":["There have been 404 other sightings in Los Angeles","There were no other sightings in Los Angeles on or around December 28th 2000"],"Region":"California"}