{"Object Shape":"Fireball, Oval, Saturn-like, Teardrop","Date Submitted":"03/13/2008 12:28 UTC","files":["/var/www/straped/mufon/html2text/9932.html.txt","/var/www/straped/mufon/org/9932.html"],"Object Flight Path":"Straight-line path","Disposition":"Unresolved","Viewing Distance":"Over One Mile","map":"<A HREF = \"http://maps.google.com/maps?q=49.891842,+-119.492201(9932)&iwloc=A&hl=en\"> mufon case (9932) map </A>","Summary":"It was bright orange and white it moved in a way that felt close but far at the same time.","City":"Kelowna","Weather Factors":"Unknown","Region":"British Columbia","trends":["There have been 9 other sightings in Kelowna","There were no other sightings in Kelowna on or around March 13th 2008"],"Sighting Duration":"Undisclosed","Tags":"City","Source":"MUFON","Country":"Canada","Latitude":"49.891842","Object Features":"Unknown","Log Number":"CA-03142008-0002","Case Number":"9932","divs":["Sighting DetailsI went to bed aprox. 11:50 and was having one of those in and out of sleep moments. Currently there is no covering on our bedroom window because we are renovating. I noticed light sort of fill the room and thought it could be car lights but seems how our bedroom is on the 2nd floor it was unusually bright to be a car. It took me a couple seconds to focus and realize there was an extremely bright object in the sky and at this moment I can not remember if it was moving or not. I just had to really look at this thing and find a category for it. I looked away and back at it to see if it was still there and then to try and comprehend what it was doing, it moved fast and slow which makes absolutely no sense and I had a hard time determining how close or far it was. It was a bright orange oval moving gradually across the sky and then behind a large group of trees on the property across the street from me and when it passed behind the trees I thought it must be close. What amazed me the most was the brilliant glow I witnessed through these trees, It was then I decided to look at the clock to document the time 12:28a.m. It sort of had a tail but not really this is why I checked the off the teardrop above cause it had that effect but it was moving across the horizon. The tail would shrink and grow as it moved kind of distorting the whole shape, I still cannot identify with the way it moved and the only thing I could possibly relate it to is a comet, but I looked them up on the internet and I couldnt find anything similar, I did find a few related pictures on some UFO sites. As for the way I felt, I was very aware of my feelings because I am a spiritual person and I didnt have any fear I was just awestruck. Afterward I laid in bed and tried to think of anything else it could be besides a UFO....but I couldnt."],"Longitude":"-119.492201","Date of the Event":"03/13/2008 12:28 UTC"}