{"Date of the Event":"03/14/2008 01:10 UTC","Latitude":"41.671765","trends":["There have been 8 other sightings in Bristol","There were no other sightings in Bristol on or around March 14th 2008"],"Disposition":"Unknown","divs":["Sighting DetailsHi. I was hesitant to report this, as I am very religious and wanted to believe I saw something other than what I did. However, for your research purposes, here was my encounter. My husband and I were just leaving a Dunkin Donuts drive-thru in Bristol at 1:10am. We were talking about how rude the drive-thru worker was, when I looked up and commented on how cloudy it was. My husband loves astronomy and we look at the sky often to observe. Anyhow, I was looking up, just east over the town skyline, when I saw a oval shaped, pewter blue colored hovering object. I did a double take, as it seemed to appear out of nowhere, and tried to discredit it as the moon. However, that theory got shot down when the moon made an appearance right next to it, under the overcast clouds. It was hovering low, seemingly just above the town, but high enough so the neighboring town of Southington should have been able to see it. I thought I saw lights on the bottom of it, but am not sure as I had my husband speed up, not slow down, and we had minimal glare from the street lamps. I rolled down my window and stuck my head out so that I could see it better. I could clearly see it, sans the lights. It seemed like it was trying to blend in with the clouds, and almost looked transparent in nature. If it wasn't for the fact that it was actually a shade LIGHTER than the clouds, and the moon near it illuminated it, I don't think I would have even noticed it. The UFO was there for about 2 minutes as we drove. It seemed to be moving as we were at that point, because we sped up, but it was still alongside the car. I became fearful and told my husband to step on it. When I looked back a second later, the object was gone, there was only the light of the moon. I wanted to see it again, even though I was scared. So as soon as we got home I went looking for it. However, I did not see it again. After wrestling with the idea for 20 minutes, I called the local police to report the incident to them. Interestingly enough, the officer told me that he had heard nothing of this nature being reported prior to my calling, but he knew the exact location where I saw it without me telling him. It's also important to note that he did not seem to find a bit of this comical, on the contrary; he sounded quite shaken. This was my first sighting, and it was truly like nothing I had ever seen in my life. I will never forget it, nor will I forget that we are truly NOT alone. Please contact me with any questions. I apologize, we do not have pictures."],"City":"Bristol","Object Flight Path":"Hovering then path,Path with directional change,Other","Summary":"UFO sighted over town skyline while driving home early morning","map":"<A HREF = \"http://maps.google.com/maps?q=41.671765,+-72.94927(9934)&iwloc=A&hl=en\"> mufon case (9934) map </A>","files":["/var/www/straped/mufon/html2text/9934.html.txt","/var/www/straped/mufon/org/9934.html"],"Case Number":"9934","Tags":"City","Object Features":"Unknown","Region":"Connecticut","Longitude":"-72.94927","Log Number":"US-03142008-0004","Weather Factors":"None","Country":"United States","Viewing Distance":"Unknown","Source":"MUFON","Date Submitted":"03/14/2008 01:10 UTC","Sighting Duration":"00:02:00","Object Shape":"Oval"}