{"Viewing Distance":"Over 1 Mile, Unknown","divs":["sighting detailshaving just purchased a new canon powershot a650 is digital camera, i stepped outside at work to photograph the moon and skywatch for ufo's. yes, i actively search for ufo's (have had several sightings)- and within 5 minutes of stepping out, i spotted an obect in the distance. i had to switch to video mode before i pointed my camera to locate the object on the screen. i lost precious seconds - seconds when the object was traveling in the clear. i started shooting as soon as i saw the object on the screen.i zoomed in at the maximum optical zoom of 6x. it traveled clear skies for a few seconds before entering the clouds where it disappeared and reappeared about three times at cloud breaks. the event date is 03\\13\\2008. the time was 1854 (6:54 pm) please watch the attached video. if you have any comments or questions feel free to email me at unleashed_texan_1946@ahoo.com. thank you. note: my location was: 37 deg 24'37.29n - 121 deg 54'49.42w. i was looking east. the object appears to have three sections,compartments, or elements. not sure what to make of it in regards to the overall shape and structure. all comments welcomed."],"Case Number":"9938","files":["/var/www/straped/mufon/html2text/9938.html.txt","/var/www/straped/mufon/org/9938.html"],"Longitude":"-121.901524","Object Flight Path":"Straight-line path","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=37.432702,+-121.901524(9938)&iwloc=A&hl=en\"> mufon case (9938) map </A>","Date Submitted":"03/13/0001 06:54 UTC","Log Number":"US-03142008-0008","Country":"United States","Object Features":"Other","City":"Milpitas","Summary":"Camera-ready, actively searching skies for ufo's -spotted one within 5 minutes","Region":"California","Object Shape":"Cylinder, Other","Disposition":"Unknown","Latitude":"37.432702","trends":["There have been 3 other sightings in Milpitas","There were no other sightings in Milpitas on or around March 11th 0001","This sighting has never been favorited.",""],"Weather Factors":"None","Source":"MUFON","Date of the Event":"03/13/0001 06:54 UTC","Tags":"City"}