{"divs":["Sighting DetailsTook several photos in sequence of sky over jobsite. When uploaded to PC I discovered that there was more than one. I don't know what inspires me to take the pictures I just get a feeling and there they are. I have several from last year on my site at fdinwidy7.tripod.com and I am seeing alot of activity starting already this year over our area. Also if Don Braffit reads this I had a really weird experience while sleeping three days before. I awoke in bed and was on my side and I could not move and didn't want to move because I had a pulsating wave going through my body from head to toe but mainly along my spine. It was as if I was floating but I know I was on the bed because I had my eyes open...too strange I know and I cannot say I've ever had an abduction experience so I won't say this is one but it was strange. Also I am seeing the craft with my own eyes sometimes rather than just random photo's of the sky."],"Weather Factors":"Unknown","Latitude":"37.33928","Date Submitted":"03/14/2008 12:00 UTC","Disposition":"Insufficient Data","Summary":"Took several photos in sequence of sky over jobsite.","Viewing Distance":"Unknown","Log Number":"US-03142008-0012","trends":["There have been 8 other sightings in Narrows","There were no other sightings in Narrows on or around March 14th 2008","This sighting has never been favorited.",""],"Case Number":"9942","Longitude":"-80.801327","map":"<A HREF = \"http://maps.google.com/maps?q=37.33928,+-80.801327(9942)&iwloc=A&hl=en\"> mufon case (9942) map </A>","Country":"United States","Tags":"City","Source":"MUFON","Object Shape":"Disc","City":"Narrows","Object Features":"Undisclosed","Region":"Virginia","Date of the Event":"03/14/2008 12:00 UTC","Object Flight Path":"Undisclosed","Sighting Duration":"Undisclosed","files":["/var/www/straped/mufon/html2text/9942.html.txt","/var/www/straped/mufon/more/9942_submitter_file1__Multipleufos31408.jpg","/var/www/straped/mufon/more/9942_submitter_file2__severalufos.jpg","/var/www/straped/mufon/org/9942.html"]}