{"Sighting Duration":"00:14:00","Disposition":"Insufficient Data","Object Features":"Other","Date of the Event":"08/14/2007 11:30 UTC","divs":["Sighting Details I was outback of my house on the porch facing northeast. When a flicker of orange and red light-sphere began to grow and pulsate from midair. I watched it for about 15 minutes. I know it was not the moon, it was already visible when this sphere appeared and it was much larger than anything else, besides the moon, i have ever seen in the sky. It grew to about the size of nickel at arms length, about half-mile from my house. The reds and oranges swirrled together like a lava lamp, i think it was rotating but with the colors moving i could not tell. Looking at it i became afraid or aware that it was not of this world or dimension. I got the feeling that something was looking back at me. I stepped out of my screen porch to try and make more sense of this thing, and when i did a small sphere detached itself from the main sphere, about a quarter of its size. It detached itself like two water drops would seperate. Once that happened i was more afraid because i dont know if they really were watching me, i went back on to the screen porch and continued to watch. The main sphere began to shrink or dim out, while the smaller one began unknowm course south. Eventually both spheres where not visible after 15 minutes. I do not know if this is related but i experienced sleep paralysis that night or what i believe, an attempted abduction. Everyone else says i had a bad dream, i am no dummy, the paranormal and the human psyche amaze me. The first thing i due is try to disprove the event with rational explanation. I couldn't find anything to explain my paralysis and the fear that cosumed me when i felt a chalky hand grab me from behind. Unable to move, scream,and protect yourself. Thats all i remember, i dont think i was abducted but then again with hypnosis that could change."],"Source":"MUFON","Object Flight Path":"Stationary,Hovering then path","Object Shape":"Fireball, Sphere","Date Submitted":"08/14/2007 11:30 UTC","Summary":"Hovered, red and orange, not moon it was also visible.","City":"Greenwood","Longitude":"-86.105193","Viewing Distance":"101-500 Feet","trends":["There have been 17 other sightings in Greenwood","There were no other sightings in Greenwood on or around August 14th 2007"],"Latitude":"39.622258","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=39.622258,+-86.105193(9943)&iwloc=A&hl=en\"> mufon case (9943) map </A>","Weather Factors":"None","Log Number":"US-03142008-0013","Tags":"City","Region":"Indiana","files":["/var/www/straped/mufon/html2text/9943.html.txt","/var/www/straped/mufon/org/9943.html"],"Case Number":"9943"}