{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"09/15/2005 12:00 UTC","files":["/var/www/straped/mufon/html2text/9946.html.txt","/var/www/straped/mufon/org/9946.html"],"Log Number":"US-03152008-0003","Object Features":"None","Object Flight Path":"Stationary","Object Shape":"Flash, Sphere","divs":["sighting detailsi was visiting my wife's parents in gilbert. at around 2am on sept. 15, 2005 there were four of us in the backyard. my brother in law tapped me on the shoulder and pointed northeast. i turned and saw a bright spherical object approximately 1\\2 mile away from our location in the subdivision. looked to be not more than 1000 feet overhead. the light emitted was almost blinding and pulsed into three different colors (red, yellow, and pale blue) i thought it was either a police or military helicopter with its searchlight on given our proximity to williams gateway airport. that thought faded as i listened and heard just a faint humming sound. all four of us kept our eyes fixed on it while i signalled my father in law to get his binoculars. i could not even look at the object being it was so bright. the whole thing was covered in light---it basically glowed totally. we watched it for about 10 minutes just remaining in that one position. it was gone almost instantly. the light looked like it just shut off and the faint humming sound was gone."],"map":"<A HREF = \"http://maps.google.com/maps?q=33.352826,+-111.789027(9946)&iwloc=A&hl=en\"> mufon case (9946) map </A>","City":"Gilbert","Longitude":"-111.789027","Summary":"Standing in backyard with 4 family members we looked northeast and saw a bright, round object hovering approx. 1/2 mile away","Latitude":"33.352826","Region":"Arizona","trends":["There have been 10 other sightings in Gilbert","There were no other sightings in Gilbert on or around September 15th 2005"],"Source":"MUFON","Country":"United States","Disposition":"Unknown","Tags":"City","Date of the Event":"09/15/2005 12:00 UTC","Case Number":"9946","Sighting Duration":"Undisclosed","Weather Factors":"Unknown"}