{"City":"Los Alamos","Region":"New Mexico","trends":["There have been 6 other sightings in Los Alamos","There was one other sighting in Los Alamos on or around March 15th 2008","This sighting has never been favorited.",""],"Date of the Event":"03/15/2008 06:43 UTC","Summary":"Stars (about 3) that left trails in almost every frame and faded behind clouds","Tags":"City","Object Shape":"Other","Log Number":"US-03152008-0004","files":["/var/www/straped/mufon/html2text/9947.html.txt","/var/www/straped/mufon/org/9947.html"],"Date Submitted":"03/15/2008 06:43 UTC","Viewing Distance":"Unknown","map":"<A HREF = \"http://maps.google.com/maps?q=35.89593,+-106.305452(9947)&iwloc=A&hl=en\"> mufon case (9947) map </A>","Latitude":"35.89593","Case Number":"9947","divs":["Sighting DetailsI was at home in Los Alamos, NM playing with a Sony Super NightShot camera in the early morning in my front yard and saw this dancing like display in the viewfinder. I looked without using the camera and it was not visible. I knew immediately that it was something very unusual when it just kept happening and I could just follow it around the clouds with the camera. I realized the star-like objects making these trails were quite obviously above the clouds and it was about then that I just knew it was a UFO. I couldn't believe the first thing I recorded with my new camera was a UFO. I freaked out and my first comment was me talking like a sailor and then my heart started really hurting and I prayed for my heart but I could not stop looking. Finally I was hurting so bad and they weren't doing anything new and I was truly hurting bad enough to scare me so I stopped filming. I have back problems too and the combined pain just stopped me. I know that sounds crazy right now (it does to me too) but I was scared that I might even have a heart attack because it really rocked my world and my heart really hurt and I needed to get away from it. It almost seemed like it was hurting me directly. I know it wasn't but in a way it was... I also know this stuff happens everyday now so its not that special but now I know its real and this was different than what I've seen because the dancing was in the clouds and well defined and easy to see in the video. I recorded about 2 minutes worth of video of about 3 star-like objects dancing (I mean it seemed like dancing) and leaving long well defined tails in every frame. They would fade in and out behind clouds. They looked a little like a laser when you twiddle it to get a pattern but they showed up in clear and cloudy sky and faded BEHIND the clouds. It is a very clear video and its obvious that it is not camera movement because of the clouds in the picture. Since I couldn't see them without the camera I think they must be Infra-red light but I didn't think to turn off the NightShot feature. I was using manual focus at infinity and they are well defined. I tried to zoom in more but they seemed to fade and so I zoomed back a little. I was at a pretty good zoom level but I don't know how much. I sure would like some guidance on what the right thing is to do now and I am honestly still quite shaken by this event. It was so unreal that I almost expected to see nothing on the video but there it is clear as day. If its some new airplane its unreal because it can make a bunch of big fast turns in one frame of video. I have much more video than I shared below but I used some sailor talk and then prayed for my heart so I don't want to share the rest without cutting the sound out."],"Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Source":"MUFON","Disposition":"Unknown","Country":"United States","Object Features":"Undisclosed","Sighting Duration":"00:03:00","Longitude":"-106.305452"}