{"Date of the Event":"02/07/2008 07:30 UTC","trends":["There have been 61 other sightings in Kokomo","There were no other sightings in Kokomo on or around February 7th 2008"],"files":["/var/www/straped/mufon/html2text/9948.html.txt","/var/www/straped/mufon/org/9948.html"],"Summary":"Multiple OBOLs Witnessed by Family in northcentral IN","Object Features":"None","City":"Kokomo","Object Flight Path":"Stationary","Object Shape":"Sphere","Log Number":"US-03152008-0005","divs":["Sighting Details(This information entered by MUFON Field Investigator who learned of witness while interviewing other witnesses to recent OBOL events in region.) A woman and her daughter were driving home in Kokomo at 7:30pm when they both noticed an orange ball of light (OBOL) flash on, then off seconds later while stopped at an intersection. As they were turning and discussing the OBOL, a second one appeared and performed the same on-again, off-again performance - illuminated for just a few seconds before going dark. The woman judged the size of the OBOL to be at least a quarter held at arm's length. As they drove home, they witnessed another OBOL illuminate near or over their neighborhood. The woman called her husband who was at home to see if he could see the OBOL. Altho he looked, he did not see it, and waited as his family arrived moments later. Then, together - they kept watch on the skies overhead. Minutes later, another OBOL appeared - this time to the far west - exhibiting the same characteristics but more distantly. Moments after it \"went out\" another OBOL appeared through their tree line down lower to the horizon before winking out. They became concerned and frightened and went inside their home. Later, the woman recalled going back outside and verbally asking the OBOL to reappear to no avail. She did notice several small planes which appeared to be circling the area of sky where the OBOL display had been earlier. The planes all departed the area within an hour of their arrival. Despite her fear, she was excited and wanted to see more of the phenomenon. The witnesses described the OBOL as stationary, not moving laterally or vertically, and only illuminating for a few seconds apiece. They also spoke with friends about their sighting and learned two friends in different locations had also seen the OBOL, one of those witnesses actually videotaping the display. The video witness was described as being frightened and nervous about what he saw and taped, and extremely hesitant about sharing his information. Their other friend who saw the event described what he saw and believed to be flares from aircraft. (The MUFON Field Investigator has requested the original witness contact her friend with the videotape and try to get a copy of it for the investigation. Awaiting further developments in this case.)"],"Date Submitted":"02/07/2008 07:30 UTC","Sighting Duration":"00:15:00","Country":"United States","map":"<A HREF = \"http://maps.google.com/maps?q=40.489037,+-86.132013(9948)&iwloc=A&hl=en\"> mufon case (9948) map </A>","Longitude":"-86.132013","Latitude":"40.489037","Viewing Distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","Tags":"City","Case Number":"9948","Region":"Indiana","Disposition":"Unknown","Weather Factors":"None","Source":"MUFON"}