{"Source":"MUFON","Longitude":"-83.70091","trends":["There have been 7 other sightings in Fenton","There were no other sightings in Fenton on or around May 31st 1967","This sighting has never been favorited.",""],"Object Features":"None","Country":"United States","Summary":"Bright Sphere came over the horizon to hover and then land","Object Flight Path":"Path then hovering","City":"Fenton","divs":["Sighting DetailsOne summer night, I believe it was 1967, my girlfriend, Debbie H., and I were sitting on her garage roof, talking. We were looking over the fields behind a row of houses on N. Leroy St, MI. All of a sudden, a bright sphere came up over the tree line. The tree line was less than 500 ft away. The Sphere moved very quickly, with no noise and came to a hover, 2 fields away, about 250 ft. It hovered over a grove a pine tree's the Johnny (of Johnny's Nusery) had planted for Christmas Trees. Then it descended straight down and appeared to land. The pine tree grove was lite up from where the sphere landed. We got off the roof and ran down the street to the home of a Fenton policeman. He told us to go home and stay away from the grove. We did not go near that grove for at least a year. When I did go to inspect the landing area, it was devoid of all growth, just gravel. Over the years, I checked that area, and nothing every grew there. Additional information requested: We did not know what it was that we saw. We were scared."],"Date of the Event":"05/31/1967 08:00 UTC","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=42.804896,+-83.70091(9954)&iwloc=A&hl=en\"> mufon case (9954) map </A>","Sighting Duration":"00:02:00","Region":"Michigan","Case Number":"9954","Date Submitted":"05/31/1967 08:00 UTC","Disposition":"Unknown","Latitude":"42.804896","files":["/var/www/straped/mufon/html2text/9954.html.txt","/var/www/straped/mufon/more/9954_submitter_file1__FentonMI-UFO.jpg","/var/www/straped/mufon/org/9954.html"],"Weather Factors":"None","Object Shape":"Sphere","Viewing Distance":"101-500 Feet","Log Number":"US-03162008-0005"}