{"Country":"United States","Sighting Duration":"Undisclosed","Object Features":"Undisclosed","divs":["Sighting DetailsMy husband and I and younger daughter were traveling home from Monticello on the evening of March 6th 2008. We were headed north on NW Shafer Drive when my husband said look at those lights, looking to the eastern sky. I was driving so I could not see past him, my younger daughter was sitting in the back seat behind him and said \"What is it?\" I slowed down to pull over, but he said they are gone, we traveld aproxiamtely 1-2 minutes and turned onto our road when he said look there they are again; I then stopped and looked at them. They were two oval shaped bright orange lights that flashed a couple times and vanished very quickly almost like it was absorbed into the sky. My husband stayed outside awhile after we returned home but didnt see anything else that evening. This is not the first time we have seen these types of lights or objects that appear and vanish with no noise or explaination of what they were, sometimes they are so very fast and move almost so you cant follow it as fast as it moves."],"Object Flight Path":"Stationary","Weather Factors":"Unknown","Region":"Indiana","Date of the Event":"03/06/2008 07:44 UTC","Longitude":"-86.758464","map":"<A HREF = \"http://maps.google.com/maps?q=40.752077,+-86.758464(9956)&iwloc=A&hl=en\"> mufon case (9956) map </A>","Disposition":"Unknown","Viewing Distance":"Over One Mile","files":["/var/www/straped/mufon/html2text/9956.html.txt","/var/www/straped/mufon/more/9956_submitter_file1__9948_report_file2__MOAMap.jpg","/var/www/straped/mufon/org/9956.html"],"Latitude":"40.752077","City":"Monticello","Log Number":"US-03162008-0007","Summary":"Two bright orange lights above horizon in northeastern sky","Tags":"City","Source":"MUFON","Date Submitted":"03/06/2008 07:44 UTC","Case Number":"9956","trends":["There have been 5 other sightings in Monticello","There were no other sightings in Monticello on or around March 6th 2008","This sighting has never been favorited.",""],"Object Shape":"Flash, Oval"}