{"Object Features":"Unknown","City":"Albuquerque","Case Number":"9964","Latitude":"35.086971","Log Number":"US-03182008-0001","divs":["Sighting DetailsI was at my cousins house saturday night march 15th. we were inside just messing around it was getting late so we were going to go drive back to my house. we were walking to the car and my cousin was like hey look what is that??!! the thing was kind of far and it looked kind of normal except it was really really bright. so we kept looking just to see what it was it was good because it kept coming towards are way then it got pretty close. it looked really wierd now at first the front of it looked like a flying car there was two main lights in the front like a car. it was flying pretty low i dont know of any plane flying that low. it was completely silent i knew then it was a ufo and we started tripping out.! but then it flew right over us and we saw the botton and oh my gosh it gives me the chills thinking about it. any way it was triangular shaped and i dont remember exactly how the lights were but there was one in the center and like three other ones they stayed brightly lit not flickering none of them flickerd. i had my phone out when it first looked unusual i knew i needed to get this on film. i started recording but my phone is not a good video camera it didnt come out good on there. but me and my cousin when we saw how it looked and that it was a ufo we were so excited, scared, in shock and so many thins we were yelling saying it was a ufo. we ran to keep up looking at it, it was really fast but silent it flew kind of east towards the mountains and before we knew it, it was gone. i know what we saw and its true and its not normal."],"Country":"United States","Date of the Event":"03/15/2008 12:00 UTC","Date Submitted":"03/15/2008 12:00 UTC","Longitude":"-106.646707","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9964.html.txt","/var/www/straped/mufon/org/9964.html"],"Sighting Duration":"Undisclosed","Region":"New Mexico","Viewing Distance":"Unknown","Summary":"triangular ufo midnight","Tags":"City","map":"<A HREF = \"http://maps.google.com/maps?q=35.086971,+-106.646707(9964)&iwloc=A&hl=en\"> mufon case (9964) map </A>","Disposition":"Insufficient Data","trends":["There have been 129 other sightings in Albuquerque","There were no other sightings in Albuquerque on or around March 15th 2008"],"Object Shape":"Triangle","Object Flight Path":"Path with directional change"}