{"Object Shape":"Chevron","Object Features":"Undisclosed","trends":["There have been 4 other sightings in Elkview","There were no other sightings in Elkview on or around March 11th 2008"],"Tags":"City","divs":["Sighting DetailsTuesday 03-11-2008 - Traveling north on I-79 near mile marker 7 at 9:12pm, it was a clear night, stars were visible. I noticed a UFO traveling south parallel to I-79 with 8 bright lights arranged in a V shape. The bright lights caught my attention. It was not heading directly at me, but, parallel to the highway. It appeared to be no more than 1000ft in altitude, but, that's a guess. I was traveling at approx 72mph on cruise control. The lights had an odd alignment to them, I would expect that 8 lights across, on a V shape, leaving 4 on each leg of the V, to be a straight line, but, counting from the tip of the V as #1 light and #4 being near the center, light #3 appeared to be lower than #2 and #4. None of these lights were flashing, nor were there any flashing lights at all, no red, no green, just white. The size reminded me of a 747 or 757 with the wingspan seeming to be quite large. I watched as much as possible but did not stop to view the object. It remained in the low slow path until it disappeared from my view as I drove north. Approximately 2 miles later I spotted a small single engine plane flying in the same direction with red and green flashing lights as I would expect and appeared in a normal fashion. This small plane must have been able to spot the object as it wasn't that far behind and in the same apparent flight path."],"City":"Elkview","Region":"West Virginia","Disposition":"Insufficient Data","Country":"United States","Date of the Event":"03/11/2008 09:12 UTC","Case Number":"9968","Sighting Duration":"Undisclosed","Date Submitted":"03/11/2008 09:12 UTC","Object Flight Path":"Undisclosed","Latitude":"38.434911","Longitude":"-81.474873","files":["/var/www/straped/mufon/html2text/9968.html.txt","/var/www/straped/mufon/org/9968.html"],"map":"<A HREF = \"http://maps.google.com/maps?q=38.434911,+-81.474873(9968)&iwloc=A&hl=en\"> mufon case (9968) map </A>","Weather Factors":"Unknown","Source":"MUFON","Summary":"Low slow flying V-shape with 8 lights none blinking no sound","Viewing Distance":"Unknown","Log Number":"US-03182008-0005"}