{"City":"Evansville","Log Number":"US-03182008-0007","Weather Factors":"Unknown","Source":"MUFON","files":["/var/www/straped/mufon/html2text/9970.html.txt","/var/www/straped/mufon/org/9970.html"],"Country":"United States","Object Flight Path":"Undisclosed","Date of the Event":"05/31/2001 12:00 UTC","Case Number":"9970","Summary":"single disc at close range multiple witness","Object Features":"Undisclosed","Disposition":"Insufficient Data","map":"<A HREF = \"http://maps.google.com/maps?q=37.976029,+-87.56275(9970)&iwloc=A&hl=en\"> mufon case (9970) map </A>","divs":["Sighting DetailsMyself and three of my younger brothers were outside in the yard. It was a very clear and warm day. Something above me caught my attention. When I looked up I saw an object that looked like an overturned cereal bowl. It looked to be made of something similar to polished alluminum and it glinted in the sunlight. I told my to youngest brothers to look up. Then we turned around to tell my oldest brother to look, but when we turned back the object was gone. This \"craft\" was maybe 100 ft. east of us and approximatly 100 to 200 ft. off the ground. From where we stood we could see at least 3 miles in all directions. We were all stunned by the experiance and were unable to explain it away. Something else came to my attention just a fiew days ago. Someone when no priar knowledge of my sighting to me of another sighting in the 50's. THe strange part is it happened in the exact same area and the witness was my great grandfather. He never reported the incident for fear of riddicule. His grandson (my uncle) is the only person he confided in. Also I had another experiance two in a half years prior to this. I belive that on january 1, 1999 I sighted an extraterrestrial being, which I believe may have abducted me. It was a very tramatic chapter of my life filled with nightmares. I had to undergo treatment because nobody believed me and they percieved this or these being or beings as a vivid hallucination."],"Region":"Indiana","Object Shape":"Disc","trends":["There have been 27 other sightings in Evansville","There were no other sightings in Evansville on or around May 31st 2001","This sighting has never been favorited.",""],"Date Submitted":"05/31/2001 12:00 UTC","Tags":"City","Sighting Duration":"Undisclosed","Latitude":"37.976029","Viewing Distance":"Unknown","Longitude":"-87.56275"}