{"Viewing Distance":"501 Feet - 1 Mile","Date Submitted":"03/18/2008 10:30 UTC","Longitude":"-82.36277","Summary":"Silver-ish disc shaped object streaking across the sky very quickly.","Object Flight Path":"Straight-line path","Object Shape":"Bullet, Missile, Disc","Tags":"City","Disposition":"Insufficient Data","Case Number":"9972","trends":["There have been 7 other sightings in Wesley Chapel","There were no other sightings in Wesley Chapel on or around March 18th 2008"],"City":"Wesley Chapel","Source":"MUFON","Region":"Florida","Object Features":"None","Country":"United States","Date of the Event":"03/18/2008 10:30 UTC","Log Number":"US-03192008-0001","Sighting Duration":"Undisclosed","map":"<A HREF = \"http://maps.google.com/maps?q=28.188285,+-82.36277(9972)&iwloc=A&hl=en\"> mufon case (9972) map </A>","files":["/var/www/straped/mufon/html2text/9972.html.txt","/var/www/straped/mufon/org/9972.html"],"divs":["sighting detailsi was standing in the backyard of my house in land o' lakes, fl. i noticed something out of the corner of my eye. glancing to my right (east) i saw a very fast moving object streak across the sky. it was 10:30pm so i was surprised that i noticed the silver tone of the object. there were no lights on the object. i think it was disc shaped but it was moving so fast that it seemed to be more of a streak. (actually it was moving incredibly fast so i think that explains the streaking aspect of it.) i would estimate that it traveled the distance of two blocks in two seconds. from my vantage point i think it was probably about the height of three or four houses stacked on top each other. 500 hundred feet maybe. it pretty much moved in a straight line, but with a slight incline in direction like it was acsending. after it traveled about two blocks distance it seemed to have just disappeared. the streaking object didn't seem like it faded away in the distance. it just vanished. i moved into this house\\land o' lakes two months ago. i saw a fireball\\falling star\\bust of flame \"thing\" in late jan. or very early feb. i've recently heard of other fireball stories and ufo sightings in this area. so i'm very excited about maybe living in a hot spot because i want to capture something on film. but no luck yet. the night of my sighting was the fourth night in a row that i've paid close attention to the skies since a ufo sighting occured very close to where i live on friday march 14, 2008."],"Weather Factors":"None","Latitude":"28.188285"}