{"Sighting Duration":"Undisclosed","City":"Oak Lawn","divs":["Sighting DetailsI went out into the back yard and went into the garage to find something. It was a beautiful clear day and a little chilly. I decided to take a look around the garden and noticed the moon was out and thought it would make a nice picture. So I went back inside to grab my camera. As I positioned myself back outside to take this picture I saw what looked like a white jelly bean flying over in the area where the moon was. I was facing east and this object came out of the south. I watched it and at first I thought it was a plane or maybe a seagull. But it was flying pretty fast and it had a trajectory that made it bank quick and then it stopped on a dime in the North over the garage. As this object stopped on a dime it slowly started getting smaller and turned into a white roundish orb. It then began moving slowly down towards the ground as it did this it got smaller and smaller as it moved down. A commerical airliner flew right by it coming from the North and flying out to the South right over my head.w As this object descended and got smaller and smaller it just got so small that it disappeared over the garage. There was no noise, lights, wings, windows or markings of any kind on this object. No reflection. The object at first seemed to be the size of a low flying smaller commercial airliner before it turned into the white orb and then slowly changed its shape into nothing."],"Object Shape":"Bullet, Missile, Circle, Sphere","Viewing Distance":"Unknown","Latitude":"41.713226","Object Features":"Undisclosed","Disposition":"Unknown","Date Submitted":"03/16/2008 05:30 UTC","Region":"Illinois","Weather Factors":"Unknown","Longitude":"-87.752708","Country":"United States","Case Number":"9976","trends":["There have been 13 other sightings in Oak Lawn","There were no other sightings in Oak Lawn on or around March 16th 2008"],"files":["/var/www/straped/mufon/html2text/9976.html.txt","/var/www/straped/mufon/org/9976.html"],"Tags":"City","Log Number":"US-03192008-0005","Date of the Event":"03/16/2008 05:30 UTC","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=41.713226,+-87.752708(9976)&iwloc=A&hl=en\"> mufon case (9976) map </A>","Object Flight Path":"Undisclosed","Summary":"White jellybean shaped object changing into white orb that slowly disappears"}