{"Latitude":"35.059784","Viewing Distance":"501 Feet - 1 Mile","Object Shape":"Chevron","map":"<A HREF = \"http://maps.google.com/maps?q=35.059784,+-78.871868(9981)&iwloc=A&hl=en\"> mufon case (9981) map </A>","trends":["There have been 20 other sightings in Fayetteville","There were no other sightings in Fayetteville on or around June 1st 1973"],"Sighting Duration":"Undisclosed","Longitude":"-78.871868","Date Submitted":"06/01/1973 08:01 UTC","City":"Fayetteville","Object Flight Path":"Straight-line path","divs":["Sighting DetailsMY FRIEND PAT KEM AND HIS MOM MAYBELLE KEM WERE WALKING ACROSS THE FRONT YARD FROM MY HOUSE AT 211 NORTHWEST AVE. IN FAYETTEVILLE N.C. IT WAS DARK AND I JUST HAD AN URGE TO LOOK UP AND WHEN I DID I SAW WHAT APPEARED TO BE A CHEVRON SHAPED OBJECT MOVING WITHOUT NOISE; ACROSS THE DARK STARLIT SKY. I COULD ONLY MAKE OUT THE CHEVRON SHAPE. IT REALLY FREAKED US OUT SO WE CALLED THE AIRPORT AND POPE AIRFORCE BASE AS WELL AS THE FORT BRAGG ARMY BASE FLYING SCHOOL. WE ASKED IF THEY SAW ANYTHING ON RADAR IN THIS AREA AND THEY ALL SAID NO. WE ARE ALL OF SOUND MINDS AND I KNOW WHAT WE SAW! IT WAS CHEVRON SHAPED WITH WHITE LIGHTS MAKING OUT IT'S SHAPE. IT JUST SEEMED TO MEANDER OFF INTO THE NIGHT. IT MADE THE HAIR ON MY NECK STAND UP WITH A CHILL. WE TRIED TO DISCOUNT WHAT WE SAW BY THINKING OUTLOUD THAT IT WAS PROBABLY A SECRET MILITARY FLIGHT. THE PRESIDENT'S PLANE. BUT WHY COULDN'T WE HEAR ANYTHING? THAT'S WHAT MADE IT WEIRD! THERE WAS NO SOUND. IT WAS MOVING IN A WESTERLY DIRECTION. I'M FIFTY-ONE YEARS OLD AND THIS NIGHT HAS STUCK WITH ME. SORRY IT TOOK SO LONG BUT WHO DO YOU TELL. I CHECKED OUT YOUR WEBSITE AND SAW REPORT A UFO. SO HERE IT IS. IT COULDN'T HAVE BEEN BLIMP BECAUSE OF IT'S SHAPE. EVEN A BLIMP WILL MAKE NOISE. WE JUST STOOD THERE SLACK JAWED STAREING UP IN THE BLACKNESS AT IT. IT DIDN'T CHANGE DIRECTION OR ALTITUDE. STEADY AND LEVEL."],"Summary":"LIKE A FLOCK OF DUCKS WITH FLARES UP THEIR BUTTS JUST SOLID","Date of the Event":"06/01/1973 08:01 UTC","Disposition":"IFO","Source":"MUFON","Region":"North Carolina","Weather Factors":"Does Not Apply","files":["/var/www/straped/mufon/html2text/9981.html.txt","/var/www/straped/mufon/org/9981.html"],"Tags":"City","Country":"United States","Log Number":"US-03192008-0010","Object Features":"Unknown","Case Number":"9981"}