{"Log Number":"US-03202008-0001","Weather Factors":"Unknown","Object Flight Path":"Undisclosed","Case Number":"9982","map":"<A HREF = \"http://maps.google.com/maps?q=42.791973,+-83.627726(9982)&iwloc=A&hl=en\"> mufon case (9982) map </A>","Date Submitted":"02/04/2008 12:00 UTC","Date of the Event":"02/04/2008 12:00 UTC","City":"Holly","Object Features":"Undisclosed","Source":"MUFON","Latitude":"42.791973","Viewing Distance":"Unknown","trends":["There have been 9 other sightings in Holly","There were no other sightings in Holly on or around February 4th 2008"],"Tags":"City","divs":["sighting detailsi was letting my dog in about 4am and after he came in the door,i stepped out the back door for a smoke. thats when this object was sitting on the grass about 200 feet from me. i think what ever was inside the thing seen me because it raised up off the ground about 60-80 feet and i could see a light coming out from the bottom and it was an opening or somthing because a popping noise was coming from the thing like the opening was jammed and wouldnt shut properly. i seen somthing fall out of that hole thing and the bottom immediately shut and the thing shot up into the sky and was gone,no noise came from it while it hovered or when it took off,the only sound was when the bottom thing was trying to shut and it made the ticking\\popping sound. i walked to the spot where the thing fell in my yard and used my lighter to light up the grass around me. i looked around for about 3 minutes and then i seen this pile of like ribbons and jewelry i thought. i squated down and lit my lighter again. it was a pile of dog collars. anyways i brought them up to the house and looked at them,i counted them,there was 8 collars and they where all sticky with this waxy gel. i think that ship thing was in my yard because they were gonna take my dog. after i thought about it,somthing was on a dog abducting spree , i swear to god and i bet when i went to let him in the house,i like foiled their plan,but they didnt cover thier tracks to good,i got those collars still, i swear, there was somebodies pets in that thing when it took off. i feel like an idiot telling this but maybee someone else know about this kind of stuff,i never have told anybody and never will. if anything bring your dogs in at night. ufo animal stealing aliens i guess,i seen it and got the evidence to prove it."],"Summary":"When it took off, an object fell out of the craft .","Object Shape":"Sphere, Other","Region":"Michigan","Longitude":"-83.627726","files":["/var/www/straped/mufon/html2text/9982.html.txt","/var/www/straped/mufon/org/9982.html"],"Disposition":"Hoax","Sighting Duration":"Undisclosed","Country":"United States"}