{"Object Flight Path":"Path with directional change","Viewing Distance":"Over One Mile","Date of the Event":"10/17/2007 11:00 UTC","Disposition":"Unknown","Latitude":"43.366501","Region":"Oregon","Country":"United States","Case Number":"9983","Object Features":"Unknown","Tags":"City","Weather Factors":"None","Sighting Duration":"Undisclosed","City":"Coos Bay","Date Submitted":"10/17/2007 11:00 UTC","trends":["There have been 10 other sightings in Coos Bay","There were no other sightings in Coos Bay on or around October 17th 2007"],"files":["/var/www/straped/mufon/html2text/9983.html.txt","/var/www/straped/mufon/org/9983.html"],"Longitude":"-124.21789","Log Number":"US-03202008-0002","Source":"MUFON","map":"<A HREF = \"http://maps.google.com/maps?q=43.366501,+-124.21789(9983)&iwloc=A&hl=en\"> mufon case (9983) map </A>","Object Shape":"Star-like","divs":["Sighting DetailsMy sister and I went to a place called Empire Lakes docks in Coos Bay. We were sitting looking at the sky and thinking about the death of our Sister-In-Law less than a year gone. We were crabbing as well and it was cold ( explaining why we were in the truck instead of sitting on the dock. ) As we were talking I was looking up and I saw a star moving in unusual ways. It was going up and down and sideways. It was also flashing almost winking at me. I told my sister to look to see if she saw what I saw and she was amazed! The whole thing only lasted about a minute or a minute and a half and then it was gone in a flash! We were both amazed. Another time I was in Shady Cove Oregon living on Bond Rd. There were alot of people at my house maybe 8 or 9 including my father. It was getting loud as everyone but me were drinking. I asked my friend who also was drinking if she wanted to go for a walk? She said yes and we started walking down my long dirt driveway. We got about a 75 feet away from the house in the dark and I heard a loud whirring sound that sounded errie. I pushed the on the light to my watch and saw the hands spinning around very fast. I looked around and saw nothing but felt as though something was watching me in the tree's! I started back with my friend to the house and said nothing to anyone. This happened about November 10th, 1996. It was about 11:00pm. The whole thing lasted about 3 minutes before I headed home. After I got home I was uneasy all night waiting for something or someone to appear. I slept with the lights on all night and my back against the wall. Then in 1983 I was living with friends in Visalia California. My son slept in their daughters bedroom in a bunk bed on the top and she on the bottom as he was older than her. My friend DeWayne and Jodie slept in their room and I slept on the couch. We all went to bed about 9:00pm. I was dreaming that I was dematerialized through the ceiling, my next memory was uneasyness, dematerialized back through the ceiling and dropped to the couch from about a foot. The shock of it made me gasp and woke me up! It was very real and I got up scared and turned on the light and looked around seeing nothing. I checked on the children and they were ok. I made some coffee and drank it shook up. DeWayne came out of his room and asked what I was doing? I told him I could not sleep and after the cup of coffee I was going to bed. He said ok and went back to bed. I never told him or his wife what happened. I looked at the clock and it was about 2:00am I have no Idea how long anything happened only that it was 2:00am. I saw another UFO in Colorado off the side of the road parked getting ready to sleep. I was really tired and I pulled off the side of the road and parked. I decided to smoke a cigarette before sleeping. I lit the cigarette and was looking out over the fields at the ranch houses in the distance about a mile from where I was parked. All of a sudden I saw a light come out of nowhere and shine down on the ground in the field below. I could not really see what it looked like because all I saw was te light shining down to the ground which looked to be about 20 feet around. It stayed on about 35 seconds and went off! I woke my husband up to look and it disappeared in 2 seconds to the sky! This happened in July of 1979 at 3:30 Am The whole thing lasted all of about 4 minutes from the time I first saw it to the time I tried to wake my husband. I was excited by what I saw but amazed at the same time."],"Summary":"Made fast flashy movements and disappeared after 1 and a half minutes."}