{"Country":"Canada","files":["/var/www/straped/mufon/html2text/9986.html.txt","/var/www/straped/mufon/org/9986.html"],"Latitude":"48.347766","City":"Les Escoumins","Object Shape":"Fireball","Region":"Quebec","Object Features":"Unknown","Case Number":"9986","Date Submitted":"06/30/1972 12:00 UTC","divs":["Sighting DetailsI'm so glad that i found a serious active site to tell my story. I was born in 1967 ( so i'll be 40 years old in may 2008 ). I had 2 sightings of the same nature between the ages af 5 and 15 approximately in the same village where i grew up ( Les Escoumins, Quebec, canada). here we go... 1- I was about 5 to 7 years old. It was after diner , maybe 6 or 7 pm in the summer. I was in the kitchen with my family which is the family room in our house. One of my sisters started screaming, asking us tocome in the solarium to see this huge object that looked like a giant fireball. It was going on a straight horizontal path over the nearby mountains. It was heading south-west on a steady speed and crossed the entire horizon without leaving any trace of smoke behind. It took about 5 minutes to cross the horizon visible from where we were. really fast, the phone rang and neighbours who were observing the same phenomenon were calling to ask if we were seing the same thing in the sky. I really felt like it was a huge fireball, several times the diameter of the sun, orange like. I was very young but i could tell that no one was able to explain what it was. 2- several years later when i was young teenager, i heard of car accident about half a kilometer from our home. It was in the summertime;at about 9pm. There was no lamp post on that section of the street which was uphill from our house. I went to see the accident but it was all over when i got there so i headed back home, walking down the hill. As i was lookin west ( halfway to my right ), i saw the exact sae fireball i had seen years ago. This time it was much further away . It was going in the north-east direction this time. It was a surreal object. exactly the same description as the object i had seen before. It lasted only for a couple of minutes as i lost sight of it over the trees. We were used to see military jets all the time in the area since i was a yung child and it had nthing to do with it. I would call it a real fireball. no noise at all and no smoke trail. Going at a steady speed horizontally. no change of direction. That's all i've seen. Never seen anything like that ever again in my life. I've seen shooting stars , northern lights, military jets a multitude of times in my life and i can tell you that it was none of those objects. thank you. Steve"],"Summary":"fireball in the sky ( 2 sightings, several witnesses )","Log Number":"CA-03202008-0005","trends":["There have been no other sightings in Les Escoumins","This sighting has never been favorited."],"Sighting Duration":"Undisclosed","Viewing Distance":"Over One Mile","Date of the Event":"06/30/1972 12:00 UTC","Source":"MUFON","Weather Factors":"None","Longitude":"-69.405735","Object Flight Path":"Straight-line path","Disposition":"Unresolved","map":"<A HREF = \"http://maps.google.com/maps?q=48.347766,+-69.405735(9986)&iwloc=A&hl=en\"> mufon case (9986) map </A>","Tags":"City"}