{"Weather Factors":"Unknown","Date of the Event":"03/18/2008 12:00 UTC","Log Number":"US-03202008-0009","Case Number":"9990","Source":"MUFON","Viewing Distance":"Unknown","City":"Pearisburg","files":["/var/www/straped/mufon/html2text/9990.html.txt","/var/www/straped/mufon/more/9990_submitter_file1__31808047.JPG","/var/www/straped/mufon/more/9990_submitter_file2__31808047-Copy.JPG","/var/www/straped/mufon/more/9990_submitter_file3__cloakedufoagain.jpg","/var/www/straped/mufon/org/9990.html"],"Tags":"City","Date Submitted":"03/18/2008 12:00 UTC","Country":"United States","Latitude":"37.327721","Sighting Duration":"Undisclosed","Longitude":"-80.728561","Disposition":"Insufficient Data","Region":"Virginia","Object Shape":"Saturn-like, Sphere, Teardrop","Object Flight Path":"Undisclosed","trends":["There have been 8 other sightings in Pearisburg","There were no other sightings in Pearisburg on or around March 18th 2008","This sighting has never been favorited.",""],"map":"<A HREF = \"http://maps.google.com/maps?q=37.327721,+-80.728561(9990)&iwloc=A&hl=en\"> mufon case (9990) map </A>","divs":["sighting detailsonce again i am seeing these things in the same place and no one seems to care. i have taken photo's of this area almost daily for almost a year to come to establish some kind of credibility to what i report and have already reported quite frequently. i have some of the many photos posted at http:\\\\fdinwidy7.tripod.com\\ i've read you now have a response team for things like this. it would seem to me that if a person is reporting these things from and around the same area for the past 8 months intensive investigation might be warranted...a phone call???...something. i now have the state dept. and a place called saic constantly on my website and so i don't know if i have attracted the wrong crowd... anyway i'm still here...me and my camera. i also found it odd to see drone footage on ufo hunters and in an interview with the international director of mufon the director stated he had not received photo's of the drone from anyone willing to reveal themselves...i think i've crossed that threshold. in fact i believe i sent the one on my site into mufon several months ago."],"Summary":"Once again I am seeing these things in the same place.","Object Features":"Undisclosed"}