{"Log Number":"US-03202008-0010","Object Flight Path":"Stationary","files":["/var/www/straped/mufon/html2text/9991.html.txt","/var/www/straped/mufon/org/9991.html"],"Sighting Duration":"Undisclosed","Date of the Event":"03/20/2008 09:52 UTC","divs":["Sighting Details At 9:52 am I was driving to work heading west on Peavy road, at Peavy and Buckner I noticed what I first thought to be a large airplane hanging over the lake or the neighbor hood behind the lake. It was dark black almost like a shadow but it was odd because it was not flying just hanging there. It was very low to be that big of a plane. I would estimate about 15 stories or a mini skyscraper. Anyway as I was driving toward it was getting larger and more visible so I know it was not moving. At first it looked like a f-16 type of plane but on steroids because it was at least the size of a jumbo jet. It also had sharp edges or jagged just like a fighter would.I was driving and it was on my left when I got up closer it seemed to turn into different colors almost like it had spots that changed it seemed as if it were alive almost. It seemed to morph a little, at first I thought I saw wings but then I could not find wings. It had a bubble like dome on top with a gold blob or maybe it was a light inside it. I finally found a spot to pull off into the neighborhood, there were many trees and by the time I found a clearing it had vanished completely. I looked at the clock it was 9:58 AM. At first I was excited but as I got closer I was afraid, it was like my mind just could not comprehend what I just saw. I think it was some sort of disguise and the closer I got the illusion that it was a plane was gone. As I write this later in the afternoon it is becoming increasingly more difficult to picture it. The odd thing is the people around driving did not seem to see it. My husband who was 2 minutes behind me never saw it, he said he was making a call at the time."],"map":"<A HREF = \"http://maps.google.com/maps?q=32.807725,+-96.762013(9991)&iwloc=A&hl=en\"> mufon case (9991) map </A>","Disposition":"Unknown","City":"Dallas","Case Number":"9991","Country":"United States","Weather Factors":"Unknown","Object Features":"Dome, Appendage(s)","Viewing Distance":"101-500 Feet","Date Submitted":"03/20/2008 09:52 UTC","Latitude":"32.807725","trends":["There have been 116 other sightings in Dallas","There was one other sighting in Dallas on or around March 20th 2008"],"Summary":"It hung silently in the air as I was driving it got closer.","Longitude":"-96.762013","Source":"MUFON","Region":"Texas","Object Shape":"Other","Tags":"City"}