{"Summary":"For lights forming a Diamond","Object Features":"Unknown","Case Number":"9994","Latitude":"42.37342","map":"<A HREF = \"http://maps.google.com/maps?q=42.37342,+-83.35105(9994)&iwloc=A&hl=en\"> mufon case (9994) map </A>","Object Shape":"Diamond","trends":["There have been 16 other sightings in Livonia","There were no other sightings in Livonia on or around July 12th 2005"],"Date of the Event":"07/12/2005 09:18 UTC","files":["/var/www/straped/mufon/html2text/9994.html.txt","/var/www/straped/mufon/org/9994.html"],"Sighting Duration":"Undisclosed","City":"Livonia","Object Flight Path":"Path then hovering","Region":"Michigan","Date Submitted":"07/12/2005 09:18 UTC","Longitude":"-83.35105","Tags":"City","Disposition":"Insufficient Data","Source":"MUFON","Country":"United States","divs":["Sighting Details At the date listed above I was outside for a smoke, when I noticed a what I (at the time) perceived to be 3 lights in a triangular shape flying east, the middle (which is to say the lead light) was like a spotlight the other two were inactive (just 2 lights) that looked (from my position) to be angled slightly downward. At this point I should point out 2 things a) It was flying at an altitude slightly lower then that of a normal passenger liner with no sound I could hear (though it drove my dog nuts) b) I'm a Specialist in the United States ARMY National Guard, and an Iraqi War vet. I'm well aware of what I'm saying. Now, as it came closer (moving no faster the a car on a side street) it became clear I was looking at a Diamond not a triangle, the interesting thing here is that (again) all 4 lights appeared to be angled downward suggesting to me that I was seeing a \"Stealth\" diamond craft, so I decided to chase it, I did so for about half a block till I reached a street corner (every so often looking up to make sure I hadn't lost it) when I got to said corner the thing stopped, as did I. I just stood there staring up at it for about 30 sec. or so when the lights just disappeared and I was left staring into space like an idiot. Now you're probably saying to yourself \"he says lights in a diamond shape, but never describes a craft of any type.\" \"Just angled light in a diamond formation.\" and you're absolutely correct in that observation, the reason I didn't describe a craft is because I didn't see one! All I saw were for angled lights moving in a consistent diamond shape for a distance at a consistent speed for a half a block silently that just disappeared in front of my eyes. Those light couldn't have maintained that consistent a formation while remaining at that same angle and maintaining that speed if they weren't part of a craft. I'd love an (private) explanation thank you."],"Log Number":"US-03202008-0013","Weather Factors":"Unknown","Viewing Distance":"101-500 Feet"}